[
  {
    "chunk_id": 0,
    "source_file": "2023scc28.txt",
    "text": "--- Page 1 ---\n \n  \nSUPREME COURT OF CANADA  \n \nCITATION : R. v. Greater Sudbury \n(City), 2023 SCC 28    \nAPPEAL HEARD : October 12, 2022  \nJUDGMENT RENDERED : \nNovember 10, 2023  \nDOCKET : 39754  \n \nBETWEEN : \n \nCorporation of the City of Greater Sudbury  \nAppellant  \n \nand \n \nMinistry of the Attorney General (Ministry of Labour, Immigration, Training \nand Skills Development)  \nRespondent  \n \n- and - \n \nRetail Council of Canada, Regional Municipality of York, Regional \nMunicipality of Peel, Regional Municipality of Durham, Regional \nMunicipality of Halton, Regional Municipality of Waterloo, Regional \nMunicipality of Niagara and Workers’ Compensation Board of British \nColumbia  \nInterveners  \n \n \n \nCORAM : Wagner C.J. and Karakatsan is, Côté, Brown,* Rowe, Martin, Kasirer, \nJamal and O’Bonsawin JJ.  \n \nREASONS : \n(paras. 1 to 62)  Martin J. (Wagner C.J. and Kasirer and Jamal JJ. concurring)  \n2023 SCC 28 (CanLII)\n\n--- Page 2 ---\n \n   \nJOINT DISSENTING \nREASONS : \n(paras. 63 to 162)  Rowe and O’Bonsawin JJ. (Karakatsanis J. concurring)  \n  \nDISSENTING \nREASONS : \n(paras. 163 to 201)  Côté J.  \n \n \nNOTE: This document is subject to editorial revision before its reproduction in final \nform in the Canada Supreme Court Reports . \n \n \n* Brown J. did not participate in the final disposition of the judgment.  \n \n \n   \n \n  \n2023 SCC 28 (CanLII)\n\n--- Page 3 ---\n \n Corporation of the City of Greater Sudbury  Appellant  \nv. \nMinistry of the Attorney General ( Ministry of Labour,  \nImmigration, Training and Skills Development)  Respondent  \nand \nRetail Council of Canada,  \nRegional Municipality of York,  \nRegional Municipality of Peel,  \nRegional Municipality of Durham,  \nRegional Municipality of Halton,  \nRegion al Municipality of Waterloo,  \nRegional Municipality of Niagara and  \nWorkers ’ Compensation Board of British Columbia  Interveners  \nIndexed as: R. v. Greater Sudbury  (City) \n2023  SCC  28 \nFile No.: 39754.  \n2022:  October  12; 2023:  November  10. \n2023 SCC 28 (CanLII)\n\n--- Page 4 ---\n \n Present: Wagner  C.J. and Karakatsanis, Côté, Brown, Rowe, Martin, Kasirer, Jamal \nand O ’Bonsawin JJ.  \nON APPEAL FROM THE C OURT OF APPEAL FOR O NTARIO  \n Provincial offences — Occupational health and safety — Duties of \nemployers — Construction projects — Control over workers and workplace — City \ncontracting with constructor to repair water main — Pedestrian struck and killed by \nroad grader during repairs — City charged with breaching duties of employers under \nprovincial occupational health and safety legislation — Whether city liable as \nemployer for breach of duties — Occupational Health and Safety Act, R.S.O. 1990, \nc. O.1, ss.  1(1) “employer”, 25(1)(c), 66(3)(b) — Construction Projects, O.Re g. \n213/91.  \n The City of Sudbury contracted with Interpaving Limited to act as \nconstructor to repair a downtown water main. During the repairs, an Interpaving \nemployee struck and killed a pedestrian when driving a road grader, in reverse, through \nan interse ction. The Ministry charged the City under s.  25(1)(c) of Ontario’s \nOccupational Health and Safety Act  (“Act”) for failing to ensure that certain safety \nrequirements of the accompanying regulation, Construction Projects (“Regulation”), \nhad been met. The Ci ty conceded it was the owner of the construction project and \nacknowledged that it sent its quality control inspectors to the project site to oversee \n                                                 \n Brown  J. did not participate in the final disposition of the judgment.  \n2023 SCC 28 (CanLII)\n\n--- Page 5 ---\n \n Interpaving’s contract compliance, but denied that it was an employer, arguing that it \nlacked control over the repair work and had delegated control to Interpaving.  \n The provincial court trial",
    "token_count": 1000,
    "start_token": 0,
    "end_token": 1000,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 1,
    "source_file": "2023scc28.txt",
    "text": " of the construction project and \nacknowledged that it sent its quality control inspectors to the project site to oversee \n                                                 \n Brown  J. did not participate in the final disposition of the judgment.  \n2023 SCC 28 (CanLII)\n\n--- Page 5 ---\n \n Interpaving’s contract compliance, but denied that it was an employer, arguing that it \nlacked control over the repair work and had delegated control to Interpaving.  \n The provincial court trial judge acquitted the City because Interpaving, not \nthe City, had direct control over the workers and the intersection and thus the City was \nnot an employer under s.  1(1) o f the Act. Alternatively, the trial judge found that even \nif the City was an employer and breached its obligations, it acted with due diligence. \nThe provincial offences appeal court upheld the trial judge’s decision but did not \naddress the finding that the  City acted with due diligence. The Court of Appeal set aside \nthe decision of the provincial offences appeal court judge, found the City liable under \ns. 25(1)(c) as an employer, and remitted the question of the City’s due diligence to the \nprovincial offenc es appeal court.  \n Held on equal division (Karakatsanis, Côté, Rowe and O’Bonsawin  JJ. \ndissenting): The appeal should be dismissed.  \n Per Wagner  C.J. and Martin , Kasirer and Jamal  JJ.: There is agreement \nwith the Court of Appeal that the City was an employer  and breached its duty under \ns. 25(1)(c) of the Act, and that the issue of the City’s due diligence defence should be \nremitted to the provincial offences appeal court. While control over workers and the \nworkplace may bear on a due diligence defence, nothin g in the text, context or purpose \nof the Act requires the Ministry to establish control over the workers or workplace to \nprove that the City breached its obligations as an employer under s.  25(1)(c).  \n2023 SCC 28 (CanLII)\n\n--- Page 6 ---\n \n  The Act seeks to maintain and promote a reasonable lev el of protection for \nthe health and safety of workers in and about their workplace and it fulfils its public \nwelfare purpose by allocating various occupational health and safety duties among \nvarious classes of workplace actors, including constructors, empl oyers and owners. \nThese duties are often concurrent and overlapping: several different actors may be \nresponsible for the same protective functions and measures — this is known as the “belt \nand braces” approach to occupational health and safety. Under this approach, where \nmultiple workplace entities fail to safeguard health and safety, they cannot point to \nothers’ failures as an excuse for their own; each workplace participant must ensure that \nthe workplace is safe. Section 66(1)(a) of the Act makes it an of fence for a workplace \nactor to breach one of the Act’s obligations, including s.  25(1)(c), which is a strict \nliability offence: the Ministry only needs to prove the actus reus  beyond a reasonable \ndoubt to ground a conviction.  \n Where an owner who contracts for the services of a constructor on a \nconstruction project is prosecuted for a breach of s.  25(1)(c), a court must first consider \nwhether the Ministry has proven beyond a reasonable doubt that the Act applied to the \naccused because the accused was an empl oyer under s.  1(1) of the Act. An owner is an \nemployer if it employed workers at a workplace where an alleged breach of s.  25(1)(c) \noccurred, or contracted for the services of a worker at that workplace (including for the \nservices of a constructor). The Mi nistry is not required to prove that the owner had \ncontrol over the workplace or the workers there. It is clear from the text of the definition \nof employer that control is not an element that the Ministry must prove to establish that \n2023 SCC 28 (CanLII)\n\n--- Page 7 ---\n \n an accused is subject to the duties of an employer. First, the definition contains no \nreference to control. A control requirement should therefore not be embedded into the \ndefinition of an employer when the legislature deliberately chose not to do so. Second, \nby referring to a contract for services in the definition of employer, the legislature \nsignalled its intent to capture employer -independent contractor relationships under the \nemployer definition and to remove from the definition the traditional common law \ncontrol condition that distinguishes employment and independent contractor \nrelationships.  \n A court must then determine whether the Ministry has proven beyond a \nreasonable doubt that the",
    "token_count": 1000,
    "start_token": 900,
    "end_token": 1900,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 2,
    "source_file": "2023scc28.txt",
    "text": " requirement should therefore not be embedded into the \ndefinition of an employer when the legislature deliberately chose not to do so. Second, \nby referring to a contract for services in the definition of employer, the legislature \nsignalled its intent to capture employer -independent contractor relationships under the \nemployer definition and to remove from the definition the traditional common law \ncontrol condition that distinguishes employment and independent contractor \nrelationships.  \n A court must then determine whether the Ministry has proven beyond a \nreasonable doubt that the accused breached s.  25(1)(c) of the Act. There is a breach of \ns. 25(1)(c) if the safety  measures prescribed by the Regulation are not carried out in the \nworkplace to which the owner /employer is connected by a contractual relationship with \nemployees or an independent contractor. Again, the Ministry is not required to prove \nthat the owner had control over the workplace or the workers there.  A review of \ns. 25(1)(c)’s text, context, and purpose reveals that control on the part of the accused is \nnot an element of this duty. The plain text of s.  25(1)(c) does not limit this duty to \nworkers over whi ch the employer has control. The duty in s.  25(1)(c) must also be \nunderstood in the context of the scheme of the Act, the wide definition of employer and \nthe existence of a due diligence defence under s.  66(3)(b) of the Act. Section 25(1)(c) \nwas intentiona lly drafted broadly so as to focus on the employer’s connection to the \nworkplace rather than any particular worker. The breadth of the employer’s duties and \nthe broad scope of the definition of “employer” are mutually reinforcing. While the \n2023 SCC 28 (CanLII)\n\n--- Page 8 ---\n \n interpretation of ss.  1(1) and 25(1)(c) raises separate questions, these sections should \nbe read harmoniously as they are nonetheless related. Reading a control requirement \ninto s.  25(1)(c) would narrow the employer’s duties and would introduce an internal \ninconsistency into the Act by pairing a broad definition of “employer” with a narrow \ninterpretation of s.  25(1)(c), rather than finding harmony between these provisions and \ntreating them as mutually reinforcing as the legislature intended. In addition, the \nexistence of the due diligence defence in s.  66(3)(b) is relevant context because it \nmeans that employers who breach s.  25(1)(c) will not be subject to penalties under the \nAct if they can show they took all reasonable steps to avoid the breach. Section 66(3)(b) \nfunctio ns as a safety valve, in which the presence of control may be a factor in assessing \ndue diligence. Reading a control requirement into s.  25(1)(c) would also be inconsistent \nwith the purpose of the Act. The act is a public welfare statute. Its purpose is to  maintain \nand promote a reasonable level of protection for the health and safety of workers in and \nabout their workplace. A control requirement could defeat the Act’s public welfare \npurpose of creating overlapping responsibility and would essentially give workplace \nactors a tool for frustrating regulatory prosecutions at the outset, by arguing that they \nhad no control over a hazard because other parties had greater comparative control over \nthat hazard.  \n Finally, a court must determine whether the accused h as proven on a \nbalance of probabilities that it should avoid liability because it exercised due diligence \nunder s.  66(3)(b) of the Act. Control should only be considered at this stage of the \nanalysis. It is open to an accused to prove that its lack of cont rol suggests that it took \n2023 SCC 28 (CanLII)\n\n--- Page 9 ---\n \n all reasonable steps in the circumstances. Shifting the burden to the employer to \nestablish a due diligence defence incentivizes employers to take all steps within their \ncontrol to achieve workplace safety and prevent future harm so that they may avail \nthemselves of the defence should harm occur. That an employer’s degree of control \nover the parties in the workplace is relevant to its due diligence defence also answers \nfairness concerns about imposing liability on an employer for a  breach caused by \nanother party. Relevant considerations for the court’s determination at this stage may \ninclude, but are not limited to: the accused’s degree of control over the workplace or \nthe workers; whether the accused delegated control to the constr uctor in an effort to \novercome its own lack of skill, knowledge or expertise to complete the project in \naccordance with the Regulation;",
    "token_count": 1000,
    "start_token": 1800,
    "end_token": 2800,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 3,
    "source_file": "2023scc28.txt",
    "text": " to its due diligence defence also answers \nfairness concerns about imposing liability on an employer for a  breach caused by \nanother party. Relevant considerations for the court’s determination at this stage may \ninclude, but are not limited to: the accused’s degree of control over the workplace or \nthe workers; whether the accused delegated control to the constr uctor in an effort to \novercome its own lack of skill, knowledge or expertise to complete the project in \naccordance with the Regulation; whether the accused took steps to evaluate the \nconstructor’s ability to ensure compliance with the Regulation before dec iding to \ncontract for its services; and whether the accused effectively monitored and supervised \nthe constructor’s work on the project to ensure that the prescriptions in the Regulation \nwere carried out in the workplace.  \n In the instant case, the City was an employer of the quality control \ninspectors, whom it employed directly and dispatched to the construction project. The \nCity was also an employer of Interpaving, with whom it contracted to undertake the \nconstruction project. As an employer of the inspecto rs and of Interpaving, the City was \nrequired by s.  25(1)(c) of the Act to ensure that the measures and procedures prescribed \nwere carried out in the workplace. On the date of the accident, measures required by \nthe Regulation — a fence between the construct ion work and the public way as well as \n2023 SCC 28 (CanLII)\n\n--- Page 10 ---\n \n signallers — were not carried out in the workplace. Thus, the City, as employer, \ncommitted the offence under s.  25(1)(c).  \n Per Karakatsanis, Rowe  and O’Bonsawin  JJ. (dissenting): The appeal \nshould be allowed. The City  is the employer of its quality control inspectors; therefore, \nthe scope of its duties under s.  25(1)(c) of the Act must be examined. Properly \ninterpreted, s.  25(1)(c) holds employers liable for breaching the regulatory measures \nwhich apply to them. Where certain measures in the Regulation do not specify to whom \nthey apply, these measures apply to an employer when they relate to the work that the \nemployer controlled and performed through their workers. As the courts below did not \nproperly analyze whether th e offence was made out, the matter should be remitted for \nreconsideration by the provincial court to consider the applicability of the regulatory \nmeasures.  \n The definition of employer in s.  1(1) of the Act covers two broad \nrelationships. The first branch o f the definition is satisfied if the person employs one or \nmore workers. It focuses on the employment contract and reflects the traditional \nconception of a direct employer -employee relationship. However, the fact that a party \nis an employer does not mean t hat they are an employer to all workers at a workplace \nor project, which may affect the scope of their responsibilities. The text of the definition \nof “employer” is expressly focused on a party’s relationship to workers and it is \ninappropriate to narrow it  by considering that party’s relationship to a workplace. The \nlatter relationship only becomes relevant at the stage of determining an employer’s \n2023 SCC 28 (CanLII)\n\n--- Page 11 ---\n \n duties. Accordingly, the first branch of the definition is satisfied where a traditional \nemployment relationsh ip exists.  \n The second branch of the definition involves a person who contracts for \nthe services of one or more workers. The second branch prevents parties from removing \nthemselves from the application of the Act where they subcontract out work, rather \nthan directly hiring workers through an employment contract. It ensures that the \nsubstance of the employer -worker relationship is not determined by the manner in \nwhich it is described in the contract. When an owner contracts with a constructor, they \nare not s eeking to subcontract out particular tasks to any independent contractor instead \nof hiring workers directly through an employment contract; rather, they are asking an \nentity to assume plenary oversight and authority to undertake the entire project. This \nrelationship reflects the practical reality of the construction industry, where owners \npromote safety by transferring responsibility to constructors with relevant expertise. \nThe owner -constructor relationship does not generally fall within the second branch of \nthe employer definition in s.  1(1). The Act is specifically designed so that an owner can \ntake a hands -off approach to overseeing the project relative to the constructor. A \nconstructor undertakes the project, which indicates that overall authority for t he project, \nincluding the coordination of health and safety, falls to the constructor. Treating an \nowner as automatically being an employer of the workers hired or contracted for by the \nconstructor under the second",
    "token_count": 1000,
    "start_token": 2700,
    "end_token": 3700,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 4,
    "source_file": "2023scc28.txt",
    "text": " within the second branch of \nthe employer definition in s.  1(1). The Act is specifically designed so that an owner can \ntake a hands -off approach to overseeing the project relative to the constructor. A \nconstructor undertakes the project, which indicates that overall authority for t he project, \nincluding the coordination of health and safety, falls to the constructor. Treating an \nowner as automatically being an employer of the workers hired or contracted for by the \nconstructor under the second branch of the employer definition would u ndermine the \ndesign of the scheme. It would mean that by virtue of engaging a constructor to oversee \na project, project owners would be assigned responsibilities that would require them to \n2023 SCC 28 (CanLII)\n\n--- Page 12 ---\n \n play an active role across the project — a role that the Act sought  to avoid by enabling \nthem to contract with a constructor in the first place. Treating the owner -constructor \nrelationship as an employer -worker relationship detracts from the legislation’s \neffectiveness because it ignores the practical differences between these relationships \nand undercuts the distinct mechanisms by which they promote worker safety. In sum, \nthe second branch of the employer definition is broad, but it does not turn an owner \ninto the employer of workers hired or contracted for by a constructo r.  \n Proceeding on the assumption that once a party meets the definition of \nemployer, they are strictly liable for the breach of any regulatory provision through the \noperation of s.  25(1)(c) and must rely on the due diligence defence conflates the \ndefiniti on of employer with the determination of the scope of an employer’s duties. On \na proper construction of the scheme, it is essential to examine both the definition of the \nworkplace parties and the duties that actually apply to them. An offence cannot be \nfounded on the breach of a duty that does not apply to the accused. Once a workplace \nparty is found to satisfy the relevant definition set out in s.  1(1) of the Act, it is \nnecessary to then consider which duties actually applied to the party at the time of th e \nalleged offence. The Act separately sets out the duties for each workplace party.  \n Section  25(1)(c) requires an employer to ensure compliance with all \napplicable regulatory measures. Where the Regulation expressly states to whom its \nmeasures apply, there  will be no question as to whether they fall within the employer’s \nduty under s.  25(1)(c). Where however, a particular measure is silent concerning to \nwhom it applies, the measure applies when it relates to work that the employer \n2023 SCC 28 (CanLII)\n\n--- Page 13 ---\n \n controlled and performed t hrough their workers . This relationship is established when \nthe employer has authority over the performance of a task, usually because it is the \nportion of the work within the larger project that, whether alone or with other parties, \nthey have been entrust ed with performing through the workers they have employed or \ncontracted for.  To be sure, multiple parties can be jointly entrusted with a task, since \ndifferent employers will often collaborate, and thus multiple employers can have an \noverlapping responsibi lity to fulfill the same measures. A regulatory measure can apply \nto the work of multiple employers so long as it relates to each employer. The core \nquestion is: What work is an employer responsible for undertaking on the construction \nproject? The Ministry  should know whether the measure is actually related to the \nemployer’s work before making the decision to charge that employer. Therefore, the \nregulatory measures apply when they present a nexus  to the work which is under the \nemployer’s control and performed through their workers. Establishing this nexus \nbetween the measure and the employer is a binary , threshold question: either the \nmeasure applies because it is related to work which the employe r has undertaken, or \nthe measure does not apply because such a link is absent.  \n It would be absurd to interpret s.  25(1)(c) and the Regulation as obligating \nevery employer at a construction project to ensure compliance with all measures \ncontained within th e Regulation. This would effectively mean that everyone who \nemploys anyone is responsible for everything that anyone does. Protecting worker \nsafety is of critical importance and it is far from clear that making every employer liable \nfor the acts of all oth er employers in carrying out all regulatory obligations \n2023 SCC 28 (CanLII)\n\n--- Page 14 ---\n \n meaningfully improves worker safety. A measured and practical approach gives effect \nto the concept of overlapping responsibilities. Since the workers’ activities under each \nemployer’s control frequent ly overlap on complex construction projects, so too will the \nme",
    "token_count": 1000,
    "start_token": 3600,
    "end_token": 4600,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 5,
    "source_file": "2023scc28.txt",
    "text": " Protecting worker \nsafety is of critical importance and it is far from clear that making every employer liable \nfor the acts of all oth er employers in carrying out all regulatory obligations \n2023 SCC 28 (CanLII)\n\n--- Page 14 ---\n \n meaningfully improves worker safety. A measured and practical approach gives effect \nto the concept of overlapping responsibilities. Since the workers’ activities under each \nemployer’s control frequent ly overlap on complex construction projects, so too will the \nmeasures which apply to them under s.  25(1)(c). A measured and practical approach \nalso fully operationalizes the belt and braces approach which aims to create meaningful \nprotection in practice. Y et, if there is no relationship between the measure and the \nemployer’s work, the employer cannot serve as an effective brace. Imposing measures \ncontained in the Regulation onto employers bearing no relationship to the work at hand \nadds an indefinite number  of illusory braces: they provide a false sense of added safety \nbut, in reality, only increase the legal jeopardy of unrelated workplace parties who \ncould not have ensured compliance with those measures. Holding employers with no \ncontrol liable does nothin g to increase worker safety — it is this very lack of control \nwhich makes them unable to carry out the regulatory measures in the first place. \nAdditionally, limitless responsibilities lead to confusion and a lack of coordination on \na construction project. If every employer is liable for everything and has duties towards \nunrelated parties, an individual employer’s sphere of responsibility becomes unclear. \nSafety issues could arise if multiple employers with no relationship to the duty or \nexpertise in the are a seek to enforce their own version of a particular safety procedure \non other workers. Alternatively, unlimited duties can lead to neglect if each employer \nassumes that duties owed by all employers will have been fulfilled by someone else.  \n Prosecutorial discretion will not limit the potential for absurdity to occur. \nThis effectively gives prosecutors unbounded discretion to define the proper scope of \n2023 SCC 28 (CanLII)\n\n--- Page 15 ---\n \n each employer’s duties by deciding who to charge, rendering the ultimate delineation \nof duties in the Act unpredictable and uneven from the accused’s perspective. Reliance \non a promise that prosecutors would not charge employers for breaches of regulatory \nmeasures over which they had no control emphasizes this absurdity. The availability of \nthe due diligence d efence at s.  66(3) also initially presents itself as an appealing \nsolution, but there are multiple flaws with adopting an approach that pushes most of \nthe analysis concerning an employer’s responsibility to the due diligence stage. From \na methodological pe rspective, the offence and the defence should not be conflated. \nJudges should not abdicate the responsibility of arriving at a reasonable interpretation \nof a duty merely because a defence exists or because doing so would improve \nadministrative efficiency. A focus on the due diligence defence flips the structure of \noffences on its head: every employer is captured by the offence as soon as any \nregulatory measure is not met, and the accused must bear the burden of pulling \nthemselves out of the ambit of the off ence. Shifting much of the analysis on the contents \nof the duty and the nature of the employer’s work to the due diligence stage increases \nuncertainty in practice and ignores the reality of how the scheme operates on the \nground. If most of the employer’s o bligations are outside of their control, they have no \nability to even know whether the measures are being complied with or what they could \nbe charged with at any moment. In contrast, requiring that a measure relates to an \nemployer’s work provides employers  with a greater understanding of their \nresponsibilities and encourages them to take initiative to protect workers.  \n2023 SCC 28 (CanLII)\n\n--- Page 16 ---\n \n  In the instant case, because the City had hired quality control inspectors \nthrough a contract of employment, it satisfied the definition of  employer under the first \nbranch. The City owes duties as the employer of these workers under the Act. However, \nby contracting with a constructor, it did not become the employer of the workers that \nthe constructor retained. The owner -constructor contract r eflects a distinct relationship \ncontemplated in the Act that does not generally fall within the second branch of the \nemployer definition in s.  1(1). Consequently, the City is only the employer of its quality \ncontrol inspectors. In light of the conclusion t hat the City is an employer to the quality \ncontrol inspectors, the applicability of the regulatory measures depends on whether the \nCity controlled work being performed near public ways or controlled the operation of \nvehicles, machines and equipment. The tr ial judge however did not consider the \napplicability of the regulatory",
    "token_count": 1000,
    "start_token": 4500,
    "end_token": 5500,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 6,
    "source_file": "2023scc28.txt",
    "text": " the second branch of the \nemployer definition in s.  1(1). Consequently, the City is only the employer of its quality \ncontrol inspectors. In light of the conclusion t hat the City is an employer to the quality \ncontrol inspectors, the applicability of the regulatory measures depends on whether the \nCity controlled work being performed near public ways or controlled the operation of \nvehicles, machines and equipment. The tr ial judge however did not consider the \napplicability of the regulatory measures, nor did the provincial offences  appeal court  \nor the Court of Appeal.  Accordingly, the proper approach is to remit the matter to the \nprovincial court to determine whether the r elevant provisions of the Regulation related \nto the City and thereby fell within its duty under s.  25(1)(c) of the Act.  \n Per Côté  J. (dissenting): The appeal should be allowed and the acquittals \nentered by the trial judge should be restored. Properly inter preted, the obligations \nprescribed by the Regulation were the responsibility of the constructor and /or the \nemployers who performed the relevant construction work. The City had no \ninvolvement in or control over that work and was therefore not an employer at  the \nconstruction project.  \n2023 SCC 28 (CanLII)\n\n--- Page 17 ---\n \n  There is agreement with Rowe and O’Bonsawin  JJ. that the definition of \nemployer in s.  1(1) of the Act does not capture the construction -specific relationship \nbetween a project owner and its general contractor. A project owner wh o hires a \nconstructor is not the employer of the constructor itself or its workers. An employer \ncannot evade its occupational health and safety responsibilities by hiring an \nindependent contractor instead of entering a typical employment relationship.  But it \ndoes not follow that an employer is responsible for the employees and independent \ncontractors of other employers.  \n There is also substantial agreement with Rowe and O’Bonsawin  JJ.’s \ninterpretation of the duties of employers under s.  25(1)(c) of the Act,  which must be \nread in context and together with the applicable Regulation. It would be absurd to \ninterpret s.  25(1)(c) literally to require each employer on a construction project to \nensure compliance with all applicable regulations. On a construction pro ject, while \neach employer is responsible for the health and safety of its own workers, the \nconstructor is responsible for health and safety across the project.  \n The belt and braces approach to occupational health and safety is not \nwithout reasonable limit s and should not be interpreted in a manner that extends the \nreach of the Act beyond what was intended by the legislature. To impose duties on \nemployers that they cannot possibly fulfil does not further the aim and purpose of the \nAct, which is to promote w orker safety. The position that workplaces will be safer if \nevery employer is made responsible for every possible safety obligation has superficial \nappeal, but it also creates a clear disincentive for a municipal project owner to engage \n2023 SCC 28 (CanLII)\n\n--- Page 18 ---\n \n in quality control efforts. A municipal project owner is not an employer on the \nconstruction site merely because it employs quality control inspectors. Holding every \nproject owner strictly liable for all safety hazards it encountered in its quality control \nefforts — and whic h it did nothing to create — renders the quality control exception \nmeaningless.  It would no longer matter that owners do not become constructors by \nhiring quality control personnel. They would simply become employers who, in \naddition to constructors, have a strict duty to ensure compliance across the construction \nproject . \n The due diligence defence only becomes relevant once the elements of the \nstatutory offence have been established. An employer’s ability to make out a potentially \ncostly and burdensome def ence is irrelevant to the proper interpretation of who is an \nemployer on a construction site and to the scope of its corresponding statutory duties. \nIt does not prevent future harm to impose statutory liability on employers who have no \nconnection to, or co ntrol over, the safety obligation in question. Where an employer on \na construction site did have some measure of control over the safety obligation in \nquestion, the burden shifts to the employer to demonstrate that it took every precaution \nreasonable in th e circumstances.  \n In a careful and thorough analysis, the trial judge in the instant case \nrepeatedly rejected the Ministry’s position that the City or its inspectors exercised \ncontrol over any construction work at the project. The trial judge properly foun d that \nthe Ministry had not proved that the City acted as an employer on the construction site. \nInterpaving was both the constructor of the project and the employer of the",
    "token_count": 1000,
    "start_token": 5400,
    "end_token": 6400,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 7,
    "source_file": "2023scc28.txt",
    "text": " to the employer to demonstrate that it took every precaution \nreasonable in th e circumstances.  \n In a careful and thorough analysis, the trial judge in the instant case \nrepeatedly rejected the Ministry’s position that the City or its inspectors exercised \ncontrol over any construction work at the project. The trial judge properly foun d that \nthe Ministry had not proved that the City acted as an employer on the construction site. \nInterpaving was both the constructor of the project and the employer of the road grader \n2023 SCC 28 (CanLII)\n\n--- Page 19 ---\n \n operator who fatally struck and killed a pedestrian. The City’s involvem ent in the \nproject was limited to quality control and it was not responsible for the completion of \nany construction work. The trial judge’s conclusions on the City’s lack of control at the \nproject are findings of fact that deserve deference . The trial judg e also correctly found \nthat even if she was wrong in concluding that the City was not an employer on the \nconstruction site, the City took every precaution reasonable in the circumstances to \nensure safety at the project.  It would be an extravagant propositi on to say that a \nmunicipal project owner becomes an employer of every person on a project by \nattending the project for the limited purpose of quality assurance. To impose statutory \nliability on the City in these circumstances would be a regrettable departu re from the \nestablished scheme of the Act. The City was not statutorily obligated to ensure \ncompliance with the Regulation which applied only to the workplace parties involved \nin the actual construction work at the project site.  \nCases Cited  \nBy Martin  J. \n Applied:  R. v. Wyssen  (1992), 10 O.R. (3d) 193; considered:  West Fraser \nMills Ltd. v. British Columbia (Workers’ Compensation Appeal Tribunal) , 2018 SCC \n22, [2018] 1 S.C.R. 635; referred to:  Ontario (Ministry of Labour) v. Hamilton (City)  \n(2002), 58 O.R. (3d) 37; Ontario (Minister of Labour) v. Enbridge Gas Distribution \nInc., 2010 ONSC 2013, 261 O.A.C. 27; R. v. J. Stoller Construction Ltd. , 1986 \nCarswellOnt 3654 (WL); R. v. Stelco Inc.  (1989), 1 C.O.H.S.C. 76; R. v. Structform \n2023 SCC 28 (CanLII)\n\n--- Page 20 ---\n \n Internation al Ltd. , [1992] O.J. No.  1711 (QL), 1992 CarswellOnt 2751 (WL); R. v. \nThomas G. Fuller & Sons Ltd. , 2008 CarswellOnt 9276 (WL); R. v. Cox Construction \nLtd., 2008 Car swellOnt 9540 (WL) ; R. v. Saskatchewan Power Corp. , 2016 SKPC 2; \nOntario (Ministry of Labou r) v. Dofasco Inc. , 2007 ONCA 769, 87 O.R. (3d) 161; R. \nv. Campbell , [2004] O.J. No.  129 (QL), 2004 CarswellOnt 116 (WL); R. v. Timminco \nLtd. (2001), 54 O.R. (3d) 21; Ontario v. London Excavators & Trucking Ltd.  (1998), \n40 O.R. (3d) 32; Ontario (Ministry o f Labour) v. Pioneer Construction Inc.  (2006), 79 \nO.R. (3d) 641; Ontario (Ministry of Labour) v. United Independent Operators Ltd. , \n2011 ONCA 33, 104 O.R. (3d) 1; R. v. McIntosh , [1995] 1 S.C.R. 686; R. v. Hinchey , \n[1996] 3 S.C.R. 1128; 671122 Ontario Ltd.  v. Sagaz Industries Canada Inc. , 2001 SCC \n59, [2001] 2 S.C.R. 983; Ontario (Ministry of Labour) v. Reid & DeLeye Contractors \nLtd., 2011 ONCJ 472; Ontario (Ministry of Labour) v. Nor Eng Construction & \nEngineering Inc. , 2008 ONCJ 296; R. v. Marina Harbour Systems , 2008 CanL",
    "token_count": 1000,
    "start_token": 6300,
    "end_token": 7300,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 8,
    "source_file": "2023scc28.txt",
    "text": " Ontario Ltd.  v. Sagaz Industries Canada Inc. , 2001 SCC \n59, [2001] 2 S.C.R. 983; Ontario (Ministry of Labour) v. Reid & DeLeye Contractors \nLtd., 2011 ONCJ 472; Ontario (Ministry of Labour) v. Nor Eng Construction & \nEngineering Inc. , 2008 ONCJ 296; R. v. Marina Harbour Systems , 2008 CanLII 64002; \nR. v. EFCO Canada Co. , 2010 ONCJ 421; Canada Post Corp. v. Canadian Union of \nPostal Workers , 2019 SCC 67, [2019] 4 S.C.R. 900; R. v. Sault Ste. Marie , [1978] 2 \nS.C.R. 1299; Director of Occupational Health and Safety v. Governmen t of Yukon, \nWilliam R. Cratty and P.S. Sidhu Trucking Ltd. , 2012 YKSC 47; R. v. Dan Gamache \nTrucking Inc. , 2005 BCSC 1487, 23 M.V.R. (5th) 305; R. v. Bradsil 1967 Ltd. , [1994] \nO.J. No.  837 (QL), 1994 CarswellOnt 4450 (WL); R. v. Cancoil Thermal Corp. and \nParkinson  (1986), 27 C.C.C. (3d) 295; R. v. Wholesale Travel Group Inc. , [1991] 3 \nS.C.R. 154; Wilson v. British Columbia (Superintendent of Motor Vehicles) , 2015 SCC \n47, [2015] 3 S.C.R. 300; La Souveraine, Compagnie d’assurance générale v. Autorité \ndes marchés financiers , 2013 SCC 63, [2013] 3 S.C.R. 756; R. v. Grant Forest Products \n2023 SCC 28 (CanLII)\n\n--- Page 21 ---\n \n Inc. (2002), 98 C.R.R. (2d) 149, rev’d 2003 CarswellOnt 6071 (WL) ; Blue Mountain \nResorts Ltd. v. Ontario (Ministry of Labour) , 2013 ONCA 75, 114 O.R. (3d) 321; R. v. \nGonder  (1981), 62 C.C.C. (2d) 326; R. v. Inco Ltd. , [2001] O.J. No.  4938 (QL), 2001 \nCarswellOnt 10933 (WL); Ontario (Ministry of Labour) v. Linamar Holdings Inc. , \n2012 ONCJ 295; Ontario (Ministry of Labour) v. Wal -Mart Canada Corp. , 2016 ONCJ \n267, 32 C.C.E.L. (4th ) 313; R. v. Imperial Electric Ltd. , 1998 CarswellBC 4085 (WL); \nR. v. Amherst Fabricators Ltd. , [2003] N.S.J. No.  280 (QL); R. v. XI Technologies Inc. , \n2011 ABPC 313 ; R. v. Rio Algom Ltd.  (1988), 66 O.R. (2d) 674; R. v. Brampton Brick \nLtd. (2004), 189 O.A. C. 44.  \nBy Rowe and O’Bonsawin  JJ. (dissenting)  \n Rizzo & Rizzo Shoes Ltd. (Re) , [1998] 1 S.C.R. 27; R. v. Cotton Felts Ltd.  \n(1982), 2 C.C.C. (3d) 287; Ontario (Minister of Labour) v. Enbridge Gas Distribution \nInc., 2010 ONSC 2013, 261 O.A.C. 27; Ontario (Ministry of Labour) v. United \nIndependent Operators Ltd. , 2011 ONCA 33, 104 O.R. (3d) 1; Ontario (Ministry of \nLabour) v. Hamilton (City)  (2002), 58 O.R. (3d) 37; R. v. Timminco Ltd.  (2001), 54 \nO.R. (3d) 21; R. v. Bondfi eld Construction Co. , 2022 ONCA 302;  R. v. Wyssen ",
    "token_count": 1000,
    "start_token": 7200,
    "end_token": 8200,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 9,
    "source_file": "2023scc28.txt",
    "text": ", 104 O.R. (3d) 1; Ontario (Ministry of \nLabour) v. Hamilton (City)  (2002), 58 O.R. (3d) 37; R. v. Timminco Ltd.  (2001), 54 \nO.R. (3d) 21; R. v. Bondfi eld Construction Co. , 2022 ONCA 302;  R. v. Wyssen  (1992), \n10 O.R. (3d) 193; Ontario (Ministry of Labour) v. Nor Eng Construction & \nEngineering Inc. , 2008 ONCJ 296; R. v. EFCO Canada Co. , 2010 ONCJ 421; Ontario \n(Ministry of Labour) v. Pioneer Construction Inc.  (2006), 79 O.R. (3d) 641; R. v. \nSunderland Co -Operative , [1993] O.J. No. 4429 (QL), 1993 CarswellOnt 5741 (WL); \nTembec Forest Products (1990) Inc. (Re) , [1994] O.O.H.S.A.D. No. 3 (QL); Abarquez \n2023 SCC 28 (CanLII)\n\n--- Page 22 ---\n \n v. Ontario , 2009 ONCA 374, 95 O.R. (3d) 414; R. v. Grant Forest Products Inc.  (2002), \n98 C.R.R . (2d) 149; Imperial Oil Ltd. v. Ontario (Ministry of Labour)  (1993), 10 \nC.O.H.S.C. 210; R. v. Campbell , [2004] O.J. No. 129 (QL), 2004 CarswellOnt 116 \n(WL), aff’d (2006), 140 C.R.R. (2d) 143; Commission de la santé et de la sécurité du \ntravail du Québec v . Acier AGF Inc. , 2001 CanLII 12761; Commission de la santé et \nde la sécurité du travail v. Poudrier et Boulet Ltée , [1982] AZ -83147017; Blue \nMountain Resorts Ltd. v. Ontario (Ministry of Labour) , 2013 ONCA 75, 114 O.R. (3d) \n321; Ontario (Ministry of Labou r) v. Black & McDonald Ltd. , 2011 ONCA 440, 106 \nO.R. (3d) 784; R. v. K.B. Home Insulation Ltd. , [2008] O.J. No.  6019 (QL), 2008 \nCarswellOnt 10891 (WL); R. v. Bradsil 1967 Ltd. , [1994] O.J. No.  837 (QL), 1994 \nCarswellOnt 4450 (WL); British Columbia Human Ri ghts Tribunal v. Schrenk , 2017 \nSCC 62, [2017] 2 S.C.R. 795; R. v. Structform International Ltd. , [1992] O.J. No.  1711 \n(QL), 1992 CarswellOnt 2751 (WL); West Fraser Mills Ltd. v. British Columbia \n(Workers’ Compensation Appeal Tribunal) , 2018 SCC 22, [2018] 1 S.C.R. 635; \nCanada Post Corp. v. Canadian Union of Postal Workers , 2019 SCC 67, [2019] 4 \nS.C.R. 900; Ontario (Health and Long -Term Care, Land Ambulance Programs) v. \nCanadian Union of Public Employees, Local 2974.1 , 2010 CanLII 11302; Willick v. \nWillick , [1994] 3 S.C.R. 670; R. v. Brampton Brick Ltd.  (2004), 189 O.A.C. 44; Ontario \nv. Canadian Pacific Ltd. , [1995] 2 S.C.R. 1031; R. v. Halifax Port Authority , 2022 \nNSPC 13; Director of Occupational Health and Safety v. Government of Yukon, \nWilliam R. Cratty a nd P.S. Sidhu Trucking Ltd. , 2012 YKSC 47; R. v. Gonder  (1981), \n62 C.C.C. (2d) 326; R. v. Sault Ste. Marie , [1978] 2 S.C.R. 1299;",
    "token_count": 1000,
    "start_token": 8100,
    "end_token": 9100,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 10,
    "source_file": "2023scc28.txt",
    "text": " Port Authority , 2022 \nNSPC 13; Director of Occupational Health and Safety v. Government of Yukon, \nWilliam R. Cratty a nd P.S. Sidhu Trucking Ltd. , 2012 YKSC 47; R. v. Gonder  (1981), \n62 C.C.C. (2d) 326; R. v. Sault Ste. Marie , [1978] 2 S.C.R. 1299; Stelco Inc. v. Ontario \n2023 SCC 28 (CanLII)\n\n--- Page 23 ---\n \n (Ministry of Labour) , 2006 CanLII 28110; Ontario v. London Excavators & Trucking \nLtd. (1998), 40 O.R. (3d) 32.  \nBy Côté  J. (dissenting)  \n Blue Mountain Resorts Ltd. v. Ontario (Ministry of Labour) , 2013 ONCA \n75, 114 O.R. (3d) 321; R. v. Bondfi eld Construction Co. , 2022 ONCA 302; R. v. K.B. \nHome Insulation Ltd. , [2008] O.J. No.  6019 (QL), 200 8 CarswellOnt 10891 (WL); R. \nv. Bradsil 1967 Ltd. , [1994] O.J. No.  837 (QL), 1994 CarswellOnt 4450 (WL); R. v. \nGrant Forest Products Inc.  (2002), 98 C.R.R. (2d) 149; R. v. Wyssen  (1992), 10 O.R. \n(3d) 193; Canada Post Corp. v. Canadian Union of Postal Worke rs, 2019 SCC 67, \n[2019] 4 S.C.R. 900; Ontario (Ministry of Labour) v. Nor Eng Construction & \nEngineering Inc. , 2008 ONCJ 296; R. v. Wholesale Travel Group Inc. , [1991] 3 S.C.R. \n154. \nStatutes and Regulations Cite d \nConstruction Projects , O. Reg. 213/91, ss. 7.1, 15(1), 17(1), 21, 65, 67(4), 80, 104(3), \n126 to 136.0.1, 140(1), 160(1), 207 to 210, 309 to 316.  \nConstruction Safety Act, 1973 , S.O.  1973, c.  47, s. 1(h). \nIndustrial Safety Act, 1964 , S.O. 1964, c.  45. \nLegislation Act, 2006 , S.O. 2006, c.  21, Sch. F, s. 64(1) . \nOccupational Health and Safety Act , R.S.O. 1990, c.  O.1, ss.  1(1) “constructor”, \n“employer”, “project”, “worker”, “workplace”, (3), Part I, II, 9, Part III, 23, 25  to \n26, 27(1), 28(1)(b), (d), 29 to 30 , 32.0.1 to 32.0.8, Parts IV to VII, 50, Part VIII, \nIX, 66(1), (2), (3). \n2023 SCC 28 (CanLII)\n\n--- Page 24 ---\n \n Authors Cited  \nBall, Stacey Reginald. Canadian Employment Law . Toront o: Thomson Reuters, 1996 \n(loose -leaf updated September 2023, release 4 ). \nCliche, Bernard, et autres. Droit de la santé et de la sécurité au travail: La loi et la \njurisprudence commentées , 3e éd. Montréal: Yvon Blais, 2018.  \nEdwards, Cheryl  A., and Ryan  J. Conlin. Employer Liability For Contractors Under \nThe Ontario Occupational Health and Safety Act , 2nd ed. Toronto: Thomson \nCarswell, 2007.  \nFidler, Richard . “The Occupational Health and Safety Act  and the Internal \nResponsibility System” (1986), 24 Osgoode Hall L.J.  315. \nJohnstone, Richard, Claire Mayhew and Michael Quinlan. “Outsourcing Risk? The \nRegulation of Occupational Health and Safety Where Subcontract ors",
    "token_count": 1000,
    "start_token": 9000,
    "end_token": 10000,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 11,
    "source_file": "2023scc28.txt",
    "text": " Ontario Occupational Health and Safety Act , 2nd ed. Toronto: Thomson \nCarswell, 2007.  \nFidler, Richard . “The Occupational Health and Safety Act  and the Internal \nResponsibility System” (1986), 24 Osgoode Hall L.J.  315. \nJohnstone, Richard, Claire Mayhew and Michael Quinlan. “Outsourcing Risk? The \nRegulation of Occupational Health and Safety Where Subcontract ors Are \nEmployed” (2001), 22 Comp. Lab. L. & Pol’y J. 351. \nMcKechnie, D ave. “Occupational Health and Safety in Construction Law”, in Leonard \nRicchetti and Timothy  J. Murphy, Construction Law in Canada . Markham, Ont.: \nLexisNexis, 2010, 209.  \nOntario. Report of the Royal Commission on the Health and Safety of Workers in Mines . \nToronto, 1976.  \nOntario.  Legislative Assembly.  Legislature of Ontario Debates: Official Report \n(Hansard) — Daily Edition , No. 151, 2nd Sess., 31st  Parl., December  14, 1978, \np. 6187.  \nOntario. Ministry of Labour, Immigration, Training and Skills Development. \nConstructor guideline , February  11, 2022 (online: \nhttps://www.ontario.ca/page/constructor -guideline; archived version: \nhttps://www.scc -csc.ca/cso -dce/2023SCC -CSC28 _1_eng.pdf ). \nOntario. Ministry of Transportation. Ontario Traffic Manual: Book  7 — Temporary \nConditions . St. Catharines, Ont., 2022.  \nSullivan, Ruth. Statutory Interpretation , 3rd ed. Toronto: Irwin Law, 2016.  \nSullivan, Ruth. The Construction of Statutes , 7th ed. Toronto: LexisNexis, 2022.  \nSwaigen, John, and Susan McRory. Regulatory Offences In Canada: Liability and \nDefences , 2nd ed. Toronto: Carswell, 2018.  \n2023 SCC 28 (CanLII)\n\n--- Page 25 ---\n \n  APPEAL from a judgment of the Ontario Court of Appeal \n(Fairburn  A.C.J.O. and Watt and Huscroft  JJ.A.), 2021 ONCA 252 , 15 M.P.L.R. (6th) \n161, [2021] O.J. No.  2113 (QL), 2021 CarswellOnt 5697 (WL), setting aside a decision \nof Po upore  J., 2019 ONSC 3285, 88 M.P.L.R. (5th) 158, [2019] O.J. No.  2957 (QL), \n2019 CarswellOnt 8916 (WL),  which affirmed the acquittals entered by Lische  J., and \nremitting the matter to the Ontario Superior Court of Justice . Appeal dismissed on equal \ndivisio n, Karakatsanis, Côté, Rowe and O’Bonsawin  JJ. dissenting . \n Ryan  J. Conlin  and Jeremy Schwartz , for the appellant.  \n David McCaskill , Giuseppe Ferraro  and William Robinson , for the \nrespondent.  \n Kevin MacNeill  and Jean -Simon Schoenholz , for the intervener the Retail \nCouncil of Canada.  \n Jonathan  C. Lisus , Zain Naqi  and John Carlo Mastrangelo , for the \nintervener s the  Regional Municipality of York, the Regional Municipality of Peel, the \nRegional Municipality of Durham, the Regional Municipality of Halton, the Regional \nMunicipality of Waterloo and the Regional Municipality of Niagara.  \n Ben Parkin  and Johanna Goosen , for the intervener the Workers ’ \nCompensation Board of British Columbia.  \n2023 SCC 28 (CanLII)\n\n--- Page 26 ---\n \n The reasons of Wagner C.J. and Martin, Kasirer and Jamal JJ. were  \ndelivered by \n \n MARTIN  J. —  \nI. Introduction  \n[1] This appeal arises from a fatal accident and concerns the proper \ninterpretation of Ontario’s Occupational Health and Safety Act , R.S.O. 1990, c.  O.1 \n(“Act”). The Corporation of the City of Greater Sudbury contracted with Interpaving \nLimited to act as constructor to repair a downtown water main. An Interpaving \nemployee struck and killed a pedestrian when driving a road grader",
    "token_count": 1000,
    "start_token": 9900,
    "end_token": 10900,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 12,
    "source_file": "2023scc28.txt",
    "text": " MARTIN  J. —  \nI. Introduction  \n[1] This appeal arises from a fatal accident and concerns the proper \ninterpretation of Ontario’s Occupational Health and Safety Act , R.S.O. 1990, c.  O.1 \n(“Act”). The Corporation of the City of Greater Sudbury contracted with Interpaving \nLimited to act as constructor to repair a downtown water main. An Interpaving \nemployee struck and killed a pedestrian when driving a road grader, in r everse, through \nan intersection. Contrary to the accompanying regulation, Construction Projects , \nO. Reg. 213/91 (“Regulation”), no fence was placed between the construction project \nworkplace and the public intersection, and no signaller was assisting the I nterpaving \nworker (see ss.  65 and 104(3)). In separate proceedings, Interpaving was tried and \nconvicted for breaching the duty of employers under s.  25(1)(c) of the Act to “ensure \nthat .  . . the measures and procedures prescribed [in the Regulation] are ca rried out in \nthe workplace”.  \n[2] The legal issue on this appeal concerns the statutory liability, if any, of the \nCity as an employer for breaching this same duty. In response to being charged and \nprosecuted by the Ontario Ministry of the Attorney General (Mini stry of Labour, \nImmigration, Training and Skills Development) (“Ministry”) under s.  25(1)(c) , the City \n2023 SCC 28 (CanLII)\n\n--- Page 27 ---\n \n conceded it was the owner of the construction project and acknowledged that it sent \nquality control inspectors to the project, but denied that it was an employer, arguing \nthat it lacked control over the repair work and had delegated control to Interpaving.  \n[3] The trial judge acquitted the City because Interpaving, not the City, had \ndirect control over the workers and the intersection and thus the City was no t an \nemployer under s.  1(1) (paras.  86-88, reproduced in A.R., vol.  1, at pp.  16-17). \nAlternatively, even if the City breached its obligations, it acted with due diligence as \n“every precaution reasonable in the circumstances” was taken (para.  91). The City ’s \nacquittal on the basis that it was not an employer was upheld by the provincial offences \nappeal court; the court did not address the Ministry’s appeal of trial judge’s finding that \nthe City acted with due diligence (2019 ONSC 3285, 88 M.P.L.R. (5th) 158 ). The Court \nof Appeal, in a unanimous decision, allowed the appeal and set aside the decision of \nthe provincial offences appeal court judge. The court  affirmed and applied the \ndefinition of “employer” established in its leading 1992 decision, R. v. Wyssen , 10 O.R. \n(3d) 193, found the City liable under s.  25(1)(c) as an employer, and remitted the \nquestion of the City’s due diligence to the provincial offences appeal court (2021 \nONCA 252, 15 M.P.L.R. (6th) 161). The City appeals to this Court and asks us to \ndetermine what role control plays in regulatory prosecutions against employers under \ns. 25(1)(c) of the Act.  \n[4] The short answer is that while control over workers and the workplace may \nbear on a due diligence defence, nothing in the text, context or purpose of the Act \n2023 SCC 28 (CanLII)\n\n--- Page 28 ---\n \n requires the Ministry to establish control over the workers or the workplace to prove \nthat the City breached its obligations as an employer under s.  25(1)(c).  \n[5] In s. 1(1), the Act defines “employer” broadly — without any reference to \ncontrol  — and charges all employers to uphold several statutory duties. There is simply \nno reason to embed a control requirement into the definition of an “employer” or graft \na control requirement onto s.  25(1)(c) when the legislature deliberately chose not to do \nso. Indeed, diminishing an employer’s duties by reading in a control requirement under \neither or both provisions would thwart the purpose of this remedial public welfare \nlegislation. This Act is specifically designed to expand historically narrow safeguards \nand seeks to promote and maintain workplace health and safety by  expressly imposing \nconcurrent, overlapping, broad, strict, and non -delegable duties on multiple workplace \nparticipants in what",
    "token_count": 1000,
    "start_token": 10800,
    "end_token": 11800,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 13,
    "source_file": "2023scc28.txt",
    "text": " 25(1)(c) when the legislature deliberately chose not to do \nso. Indeed, diminishing an employer’s duties by reading in a control requirement under \neither or both provisions would thwart the purpose of this remedial public welfare \nlegislation. This Act is specifically designed to expand historically narrow safeguards \nand seeks to promote and maintain workplace health and safety by  expressly imposing \nconcurrent, overlapping, broad, strict, and non -delegable duties on multiple workplace \nparticipants in what is known as the “belt and braces” strategy. The interpretation \nadvanced by the City not only defeats this intention, but would also create undesirable \nand unnecessary uncertainty and jeopardize efficient administration of the Act’s strict \nliability offences. Instead, control is properly considered in deciding whether an \nemployer who has breached the Act can nevertheless defend on the basis that it acted \nwith due diligence. It is open to an accused to prove that its lack of control suggests \nthat it took all reasonable steps in the circumstances.  \n[6] Accordingly, I agree with t he Court of Appeal that the City was an \nemployer and breached its duty under s.  25(1)(c). I would therefore dismiss the appeal \n2023 SCC 28 (CanLII)\n\n--- Page 29 ---\n \n and uphold the Court of Appeal’s order remitting the question of due diligence to the \nprovincial offences appeal court.  \nII. Analysis  \n[7] My analysis proceeds in three parts. I first provide an overview of the Act. \nSecond, I explain why the Ministry need not prove control in a prosecution against an \nemployer under s.  25(1)(c) of the Act. Third, I comment on the role of control in \nrelation t o the due diligence defence under s.  66(3)(b).  \nA. Overview of the Occupational Health and Safety Act  \n[8] The Act seeks to maintain and promote a reasonable level of protection for \nthe health and safety of workers in and about their workplace. As set out in Ontari o \n(Ministry of Labour) v. Hamilton (City)  (2002), 58 O.R. (3d) 37 (C.A.), at para.  16: \nThe [Act] is a remedial public welfare statute intended to guarantee a \nminimum level of protection for the health and safety of workers. When \ninterpreting legislation of  this kind, it is important to bear in mind certain \nguiding principles. Protective legislation designed to promote public health \nand safety is to be generously interpreted in a manner that is in keeping \nwith the purposes and objectives of the legislative s cheme. Narrow or \ntechnical interpretations that would interfere with or frustrate the \nattainment of the legislature’s public welfare objectives are to be avoided.  \n[9] The Act’s public welfare purpose is confirmed by its history. Following the \n1976 Report of th e Royal Commission on the Health and Safety of Workers in Mines  \n(“Ham Commission Report”), the Ontario government engaged in substantial \n2023 SCC 28 (CanLII)\n\n--- Page 30 ---\n \n legislative reform. It repealed various predecessor statutes that only provided \nworkplace protection to employees. When  the Act was introduced in 1978, it expanded \nthe definition of “employer” to extend protection to independent contractors, reflecting \n“the clear intention of the legislature to make employers responsible for ensuring safety \nin the workplace” (see Wyssen , at p. 199).  \n[10] The Act fulfills its public welfare purpose by allocating various \noccupational health and safety duties among various classes of workplace actors, \nincluding constructors, employers, and owners (see ss.  23, 25 and 29, respectively). \nThese duties are often concurrent and overlapping: several different actors may be \nresponsible for the same protective functions and measures. This is known as the “belt \nand braces” approach to occupational health and safety:  \n. . . the Act and Regulations use more than  one method to ensure workers \nare protected. So, if the “belt” does not work to safeguard a worker, the \nbackup system of the “braces” might, or vice versa. If all workplace parties \nare required to exercise due diligence, the failure of one party to exercis e \nthe requisite due diligence might be compensated for by the diligence of \none of the other workplace parties. The purpose is to leave little to chance \nand to make protection of workers an overlapping responsibility.  \n \n(Ontario (Minister of Labour) v. Enbri dge Gas Distribution Inc. , 2010 \nONSC 2013, 261 O.A.C. 27, at para.  24) \n[11] Under the “belt and braces” approach, where multiple workplace entities \nfail to safeguard",
    "token_count": 1000,
    "start_token": 11700,
    "end_token": 12700,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 14,
    "source_file": "2023scc28.txt",
    "text": " the diligence of \none of the other workplace parties. The purpose is to leave little to chance \nand to make protection of workers an overlapping responsibility.  \n \n(Ontario (Minister of Labour) v. Enbri dge Gas Distribution Inc. , 2010 \nONSC 2013, 261 O.A.C. 27, at para.  24) \n[11] Under the “belt and braces” approach, where multiple workplace entities \nfail to safeguard health and safety, they cannot point to others’ failures as an excuse for \ntheir own; each workp lace participant must ensure that the workplace is safe ( R. v. \nJ. Stoller Construction Ltd. , 1986 CarswellOnt 3654 (WL) (Prov. Ct.), at para.  22; R. \n2023 SCC 28 (CanLII)\n\n--- Page 31 ---\n \n v. Stelco Inc. (1989), 1 C.O.H.S.C. 76 (Ont. Prov. Ct.), at pp.  83-84; R. v. Structform \nInternational Ltd. , [1992] O.J. No.  1711 (QL), 1992 CarswellOnt 2751 (WL) (C.J. \n(Gen. Div.)), at para.  17 (WL); R. v. Thomas  G. Fuller & Sons Ltd. , 2008 CarswellOnt \n9276 (WL) (C.J.), at para.  54; R. v. Cox Construction Ltd. , 2008 CarswellOnt 9540 \n(WL) (C.J.), at paras.  189-92; R. v. Saskatchewan Power Corp. , 2016 SKPC 2, at \npara.  35 (CanLII), citing Ontario (Ministry of Labour) v. Dofasco Inc. , 2007 ONCA \n769, 87 O.R. (3d) 161). The Ham Commission Report advocated for an “internal \nresponsibility system” whereby all workplace p articipants share responsibility for \nworkplace safety, highlighted that “a safe workplace involves all participants working \ntogether in a shared responsibility system”, and recognized “a positive and proactive \nduty on all participants” ( R. v. Campbell , [2004] O.J. No.  129 (QL), 2004 CarswellOnt \n116 (WL) (C.J.), at paras.  28-29 and 65).  \nB. What the Ministry is Required to Establish  \n[12] Section  66(1)(a) of the Act makes it an offence for a workplace actor to \nbreach one of the Act’s obligations, including s.  25(1)( c), which is a strict liability \noffence ( R. v. Timminco Ltd.  (2001), 54 O.R. (3d) 21 (C.A.), at para.  23). As such, \nwhen s.  25(1)(c) is the subject of the charge, the Ministry only needs to prove the actus \nreus beyond a reasonable doubt to ground a convict ion; the Ministry does not need to \nprove mens rea . To prove the actus reus , the Ministry must prove that workplace \nparticipant was an employer under s.  1(1) and that there was a breach because the \n2023 SCC 28 (CanLII)\n\n--- Page 32 ---\n \n employer did not ensure that the prescribed measures and pr ocedures were carried out \nin the workplace.  \n[13] My colleagues Rowe and O’Bonsawin  JJ. and I agree that the definition of \n“employer” is a free -standing and distinct question from the question of the scope of \nthe duty under s.  25(1)(c) (see para.  75). Though th e interpretation of “employer” in \ns. 1(1) and of the duty in s.  25(1)(c) are related insofar as the provisions provide context \nfor one another and are governed by the same statutory purpose, these two questions \nmust remain analytically distinct. Additional ly, my colleagues Rowe and \nO’Bonsawin  JJ. and I agree that control should not be embedded into the definition of \n“employer” (paras.  93 and 97). Where we part ways is the role of control in relation to \nthe employer’s duty in s.  25(1)(c).  \n(1) Proving the City Is an “Employer” Under Section  1(1) of the Act Does Not \nRequire the Ministry to Prove Control  \n[14",
    "token_count": 1000,
    "start_token": 12600,
    "end_token": 13600,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 15,
    "source_file": "2023scc28.txt",
    "text": "onsawin  JJ. and I agree that control should not be embedded into the definition of \n“employer” (paras.  93 and 97). Where we part ways is the role of control in relation to \nthe employer’s duty in s.  25(1)(c).  \n(1) Proving the City Is an “Employer” Under Section  1(1) of the Act Does Not \nRequire the Ministry to Prove Control  \n[14] The Act defines an employer as  \na person who employs one or more workers or contracts for the services of \none or more workers and includes a cont ractor or subcontractor who \nperforms work or supplies services and a contractor or subcontractor who \nundertakes with an owner, constructor, contractor or subcontractor to \nperform work or supply services;  \n[15] The meaning of “employer” was thoroughly canvassed a nd authoritatively \ndetermined in Wyssen (see Ontario v. London Excavators & Trucking Ltd.  (1998), 40 \n2023 SCC 28 (CanLII)\n\n--- Page 33 ---\n \n O.R. (3d) 32 (C.A.), at p.  40; Ontario (Ministry of Labour) v. Pioneer Construction \nInc. (2006), 79 O.R. (3d) 641 (C.A.), at para.  19; Dofasco Inc. , at para.  9; Ontario \n(Ministry of Labour) v. United Independent Operators Ltd. , 2011 ONCA 33, 104 O.R. \n(3d) 1, at para.  38). \n[16] In that 1992 decision, the Court of Appeal for Ontario eschewed, not \nembedded, a control requirement for who qualifies as an emplo yer. In doing so, the \ncourt endorsed the “belt and braces” approach of placing overlapping responsibilities \non all workplace actors, regardless of their level of control, in order to best protect \nworker safety. Blair  J.A., for the majority, considered the text, context and purpose of \ns. 1(1) in concluding that the definition of “employer” is broad, unconnected to control, \nand encompasses two types of relationships: (1) where a person employs workers; and \n(2) where a person contracts for the services of work ers (p.  196).  \n[17] It is clear from the text of the definition of “employer” that control is not \nan element that the Ministry must prove to establish that an accused is subject to the \nduties of an employer. First, the definition contains no reference to contro l. It is simply \nnot there when it could have been, if that was the intention of the legislature. This Court \nmust give effect to what the legislature included in the definition of “employer”. To \nconjecture and then grant priority to what the legislature cho se not to include, by adding \nan additional element into the definition, “would be tantamount to amending [the Act], \nwhich is a legislative and not a judicial function” ( R. v. McIntosh , [1995] 1 S.C.R. 686, \nat para.  26 (emphasis deleted); see also R. v. Hin chey, [1996] 3 S.C.R. 1128, at para.  8). \n2023 SCC 28 (CanLII)\n\n--- Page 34 ---\n \n [18] Second, at common law, a person’s relationship with an independent \ncontractor is typically characterized by a lack of control on the part of that person over \nthe contractor ( 671122 Ontario Ltd. v. Sagaz Industries C anada Inc. , 2001 SCC 59, \n[2001] 2 S.C.R. 983, at paras.  33-48). The phrase “contract for services” is used, at \ncommon law, to refer to such relationships. Comparatively, “contract of service” is \nused to denote an employment agreement. By referring to a “co ntract for services” in \nthe definition of “employer”, the legislature signaled its intent to capture \nemployer -independent contractor relationships under the “employer” definition \n(Wyssen , at pp.  196-98). Since Wyssen found that such relationships are captu red by \nthe definition, it follows that a person can be an employer under the Act even where \nthey lack control over the worker or the workplace. Wyssen ’s interpretation applies to \nall employees and workplaces, including those in the construction industry.  \n[19] In addition, as noted in Wyssen , prior to the Act’s",
    "token_count": 1000,
    "start_token": 13500,
    "end_token": 14500,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 16,
    "source_file": "2023scc28.txt",
    "text": "employer” definition \n(Wyssen , at pp.  196-98). Since Wyssen found that such relationships are captu red by \nthe definition, it follows that a person can be an employer under the Act even where \nthey lack control over the worker or the workplace. Wyssen ’s interpretation applies to \nall employees and workplaces, including those in the construction industry.  \n[19] In addition, as noted in Wyssen , prior to the Act’s enactment, other pieces \nof worker safety legislation defined “employer” in a way that excluded independent \ncontractor relationships (p.  199, citing Industrial Safety Act, 1971 , S.O. 1971, c.  43, \ns. 1(e); see also, e.g., The Construction Safety Act, 1973 , S.O. 1973, c.  47, s.  1(h)). The \nshift in this Act to expressly include employer -independent contractor relationships \nwithin the definition of “employer” signals the legislature’s intention to remove from \nthe definition the traditional common law control condition that distinguishes \nemployment and independent contractor relationships. Incorporating control into the \ns. 1(1) definition would therefore reintroduce a characteristic of the former regime, \n2023 SCC 28 (CanLII)\n\n--- Page 35 ---\n \n which wa s abolished because it failed to adequately promote and protect workplace \nsafety.  \n[20] It is also significant that while the legislature did not include control in the \ndefinition of “employer”, it did in the definition of “constructor”. In s.  1(1), \n“constructo r” is defined as “a person who undertakes a project for an owner”; \n“undertaking a project” involves assuming control over it ( Ontario (Ministry of \nLabour) v. Reid & DeLeye Contractors Ltd. , 2011 ONCJ 472, at para.  42 (CanLII)). \nThe absence of a control req uirement for employers thus reflects an intentional \nlegislative choice that must be respected.  \n[21] Accordingly, authorities that have read a control requirement into \n“employer” are irreconcilable with Wyssen , inconsistent with the text, context and \npurpose of  the Act,  and should not be followed (see, e.g., Ontario (Ministry of Labour) \nv. Nor Eng Construction & Engineering Inc. , 2008 ONCJ 296, at para.  88 (CanLII); R. \nv. Marina Harbour Systems , 2008 CanLII 64002 (Ont. S.C.J.), at paras.  27-30; R. v. \nEFCO Canada  Co., 2010 ONCJ 421, at paras.  59-60). \n[22] It follows from the straightforward application of Wyssen , as well as the \ntext, context and purpose of s.  1(1), that the City was an employer under both branches \nof the Act’s definition. I agree with the Court of Appe al that it was an employer of the \ninspectors, whom it employed directly and dispatched to the construction project. \nFurther, under the second branch, the City was an employer of Interpaving, with whom \nit contracted to undertake the construction project. Be cause the definition of \n2023 SCC 28 (CanLII)\n\n--- Page 36 ---\n \n “employer” encompasses employer -independent contractor relationships, an owner \nwho contracts with a constructor is an employer under s.  1(1) of the Act. The text of \nthe “employer” definition captures a person who contracts for the s ervices of workers, \nand “worker” is defined as including “[a] person who performs work or supplies \nservices for monetary compensation”. This encompasses constructors, who perform \nwork and supply services for monetary compensation. Thus, the reference to \ncontracting for the services of workers in the “employer” definition clearly captures \ncontracting with constructors.  \n(2) Proving the City Breached Section 25(1)(c) of the Act  \n[23] The duties imposed by the Act are numerous, varied and stated in precise, \npurposeful wa ys. In some cases, they are linked to a particular workplace or project \n(see, e.g., ss.  23(1) and 25(1)(c)) or to the workers (see, e.g., ss.  23(1)(c) and 25(2)(a)). \nIn other cases, they are more broadly stated (see, e.g., s.  25(1)(a)). The relevant \nobliga tion in this case is",
    "token_count": 1000,
    "start_token": 14400,
    "end_token": 15400,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 17,
    "source_file": "2023scc28.txt",
    "text": " In some cases, they are linked to a particular workplace or project \n(see, e.g., ss.  23(1) and 25(1)(c)) or to the workers (see, e.g., ss.  23(1)(c) and 25(2)(a)). \nIn other cases, they are more broadly stated (see, e.g., s.  25(1)(a)). The relevant \nobliga tion in this case is tied to the workplace.  \n[24] The City is alleged to have breached s.  25(1)(c), which requires that an \nemployer “shall ensure that .  . . the measures and procedures prescribed are carried out \nin the workplace”. This obligation applies to emp loyers across all sectors. For \nemployers in the construction industry, the relevant measures and procedures are \nprescribed in the Regulation. A review of s.  25(1)(c)’s text, context, and purpose \nreveals that control on the part of the accused is not an ele ment of this duty. The \n2023 SCC 28 (CanLII)\n\n--- Page 37 ---\n \n Ministry does not need to prove that the City had control over the Interpaving workers \nor the workplace as part of the actus reus  of the s.  25(1)(c) offence.  \n(a) Text \n[25] The plain text of s.  25(1)(c) does not limit this duty to workers or \nworkplaces over which the employer has control. The legislature could have written in \nan internal limitation akin to a control requirement in relation to this duty but chose not \nto. This is all the more important because, in contrast to s.  25(1)(c), it did  precisely that \nin s. 25(2)(h), where the employer’s obligation to take precautions is limited to those \nprecautions “reasonable in the circumstances”. That the legislature did not limit \ns. 25(1)(c), whether by reference to a control requirement or otherwis e, reflects an \nintentional choice that this Court should not disturb.  \n[26] By comparison, other statutes express a different legislative choice. For \nexample, in Canada Post Corp. v. Canadian Union of Postal Workers , 2019 SCC 67, \n[2019] 4 S.C.R. 900, the text o f the duty at issue required the employer to inspect “every \nwork place controlled by the employer” (para.  9, citing s.  125(1) of the Canada Labour \nCode , R.S.C. 1985, c.  L-2). Thus, Parliament explicitly decided that the employer’s \nduty should be triggered by the employer’s control over the workplace. Similarly, in R. \nv. Sault  Ste. Marie , [1978] 2 S.C.R. 1299, the foundational case setting out the structure \nof regulatory offences, the relevant offence was discharging or depositing, or causing \nor permitting t he discharge or deposit of, material of any kind into a water course. This \nCourt interpreted the actus reus  of the offence of “causing” the discharge of material \n2023 SCC 28 (CanLII)\n\n--- Page 38 ---\n \n as incorporating a control element (p.  1329). No similar language can be found in \ns. 25(1)(c).  This indicates that a different legislative choice was made by the Ontario \nlegislature.  \n[27] The language that the legislature chose to use in s.  25(1)(c) — namely, the \nuse of the word “ensure” — also speaks to and supports the broad nature of this duty. \nIn Wyssen, Blair  J.A. noted that the dictionary definition of “ensure”, as it appeared in \nthe predecessor to s.  25(1)(c), is to “make certain” (p.  198). This duty “puts an \n‘employer’ virtually in the position of an insurer who must make certain that the \nprescri bed regulations for safety in the workplace have been complied with before work \nis undertaken by either employees or independent contractors” (p.  198). This \n“sweeping”, “undeniably strict” and “non -delegable” duty “cannot be evaded by \ncontracting out perfo rmance of the work to independent contractors” (p.  198).  \n[28] The strict nature of this duty also led the Court of Appeal to reject reading \na mens rea  requirement into s.  25(1)(c) ( Timminco , at",
    "token_count": 1000,
    "start_token": 15300,
    "end_token": 16300,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 18,
    "source_file": "2023scc28.txt",
    "text": " (p.  198). This \n“sweeping”, “undeniably strict” and “non -delegable” duty “cannot be evaded by \ncontracting out perfo rmance of the work to independent contractors” (p.  198).  \n[28] The strict nature of this duty also led the Court of Appeal to reject reading \na mens rea  requirement into s.  25(1)(c) ( Timminco , at paras.  22-26). Clear language, \nlike the words “wilfully”, “with int ent”, “knowingly” or “intentionally”, would be \nnecessary to view s.  25(1)(c) as a mens rea offence ( Timminco , at para.  26). That the \nlegislature instead used the word “ensure” “suggests that [it] intended to impose a strict \nduty on the employer to make cer tain that the prescribed safety standards were \ncomplied with at all material times” ( Timminco , at para.  26). For the same reasons that \nreading in a mens rea  element would be inappropriate, a control requirement cannot be \nread into s.  25(1)(c).  \n2023 SCC 28 (CanLII)\n\n--- Page 39 ---\n \n [29] This conclusion about the text of s.  25(1)(c) is further supported by this \nCourt’s reasoning in West Fraser Mills Ltd. v. British Columbia (Workers’ \nCompensation Appeal Tribunal) , 2018 SCC 22, [2018] 1 S.C.R. 635, which considered \nthe interpretation of “em ployer” in s.  196(1) of British Columbia’s Workers \nCompensation Act , R.S.B.C. 1996, c.  492. The workplace owner, West Fraser Mills, \nhired an independent contractor, and one of the contractor’s employees was killed in a \nworkplace accident. The Workers’ Comp ensation Board of British Columbia \ndetermined that West Fraser Mills had breached its regulatory duty as an owner under \ns. 26.2(1) of the Occupational Health and Safety Regulation , B.C. Reg. 296/97, by \nfailing to ensure that “all activities of the forestry  operation are both planned and \nconducted in a manner consistent with this Regulation and with safe work practices \nacceptable to the Board”. It then imposed a penalty under s.  196(1) of the enabling \nstatute, which permits the Board to penalize an employer.  West Fraser Mills was seen \nas an employer, in addition to being an owner, because it employed individuals to carry \nout the duties imposed by s.  26.2(1) of the regulation in relation to the worksite in \nquestion.  \n[30] On appeal, this Court determined that the T ribunal’s decision was not \npatently unreasonable (para.  32). The Tribunal had broadly interpreted West Fraser \nMills’ duties as an employer under s.  196(1) as relating to the worksite at issue. An \n“actual connection to the specific accident at issue” existe d between West Fraser Mills \nas the employer and the “ worksite that led to the accident and injury ”, even though \nthere was no “employment relationship with the person injured ” (para.  39 (emphasis in \n2023 SCC 28 (CanLII)\n\n--- Page 40 ---\n \n original)). This interpretation aligned with s.  196(1)’s t ext, which “focus[ed] not on the \nspecific relationship between the impugned employer and the victim of a workplace \naccident, but on the relationship between the employer and the worksite that led to the \naccident and injury” (para.  45).  \n[31] As with s.  196(1) o f the British Columbia statute, the text of s.  25(1)(c) of \nthe Ontario Act concerns occupational health and safety measures present at a physical \nworkplace location to which an employer may be connected by virtue of sending \nemployees there or contracting w ith independent contractors to perform work there. It \nstates that the measures prescribed in the Regulation must be followed at that location. \nIt does not focus on the nature of the employer’s relationship with any particular \nindividual. Crucially, it does  not focus on whether that relationship is characterized by \ncontrol. Because of its language, s.  25(1)(c) cannot be read as applying only when an \nemployer has a degree of control over someone.  \n(b) Context  \n[32] The duty in s. ",
    "token_count": 1000,
    "start_token": 16200,
    "end_token": 17200,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 19,
    "source_file": "2023scc28.txt",
    "text": " \nstates that the measures prescribed in the Regulation must be followed at that location. \nIt does not focus on the nature of the employer’s relationship with any particular \nindividual. Crucially, it does  not focus on whether that relationship is characterized by \ncontrol. Because of its language, s.  25(1)(c) cannot be read as applying only when an \nemployer has a degree of control over someone.  \n(b) Context  \n[32] The duty in s.  25(1)(c) must be understood in the cont ext of the scheme of \nthe Act, including other duties contained therein, the wide definition of “employer”, \nand the existence of a due diligence defence under s.  66(3)(b).  \n[33] To begin, and to state the obvious, s.  25 imposes various, differently \nworded duties  on employers. Some are drafted narrowly. For example, ss.  25(1)(b) and \n25(1)(d) create duties respecting “the equipment, materials, and protective devices \n2023 SCC 28 (CanLII)\n\n--- Page 41 ---\n \n provided by the employer ”. Similarly, the duty on workers set out in s.  28(1)(b) to “use \nor wear” eq uipment, protective devices, or clothing is restricted to the items that the \n“worker’s employer  requires to be used or worn”. This juxtaposition of narrow duties \nwith the more broadly worded s.  25(1)(c) does not suggest that s.  25(1)(c)’s duty is \nimplicitl y narrow. Rather, the narrower provisions show that the legislature \nintentionally limited some duties (such as s.  25(1)(b) and (d)) to the relationship \nbetween an employer and a worker, whereas other duties, including s.  25(1)(c), were \nintentionally drafte d broadly so as to focus on the employer’s connection to the \nworkplace rather than any particular worker (R.  Sullivan, The Construction of Statutes  \n(7th ed. 2022), at pp.  249-52). The legislature’s choice ought to be respected, and there \nis no need to read  down or read into s.  25(1)(c)’s explicitly expansive text.  \n[34] Second, the broad definition of “employer” is relevant context for \ninterpreting s.  25(1)(c). The breadth of the employer’s duties and the broad scope of \nthe definition of “employer” are mutually reinforcing. Narrowing s.  25(1)(c) by reading \na control requi rement into it runs contrary to Wyssen  and the modern approach to \nstatutory interpretation.  \n[35] Though my colleagues Rowe and O’Bonsawin  JJ. and I agree that the City \nis an employer under the Act and that control is not relevant to the definition of \n“employer ”, we diverge in our interpretation of s.  25(1)(c). They would read a control \nrequirement into this duty, such that it only applies to employers where there is a \n“functional relationship between the measure and the employer” (para.  106), which \n2023 SCC 28 (CanLII)\n\n--- Page 42 ---\n \n they describ e as “a nexus to the work which is under the employer’s control and \nperformed through their workers” (para.  155). Incorporating control by requiring a \n“nexus” between an employer and activities under the employer’s control is \ninconsistent with the text, co ntext, and purpose of the section and with Wyssen . While \nthe interpretation of ss.  1(1) and 25(1)(c) raises separate questions, these sections \nshould be read harmoniously as they are nonetheless related.  \n[36] In Wyssen , Blair  J.A. observed that the breadth of the employer’s duties \nunder what is now s.  25(1)(c) corroborated the breadth of the definition of “employer” \n(p. 198).  The broad nature of one goes hand in hand with the broad nature of the other. \nYet, while my colleagues purport to follow Wyssen by leavin g the definition broad, in \nfact they depart from Wyssen  by narrowing the employer’s duties. In doing so, they \nintroduce an internal inconsistency into the Act by pairing a broad definition of \n“employer” with a narrow interpretation of s.  25(1)(c), rather t han finding harmony \nbetween these provisions and treating them as mutually reinforcing as",
    "token_count": 1000,
    "start_token": 17100,
    "end_token": 18100,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 20,
    "source_file": "2023scc28.txt",
    "text": " the broad nature of the other. \nYet, while my colleagues purport to follow Wyssen by leavin g the definition broad, in \nfact they depart from Wyssen  by narrowing the employer’s duties. In doing so, they \nintroduce an internal inconsistency into the Act by pairing a broad definition of \n“employer” with a narrow interpretation of s.  25(1)(c), rather t han finding harmony \nbetween these provisions and treating them as mutually reinforcing as the legislature \nintended. Wyssen  observed that the legislature expanded the definition of “employer” \nto capture employer -independent contractor relationships that are  not characterized by \ncontrol; reading control into s.  25(1)(c) thus creates a dissonance in the Act that \nundermines legislative intention by reintroducing a previously discarded control \nelement into the new widely worded public welfare legislation.  \n[37] Third , the existence of the due diligence defence in s.  66(3)(b) of the Act \nis relevant context because it means that employers who breach s.  25(1)(c) will not be \n2023 SCC 28 (CanLII)\n\n--- Page 43 ---\n \n subject to penalties under the Act if they can show they took all reasonable steps to \navoid the br each. Section  66(3)(b) therefore functions as a safety valve, in which the \npresence of control may be a factor in assessing due diligence. As a result, there is no \njustification for narrowing the offence under s.  25(1)(c) by overlaying a control \nrequiremen t. Concerns about fairness are answered by the availability and content of \nthis defence.  \n(c) Purpose  \n[38] Reading a control requirement into s.  25(1)(c) would also be inconsistent \nwith the purpose of the Act. The Act, to repeat, is a public welfare statute. Its pu rpose \nis to maintain and promote a reasonable level of protection for the health and safety of \nworkers in and about their workplace. This purpose is achieved through the imposition \nof shared and overlapping duties: the “belt and braces” regulatory strategy .  \n[39] A clear example of this approach is found in the overlap between a \nconstructor’s and employer’s duties. Section  23(1)(a) requires constructors to ensure \nthat “the measures and procedures prescribed by this Act and the regulations are carried \nout on the project”, mirroring the employer’s duty under s.  25(1)(c). This overlap is \nexplicit and intentional. Indeed, s.  23(1)(b) requires constructors to ensure that “ every \nemployer  . . . performing work on the project complies with this Act and the \nregulations”. It is entirely in keeping with the regulatory structure and strategy that the \nAct deploys to achieve worker safety for an employer to have duties that reciprocally \noverlap with the duties of a constructor irrespective of these entities’ respective degrees \n2023 SCC 28 (CanLII)\n\n--- Page 44 ---\n \n of control over a workplace or a hazard there. Similarly, the required expansive and \ngenerous interpretation of the Act means that there may also be more than one employer \nwho is responsible for the safety of the workplace and workers.  \n[40] Concern that overla pping duties will create confusion because different \nactors may not coordinate with each other and may implement competing or \ninconsistent safety measures is unwarranted. Cooperation and communication between \nworkplace actors is built into the Act’s scheme  (United Independent Operators , at \npara.  55, citing the Ministry’s  Guide to T he Occupational Health and Safety Act , 1978 , \nat p.  28; see also West Fraser Mills , at para.  43). The Act also incentivizes such \nbehaviour: where actors fail to cooperate and commu nicate, it is less likely that they \nwill be able to successfully mount a due diligence defence. For example, in London \nExcavators , a subcontractor on a construction project was unable to establish the due \ndiligence defence because of its unreasonable relia nce on a general contractor’s \nmiscommunication about the location of a hazard (p.  40).  \n[41] However, reading in a control requirement could defeat the Act’s public \nwelfare purpose of creating overlapping responsibility. Often, workplace actors will \nhave varyin g degrees of control over a workplace. Some will have more  control than \nothers without having exclusive  control ( Director of Occupational Health and Safety v. \nGovernment of Yukon, William R.  Cratty and P.S.  Sidhu Trucking Ltd. , 2012 YKSC \n47, at para.",
    "token_count": 1000,
    "start_token": 18000,
    "end_token": 19000,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 21,
    "source_file": "2023scc28.txt",
    "text": "41] However, reading in a control requirement could defeat the Act’s public \nwelfare purpose of creating overlapping responsibility. Often, workplace actors will \nhave varyin g degrees of control over a workplace. Some will have more  control than \nothers without having exclusive  control ( Director of Occupational Health and Safety v. \nGovernment of Yukon, William R.  Cratty and P.S.  Sidhu Trucking Ltd. , 2012 YKSC \n47, at para.  69 (C anLII)). This variance matters. Incorporating a control element into \ns. 25(1)(c) would essentially give workplace actors a tool for frustrating regulatory \n2023 SCC 28 (CanLII)\n\n--- Page 45 ---\n \n prosecutions at the outset, before the burden shifts to the accused to demonstrate due \ndiligence unde r s. 66(3)(b), by arguing that they had no control over a hazard because \nother parties had greater comparative control  over that hazard. We cannot ignore this \npractical, on -the-ground reality, which, if permitted to prevail, would not be conducive \nto promo ting workplace safety. Rather, it would undermine the “belt and braces” \napproach by turning prosecutions under the Act into a “finger pointing” exercise. As \nGotlib  J. explained in Structform , at para.  17: \nThe case law is clear that one employer cannot poin t a finger at another \nemployer who might be closer to the situation. Every employer has a duty \nto see that the workplace is safe. And in the complexity of construction it \nis important that every employer use knowledge, due diligence, etc., to \nensure that t he workplace is safe. An employer is not entitled to say it is \nsomeone else’s responsibility.  \n[42] The point is not that it is prohibitively difficult for a court to ascertain \nwhether control exists or to even assess comparative degrees of control. The point is  \nthat situating the assessment of control under the Ministry’s burden to prove the \ns. 25(1)(c) offence is incongruous with the Act’s public welfare objectives. The focus \nat the breach stage would move from safety, where it belongs, to parsing who actually \ncontrolled what. Creating a control requirement under s.  25(1)(c) is impractical as it is \nthe employer, not the Ministry, who has the best knowledge and evidence about their \nlevel of control ( Sault  Ste. Marie , at p.  1325). It is also inefficient as requiri ng the \nMinistry to prove control defeats the objective of achieving administrative expediency \nthrough the use of strict liability regulatory offences ( Sault  Ste. Marie , at p.  1311). \n2023 SCC 28 (CanLII)\n\n--- Page 46 ---\n \n These problems are precisely what led the Court of Appeal to reject a mens  rea \nrequirement under s.  25(1)(c) ( Timminco , at paras.  24-26).  \n[43] It is unnecessarily duplicative to situate an inquiry into the accused’s \ndegree of control under both the Ministry’s burden and the accused’s burden of \nestablishing due diligence. Even where the language of an offence in a public welfare \nstatute makes control an explicit condition, “it is sometimes difficult to maintain the \ndistinction between the actus reus  and the defence of due diligence” ( R. v. Dan \nGamache Trucking Inc. , 2005 BCSC 1487, 23  M.V.R. (5th) 305, at para. 13). Far from \nclarifying the role of control in prosecutions under the Act, actively reading it into an \noffence like s.  25(1)(c), whose text makes no mention of control, invites further \nconfusion about the proper place of contro l and what analytical differences there are \nbetween the Ministry’s burden to prove control and the accused’s burden to prove a \nlack of control. Introducing this additional complexity into proceedings under the Act \nundercuts the goal of administrative effic iency. By contrast, considering control only \nunder due diligence, where its relevance is entirely uncontroversial, indeed common, \noffers much -needed clarity and predictability. I return to the due diligence defence \nbelow.  \n[44] Finally, it advances the Act’s pur pose to impose an employer’s duties on \nthe owner of a construction project even if that owner has divested control to a \nconstructor. My colleagues Rowe and O’Bonsawin  JJ. argue that the Act intentionally \nleaves owners who hire constructors with limited res ponsibilities (paras.  100-102 and \n2023",
    "token_count": 1000,
    "start_token": 18900,
    "end_token": 19900,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 22,
    "source_file": "2023scc28.txt",
    "text": " -needed clarity and predictability. I return to the due diligence defence \nbelow.  \n[44] Finally, it advances the Act’s pur pose to impose an employer’s duties on \nthe owner of a construction project even if that owner has divested control to a \nconstructor. My colleagues Rowe and O’Bonsawin  JJ. argue that the Act intentionally \nleaves owners who hire constructors with limited res ponsibilities (paras.  100-102 and \n2023 SCC 28 (CanLII)\n\n--- Page 47 ---\n \n 119-25). But, while s.  29(1) imposes duties on owners of workplaces that are not \nprojects, this provision does not suggest that project owners are absolved of statutory \nduties if they devolve control to a constructor. Thes e duties simply do not apply to \nproject owners; however, project owner duties set out in s.  30 do apply to the project \nowner regardless of whether they hire a constructor. Moreover, a constructor under \ns. 1(1) is defined as including “an owner who undertak es all or part of a project by \nhimself”. It is thus not the case that on every construction project an independent \ncontractor is the constructor with overall safety responsibility; the constructor may \nsimply be the owner, if the owner undertakes a project alone.  \n[45] Most importantly, even where an owner gives up control to a constructor, \nthat same owner can have duties as an employer that may at times overlap with the \nconstructor’s duties. While s.  1(3) prevents an owner who sends inspectors to a \nworksite from  becoming a constructor, it does not prevent the owner from being an \nemployer. And, there is “a connection between increased remedies against owners who \nhold duties as employers for given workplaces and increased occupational health and \nsafety. The general  scheme of the Act is to hold both owners and employers responsible \nin an overlapping and cooperative way for ensuring worksite safety” ( West Fraser \nMills , at para.  43). This conclusion does not undermine the fact that the Act places \noverall authority with  a constructor. Indeed, guidelines published by the Ministry \nprovide that, even though a constructor is the party with the greatest control over a \nconstruction project, “[h]ealth and safety at a project are a shared responsibility [such \nthat] each employer  at a project has significant responsibilities for the health and safety \n2023 SCC 28 (CanLII)\n\n--- Page 48 ---\n \n of their workers” ( Constructor guideline , February 11, 2022 (online)). Occupational \nhealth and safety legislation does not create distinct “silos of responsibility” for \ndifferent actors, nor for different sectors or industries ( West Fraser Mills , at para.  15), \nand this sharing of responsibilities is simply another manifestation of the “belt and \nbraces” approach.  \n(d) The City Breached Its Duties as an Employer  \n[46] As an employer of the insp ectors and of Interpaving, the City was required \nby s. 25(1)(c) of the Act to ensure that “the measures and procedures prescribed [were] \ncarried out in the workplace”. This included ensuring compliance with ss.  65 and \n104(3) of the Regulation. On the date of the pedestrian’s death, the measures required \nby these provisions — a fence between the construction work and the public way, and \nsignallers — were not carried out in the workplace. Thus, the City, as employer, \ncommitted the offence under s.  25(1)(c) an d its degree of control over the workplace \nor the workers is not relevant to this finding.  \n[47] Having determined that the City was in breach of the Act, I turn to the due \ndiligence defence.  \nC. The Defence’s Burden: Proving Due Diligence  \n[48] Once the Ministry establi shes a breach of the employer’s duty under \ns. 25(1)(c), the burden shifts to the accused to prove, on a balance of probabilities, that \n2023 SCC 28 (CanLII)\n\n--- Page 49 ---\n \n “every precaution reasonable in the circumstances” was taken pursuant to s.  66(3)(b) \n(see Timminco , at paras.  22-26; see also Sault  Ste. Marie , at pp. 1324 -25). I note that \nthe common law defence of due diligence also remains available for strict liability \noffences under the Act that are not listed in s.  66(3) (see R. v. Bradsil 1967 Ltd. , [",
    "token_count": 1000,
    "start_token": 19800,
    "end_token": 20800,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 23,
    "source_file": "2023scc28.txt",
    "text": " was taken pursuant to s.  66(3)(b) \n(see Timminco , at paras.  22-26; see also Sault  Ste. Marie , at pp. 1324 -25). I note that \nthe common law defence of due diligence also remains available for strict liability \noffences under the Act that are not listed in s.  66(3) (see R. v. Bradsil 1967 Ltd. , [1994] \nO.J. No.  837 (QL), 1994 Cars wellOnt 4450 (WL) (C.J. (Prov. Div.)), at para.  16, citing \nR. v. Cancoil Thermal Corp. and Parkinson  (1986), 27 C.C.C. (3d) 295 (Ont. C.A.)). \nIt is therefore open to the City to escape liability by proving that it exercised due \ndiligence. I begin by explai ning why control should only be considered at this stage of \nthe analysis, before turning to how control ought to be considered.  \n(1) An Employer’s Control Should Be Considered Only as Part of the Due \nDiligence Defence  \n[49] Considering control at the due diligence s tage respects the text, context and \npurpose of the Act and best upholds its purpose of promoting workplace safety. Though \na person convicted under s.  25(1)(c) of the Act may be liable to fines and/or \nimprisonment (s.  66(1) and (2)), a breach of s.  25(1)(c)  is not a criminal offence, but \nrather a strict liability regulatory offence. Its goal is not to “condemn and punish past, \ninherently wrongful conduct”, but to “preven[t] .  . . future harm through the \nenforcement of minimum standards of conduct and care” ( R. v. Wholesale Travel \nGroup Inc. , [1991] 3 S.C.R. 154, at p.  219; see also Wilson v. British Columbia \n(Superintendent of Motor Vehicles) , 2015 SCC 47, [2015] 3 S.C.R. 300, at para.  33; La \nSouveraine, Compagnie d’assurance générale v. Autorité des marchés financiers , 2013 \nSCC 63, [2013] 3 S.C.R. 756, at para.  90). The legislature’s choice to impose liability \n2023 SCC 28 (CanLII)\n\n--- Page 50 ---\n \n upon an employer, even absent a connection to or control over an activity, was driven \nnot by a desire  to express opprobrium of inherently blameworthy c onduct but by a \ndesire to modify behaviour and reduce the risk of workplace injury. The nature and \npurpose of strict liability offences means that stigma will not attach to employers who \nare found to have breached s.  25(1)(c) of the Act. Rather, shifting t he burden to the \nemployer to establish a due diligence defence incentivizes employers to take all steps \nwithin their control to achieve workplace safety and prevent future harm so that they \nmay avail themselves of the defence should harm occur.  \n[50] That an em ployer’s degree of control over other parties in the workplace is \nrelevant to its due diligence defence also answers fairness concerns about imposing \nliability on an employer for a breach caused by another party. Considering control \nunder due diligence mea ns employers lacking control may escape liability. Placing the \nburden of establishing a lack of control on the employer is logical and preferable, as \nthe employer is best positioned to adduce evidence of its levels of control, expertise, \nknowledge, and ski ll. It is not unfair or absurd to shift the burden of proof and costs of \nproving lack of control to an accused. In Wyssen , Finlayson  J.A., concurring in the \nresult only, raised fairness concerns that were reprised by the City in this appeal. These \nconcerns  were rightly rejected as unpersuasive by the majority in Wyssen  and the \nunanimous Court of Appeal in the case at bar. They simply do not support reading a \ncontrol requirement into provisions without one, especially when control plays a role \nat the due dil igence stage.  \n2023 SCC 28 (CanLII)\n\n--- Page 51 ---\n \n [51] In this appeal, no one argues that ss.  1(1) or 25(1)(c) are unconstitutional. \nWhile in Wyssen Finlayson  J.A. also",
    "token_count": 1000,
    "start_token": 20700,
    "end_token": 21700,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 24,
    "source_file": "2023scc28.txt",
    "text": " Court of Appeal in the case at bar. They simply do not support reading a \ncontrol requirement into provisions without one, especially when control plays a role \nat the due dil igence stage.  \n2023 SCC 28 (CanLII)\n\n--- Page 51 ---\n \n [51] In this appeal, no one argues that ss.  1(1) or 25(1)(c) are unconstitutional. \nWhile in Wyssen Finlayson  J.A. also suggested that the definition of “employer” was \noverbroad (at pp.  202-3), the matter was later argued and rejected in R. v. Gra nt Forest \nProducts Inc . (2002), 98 C.R.R. (2d) 149 (Ont. C.J.), at para.  55, rev’d on other grounds \n2003 CarswellOnt 6071 (WL) (S.C.J.). The court found that overbreadth concerns are \nof limited concern given that the Act is public welfare legislation that enacts strict \nliability regulatory offences, not criminal offences, and given that the employer duties \nare subject to a due diligence defence (paras.  53 and 55). As Bélanger  J. observed:  \nWithout doubt, the breadth of the legislation is onerous and may hav e \nnegative consequences relating to cost and economic feasibility of any \nparticular endeavour or enterprise, but it does not unfairly deprive \nowner/contractors of the means to advance successful defences when they \nhave attended diligently to their responsi bilities. [para.  57] \nThis observation answers the City’s submissions in this appeal. Existing jurisprudence \non the interpretation of the Act and the nature of strict liability offences contain all that \nis needed to affirm the conclusion of the Court of Appeal below. It is unnecessary to \nrevisit or reverse that jurisprudence here.  \n[52] Additionally, though my colleagues Rowe and O’Bonsawin  JJ. point to \nhypotheticals that they say demonstrate the absurdity of leaving control to due diligence \n(at paras.  137-39), a close examination of the statutory scheme dispels any such \nabsurdity. First, the hypothetical concerning the caterer fails to appreciate that an \nemployer’s duties under s.  25(1)(c) are limited to the workplace . A “workplace” is a \ndistinct definition fro m a construction “project” (s.  1(1)) and refers to a place where a \n2023 SCC 28 (CanLII)\n\n--- Page 52 ---\n \n worker is or can reasonably be expected to be carrying out their employment duties at \nthe time an incident occurs ( Blue Mountain Resorts Ltd. v. Ontario (Ministry of \nLabour) , 2013 ONCA 75, 114 O.R. (3d) 321, at para.  57). It seems unlikely that the \ncaterer’s workplace would span the entirety of the construction project, such that the \ncaterer would necessarily  be charged and found liable in the event of a breach.  \n[53] Second, the remaining hypoth eticals fail to appreciate that the employer is \nan employer by virtue of contracting for the services of the constructor who is present \nat the project. When this layer of the “employer” definition is kept in mind, the \nabsurdity of the hypotheticals falls a way. The employer’s potential liability is not tied \nto the simple act of sending an inspector to a project. Rather, they are already possibly \nliable because they are the employer who has deployed a constructor on the project. \nIndeed, the employer is likely  well served by sending an inspector to the project, since, \nas discussed below, this may well demonstrate that they were duly diligent in hiring \nand supervising the constructor. As a result, the concern that the risk of liability would \ndissuade the hypothe tical employer from sending inspectors is unwarranted.  \n(2) How an Employer’s Control Informs the Due Diligence Defence  \n[54] Though I am remitting the issue of the City’s due diligence to the provincial \noffences appeal court, I turn now to how courts may assess th is defence and how an \nemployer’s level of control informs the analysis.   \n2023 SCC 28 (CanLII)\n\n--- Page 53 ---\n \n [55] That the employer’s level of control over workers or the workplace is \nrelevant to the due diligence defence  is well recognized in existing authorities. As set \nout in R. v. Gonder  (1981), 62 C.C.C. (2d) 326 (Y. Terr. Ct.), at pp.  332-33: \nReasonable",
    "token_count": 1000,
    "start_token": 21600,
    "end_token": 22600,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 25,
    "source_file": "2023scc28.txt",
    "text": " control informs the analysis.   \n2023 SCC 28 (CanLII)\n\n--- Page 53 ---\n \n [55] That the employer’s level of control over workers or the workplace is \nrelevant to the due diligence defence  is well recognized in existing authorities. As set \nout in R. v. Gonder  (1981), 62 C.C.C. (2d) 326 (Y. Terr. Ct.), at pp.  332-33: \nReasonable care implies a scale of caring. The reasonableness of the \ncare is inextricably related to the special circumstances of each case. A \nvariable standard of care is necessary to ensure the requis ite flexibility to \nraise or lower the requirements of care in accord with the special \ncircumstances of each factual setting. The degree of care warranted in each \ncase is principally governed by the following circumstances:  \n \n(a) Gravity of potential harm.  \n(b) Alternatives available to the accused.  \n(c) Likelihood of harm.  \n(d) Degree of knowledge or skill expected of the accused.  \n(e) Extent [to which] underlying causes of the offence are beyond the \ncontrol of the accused.  \nGonder  has been followed by courts across Canada when applying the due diligence \ndefence under occupational health and safety legislation (see, e.g., London Excavators , \nat p. 37; R. v. Inco Ltd. , [2001] O.J. No.  4938 (QL), 2001 CarswellOnt 10933 (WL) \n(C.J.), at para.  39 (QL); Ontario (Ministry of Labour) v. Linamar Holdings Inc. , 2012 \nONCJ 295, at para.  112 (CanLII); Ontario (Ministry of Labour) v. Wal -Mart Canada \nCorp. , 2016 ONCJ 267, 32 C.C.E.L. (4th) 313, at para.  123; R. v. Imperial Electric \nLtd., 1998 Carswe llBC 4085 (WL) (Prov. Ct.), at para.  37; R. v. Amherst Fabricators \nLtd., [2003] N.S.J. No.  280 (QL) (Prov. Ct.), at para.  9; R. v. XI Technologies Inc. , 2011 \nABPC 313, at para.  201 (CanLII)).  \n[56] I agree that the “[e]xtent [to which] underlying causes of the o ffence are \nbeyond the control of the accused” is a relevant factor. The fact -finder should assess, \n2023 SCC 28 (CanLII)\n\n--- Page 54 ---\n \n either in absolute or comparative terms, whether an employer had control over the \nworker and the workplace. Control is also an implicit consideration in asse ssing what \nalternatives were available to the accused ( J. Stoller , at paras.  22-24; Campbell , at \npara.  68; J. Swaigen and S.  McRory, Regulatory Offences In Canada: Liability and \nDefences  (2nd ed. 2018), at pp.  123-28). Indeed, “[r]easonableness of care is often best \nmeasured by comparing what was done against what could have been done ” (Gonder , \nat p. 333 (emphasis added)). “What could have been done” is necessarily limited to \nsteps or measures that are within the workplace actor’s control and thus capable o f \nbeing carried out.  \n[57] In the construction context, it may be open to a judge to find that the owner \ntook every reasonable precaution because the owner decided to delegate control of the \nproject and responsibility for workplace safety to a more experienced constructor. \nRelevant considerations might include whether the owner pre -screened the constructor \nbefore hiring the constructor to ascertain, for example, whether the constructor has \nsuperior expertise, a track record free of prior convictions for breach o f the Act, and \nthe capacity to ensure compliance with the Act and the Regulation ( Grant Forest \nProducts , at para.  54; D.  McKechnie, “Occupational Health and Safety in Construction \nLaw”, in L.  Ricchetti and T.  J. Murphy, Construction Law in Canada  (2010), 2 09, at \npp. 219-20). An owner may argue that its relative inexperience with workplace safety \nwas why it chose to delegate control over a project to a more sophisticated constructor.  \n2023 SCC 28 (CanLII)\n\n--- Page 55 ---\n \n [",
    "token_count": 1000,
    "start_token": 22500,
    "end_token": 23500,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 26,
    "source_file": "2023scc28.txt",
    "text": "Kechnie, “Occupational Health and Safety in Construction \nLaw”, in L.  Ricchetti and T.  J. Murphy, Construction Law in Canada  (2010), 2 09, at \npp. 219-20). An owner may argue that its relative inexperience with workplace safety \nwas why it chose to delegate control over a project to a more sophisticated constructor.  \n2023 SCC 28 (CanLII)\n\n--- Page 55 ---\n \n [58] Another consideration might be whether after executing the contract the \nowner informed the constructor of any hazards at the workplace and monitored the \nquality of the constructor’s work (indeed, the trial judge placed weight on the fact that \nthe City supervised Interpaving’s work) (McKechnie, at pp.  219-20). As well, a court \ncould find that a municipality, such as the City, has the ability to require its contractors \nto uphold health and safety requirements on a project, since it “is in a position to control \nthose whom it hires  . . . and to supervise the activity, either through the provisions of \nthe contract or by municipal by -laws” ( Sault  Ste. Marie , at p.  1331).  \n[59] Once again, this guidance is not novel. Supervision and inspection have \nlong been seen as sensible steps to take when considering whether that person can avail \nthemselv es of the due diligence defence. Put simply, the Act does not “capture within \nits ambit owners and employers who have exercised due diligence in their choice and \nsupervision of contractors” ( Grant Forest Products , at para.  57). Hence, categorizing \nthe City  as an employer in breach of s.  25(1)(c) of the Act because it sent inspectors to \nthe worksite to monitor Interpaving’s work does not condemn the City for supervising \nInterpaving or otherwise discourage it from doing so. Those efforts may well assist the \nCity in establishing due diligence and escaping liability.  \n[60] In addition to control, the accused’s degree of knowledge, skill or \nexperience and the gravity and likelihood of harm (i.e., the “foreseeability of the \naccident”) are all relevant to whether the acc used took every precaution reasonable in \nthe circumstances ( R. v. Rio Algom Ltd.  (1988), 66 O.R. (2d) 674 (C.A.), at p.  682; R. \n2023 SCC 28 (CanLII)\n\n--- Page 56 ---\n \n v. Brampton Brick Ltd.  (2004), 189 O.A.C. 44, at para.  29). An accused’s relative \ninexperience might support a finding that the accident was unforeseeable, at least from \nits standpoint.  \nD. Summary  \n[61] In summary, a court must consider three questions where an owner who \ncontracts for the services of a constructor on a construction project is prosecuted for a \nbreach of s.  25(1)(c):  \n1. First, has the Ministry proven beyond a reasonable doubt that the \nAct applied to the accused because the accused was an employer \nunder s.  1(1) of the Act? An owner is an employer if it (i) \nemployed workers at a workplace where an alleged breach of \ns. 25(1)(c) occ urred; or (ii) contracted for the services of a worker \nat that workplace (including for the services of a constructor). The \nMinistry is not required to prove that the owner had control over \nthe workplace or the workers there.  \n \n2. Second, has the Ministry prov en beyond a reasonable doubt that \nthe accused breached s.  25(1)(c) of the Act? There is a breach of \ns. 25(1)(c) if the safety measures prescribed by the Regulation are \nnot carried out in the workplace to which the owner/employer is \nconnected by a contractu al relationship with employees or an \n2023 SCC 28 (CanLII)\n\n--- Page 57 ---\n \n independent contractor. Further, the Ministry is not required to \nprove that the owner had control over the workplace or the \nworkers there.  \n \n3. Third, if the Ministry proves the above, has the accused proven on \na balance of  probabilities that it should avoid liability because it \nexercised due diligence under s.  66(3)(b) of the Act? Relevant \nconsiderations may include, but are not limited to, (i) the \naccused’s degree of control over the workplace or the workers \nthere; (ii) wh ether the accused delegated control to the constructor \nin an effort",
    "token_count": 1000,
    "start_token": 23400,
    "end_token": 24400,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 27,
    "source_file": "2023scc28.txt",
    "text": " \n3. Third, if the Ministry proves the above, has the accused proven on \na balance of  probabilities that it should avoid liability because it \nexercised due diligence under s.  66(3)(b) of the Act? Relevant \nconsiderations may include, but are not limited to, (i) the \naccused’s degree of control over the workplace or the workers \nthere; (ii) wh ether the accused delegated control to the constructor \nin an effort to overcome its own lack of skill, knowledge or \nexpertise to complete the project in compliance with the \nRegulation; (iii) whether the accused took steps to evaluate the \nconstructor’s abil ity to ensure compliance with the Regulation \nbefore deciding to contract for its services; and (iv) whether the \naccused effectively monitored and supervised the constructor’s \nwork on the project to ensure that the prescriptions in the \nRegulation were carri ed out in the workplace.  \nIII. Conclusion  \n[62] I would dismiss the appeal. I affirm the decision of the Court of Appeal to \nremit the matter to the provincial offences appeal court for hearing before a different \n2023 SCC 28 (CanLII)\n\n--- Page 58 ---\n \n judge to consider the Ministry’s appeal of the City’s du e diligence defence with respect \nto counts 8 and 9 of the information.  \n The reasons of Karakatsanis, Rowe and O’Bonsawin JJ. were delivered by  \n  ROWE AND O’B ONSAWIN JJ. —  \nI. Overview  \n[63] The appellant, the Corporation of the City of Greater Sudbury (“City”), \ncontracted with Interpaving Limited (“Interpaving”) to repair a water main and repave \nthe affected streets. It also sent quality control inspectors to the construction project, \nwho raised safety concerns to Interpaving. Later, a pedestrian was killed at an \nintersection after several regulatory provisions aimed at protecting public safety were \nnot respected. The City was charged as both a constructor and an employer; it argued \nthat it did not satisfy either definition. On appeal, the only question is whether th e City \ncould be liable for breaching its duties as an employer.  \n[64] This appeal provides the Court with an opportunity to clarify the definition \nand the duties of an “employer” in Ontario’s Occupational Health and Safety Act , \nR.S.O. 1990, c.  O.1 (“Act”). While this Court is tasked with interpreting particular \nprovisions within the Act  (namely ss.  1(1) and 25(1)(c)) and its accompanying \nregulation, Construction Projects , O. Reg. 213/91 (“Regulation”) (namely ss.  65 and \n104(3)),  we must not lose si ght of the careful structure of the scheme as a whole. The \n2023 SCC 28 (CanLII)\n\n--- Page 59 ---\n \n Act and its accompanying Regulation constitute an integrated scheme which contains \nprotections for workers that are effective in practice and reflective  of the reality of \nmodern workplace dynamics.   \n[65] In the reasons that follow, we seek to further these aims by establishing the \nmeaning and scope of the definition and duties of employers in the construction \ncontext. In our view, a clear understanding of who  is an employer, and which regulatory \nmeasures  apply to them, is critical to preserving the integrity of the overall scheme. It \nis also critical to respecting the legislative purpose of promoting worker safety in \npractice — while guarding against absurd results and, in particular, unbridled \nministeria l discretion that would leave the scope of an employer’s responsibilities to be \nresolved ex post facto . \n[66] In light of the foregoing, we conclude that the definition of “employer” in \ns. 1(1) of the Act  encompasses the City’s relationship with its quality cont rol \ninspectors. As an employer of the quality control inspectors, the scope of the City’s \nduties under s.  25(1)(c) of the Act  must be examined. Properly interpreted, s.  25(1)(c) \nholds employers liable for breaching the regulatory measures which apply to th em. The \npresent appeal involves measures contained within the Regulation. Having considered \nthe text of the regulatory measures, the structure of the Regulation,  its relationship to \nthe division of roles within the Act,  and the purposes of the scheme as a whole, we \nconclude that where certain measures in the Regulation do not specify to whom they \napply, these measures apply to an employer when they relate  to the work that the \nemployer controlled and performed through their workers . As the courts below did n ot \n2023",
    "token_count": 1000,
    "start_token": 24300,
    "end_token": 25300,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 28,
    "source_file": "2023scc28.txt",
    "text": " measures contained within the Regulation. Having considered \nthe text of the regulatory measures, the structure of the Regulation,  its relationship to \nthe division of roles within the Act,  and the purposes of the scheme as a whole, we \nconclude that where certain measures in the Regulation do not specify to whom they \napply, these measures apply to an employer when they relate  to the work that the \nemployer controlled and performed through their workers . As the courts below did n ot \n2023 SCC 28 (CanLII)\n\n--- Page 60 ---\n \n properly analyze whether the breach was made out, we would remit the matter for \nreconsideration by the Ontario Court of Justice at the duties stage.  \nII. Facts  \n[67] The facts are not in dispute. In February  2015, the City entered into a \ncontract with Interpaving to undertake a construction project in downtown Greater \nSudbury. The contract stipulated that Interpaving would assume control over the entire \nproject, including the role of “constructor” under the Act as well as the responsibility \nof ensuring that the req uirements of the Act and the Regulation were met. In \nSeptember  2015, a pedestrian who was attempting to cross an intersection within the \nconstruction zone was fatally struck by a Caterpillar grader being driven in reverse by \nan Interpaving employee.  \n[68] The r espondent, the Ministry of the Attorney General (Ministry of Labour, \nImmigration, Training and Skills Development) (“Ministry”), charged Interpaving and \nthe City under the Act for failing to ensure that certain requirements of the Regulation \nhad been met. The City was charged as a “constructor” and an “employer” under the \nAct for breaches of ss.  65, 67(4), and 104(3) of the Regulation. Section  65 states that \n“[i]f work on a project may endanger a person using a public way, a sturdy fence of at \nleast 1.8 met ers in height shall be constructed between the public way and the \n[construction] project.” Section  67(4) provides that “[e]very employer shall develop in \nwriting and implement a traffic protection plan for the employers’ workers at a project \nif any of them  may be exposed to a hazard from vehicular traffic.” Finally, s.  104(3) \n2023 SCC 28 (CanLII)\n\n--- Page 61 ---\n \n states that vehicle, machine, and equipment operators “shall be assisted by signallers” \nif the operator’s view is obstructed or “[a] person could be endangered by the vehicle, \nmachine,  or equipment or by its load.”  \n[69] On appeal, the only charges in issue pertain to the City’s alleged status as \nan “employer” and its liability under s.  25(1)(c) of the Act  for the breach of ss.  65 and \n104(3) of the Regulation. At the Court of Appeal, the Ministry conceded that the trial \njudge had not made the necessary factual findings to determine guilt of the alleged \nbreach of s.  67(4) regarding the traffic protection plan.  \nIII. Judgments Below  \nA. Ontario Court of Justice  \n[70] The trial judge acquitted the City of al l charges by finding that the City was \nneither a “constructor” nor an “employer” within the meaning of the Act. Alternatively, \nif the City was an employer, she found that the City had established the due diligence \ndefence. On the issue of whether the City was liable as an employer, the trial judge \ndetermined that “the City did not have control of the conduct of the workplace to bring \nit within the obligations intended or created by the [Act]  for employers” (para. 87, \nreproduced in A.R., vol.  I, at p. 17). T he City did not supervise the construction work; \nnor was it directing the work. Rather, it contracted for the services of Interpaving, \nwhich had the relevant knowledge and resources to execute the work. Although the \nCity’s inspectors were at the constructi on project from time to time, the quality control \n2023 SCC 28 (CanLII)\n\n--- Page 62 ---\n \n inspectors were subject to the constructor’s requirements concerning health and safety. \nRather than being supervisors on the project, their role was limited to quality control \n— ensuring that work was perfo rmed in accordance with the contractual arrangements \nso that payments could be made. The trial judge observed that the “punitive sections of \nthe [Act]  are intended to make accountable those who do not comply with the \nprovisions of the [Act",
    "token_count": 1000,
    "start_token": 25200,
    "end_token": 26200,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 29,
    "source_file": "2023scc28.txt",
    "text": " (CanLII)\n\n--- Page 62 ---\n \n inspectors were subject to the constructor’s requirements concerning health and safety. \nRather than being supervisors on the project, their role was limited to quality control \n— ensuring that work was perfo rmed in accordance with the contractual arrangements \nso that payments could be made. The trial judge observed that the “punitive sections of \nthe [Act]  are intended to make accountable those who do not comply with the \nprovisions of the [Act]  and its Regulat ion in the ‘sphere of operation’” (para. 88). Thus, \nthe City’s involvement as an owner seeking to ensure quality control fell outside this \npurpose.  \nB. Ontario Superior Court of Justice, 2019 ONSC 3285, 88 M.P.L.R. (5th) 158  \n[71] The Ministry appealed the acquittals to the Ontario Superior Court of \nJustice. The provincial offences appeal court judge endorsed the reasoning of the trial \njudge and found no errors in her application of the facts to the definitions of \n“constructor” and “employer”. He therefore d ismissed the appeal and  agreed that the \nCity did not exercise control over the project site such that it became the constructor. \nAs to whether the City was an employer by virtue of having quality control inspectors \non the project,  the provincial offences a ppeal court judge noted that this was not \ncontemplated by the parties and that adopting the Ministry’s approach would \nsubstantially change the occupational health and safety liability regime governing \nconstruction projects in Ontario. He concluded that the  Ministry had not proven that \nthe City exercised significant control over workers on the site. Accordingly, the trial \njudge properly found that the City was not an employer on site under the Act.  \n2023 SCC 28 (CanLII)\n\n--- Page 63 ---\n \n C. Court of Appeal for Ontario, 2021 ONCA 252, 15 M.P.L.R. (6th ) 161  \n[72] The Ministry was granted leave to appeal by Brown  J.A. of the Court of \nAppeal for Ontario, but only with respect to the acquittals relating to the charges against \nthe City as an “employer” under the Act ( 2019 ONCA 854, 93 M.P.L.R. (5th)  179). \nGiven t hat municipalities often contract out work on construction projects to a third \nparty, Brown  J.A. was satisfied that whether a municipality is liable as an employer by \nreason of the degree of control it exercises raises a question of law of interest to the \npublic at large.  \n[73] The Court of Appeal allowed the Ministry’s appeal. It concluded that \nbecause the City employed quality control inspectors as workers at the project site \nwithin the meaning of “employer” in s.  1(1) of the Act, it was liable for violations o f \nthe Regulation unless it could establish a due diligence defence. The Court of Appeal \nrecognized that the definition of “employer” covered two relationships — first, that of \na person who employs a worker, and second, that of one who contracts for the ser vices \nof a worker — but that this appeal could be resolved according to the first relationship. \nAs a result, the Court of Appeal concluded that it was not necessary to address the \nelement of control — even though Brown  J.A. had granted leave on precisely t his issue. \nIt noted that although s.  1(3) of the Act prevents an owner from becoming a constructor \nby engaging a quality control inspector, it does not preclude an owner from becoming \nan employer. Finally, the Court of Appeal concluded that the appropriate  remedy was \nto set aside the provinc ial offences appeal court judge ’s decision and remit only the \n2023 SCC 28 (CanLII)\n\n--- Page 64 ---\n \n alleged breaches of ss.  65 and 104(3) of the Regulation to the Superior Court of Justice \nto hear the Ministry’s appeal of the City’s due diligence defence.  \nIV. Issues \n[74] The Court must decide whether the City is liable as an employer for the \nbreach of ss.  65 and 104(3) of the  Regulation. To do so, we must examine the following \ntwo issues:  \n(1) Is the City an “employer” under s.  1(1) of the Act?  \n(2) Do ss.  65 and 104(3) of the Regulation apply to the City as an \nemployer through the operation of s.  25(1)(c) of the Act?  \n[75] The courts below proceeded on the assumption that once a party meets the \ndefinition of",
    "token_count": 1000,
    "start_token": 26100,
    "end_token": 27100,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 30,
    "source_file": "2023scc28.txt",
    "text": " so, we must examine the following \ntwo issues:  \n(1) Is the City an “employer” under s.  1(1) of the Act?  \n(2) Do ss.  65 and 104(3) of the Regulation apply to the City as an \nemployer through the operation of s.  25(1)(c) of the Act?  \n[75] The courts below proceeded on the assumption that once a party meets the \ndefinition of “employer”, they are strictly liable for the breach of any regulatory \nprovis ion through the operation of s.  25(1)(c) and must rely on the due diligence \ndefence. With respect, such an approach conflates the definition of “employer” with \nthe determination of the scope of an employer’s duties. On a proper construction of the \nscheme, it is essential to examine both the definition of the workplace parties and the \nduties that actually apply to them. An offence cannot be founded on the breach of a \nduty that does not apply to the accused.  \nV. Analysis  \n2023 SCC 28 (CanLII)\n\n--- Page 65 ---\n \n [76] Before turning to the facts of this case, we provide a brief overview of the \nAct as a whole. Then, we turn to identifying and explaining the three distinct stages of \nan inquiry to establish a breach of an employer’s duties under the scheme. First, we \nexamine the definition of “employer” under s.  1(1), since the parties dispute whether \nthe City is an employer under the Act and if so, under which branch of the definition \n(“definition stage”). Second, we trace the scope of each employer’s duties under \ns. 25(1)(c) and the Regulation, as the applicabili ty of prescribed measures to an \nemployer is essential to determining the elements of an offence under the Act  (“duties \nstage”). Finally, we briefly consider the due diligence defence under s.  66(3) of the Act \nin order to contrast the nature of the inquiry at the offence and defence  stages (“due \ndiligence stage”). This analytical approach is consistent with the structure of the \nscheme and promotes a cohesive reading of the scheme’s enabling statute and \nregulations.  \n[77] The usual principles of statutory interpret ation, as set out in our \njurisprudence, offer guidance in this exercise: “.  . . the words of an Act are to be read \nin their entire context and in their grammatical and ordinary sense harmoniously with \nthe scheme of the Act, the object of the Act, and the i ntention of Parliament” \n(E. A. Driedger, Construction of Statutes  (2nd ed. 1983), at p.  87, cited in Rizzo & \nRizzo Shoes Ltd. (Re) , [1998] 1 S.C.R. 27, at para.  21). The Ontario Legislation Act, \n2006 , S.O. 2006, c. 21, Sch. F,  also applies to the Act:  \n64 (1) An Act shall be interpreted as being remedial and shall be given \nsuch fair, large and liberal interpretation as best ensures the attainment of \nits objects.  \n2023 SCC 28 (CanLII)\n\n--- Page 66 ---\n \n Before analyzing the definition and duties of employers, it is useful to begin with an \noverview o f the Act  in order to understand how it operates.  \nA. The Occupational Health and Safety Scheme  \n[78] During the 1970s, Ontario overhauled its workplace safety legislation \nfollowing the release of the Report of the Royal Commission on the Health and Safety \nof Worke rs in Mines  (1976), better known as the “Ham Report”. The result of this \nreform was to replace a patchwork of legislation, including The Industrial Safety Act, \n1964 , S.O. 1964, c.  45, with the Occupational Health and Safety Act , which came into \nforce in 1979 (S.  R. Ball, Canadian Employment Law  (loose -leaf), at §  25:1; R. v. \nCotton Felts Ltd.  (1982), 2 C.C.C. (3d) 287 (Ont.  C.A.), at p.  294).  \n[79] The Act  sets out the rights and duties of all parties in the workplace, as well \nas the procedures for dealing with workplace hazards and for enforcement of the law \nwhere compliance has not been achieved voluntarily by workplace parties. Since 1979, \nthe Act has been amended several times to evolve with changing standards of",
    "token_count": 1000,
    "start_token": 27000,
    "end_token": 28000,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 31,
    "source_file": "2023scc28.txt",
    "text": ".  (1982), 2 C.C.C. (3d) 287 (Ont.  C.A.), at p.  294).  \n[79] The Act  sets out the rights and duties of all parties in the workplace, as well \nas the procedures for dealing with workplace hazards and for enforcement of the law \nwhere compliance has not been achieved voluntarily by workplace parties. Since 1979, \nthe Act has been amended several times to evolve with changing standards of \nworkplace health a nd safety, while maintaining a system of internal responsibility in \nwhich all workplace parties are given responsibilities for health and safety (see Ontario \n(Minister of Labour)  v. Enbridge Gas Distribution Inc. , 2010 ONSC 2013 , 261 O.A.C. \n27, at para.  24). The internal responsibility system is designed to promote coordinated \nand collaborative relationships between the different workplace parties ( Ontario \n(Ministry of Labour) v. United Independent Operators Ltd. , 2011 ONCA 33 , 104 O.R. \n(3d) 1, at para.  55). Although the purpose of Ontario’s Act  is not expressly included \n2023 SCC 28 (CanLII)\n\n--- Page 67 ---\n \n within the statute, it has been judicially considered in the past. In Ontario (Ministry of \nLabour) v. Hamilton (City)  (2002), 58 O.R. (3d) 37 (C.A.) , Sharpe  J.A. explained that \nthe Act is “a  remedial public welfare statute intended to guarantee a minimum level of \nprotection for the health and safety of workers” ( para.  16). Similarly, in R. v. Timminco \nLtd. (2001), 54 O.R. (3d) 21 , Osborne  A.C.J.O. stated that “[t]he broad purpose of the \nstatu te is to maintain and promote a reasonable level of protection for the health and \nsafety of workers in and about their workplace” ( para.  22). This purpose has been \naffirmed recently by the Court of Appeal in R. v. Bondfield Construction Co. , 2022 \nONCA 302,  at para.  59 (CanLII) . \n[80] In terms of structure, the Act  sets out definitions in s.  1(1) and outlines the \napplication and administration of the Act in Parts  I and II, including the creation of \njoint health and safety committees (s.  9). In Part  III, the Act  enumerates the health and \nsafety duties of employers and other workplace parties. The Act  also addresses a variety \nof workplace matters in Parts  IV to VII, from the right to refuse or to stop work to the \nprohibition of employer reprisals. Finally, the Act  provides for a system of enforcement \naction and offences and penalties in Parts  VIII and IX. In particular, s.  66(1)(a) states \nthat it is an offence for a person to contravene a provision of the Act or the regulations. \nThe variety of duties contained withi n Ontario’s scheme reflects the “belt and braces” \napproach to ensuring occupational health and safety, wherein “the Act and Regulations \nuse more than one method to ensure workers are protected” ( Enbridge , at para.  24). \n[81] Particularly relevant to the present appeal are the definition of “employer” \nas set out in s.  1(1), the duty of employers in s.  25(1)(c) as well as the applicability of \n2023 SCC 28 (CanLII)\n\n--- Page 68 ---\n \n measures contained within the Regulation, and the function of the due diligence \ndefence in s.  66(3). The interpretation of t hese provisions coincides with the three \nstages of an inquiry to establish a breach of an employer’s duties. It also requires the \nconsideration of the definitions of “workplace” and “project” at s.  1(1), the duties of \nconstructors at s.  23(1) and the dutie s of owners at ss.  29 to 30.  \n[82] The definitions of various workplace parties, such as owners, employers, \nsupervisors, workers, and constructors, are set out at the beginning of the Act. The \ndefinition of “employer” in s. 1(1) reads as follows:  \n“employer” mean s a person who employs one or more workers or contracts \nfor the services of one or more workers and includes a contractor or \nsubcontractor who",
    "token_count": 1000,
    "start_token": 27900,
    "end_token": 28900,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 32,
    "source_file": "2023scc28.txt",
    "text": " ss.  29 to 30.  \n[82] The definitions of various workplace parties, such as owners, employers, \nsupervisors, workers, and constructors, are set out at the beginning of the Act. The \ndefinition of “employer” in s. 1(1) reads as follows:  \n“employer” mean s a person who employs one or more workers or contracts \nfor the services of one or more workers and includes a contractor or \nsubcontractor who performs work or supplies services and a contractor or \nsubcontractor who undertakes with an owner, constructor, c ontractor or \nsubcontractor to perform work or supply services;  \nA “worker” is mainly defined as “[a] person who performs work or supplies services \nfor monetary compensation.”  \n[83] In the construction industry, the Ontario legislature has defined the role of \n“constructor” as follows:  \n“constructor” means a person who undertakes a project for an owner and \nincludes an owner who undertakes all or part of a project by himself or by \nmore than one employer; [s. 1(1)]  \nThus, it is important to distinguish a general “workp lace” from a “project” that exists \nin the construction context. Whereas a “workplace” is broadly defined as “any land, \npremises, location or thing at, upon, in or near which a worker works”, a “project” is \n2023 SCC 28 (CanLII)\n\n--- Page 69 ---\n \n defined in regard to construction as “any work or undertaking, or any lands or \nappurtenances used in connection with construction” (s.  1(1)). Further, although it is \npossible for a single person to satisfy multiple workplace party definitions, the Ontario \nlegislature has stated that, in the construction i ndustry, “[a]n owner does not become a \nconstructor by virtue only of the fact that the owner has engaged an architect, engineer \nor other person solely to oversee quality control at a project” (s.  1(3)).  \n[84] Once a workplace party is found to satisfy the releva nt definition set out in \ns. 1(1) of the Act, it is necessary to then consider which duties actually applied to the \nparty at the time of the alleged offence. The Act  separately sets out the duties for each \nworkplace party. The primary duties of a constructo r are listed in s.  23(1) of the Act. \nThey are threefold:  \n23 (1) A constructor shall ensure, on a project undertaken by the \nconstructor that,  \n \n(a) the measures and procedures prescribed by this Act and the \nregulations are carried out on the project;  \n \n(b) every empl oyer and every worker performing work on the project \ncomplies with this Act and the regulations; and  \n \n(c) the health and safety of workers on the project is protected.  \n[85] As for employers, they are subject to a variety of duties in ss.  25 to 26 of \nthe Act. These duties include providing, maintaining in good condition and using \nequipment, materials and protective devices (s.  25(1)(a), (b) and (d)), appointing \ncompetent supervisors (s.  25(2)(c)), cooperating with health and safety committees \n(s. 25(2)(e)), and takin g every precaution reasonable in the circumstances for the \n2023 SCC 28 (CanLII)\n\n--- Page 70 ---\n \n protection of a worker (s.  25(2)(h)), to name but a few. In addition, employers have a \nduty to comply with the regulations:  \n25 (1) An employer shall ensure that,  \n \n. . . \n \n(c) the measures and procedures prescribed are carried out in the \nworkplace;  \n[86] The “measures and procedures prescribed” are found in various \nregulations. At issue in this case is the Regulation, which contains approximately 400 \nprovisions relating to all aspects of a constructio n project — from housekeeping, heat, \ndust control, and public way protection to platforms and ramps, stairs and landings, \nwelding and cutting, and excavations.  \n[87] Finally, the Act provides for a defence of due diligence applicable to a \nlimited number of duties at s.  66(3) (similar to the defence which exists at common \nlaw):  \n(3) On a prosecution for a failure to comply with,  \n \n(a) subsection 23(1);  \n \n(b) clause 25(1)(b), (c) or (d); or  \n \n(c) subsection 27(1),",
    "token_count": 1000,
    "start_token": 28800,
    "end_token": 29800,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 33,
    "source_file": "2023scc28.txt",
    "text": "ations.  \n[87] Finally, the Act provides for a defence of due diligence applicable to a \nlimited number of duties at s.  66(3) (similar to the defence which exists at common \nlaw):  \n(3) On a prosecution for a failure to comply with,  \n \n(a) subsection 23(1);  \n \n(b) clause 25(1)(b), (c) or (d); or  \n \n(c) subsection 27(1),  \n \nit shall be a defence for the accused to prove that every pre caution \nreasonable in the circumstances was taken.  \n2023 SCC 28 (CanLII)\n\n--- Page 71 ---\n \n Thus, on a prosecution for a failure to comply with ss.  23(1), 25(1)(b), (c) or (d) and \n27(1), the accused can defend against the charges by proving that they took “every \nprecaution reasonable in the circu mstances”.  \nB. The Definition of “Employer” Under Section  1(1) \n[88] The parties’ arguments have focused on the definition of “employer” under \ns. 1(1) of the Act. In the following sections, we address the interpretation of the \ndefinition. The definition of “employer ” in s.  1(1) covers two broad relationships. On \nthe first branch, a person satisfies the definition of “employer” where they employ one \nor more workers. On the second branch, a person is an employer where they contract \nfor the services of one or more worke rs (R. v. Wyssen  (1992), 10 O.R. (3d) 193 (C.A.), \nat p. 196). \n[89] The Court of Appeal concluded that it did not need to examine the second \nbranch of the definition (at para.  15), because it determined that the City was the \nemployer of the quality control inspe ctors under the first branch. With respect, we \nbelieve that both branches of the definition warrant discussion. The fact that a party is \nan employer does not mean that they are an employer to all workers at a workplace or \nproject, which may affect the scop e of their responsibilities.  Indeed, when we apply the \nAct to the present appeal based on our analytical approach, we agree with the Court of \nAppeal that the City is the employer of its inspectors under the first branch of the \ndefinition of “employer”. How ever, the City is not the employer of the workers hired \nor contracted for by Interpaving  under the second branch of the employer definition. \n2023 SCC 28 (CanLII)\n\n--- Page 72 ---\n \n The City’s relationship with Interpaving reflects an owner -constructor relationship, not \nan employer -worker relatio nship.  \n(1) The First Branch Is Focused on Traditional Employment \nRelationships  \n[90] The first branch of the definition is satisfied if a person “employs one or \nmore workers” (s.  1(1)). It focuses on the employment contract ( Wyssen , at p. 197) and \nreflects the tradi tional conception of a direct employer -employee relationship \n(D. McKechnie, “Occupational Health and Safety in Construction Law”, in \nL. Ricchetti and T.  J. Murphy, Construction Law in Canada  (2010 ), 209, at p. 211). In \nthis way, its scope is relatively str aightforward: as soon as a person hires a worker \nthrough a contract of employment, they meet the definition of “employer” under the \nfirst branch of the definition.  \n[91] In support of its appeal, the City directed this Court to the decisions of \nOntario (Ministry  of Labour) v. Nor Eng Construction & Engineering Inc. , 2008 ONCJ \n296, and R. v. EFCO Canada Co. , 2010 ONCJ 421 . In Nor Eng , rehabilitation work \nwas being performed on a bridge when the south end of the overpass collapsed. One of \nthe charges alleged that an engineering firm failed, as an employer, to ensure that the \ntemporary support structure that it undertook to design was able to support or resist all \nloads and forces to which it was likely to be subjected (s.  31(1)(a) of the Regulation; \ns. 25(1)(c) of the Act). Renaud  J. admitted that he struggled to “fit the defendant within \nthis section’s definition of ‘employer’” ( para.  88 (CanLII) ), because the engineering \nfirm had no ability to ensure that the",
    "token_count": 1000,
    "start_token": 29700,
    "end_token": 30700,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 34,
    "source_file": "2023scc28.txt",
    "text": "ook to design was able to support or resist all \nloads and forces to which it was likely to be subjected (s.  31(1)(a) of the Regulation; \ns. 25(1)(c) of the Act). Renaud  J. admitted that he struggled to “fit the defendant within \nthis section’s definition of ‘employer’” ( para.  88 (CanLII) ), because the engineering \nfirm had no ability to ensure that the measures were carried out. He noted that the \n2023 SCC 28 (CanLII)\n\n--- Page 73 ---\n \n engineerin g firm was “ removed geographically, temporally, contractually from the \nsituation at the workplace” and “did not have sufficient or any control on the conduct \nof the workplace to bring it within the obligations intended and created by this \nlegislation” ( paras. 88-89). \n[92] Similarly, in EFCO , a bridge under construction collapsed, injuring several \nworkers. Alongside other counts, EFCO Canada Co. was charged with failing, as an \nemployer, to ensure that its falsework — the supports and bracing used to support the \nstructure — was capable of withstanding all loads (s.  87(1) of the Regulation; \ns. 25(1)(c) of the Act). Rabley  J. determined that EFCO Canada Co. was not an \nemployer within the meaning of the Act at the time of the building of the bridge. He \nechoed Renaud  J.’s analysis in Nor Eng , having found that EFCO Canada Co. had “no \ncontrol over the jobsite” and that its falsework had been installed by other parties. \nTherefore, it was not an “ employer in the ‘sphere of operation’ but a supplier of \nfalsework” (para.  60 (QL, WL)).  \n[93] In both cases, the judges suggested that a party is not an “employer” if they \nhave no control over the workplace in question. We decline to adopt such an approach, \nsince it conflates the definition of “employer” with the scope of an employer’s d uties \nunder s.  25(1)(c). A narrow definition of “employer” would remove a party from all of \ntheir obligations under the Act, not merely those related to the workplace. As \nhighlighted by the Workers’ Compensation Board of British Columbia, this includes a \nvariety of important duties, such as the provisions which prohibit employers from \ntaking reprisals against employees (s.  50 of the Act; I.F., at para.  14). It could not have \n2023 SCC 28 (CanLII)\n\n--- Page 74 ---\n \n been the legislature’s intention for a party to be freed from all of their responsi bilities \ntowards individuals that they directly hired merely because they did not control the \nworkplace.  \n[94] Moreover, the text of the definition of “employer” is expressly focused on \na party’s relationship to workers . It is inappropriate to narrow it by consi dering that \nparty’s relationship to a workplace . The latter relationship only becomes relevant at the \nstage of determining an employer’s duties. Accordingly, the first branch of the \ndefinition is satisfied where a traditional employment relationship exists . \n(2) The Second Branch Extends the Definition of “Employer”  \n[95] The second branch of the definition involves a person who “contracts for \nthe services of one or more workers” (s.  1(1)). This reflects the “extended definition” \nof an employer adopted by the legislature (McKechnie, at p.  211). A party is an \nemployer not only if they directly employ one or more workers, but if they enter into a \ncontract for the services of workers ( Wyssen , at p. 196; Ontario (Ministry of Labour) \nv. Pioneer Construction Inc.  (2006), 79 O.R. (3d) 641 (C.A.) , at para.  19). In Wyssen , \nBlair  J.A. concluded that when a party engages an independent contractor to perform \ntasks, they become an employer under the second branch of the definition (pp.  197-98). \n[96] The wisdom contained in Wyssen  is about ensuring that an employer cannot \nescape liability for the safety of their workplace due to a contractual label, and this \nwisdom endures today. The second branch prevents parties from removing themselves \nfrom the application of the Act where they subcontract out work, rather than directly \n2023 SCC 28 (CanLII)\n\n--- Page 75 ---\n \n hiring workers through an employment",
    "token_count": 1000,
    "start_token": 30600,
    "end_token": 31600,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 35,
    "source_file": "2023scc28.txt",
    "text": " the definition (pp.  197-98). \n[96] The wisdom contained in Wyssen  is about ensuring that an employer cannot \nescape liability for the safety of their workplace due to a contractual label, and this \nwisdom endures today. The second branch prevents parties from removing themselves \nfrom the application of the Act where they subcontract out work, rather than directly \n2023 SCC 28 (CanLII)\n\n--- Page 75 ---\n \n hiring workers through an employment contract ( Wyssen ; Pioneer Construction , at \npara.  19; R. v. Sunderland Co -Operative , [1993] O.J. No.  4429 (QL), 1993 \nCarswellOnt 5741 (WL) (C.J. (Prov. Div.)); Tembec Forest Pro ducts (1990) Inc. (Re) , \n[1994] O.O.H.S.A.D. No.  3 (QL)). In this way, it ensures that the substance of the \nemployer -worker relationship is not determined by the manner in which it is described \nin the contract. This is particularly important in the construc tion field, as subcontracting \nand labour leasing arrangements have been a long -term feature of the industry \n(R. Johnstone, C.  Mayhew and M.  Quinlan, “Outsourcing Risk? The Regulation of \nOccupational Health and Safety Where Subcontractors Are Employed” (200 1), 22 \nComp. Lab. L. & Pol’y J.  351, at p.  391).  \n[97] In the present appeal, we need not comprehensively examine the range of \ncontractual relationships which would fall under the second branch, particularly on \ncomplex construction projects. Nor is it necessary to determine whether a degree of \nauthority over a worker is required to be an employer (see, e.g., Abarquez v. Ontario , \n2009 ONCA 374 , 95 O.R. (3d) 414, at para.  33; Pioneer Construction , at para.  19). \nAlthough the second branch is extensive, we acknowledge that it does not capture every \ncontractual relationship indirectly linking an employer to a worker.  \n[98] However, the present appeal raises the following question: Does an owner \nwho retains a construct or to undertake a project automatically become an employer of \nworkers hired or contracted for by that constructor? This question was not answered by \nWyssen ; indeed, the facts of Wyssen involved a contractor who subcontracted a \nwindow -cleaning job to an ind ependent contractor rather than directly hiring workers. \n2023 SCC 28 (CanLII)\n\n--- Page 76 ---\n \n Blair  J.A. was not required to interpret the distribution of duties among various \nworkplace parties nor did he consider the owner -constructor relationship. Contrary to \nour colleague Martin  J.’s appro ach, we would thus answer the question in the negative \n(paras.  18 and 22).  \n[99] The text of the second branch of the definition of “employer” refers to \n“contract[ing] for the services of  . . . workers”. When an owner contracts with a \nconstructor, they are not s eeking to subcontract out particular tasks to any independent \ncontractor instead of hiring workers directly through an employment contract; rather, \nthey are asking an entity to assume plenary oversight and authority to undertake the \nentire project. The own er is contracting for a constructor , a party separately defined in \ns. 1(1). Thus, the owner -constructor relationship is a specific contractual relationship \ncontemplated by the Act ( R. v. Grant Forest Products Inc.  (2002),  98 C.R.R. (2d) 149 \n(Ont. C.J.), at  para.  32). This relationship reflects the practical reality of the \nconstruction industry, where owners promote safety by transferring responsibility to \nconstructors with relevant expertise. That a constructor who “supplies services” may \nsatisfy a strictly  literal definition of “worker” under the Act  belies the nature of the \nconstructor as the entity overseeing  workers; it must also, in our view, be reconciled \nwith the legislature’s deliberate choice to carve out a distinct owner -constructor \nrelationship. C ontrary to the view expressed by our colleague Martin  J. (at para.  22), \nthis relationship does not generally fall within the second branch of the employer \ndefinition in s.  1(1) in keeping with a basic rule of interpretation — “implied exception” \n(specialia  generalibus non derogant ) — in which a specific statutory provision prevails \n202",
    "token_count": 1000,
    "start_token": 31500,
    "end_token": 32500,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 36,
    "source_file": "2023scc28.txt",
    "text": " the legislature’s deliberate choice to carve out a distinct owner -constructor \nrelationship. C ontrary to the view expressed by our colleague Martin  J. (at para.  22), \nthis relationship does not generally fall within the second branch of the employer \ndefinition in s.  1(1) in keeping with a basic rule of interpretation — “implied exception” \n(specialia  generalibus non derogant ) — in which a specific statutory provision prevails \n2023 SCC 28 (CanLII)\n\n--- Page 77 ---\n \n over a general statutory provision to the extent of any conflict (R.  Sullivan, Statutory \nInterpretation  (3rd ed. 2016), at pp. 327-28). \n[100]  This reading of the text of s.  1(1) is con firmed by the statutory context . The \nAct is specifically designed so that an owner can take a hands -off approach to \noverseeing the project relative to the constructor. A constructor “undertakes” the \nproject, which indicates that overall authority for the p roject, including the coordination \nof health and safety, falls to the constructor. Project owners have far fewer \nresponsibilities, even compared to owners of other workplaces. For example, while \nowners of other workplaces must ensure that prescribed facili ties are provided and \nmaintained and that the workplace complies with the regulations, these duties do not \napply to project owners (see ss.  29(1) and 30). This is because by contracting for a \nconstructor, the owner is empowered to surrender control so that  another workplace \nparty can assume responsibility for overall health and safety (McKechnie , at p.  214; \nC. A. Edwards and R.  J. Conlin, Employer Liability For Contractors Under The \nOntario Occupational Health and Safety Act (2nd ed. 2007) , at p.  59; Grant Forest \nProducts , at para.  32). \n[101]  In fact, if the owner sought to retain an active role in activities on the \nproject, they would run the risk of becoming the constructor themselves ( Imperial Oil \nLtd. v. Ontario (Ministry of Labour)  (1993), 10 C.O.H.S.C. 210 ( Ont.), at paras. 13 -\n17). The Act even sets out a limitation to ensure that an owner who sends persons to \noversee quality control does not thereby become a constructor on the project (s.  1(3)). \nOf course, an owner who employs persons to perform this task is  an employer to those \n2023 SCC 28 (CanLII)\n\n--- Page 78 ---\n \n workers. Yet the legislature felt the need to ensure that they did not thereby become a \nconstructor  by crafting a specific limitation. The Act is careful to ensure that the project \nowner can still oversee quality control, without bein g subjected to onerous duties \nrelating to the project.  \n[102]  However, treating an owner as automatically being an employer of the \nworkers hired or contracted for by the constructor under the second branch of the \nemployer definition would undermine the design of the scheme. It would mean that by \nvirtue of engaging a constructor to oversee a project, project owners would be assigned \nresponsibilities that would require them to play an active role across this project — a \nrole that the Act sought to avoid by enabling them to contract with a constructor in the \nfirst place. Unlike the duties of project owners, employers’ duties towards their workers \nare onerous. For example, they must provide information, instruction, and supervision \nto worker s (s. 25(2)(a)), assist and co -operate with a joint health and safety committee \n(s. 25(2)(e)), prepare a written occupational health and safety policy (s.  25(2)(j)), and \ntake an active role in preventing violence and harassment (ss.  32.0.1 to 32.0.8). \nNota bly, none of these strict duties are subject to the due diligence defence at s.  66(3). \nIt would defeat the structure of the scheme to treat the owner -constructor relationship \nas giving rise to an employer -worker relationship.  \n[103]  Finally, preserving the integr ity of the  owner -constructor relationship when \ninterpreting the second branch of the employer definition  is consistent with legislative \npurpose . To achieve the purpose of protecting worker safety, the legislature has defined \nthe various roles on the projec t and carefully structured the relationship between the \n2023 SCC 28 (CanLII)\n\n--- Page 79 ---\n \n owner and the constructor. Treating the owner -constructor",
    "token_count": 1000,
    "start_token": 32400,
    "end_token": 33400,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 37,
    "source_file": "2023scc28.txt",
    "text": " employer -worker relationship.  \n[103]  Finally, preserving the integr ity of the  owner -constructor relationship when \ninterpreting the second branch of the employer definition  is consistent with legislative \npurpose . To achieve the purpose of protecting worker safety, the legislature has defined \nthe various roles on the projec t and carefully structured the relationship between the \n2023 SCC 28 (CanLII)\n\n--- Page 79 ---\n \n owner and the constructor. Treating the owner -constructor relationship as an \nemployer -worker relationship detracts from the legislation’s effectiveness because it \nignores the practical differences bet ween these relationships and undercuts the distinct \nmechanisms by which they promote worker safety. Thus, to protect worker safety, we \nseek to give faithful effect to the assignment of roles and responsibilities chosen by the \nlegislature.  \n[104]  In sum, the secon d branch of the employer definition is broad, but it does \nnot turn an owner into the employer of workers hired or contracted for by a constructor. \nHaving examined both branches of the definition of “employer” under s.  1(1), we now \nturn to the scope of an e mployer’s duties. At issue is the interpretation of s.  25(1)(c) \nand the accompanying Regulation.  \nC. The Duties of an Employer Under Section  25(1)(c) and the Regulation  \n[105]  The Ministry argues that as soon as a worker is present at the workplace, \ntheir employer is  liable for complying with all regulatory measures through s.  25(1)(c). \nThis appears to have been the unstated assumption of the courts below (Ont. C.J. \nreasons, at para.  74; Ont. C.A. reasons (2021), at para.  6). What this interpretation \neffectively means  is that everyone  who employs anyone  is responsible for everything  \nthat anyone does. It would be absurd to interpret s.  25(1)(c) and the Regulation  as \nobligating every employer at a construction project to ensure compliance with all the \nmeasures contained within the Regulation. This is inconsistent with the text of the \nRegulation itself, the structure of the Act, and the statutory purpose of protecting \n2023 SCC 28 (CanLII)\n\n--- Page 80 ---\n \n workers. It places obligations on employers which are specifically directed at other \nworkplace parties and  ignores the carefully legislated distinction between a “project” \nand a “workplace” as borne out by the definitions of these terms pursuant to s.  1(1) of \nthe Act.  \n[106]  In the sections below, we first explain that s.  25(1)(c) requires employers \nto comply with th e measures which apply to them. Second, we set out the requisite link \nfor particular measures in the Regulation  to apply to an employer where they do not \notherwise specify to whom they apply. In doing so, we do not import a “control \nrequirement” into s.  25(1)(c), as our colleague Martin  J. suggests (para. 35). Our \ninterpretation of s.  25(1)(c) merely recognizes that this duty does not require employers \nto ensure compliance with measures that do not actually apply to them. We pay close \nattention to the text,  context and purpose of the Regulation  and recognize that where a \nmeasure is silent as to whom is supposed to ensure its compliance, there must be a \nfunctional relationship between the measure and the employer: the measure must relate \nto the work that the employer controlled and performed through their workers.  \n(1) Section  25(1)(c) Requires Employers to Comply With Measures That \nApply to Them  \n[107]  Section  25(1)(c) is part of a list of duties which uses the words “shall ensure \nthat” at the beginning of the enumeratio n. Each clause then completes the sentence. \nThe use of the verb “ensure”, followed by the duties to be accomplished, emphasizes \nthe principle of strict liability imposed upon employers ( Legislature of Ontario \nDebates: Official Report (Hansard) — Daily Edit ion, No.  151, 2nd Sess., 31st Parl., \n2023 SCC 28 (CanLII)\n\n--- Page 81 ---\n \n December 14, 1978, at p.  6187 ; see also Timminco , at para. 26). Among these duties, \nthe employer shall ensure that “the measures and procedures prescribed are carried out \nin the workplace” (s.  25(1)(c)).  \n[108]  Section",
    "token_count": 1000,
    "start_token": 33300,
    "end_token": 34300,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 38,
    "source_file": "2023scc28.txt",
    "text": " 151, 2nd Sess., 31st Parl., \n2023 SCC 28 (CanLII)\n\n--- Page 81 ---\n \n December 14, 1978, at p.  6187 ; see also Timminco , at para. 26). Among these duties, \nthe employer shall ensure that “the measures and procedures prescribed are carried out \nin the workplace” (s.  25(1)(c)).  \n[108]  Section  25(1)(c ) imposes a duty to comply with the prescribed measures \nand procedures. Thus, it is by virtue of s.  25(1)(c) that the provisions in the Regulation \nwhich apply to the employer become binding on it. The word prescribed  is defined as \n“prescribed by a regulati on made under this Act” (s.  1(1)). In this sense, s.  25(1)(c) \nreflects the Act’s secondary function as enabling legislation by imposing a duty to \ncomply with other provisions contained in industry -specific regulations ( R. v. \nCampbell , [2004] O.J. No.  129 ( QL),  2004 CarswellOnt 116 (WL)  (C.J.), at paras.  32-\n34, aff’d (2006), 140 C.R.R. (2d) 143  (S.C.J.)).  \n[109]  Although not expressly stated, it is evident that the phrase “measures and \nprocedures prescribed” cannot refer to all measures contained in the Regulation, since \nmany provisions expressly refer only to parties such as constructors or workers. For \nexample, ss. 21(2) and 67(4) of the Regulation explicitly note that “[a] worker’s \nemployer  shall require the worker to comply with subsection  (1) [regarding protective \nclothing, equipment and devices]” and that “[e]very employer shall develop in writing \nand impleme nt a traffic protection plan for the employers’ workers ”, respectively. It \nwould be absurd for an excavating company which had safely equipped its own workers \nto be liable if a welding company on the other side of the project was not providing its \nworkers with gloves, or for one employer to bear responsibility for ensuring that every \nother employer had made their own traffic plans. Many regulatory provisions specify \n2023 SCC 28 (CanLII)\n\n--- Page 82 ---\n \n to whom the provision applies, and s.  25(1)(c) should be read consistently to coincide \nwith this pattern of drafting (R. Sullivan, The Construction of Statutes  (7th ed. 2022), \nat § 8.04[3] ). The legislature clearly did not intend to require an employer to “ensure” \ncompliance with obligations directed only at other workplace parties.  \n[110]  The simple co rollary is that s.  25(1)(c) requires an employer to comply \nwith the measures that actually apply to it. This may seem evident, but it must be stated, \nbecause the result of the Ministry’s interpretation of the Act  is, effectively, to make no \ndistinction bet ween the measures in the Regulation that apply to a particular employer \nand those that do not. We now turn to the Regulation, since, in light of the foregoing, \nit is important to determine when a particular regulatory measure applies to an \nemployer.  \n(2) The Re gulation  Applies to an Employer’s Work Where There Is a \nRelationship Between the Measure and the Employer  \n(a) The Text of the Regulation  \n[111]  In the construction context, hundreds of measures are contained within the \nextensive Regulation. Since s.  25(1)(c) makes an  employer liable for not ensuring \ncompliance with the measures that apply to them, it is essential to determine which \nmeasures in the Regulation  are applicable, bearing in mind the employer’s relationship \nto their workers.  \n2023 SCC 28 (CanLII)\n\n--- Page 83 ---\n \n [112]  Some regulatory measures indicate  their subject expressly. For example, \ns. 140(1) sets out requirements applicable to an “employer who uses a suspended work \nplatform”. Similarly, s.  21 indicates that a worker must wear protective clothing and \nthat the “worker’s employer” is responsible fo r requiring the worker to comply. For \nthese measures, the link required for them to apply is clear, and no further analysis is \nrequired.  \n[113]  However, the majority of measures do not indicate who is responsible for \nthem. Instead, they are written in the form of  a safety measure that shall be  \nimplemented",
    "token_count": 1000,
    "start_token": 34200,
    "end_token": 35200,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 39,
    "source_file": "2023scc28.txt",
    "text": " work \nplatform”. Similarly, s.  21 indicates that a worker must wear protective clothing and \nthat the “worker’s employer” is responsible fo r requiring the worker to comply. For \nthese measures, the link required for them to apply is clear, and no further analysis is \nrequired.  \n[113]  However, the majority of measures do not indicate who is responsible for \nthem. Instead, they are written in the form of  a safety measure that shall be  \nimplemented , without specifying who must implement the measure. The measures at \nissue in the present case belong to that category:  \n65. If work on a project may endanger a person using a public way, a sturdy \nfence at least 1. 8 metres in height shall be constructed  between the public \nway and the project.  \n \n104. . . . \n \n(3) Operators of vehicles, machines and equipment shall be assisted  by \nsignallers if either of the following applies:  \n \n1. The operator’s view of the intended path of travel is obstructed.  \n \n2. A person could be endangered by the vehicle, machine or \nequipment or by its load.  \n[114]  At this juncture, the following problem arises: s.  25(1)(c) imposes a duty \non the employer to carry out the measures which apply to them; however, the text in \nmany of the measures contained in the Regulation  is ambiguous regarding to whom \nthey apply.  For example, at first glance, ss.  65 and 104(3) might appear silent on the \n2023 SCC 28 (CanLII)\n\n--- Page 84 ---\n \n link required between the measure and the employer’s work in order for them to ap ply \nto an employer under s.  25(1)(c). However, when reading the Regulation in light of the \ncontext and purpose of the overall scheme, this problem subsides. Indeed,  reading a \nlegislative provision in context means that the surrounding provisions and any ot her \nrelevant provisions must be considered ( United Independent Operators , at para.  57). \n[115]  Put simply, a measure contained in the Regulation  applies to an employer \nwhere it relates to the work that the employer controlled and performed through their \nworkers. Otherwise, employers would have no ability to ensure compliance with that \nmeasure nor would the measure bear any relation to their workers’ tasks. The structure \nof the Regulation, the division of roles in the construction context, the relationship with \nother employer duties, the purpose of protecting workers, and the presumption against \nabsurdity  call for such an approach.  \n(b) The Structure of the Regulation and the Act  \n[116]  The Regulation  is organized under headings tied to particular work \nactivities. For example, divisions of the Regulation include “Scaffolds and Work \nPlatforms” (ss.  126 to 136.0.1), “Roofing” (ss.  207 to 210) and “Tunnel Equipment” \n(ss. 309 to 316), or, in the examples above, “Public Way Protection” and “Equipment, \nGeneral”, respectively. This div ision categorizes the hundreds of measures according \nto the activities and material involved in a construction project. The subject matter of \nindividual measures also reflects a careful consideration of the situations in which a \nsafety hazard would arise a nd imposes safety measures accordingly in order to promote \n2023 SCC 28 (CanLII)\n\n--- Page 85 ---\n \n worker safety in practice . In most cases, an employer’s work will only be related to \nsome of these measures, in contrast to the constructor, who “undertakes” the project as \na whole (s.  1(1) of the Act) and ensures that “the health and safety of workers on the \nproject is protected” (s.  23(1)(c) of the Act). In the examples above, not all aspects of \na project involve work near a public way; however, where any number of employers \ncontrol work that is p erformed by their workers near a public way, they share the \nresponsibility of ensuring that a fence is constructed. Similarly, on a given project, not \nall employers are completing work that requires them to use vehicles, machines and \nequipment, but all of those employers who are entrusted with such work are caught by \ns. 104(3) of the Regulation. The formulation of the Regulation  reflects the practical \nrealities of work on a project and how to protect worker safety on the ground. This \nstructure suggests that  the measures contained in the Regulation  apply to those \nemployers whose work is actually related to their subject matter.  \n[117]  This understanding  is",
    "token_count": 1000,
    "start_token": 35100,
    "end_token": 36100,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 40,
    "source_file": "2023scc28.txt",
    "text": " to use vehicles, machines and \nequipment, but all of those employers who are entrusted with such work are caught by \ns. 104(3) of the Regulation. The formulation of the Regulation  reflects the practical \nrealities of work on a project and how to protect worker safety on the ground. This \nstructure suggests that  the measures contained in the Regulation  apply to those \nemployers whose work is actually related to their subject matter.  \n[117]  This understanding  is not unique to Ontario. In Quebec, the corresponding \noccupational health and safety regulatory code reflects a similar pattern of drafting, and \na similar interpretation was reached by tribunals: when a measure is not addressed to a \nparticular workplace party, [ TRANSLATION ] “it must be regarded as being addressed to \nall persons present on a construction site who mig ht, in light of the usual nature of their \nactivities, commit the offence in question, on the basis of their functional relationship \nwith the subject matter of the provision” ( Commission de la santé et de la sécurité du \ntravail du Québec v. Acier AGF Inc. , 2001 CanLII 12761 (Que. Lab. Ct.), at para.  17, \nciting Commission de la santé et de la sécurité du travail v. Poudrier et Boulet Ltée , \n[1982] AZ -83147017 (Que. Lab. Ct.) ; see also B.  Cliche et al., Droit de la santé et de \n2023 SCC 28 (CanLII)\n\n--- Page 86 ---\n \n la sécurité au travail: La loi et la jurisprudence commentées  (3rd ed. 2018)). This \nfunctional approach reflects a proper understanding of regulatory drafting in the \nconstruction context: when a measure relates to work that one or more employers \ncontrolled and performed through their worke rs, those employers are each in a position \nto take steps to avoid violations and address any safety hazards.  \n[118]  The necessity of a relationship between a measure  and an employer has \nalso been recognized under the Act  in other contexts. For example,  in Blue Mo untain \nResorts Ltd. v. Ontario (Ministry of Labour) , 2013 ONCA 75 , 114 O.R. (3d) 321, the \nCourt of Appeal interpreted the reporting obligation under s.  51(1) of the Act, which \nrequired an employer to notify various parties where “a person is killed or crit ically \ninjured from any cause at a workplace”. Blair  J.A. recognized that a purely textual \nreading of the provision would have imposed a reporting obligation on an employer for \nincidents unrelated to the employer’s work. He adopted a functional approach ba sed on \na “reasonable nexus” to accurately interpret which employers would be liable for the \nreporting obligation and concluded that “ ‘[c]ontextually’ and ‘purposively’ speaking \n. . . s. 51(1) is not engaged unless there is some reasonable nexus  between the  hazard \ngiving rise to the injury and a realistic risk to worker safety” ( para.  49 (emphasis \nadded)). Wyssen and Blue Mountain Resorts must be read together. Wyssen  interpreted \nthe definition of “employer” in keeping with the legislature’s intention to sub ject \ndifferent types of employers to the Act  as a whole. Blue Mountain Resorts considered \nwhen the duty in s.  51(1) applied to a given employer on a functional basis, focusing \non that particular duty and thereby giving effect to the legislature’s intention . The same \ninterpretative approach flows from the Regulation  in this case.  \n2023 SCC 28 (CanLII)\n\n--- Page 87 ---\n \n (c) The Act’s Division of Roles in the Construction Context  \n[119]  As its title ( Construction Projects ) suggests, the Regulation  is designed for \nthe construction context. The Act has set out t he particular distribution of duties \nbetween parties on a construction project, which provides important context for \ninterpreting the applicability of the regulatory provisions. Indeed, establishing a \nrelationship between a measure and an employer is neces sary to respect the distinct \nspheres of operation of an employer and a constructor set out within the Act.  \n[120]  Construction projects are a unique type of workplace engaging a distinct \ndivision of roles. As previously stated, the constructor undertakes the proj ect and \ntherefore has a unique role as a backstop for worker safety by bearing overall \nresponsibility for the project and all workers ( Ontario (Ministry of Labour) v. Black & \nMcDonald Ltd. , 2011 ONCA 440 , 106 O.R. (3d)",
    "token_count": 1000,
    "start_token": 36000,
    "end_token": 37000,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 41,
    "source_file": "2023scc28.txt",
    "text": " set out within the Act.  \n[120]  Construction projects are a unique type of workplace engaging a distinct \ndivision of roles. As previously stated, the constructor undertakes the proj ect and \ntherefore has a unique role as a backstop for worker safety by bearing overall \nresponsibility for the project and all workers ( Ontario (Ministry of Labour) v. Black & \nMcDonald Ltd. , 2011 ONCA 440 , 106 O.R. (3d) 784, at para.  12; R. v. K.B. Home \nInsulation Ltd. , [2008] O.J. No.  6019 (QL), 2008 CarswellOnt 10891 (WL) (C.J.) , at \npara.  18; R. v. Bradsil 1967 Ltd. , [1994] O.J. No.  837 (QL), 1994 CarswellOnt 4450 \n(WL) (C.J. (Prov. Div.)), at para.  33). On a complex, multi -employer construction \nproject,  the Act vests the constructor with responsibility to coordinate  work across the \nentire project. As the Ministry itself recognized in its Constructor guideline , “[t]he \nintent of the [Act] is to have one person with overall authority for health and safety \nmatters on a project. This person is the constructor of the project” (February 11, 2022 \n(online) (emphasis deleted)). In comparison, the employer is entrusted with particular \nwork on the project; they make an essential contribution to worker safety by ensur ing \nthat their work complies with the applicable measures. Properly interpreted, employers \n2023 SCC 28 (CanLII)\n\n--- Page 88 ---\n \n have distinct but overlapping obligations, coordinated by the constructor responsible \nfor overseeing all employers.  \n[121]  The constructor is tasked with ensuring that all employers comply with \ntheir obligations:  \n23 (1) A constructor shall ensure, on a project undertaken by the \nconstructor that,  \n \n(a) the measures and procedures prescribed by this Act and the \nregulations are carried out on the project;  \n \n(b) every employer and every worker performing work on the project \ncomplies with this Act and the regulations ; and  \n \n(c) the health and safety of workers on the project is protected.  \n[122]  The constructor’s plenary oversight role is clearly set out in this provision; \nthey are specifically requir ed to ensure that every employer  complies with the Act and \nthe Regulation. Moreover, this duty applies across the entire “project”, thereby using \nconstruction -specific language in contrast to the general formulation of employers’ \nduties in the workplace un der s.  25. The wording of s.  23(1)(b) differs significantly \nfrom the duties set out in both s.  23(1)(a) and s.  25(1)(c), because it requires \nconstructors to ensure compliance with duties and regulatory measures that may only \napply to other workplace partie s. \n[123]  Section  25(1)(c) subjects employers to a duty to carry out the prescribed \nregulations that apply to them; there is no employer duty that corresponds to s.  23(1)(b). \nInterpreting particular measures within the Regulation as if they always  applied to all \nemployers, rather than to employers who have a relationship to the measure, would \n2023 SCC 28 (CanLII)\n\n--- Page 89 ---\n \n undermine the distinctions between s.  23(1)(b) and s.  25(1)(c). Such an interpretation \nof the Regulation  would make every employer responsible for everything under \ns. 25(1)(c ) and would effectively turn s.  25(1)(c) into a duty akin to s.  23(1)(b) despite \nits distinct wording. The measures prescribed in the Regulation  must be interpreted in \na way that is sensitive to the distinction between employers and constructors. This is \nachieved by recognizing that a measure applies to employers where a relationship exists \nbetween the measure and the employer’s work.  \n[124]  Moreover, it is worth remembering that an employer’s obligations extend \nbeyond s.  25(1)(c) and the regulatory measures that directly apply to them. The Act \nand the Regulation  cannot be interpreted using tunnel vision, because s.  25(1)(c) and \nthe associated regulatory measures  are only one of many mechanisms to protect worker \nsafety. Among other duties, s.  28(1)(d) obligates any  worker to “report",
    "token_count": 1000,
    "start_token": 36900,
    "end_token": 37900,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 42,
    "source_file": "2023scc28.txt",
    "text": " it is worth remembering that an employer’s obligations extend \nbeyond s.  25(1)(c) and the regulatory measures that directly apply to them. The Act \nand the Regulation  cannot be interpreted using tunnel vision, because s.  25(1)(c) and \nthe associated regulatory measures  are only one of many mechanisms to protect worker \nsafety. Among other duties, s.  28(1)(d) obligates any  worker to “report to his or her \nemployer or supervisor any contravention of this Act or the regulations or the existence \nof any hazard of which he or she knows”. An employer also has a duty to “take every \nprecaution reasonable in the circumstances for the  protection of a worker” under \ns. 25(2)(h). Thus, aside from safety hazards not mentioned within the Regulation, these \nprovisions may require an employer to take steps to address violations and hazards that \nwould not normally have fallen within s.  25(1)(c) , but which had been reported to them \nand which they could have brought to the attention of the employers who did have \ncontrol under s.  25(1)(c). Importantly, however, s.  25(2)(h) is an obligation of means ; \nit is the appropriate section under which to anal yze such situations, rather than through \na decontextualized and limitless interpretation of s.  25(1)(c).  \n2023 SCC 28 (CanLII)\n\n--- Page 90 ---\n \n [125]  Finally, we note that just because the definition of “employer” is broad, \nevery regulatory measure does not necessarily apply to everyone. As we explai ned, the \ndefinition of “employer” in s.  1(1) ensures that entities are subject to a variety of \nsubstantive and procedural duties under the Act — of which s.  25(1)(c) is only one. \nThese duties each serve distinct functions in advancing the objective of the statutory \nscheme. Accordingly, and in contrast to our colleague Martin  J.’s interpretation of the \nscheme (at para.  36), it does not follow that each regulatory measure is equally broad \nand must apply to all employers simply because the definition of “emplo yer” is \nexpansive; the result in Blue Mountain Resorts supports this view. Rather, duties must \nbe interpreted in their proper context in order to further the legislature’s objectives in \npractice. Our functional and contextual interpretation of s.  25(1)(c) and the Regulation \nachieves this aim.  \n(d) The Purpose of the Regulation and the Act  \n[126]  Courts should approach statutory and regulatory language “in the manner \nthat best reflects the underlying aims of the statute. This follows from the obligation to \ninterpret the  words of an Act harmoniously with the object of the Act and the intention \nof Parliament” ( British Columbia Human Rights Tribunal v. Schrenk , 2017 SCC 62 , \n[2017] 2 S.C.R. 795, at para.  50). The interpretation adopted in these reasons best \nfurthers the purposes of the Act. Protecting worker safety is of critical importance; the \nquestion is how the legislature has chosen to achieve this aim. The Ministry proposes \nan unbounded interpretation of employer duties and simply asserts that this promotes \n2023 SCC 28 (CanLII)\n\n--- Page 91 ---\n \n the public welfare purposes of the Act. However, such a bald assertion should not be \naccepted uncritically. It is far from clear that making every employer liable for the acts \nof all other employers in carrying out all regulatory obligations meaningfully improves \nworker safety. To the contrary, our interpretation reflects a measured and practical \napproach that is fully consistent with the legislature’s purposes and best promotes the \nsafety of workers on a project. Below, we focus on worker safety through the \nperspective of overlapping and coordinated duties across a project, the “belt and \nbraces” approach, and the administration of the scheme.  \n[127]  First, our interpretation of s.  25(1)(c) of the Act and the  Regulation  gives \neffect to the concept of overlapping responsibilities. Since the workers’ activities under \neach employer’s control frequently overlap on complex construction projects, so too \nwill the measures which apply to them under s.  25(1)(c). For ex ample, when multiple \ncontractors send their respective workers up a scaffold, they are each responsible for \nits safety under ss.  126 to 136.0.1 of the Regulation (see, e.g., R. v. Structform \nInternational Ltd. , [1992] O.J",
    "token_count": 1000,
    "start_token": 37800,
    "end_token": 38800,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 43,
    "source_file": "2023scc28.txt",
    "text": "’ activities under \neach employer’s control frequently overlap on complex construction projects, so too \nwill the measures which apply to them under s.  25(1)(c). For ex ample, when multiple \ncontractors send their respective workers up a scaffold, they are each responsible for \nits safety under ss.  126 to 136.0.1 of the Regulation (see, e.g., R. v. Structform \nInternational Ltd. , [1992] O.J. No.  1711 (QL), 1992 CarswellOnt 2 751 (WL) (C.J. \n(Gen. Div.)), at para. 6). Importantly, other employers may also be subject to duties \nunder other provisions of the Act (see, e.g., s.  25(2)(h)). The critical distinction is that \nthere is a functional basis  for the overlap, consistent with t he work that the employers \ncontrolled and performed through their respective workers. Employers whose work is \nnot related to the regulatory measure will not be arbitrarily sent before the courts to \ndefend their actions in the event of an accident or incide nt. Similarly, while the \nconstructor’s plenary authority across a project will overlap with employers’ duties in \ntheir respective operational spheres, the scope of the employers’ respective \n2023 SCC 28 (CanLII)\n\n--- Page 92 ---\n \n occupational health and safety duties will be functionally based o n the work that the \nemployers controlled and performed through their workers.  \n[128]  Such an approach to overlapping responsibilities is consistent with this \nCourt’s decision in  West Fraser Mills Ltd. v. British Columbia (Workers’ \nCompensation Appeal Tribunal) , 2018 SCC 22 , [2018] 1 S.C.R. 635 . While reviewing \nthe decision of the Workers’ Compensation Board of British Columbia, McLachlin  C.J. \nrejected an interpretive approach to an occupational health and safety  provision that \nwould have held only one employer lia ble where multiple were responsible in a \n“complex joint set of interactions” ( para.  44). On the proposed interpretation of \ns. 25(1)(c) and the Regulation, the employers involved in a joint set of interactions \nthrough their workers will be liable under s.  25(1)(c), since regulatory measures clearly \nrelate to each of their work. Our approach is thus similar to the prevailing interpretation \nin West Fraser Mills , which was based on a “factual link between West Fraser Mills’ \nactivities and choices as an employer  of individuals meant to monitor the worksite and \nthe incident that occurred” (para.  38). \n[129]  Although paying lip service to the language of overlapping obligations, the \nMinistry is effectively proposing coextensive  obligations among employers, without \nregard for the activities under their control on the larger project. This approach \nadvances an interpretation that goes “ well beyond the proper reach of the Act and the \nreviewing role of the ministry reasonably necessary to advance the admittedly \nimportant object ive of protecting the health and safety of workers in the workplace ” \n(Blue Mountain Resorts , at para.  4; see also paras. 26 -27). \n2023 SCC 28 (CanLII)\n\n--- Page 93 ---\n \n [130]  Second, the interpretation of the Regulation in these reasons fully \noperationalizes the “belt and braces” approach. The goal of  a “belt and braces” system \nis to create meaningful  protection  in practice . Thus, “if the ‘belt’ does not work to \nsafeguard a worker, the backup system of the ‘braces’ might, or vice versa” ( Enbridge , \nat para.  24). Yet, if there is no relationship between the measure and the employer’s \nwork, the employer cannot serve as an effective brace. Further, if everybody is \nresponsible for everything, it is difficult for a given employer to determine which of \nthe hundreds of regulatory measures they are responsible f or overseeing. The \napplicability of each measure is, in essence, determined by the Ministry’s use of \nprosecutorial discretion ex post facto . Clearly, the problem with this approach is that if \nemployers do not know who is a belt or a brace, then the safety system cannot function \nat all and leads to confusion. Imposing measures contained in the Regulation onto \nemployers bearing no relationship to the work at hand adds an indefinite number of \nillusory braces: they provide a false sense of added safety but, in reality, only increase \nthe legal jeopardy of unrelated workplace parties who could not have ensured \ncompliance with those measures. The “be lt and braces” approach is best \noperationalized",
    "token_count": 1000,
    "start_token": 38700,
    "end_token": 39700,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 44,
    "source_file": "2023scc28.txt",
    "text": " who is a belt or a brace, then the safety system cannot function \nat all and leads to confusion. Imposing measures contained in the Regulation onto \nemployers bearing no relationship to the work at hand adds an indefinite number of \nillusory braces: they provide a false sense of added safety but, in reality, only increase \nthe legal jeopardy of unrelated workplace parties who could not have ensured \ncompliance with those measures. The “be lt and braces” approach is best \noperationalized when “redundanc[ies]” — a term employed by Bellamy  J. in \nEnbridge  — exist among the employers who bear an actual connection to the relevant \nmeasure (para. 24). These employer duties exist alongside the distin ct but overlapping \nduties of the constructor and other workplace parties.  \n[131]  Put simply, holding employers with no control liable does nothing to \nincrease worker safety — it is this very lack of control which makes them unable to \ncarry out the regulatory meas ure in the first place. Although the statutory and \n2023 SCC 28 (CanLII)\n\n--- Page 94 ---\n \n administrative law context was different in Canada Post Corp. v. Canadian Union of \nPostal Workers , 2019 SCC 67,  [2019] 4 S.C.R. 900, this Court referenced the more \ngeneral idea that, in practice, “[a]n int erpretation which imposed on the employer a \nduty it could not fulfil would do nothing to further the aim of preventing accidents and \ninjury” ( para.  59). \n[132]  Third, limitless responsibilities lead to confusion and a lack of coordination \non a construction projec t. If every employer is liable for everything and has duties \ntowards unrelated parties, an individual employer’s sphere of responsibility becomes \nunclear. Indeed, it stands to reason that when too many workplace parties share too \nmany of the same responsib ilities, confusion about when and how those parties must \nanswer the call of duty is bound to arise. These circumstances can lead to duplication \nand the potential for competing directives ( Ontario (Health and Long -Term Care, Land \nAmbulance Programs) v. Cana dian Union of Public Employees, Local 2974.1 , 2010 \nCanLII 11302  (Ont. L.R.B.), at para.  83). For example, safety issues could arise if \nmultiple employers with no relationship to the duty or expertise in the area seek to \nenforce their own version of a parti cular safety procedure on other workers. \nAlternatively, unlimited duties can lead to neglect if each employer assumes that duties \nowed by all employers will have been fulfilled by someone else. Hoping that the due \ndiligence defence will incentivize parties  to remedy this problem belies the fact that, \nproperly interpreted, s.  25(1)(c) should not create this problem in the first place. Rather, \nour interpretive approach assists in avoiding these problems by clarifying the requisite \nrelationship for a measure t o apply to an employer.  \n2023 SCC 28 (CanLII)\n\n--- Page 95 ---\n \n [133]  As we explained, the Act  is designed to provide effective protection for the \nhealth and safety of workers ( Hamilton (City) , at para.  16; Timminco , at para.  22; \nBondfield , at para.  59). This objective is furthered by requiring employ ers to be focused \non fulfilling regulatory measures related to work which they control. Conversely, it is \nfrustrated when limitless duties are imposed that ultimately obscure the areas in which \nan employer can make a practical difference. If every employer  is rendered equally \nresponsible for everything, it becomes more difficult for workers and other workplace \nparties to single out particular employers who should take the initiative, or to seek a \nuniform response among employers. This undermines the effecti veness of the internal \nresponsibility system, which was at the core of the Act’s  reform (see, e.g., R.  Fidler, \n“The Occupational Health and Safety Act  and the Internal Responsibility System” \n(1986), 24 Osgoode Hall L.J.  315). Such an outcome does not promo te worker safety; \nit jeopardizes it. In contrast, the interpretation presented in these reasons clarifies the \nduties of each employer in relation to their work activities. It also gives meaningful \nroom for the constructor to coordinate the employers’ respe ctive activities to maximize \nworker safety. A practical understanding of how the Regulation connects to s.  25(1)(c) \nbest protects the purpose of the scheme and recognizes how the scheme “operates on \n",
    "token_count": 1000,
    "start_token": 39600,
    "end_token": 40600,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 45,
    "source_file": "2023scc28.txt",
    "text": " not promo te worker safety; \nit jeopardizes it. In contrast, the interpretation presented in these reasons clarifies the \nduties of each employer in relation to their work activities. It also gives meaningful \nroom for the constructor to coordinate the employers’ respe ctive activities to maximize \nworker safety. A practical understanding of how the Regulation connects to s.  25(1)(c) \nbest protects the purpose of the scheme and recognizes how the scheme “operates on \nthe ground” ( West Fraser Mills , at para.  41). \n[134]  It is true that the legislature imposed strict liability offences to increase \nadministrative efficiency. However, the fact that the Ministry is spared from proving \nmens rea does not mean that it is able to charge anyone with anything in the Regulation; \nthese are two separate questions. Moreover, determining whether a measure in the \nRegulation applies to an employer under our interpretation is not an onerous task and \n2023 SCC 28 (CanLII)\n\n--- Page 96 ---\n \n therefore has little effect on the efficiency of the Ministry’s work. As we later explain, \nto determine  which measures apply to which employers, courts merely need to ask: \nWhat work is an employer responsible for undertaking on the construction project? In \nthis sense, it involves an inquiry into the allocation of tasks on the project and the work \nactually p erformed by the employer’s workers. This is a basic question that should arise \nin the Ministry’s investigation of an accident or incident. It should inform who the \nMinistry charges. Taken together, our interpretation promotes the purposes of the \nscheme whi le protecting the integrity of its structure.  \n(e) Absurdity and Legislative Intent  \n[135]  It is a well -established principle that the legislature does not intend to \nproduce absurd results. This would occur if an interpretation “leads to ridiculous or \nfrivolous consequences, if it is extremely unreasonable or inequitable, if it is illogical \nor incoherent, or if it is incompatible with other provisions or with the object of the \nlegislative enactment” ( Rizzo , at para.  27). \n[136]  The Ministry’s expansive interpretation of  employer duties ignores this \nprinciple and leads to absurdity. Applying its interpretation in a construction context, \nthe vast majority of an employer’s s.  25(1)(c) duties would be unrelated to their work \nand impossible for them to fulfill, yet could stil l result in them being charged. Three \nexamples suffice to demonstrate the absurd results that would flow from the Ministry’s \ninterpretation.  \n2023 SCC 28 (CanLII)\n\n--- Page 97 ---\n \n [137]  First, consider the company that provides catering services on a large \nconstruction project and that delivers food and beverage services at various respite \nlocations. While this company employs caterers on the project site and has control over \ncatering tasks, it is uninvolved in most operations on the construction project. Yet, \nunder the Ministry’s approach, if a tower  crane was erected near the caterer’s activities \nwithout including automatic limit switches (s.  160(1) of the Regulation), the catering \ncompany could be charged, the actus reus  would be made out, and the catering \ncompany would bear the burden of establishi ng a defence. To subject an employer such \nas the catering company to this process is absurd. On a large project involving \nnumerous employers, such absurdities would be multiplied.  \n[138]  Second, the group of interveners, including the Regional Municipality of \nYork, raise the following example. A municipality greenlights the construction of a rail \nsystem and contracts with a constructor. It sends a quality assurance inspector to check \nthat the lights were installed in accordance with the contract. If an electrical problem \ncauses an accident on the other side of the station, the municipality would have \nbreached s.  25(1)(c) on the Ministry’s interpretation merely because its employee was \npresent at the site. Further, according to the Ministry’s interpretation of the A ct, the \nmunicipality would be dissuaded from sending inspectors  — who might otherwise \nimprove the project — for fear of being held liable for all regulatory measures under \nthe Act, no matter how unconnected the measures are to the inspectors’ activities. \nSurely, such an absurd outcome does not further the statutory purpose of protecting \nworkers.  \n2023 SCC 28 (CanLII)\n\n--- Page 98 ---\n \n [139]  Third, one can easily imagine a homeowner who has contracted with a \nconstructor to repair the attic, but who engages an external person to verify that the \nproject i s proceeding according to architectural design",
    "token_count": 1000,
    "start_token": 40500,
    "end_token": 41500,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 46,
    "source_file": "2023scc28.txt",
    "text": " regulatory measures under \nthe Act, no matter how unconnected the measures are to the inspectors’ activities. \nSurely, such an absurd outcome does not further the statutory purpose of protecting \nworkers.  \n2023 SCC 28 (CanLII)\n\n--- Page 98 ---\n \n [139]  Third, one can easily imagine a homeowner who has contracted with a \nconstructor to repair the attic, but who engages an external person to verify that the \nproject i s proceeding according to architectural design standards. If, on the same day, \none of the constructor’s subcontractors falls from a ladder that did not meet regulatory \nspecifications (see s.  80 of the Regulation), should the homeowner be liable as soon as \nthey employed an individual who entered the attic? Similarly, does a small retailer who \nsends their business employee to the premises to confirm the constructor’s performance \nof the contract become liable for all regulatory measures across the project mere ly \nbecause they are an “employer” whose worker performed a task at the project? These \nare some of the absurd outcomes that flow from the Ministry’s literal interpretation of \ns. 25(1)(c) of the Act, according to which every employer would be obligated to en sure \ncompliance with every regulatory measure contained within the Regulation. Moreover, \nas we noted earlier, these entities would not otherwise be forced to comply with such \nmeasures, given that the owner -constructor relationship does not simultaneously c reate \nan employer -worker relationship.  \n[140]  At the hearing, the Ministry’s counter -arguments were twofold. First, \nprosecutorial discretion will limit the potential for absurdity to occur. Second, even if \nthese employers are charged, the due diligence defence at  s. 66(3) will allow them to \navoid conviction. Neither of these responses is satisfactory.  \n[141]  On the question of prosecutorial discretion, the Ministry’s approach \nundermines the rule of law. It effectively gives prosecutors unbounded discretion to \ndefine the proper scope of each employer’s duties by deciding who to charge, rendering \n2023 SCC 28 (CanLII)\n\n--- Page 99 ---\n \n the ultimate delineation of duties in the Act unpredictable and uneven from the \naccused’s perspective. This cannot be what the legislature intended when it sought to \nenact strict l iability offences for administrative efficiency. It crafted a careful scheme \nto create coordinated working relationships among employers under the oversight of \nthe constructor. It is inconceivable that the legislature would intend for the true scope \nof s. 25(1)(c) to be determined via prosecutorial discretion. Moreover, the Ministry’s \nreliance on a promise that prosecutors would not charge employers for breaches of \nregulatory measures over which they had no control emphasizes the absurdity of its \nown interp retation.  \n[142]  As for the availability of the defence at s.  66(3), it initially presents itself \nas an appealing solution: courts could accept the broad language of s.  25(1)(c) at face \nvalue and simply resolve the absurdities created through a lenient approach to the \naccused’s defence. However, there are multiple flaws with adopting an approach that \npushes most of the analysis concerning an employer’s responsibility to the due \ndiligence stage.  \n[143]  First, from a methodological perspective, the offence and the defence  \nshould not be conflated. The existence of s.  66(3) confirms the nature of certain duties: \nss. 23(1), 25(1)(b), (c) or (d) and 27(1) involve strict liability, rather than absolute \nliability. However, s.  66(3) does not determine the applicability  of these d uties to a \nparty, nor their content . These are distinct inquiries, and judges should not abdicate the \nresponsibility of arriving at a reasonable interpretation of a duty merely because a \n2023 SCC 28 (CanLII)\n\n--- Page 100 ---\n \n defence exists or because doing so would improve administrative effic iency for the \nMinistry.  \n[144]  The Ministry’s focus on the due diligence defence flips the structure of \noffences on its head: every employer is captured by the offence as soon as any \nregulatory measure is not met, and the accused must bear the burden of pulling \nthemselves out of the ambit of the offence. Owners might point to retaining a \nconstructor, but for most employers on a construction project, the defence would \ninvolve justifying why the measure was so unrelated to their work that no precautions \nwere possibl e; put differently, employers would effectively be forced to argue at the \ndefence stage  that",
    "token_count": 1000,
    "start_token": 41400,
    "end_token": 42400,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 47,
    "source_file": "2023scc28.txt",
    "text": " captured by the offence as soon as any \nregulatory measure is not met, and the accused must bear the burden of pulling \nthemselves out of the ambit of the offence. Owners might point to retaining a \nconstructor, but for most employers on a construction project, the defence would \ninvolve justifying why the measure was so unrelated to their work that no precautions \nwere possibl e; put differently, employers would effectively be forced to argue at the \ndefence stage  that the offence  should not actually apply to them.  \n[145]  Second, the contextual analysis undertaken in our reasons demonstrates \nthat the Ministry’s interpretation is inconsi stent with other statutory provisions and \nconfuses the roles of employer and constructor. The objective of statutory interpretation \nmust be to “interpret statutory provisions to harmonize the components of legislation \ninasmuch as is possible, in order to m inimize internal inconsistency” ( Willick v. Willick , \n[1994] 3 S.C.R. 670, at p.  689). The Ministry’s interpretation does the opposite: it \nundermines the coherence of the overall scheme, while asking the accused  to bear the \nburden of repairing it at the due  diligence stage. Pointing to the existence of s.  66(3) as \na safety valve does not excuse the damage inflicted on the scheme by an unbridled \ninterpretation of s.  25(1)(c) and the Regulation. Even if pushing the analysis to the due \ndiligence stage was a pla usible interpretation, courts should favour an approach that \nreflects the structure and consistency of the legislative scheme.  \n2023 SCC 28 (CanLII)\n\n--- Page 101 ---\n \n [146]  Third, shifting much of the analysis on the contents of the duty and the \nnature of the employer’s work to the due diligence stage  has superficial appeal in its \napparent simplicity: on this approach, every employer is liable for fulfilling all of the \nsame measures in the Regulation, and the practical problems with such an approach are \nconveniently hidden from view by pushing them to the due diligence stage. However, \nthis increases uncertainty in practice and ignores the reality of how the scheme operates \non the ground. If most of the employer’s obligations are outside of their control, they \nhave no ability to even know whether the mea sures are being complied with or what \nthey could be charged with at any moment. In contrast, requiring that a measure relates \nto an employer’s work provides employers with a greater understanding of their \nresponsibilities and encourages them to take initia tive to protect workers.  \n[147]  Fourth, it should not be forgotten that the Act  is penal legislation ( R. v. \nBrampton Brick Ltd.  (2004), 189 O.A.C. 44 , at para.  22). Those convicted of an offence \nare subject to fines of up to $500,000 and imprisonment for up to on e year (s.  66(1)). \nThese are serious punishments for the caterer, the homeowner, or the small business \nowner on a construction project. It is inconceivable that the legislature intended to \nallow prosecutors to haul any employer on a massive project to cour t and force them  to \ndemonstrate the measure was completely irrelevant to their work in order to save \nthemselves from prison or financial ruin. The interpretation proposed in these reasons \nrecognizes this absurdity and offers a grounded approach that preser ves the \nlegislature’s intent.  \n2023 SCC 28 (CanLII)\n\n--- Page 102 ---\n \n [148]  Fifth and finally, the defence at s.  66(3) is illusory for a variety of parties: \nrather than pay hefty legal fees and seek to mount a successful due diligence defence, \nsmall businesses, sole proprietors, contractors, and homeo wners may resign themselves \nto pleading guilty. Insofar as the existence of a due diligence defence is a safety valve \nunderpinning the Ministry’s broad interpretation, its practical unavailability for more \nvulnerable parties should be acknowledged since ac cess to justice remains out of reach \nfor many Canadians. Thus, the availability and content of the due diligence defence do \nnot serve as an adequate safety valve for an employer who has been charged with failing \nto comply with measures which are unrelated to their work and should never have \napplied to them in the first place.  \n[149]  In contrast, the interpretation adopted in these reasons gives meaningful \neffect to the statutory scheme, while avoiding overly broad interpretations that would \nlead to absurd outcomes . Broad language in a statute should be given a more limited \ninterpretation “ in order to avoid absurdity and to give the",
    "token_count": 1000,
    "start_token": 42300,
    "end_token": 43300,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 48,
    "source_file": "2023scc28.txt",
    "text": " as an adequate safety valve for an employer who has been charged with failing \nto comply with measures which are unrelated to their work and should never have \napplied to them in the first place.  \n[149]  In contrast, the interpretation adopted in these reasons gives meaningful \neffect to the statutory scheme, while avoiding overly broad interpretations that would \nlead to absurd outcomes . Broad language in a statute should be given a more limited \ninterpretation “ in order to avoid absurdity and to give the words their appropriate \nmeaning, having regard to their context, the purpose of the Act and the intention of the \nlegislature” ( Blue Mou ntain Resorts , at para.  51; see also Ontario v. Canadian Pacific \nLtd., [1995] 2 S.C.R. 1031 , at p. 1082 ). Indeed, when a court interprets broad \noccupational health and safety legislation, “there are safeguards or elements imposed \nat each stage that offer a n opportunity to interpret and restrict that broad language to \navoid absurdity” ( R. v. Halifax Port Authority , 2022 NSPC 13 , at para.  130 (CanLII) ). \nThis is the case here, with regard to s.  25(1)(c) and the ambiguous provisions in the \nRegulation. Our inter pretation is the product of a careful examination of the text of \n2023 SCC 28 (CanLII)\n\n--- Page 103 ---\n \n s. 25(1)(c) and the Regulation, read in light of its statutory context, the legislature’s \npurposes, and its practical effects on the ground.  \n(3) Summary and Guidance  \n[150]  In summary, s.  25(1)(c) requires an employer to ensure compliance with \nall applicable  regulatory measures. Where the Regulation expressly states to whom its \nmeasures apply, there will be no question as to whether they fall within the employer’s \nduty under s. 25(1)(c). Where however, a particular measure is silent concerning to \nwhom it applies, the measure applies when it relates to work that the employer \ncontrolled and performed through their workers . This relationship is established when \nthe employer has authority over the performance of a task, usually because it is the \nportion of the work within the larger project that, whether alone or with other parties, \nthey have been entrusted with performing through the workers they have employed or \ncontracted for.  To be sure, multiple parties can be jointly entrusted with a task, since \ndifferent employers will often collaborate, and thus multiple employers can have an \noverlapping responsibility to fulfill the same measures ( Director of Occupational \nHealth and Safety v. Government of Yukon, William R. Cratty and P.S. Sidhu Trucking \nLtd., 2012 YKSC 47 , at para.  69 (CanLII) ). It is not necessary for the Ministry to assign \nrelative degrees of control over the activity in question. A regulatory measure can apply \nto the wor k of multiple employers so long as it relates to each employer. As we \nexplained, the core question is: What work is an employer responsible for undertaking \non the construction project? Clearly the Ministry should know whether the measure is \n2023 SCC 28 (CanLII)\n\n--- Page 104 ---\n \n actually relate d to the employer’s work before making the decision to charge that \nemployer.  \n[151]  Such an inquiry does not require fact -specific findings relative to the \naccident or incident nor in respect of the various employers’ resources, intentions or \nrelative degrees of control. When an employer is given responsibility for performing a \ntask (whether exclusive or shared), they are liable for ensuring compliance with all \nregulatory measures related to this work. This is a binary determination and does not \ndepend on relative  control: when an employer undertakes to perform a task through \ntheir workers, they must address the safety hazards related to this work.  \n[152]  It is not difficult to determine which duties are involved, since (as noted \nabove) the duties are deliberately organiz ed based on project materials, devices and \nactivities. For example, s.  207(1) of the Regulation reads as follows:  \n207. (1) If a built -up roof is being constructed, repaired or resurfaced, a \nbarrier shall be placed in the immediate work area at least two me tres from \nthe perimeter of the roof.  \n[153]  If one or more employers are entrusted with constructing a roof, then they \nmust ensure that a barrier has been placed in conformity with s.  207(1). Conversely, \nthe measure clearly does not apply to a painting company wo rking on the interior walls. \nIn most",
    "token_count": 1000,
    "start_token": 43200,
    "end_token": 44200,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 49,
    "source_file": "2023scc28.txt",
    "text": "up roof is being constructed, repaired or resurfaced, a \nbarrier shall be placed in the immediate work area at least two me tres from \nthe perimeter of the roof.  \n[153]  If one or more employers are entrusted with constructing a roof, then they \nmust ensure that a barrier has been placed in conformity with s.  207(1). Conversely, \nthe measure clearly does not apply to a painting company wo rking on the interior walls. \nIn most cases, this determination would not be in doubt. In any event, it is reasonable \nto ask the Ministry to demonstrate that a measure — with which non -compliance risks \nimprisonment — actually applies to the person it is see king to charge, as prosecutors \nwould have to do in any other instance.  \n2023 SCC 28 (CanLII)\n\n--- Page 105 ---\n \n [154]  It warrants emphasizing that whether a regulatory measure applies  to a \nparty (and, thus, whether they can properly be charged) is different from whether they \nwere diligent in the circum stances  (and, thus, whether they can make out a defence if \ncharged) and from whether there are aggravating or mitigating factors at sentencing \n(and, thus, the penalty in the event of conviction). To explain this distinction, we briefly \nexamine the distinct  role of the due diligence defence provided for at s.  66(3).  \nD. The Role of the Defence Provided for at Section  66(3)  \n[155]  If a person is an employer under the Act, they must ensure that the measures \nwhich apply to them are carried out in the workplace pursuant to  s. 25(1)(c). As we \nexplained, the regulatory measures apply when they present a nexus to the work which \nis under the employer’s control and performed through their workers. Establishing this \nnexus between the measure and the employer is a binary, threshol d question: either the \nmeasure applies because it is related to work which the employer has undertaken, or \nthe measure does not apply because such a link is absent.  \n[156]  If a violation of an applicable measure is proven, the employer must make \nout a due diligen ce defence as per s.  66(3). Since the measure is related to their work, \nthe employer has the burden of demonstrating the specific  steps they took to prevent \nthe breach in the circumstances . The role that control might play at this stage is \nfundamentally di fferent. Indeed, making out this defence entails a fact - and \nsituation -specific analysis that can capture the degree and extent of the employer’s \ncontrol over the underlying cause of the breach at issue, the gravity and likelihood  of \n2023 SCC 28 (CanLII)\n\n--- Page 106 ---\n \n the harm, the alternat ives available  to the employer in the circumstances, and the \ndegree of knowledge or skill  expected of the employer — considerations that are \nirrelevant to the applicability of the duty ( R. v. Gonder  (1981), 62 C.C.C. (2d) 326 \n(Y. Terr. Ct.), at pp.  332-33; R. v. Sault Ste. Marie , [1978] 2 S.C.R. 1299; Stelco Inc.  \nv. Ontario (Ministry of Labour) , 2006 CanLII 28110 (Ont. S.C.J.), at paras.  28-32; \nOntario v. London Excavators & Trucking Ltd.  (1998), 40 O.R. (3d) 32 (C.A.)).  \nE. Application  \n[157]  Based on our analysis of  the Act,  we now examine whether the City is \nliable as an employer for the breach of ss.  65 and 104(3) of the  Regulation.  \n(1) Is the City an Employer Under Section  1(1)?  \n[158]  The Court of Appeal concluded that because the City had hired quality \ncontrol inspectors t hrough a contract of employment, it satisfied the definition of \n“employer” under the first branch (paras.  13-14). We agree with this conclusion. \nIndeed, at the hearing, the City effectively conceded that it was the employer of its \ninspectors. The City hire d quality control inspectors and owes duties as the employer \nof these workers under the Act. However, this does not mean that the City is the \nemployer of all workers on the project. By contracting with a constructor, it did not \nbecome the employer of the w orkers that the constructor retained. As explained \npreviously, the owner -constructor",
    "token_count": 1000,
    "start_token": 44100,
    "end_token": 45100,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 50,
    "source_file": "2023scc28.txt",
    "text": " this conclusion. \nIndeed, at the hearing, the City effectively conceded that it was the employer of its \ninspectors. The City hire d quality control inspectors and owes duties as the employer \nof these workers under the Act. However, this does not mean that the City is the \nemployer of all workers on the project. By contracting with a constructor, it did not \nbecome the employer of the w orkers that the constructor retained. As explained \npreviously, the owner -constructor contract reflects a distinct relationship contemplated \nin the Act that does not generally fall within the second branch of the employer \n2023 SCC 28 (CanLII)\n\n--- Page 107 ---\n \n definition in s.  1(1). Consequently , the City is only the employer of its quality control \ninspectors.  \n[159]  Since the City satisfies the definition of “employer” in s.  1(1), we now turn \nto the scope of its duties.  \n(2) Do Sections  65 and 104(3) of the Regulation Apply to the City as an \nEmployer Throug h the Operation of Section  25(1)(c) of the Act?  \n[160]  In light of our conclusion that the City is an employer of the quality control \ninspectors, the applicability of the regulatory measures  depends on whether it \ncontrolled work being performed near  public ways (s.  65) or controlled the  operation \nof vehicles, machines and equipment (s.  104(3)). As previously mentioned, the Court \nof Appeal did not examine this question once it found that the City was an “employer”. \nRather, the Court of Appeal stated: “We conclude that the City was an employer within \nthe meaning of the Act and, as a result , was liable for violations of the Regulation found \nby the trial judge unless it could establish a due diligence defence” ( para.  6 (emphasis \nadded)). Respectfully, it was incorrect for the Court of Appeal to find that because  the \nCity satisfied the definition of “employer” it was liable for the violations under the \nRegulation. This reasoning rests on an improper interpretation of the Act, as we \nexplained above.  \n[161]  Due to t his flawed assumption, the trial judge did not consider the \napplicability of the regulatory measures, nor did the Superior Court or the Court of \nAppeal. Accordingly, the proper approach is to remit the matter to the Ontario Court of \n2023 SCC 28 (CanLII)\n\n--- Page 108 ---\n \n Justice to determine wh ether, following the approach set out above, ss.  65 and 104(3) \nof the Regulation related to the City and thereby fell within its duty under s.  25(1)(c) \nof the Act.  \nVI. Conclusion  \n[162]  For the foregoing reasons, we would allow the appeal and remit the matter \nto the Ontario Court of Justice to assess whether ss.  65 and 104(3) of the Regulation  \napply to the City as an employer, and thus whether the City breached its duty under \ns. 25(1)(c) of the Act.  \n The following are the reasons delivered by  \n \n CÔTÉ J. —  \nI. Introduction  \n[163]  The entirety of the Elgin Project  — including responsibility for compliance \nwith the Occupational Health and Safety Act , R.S.O. 1990, c.  O.1 (“OHSA” or \n“Act”)  — was under the control of Interpaving Limited, the company hired by the \nCorporation of the City  of Greater Sudbury to be its general contractor. As the \nmunicipal project owner, the City sent quality control inspectors to the project “to \nensure the quality of work and to protect public funds” (Ont. C.J. reasons, at para.  23, \nreproduced in A.R., vol.  I, at p.  7). The City was not involved in any of the construction \n2023 SCC 28 (CanLII)\n\n--- Page 109 ---\n \n work at the Elgin Project. Its inspectors did not “direct any workers”, “supervis[e] the \nwork”, or “exercise control over the work” (paras.  26 and 86).  \n[164]  In these circumstances, I agree with t he trial judge, Lische  J., that the City \nwas not an “employer” on the construction project as defined and intended by the Act. \nI also agree with Poupore  J., on appeal, that the trial judge “properly found that the \n[Ministry of the Attorney General (Ministr y of Labour",
    "token_count": 1000,
    "start_token": 45000,
    "end_token": 46000,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 51,
    "source_file": "2023scc28.txt",
    "text": " “exercise control over the work” (paras.  26 and 86).  \n[164]  In these circumstances, I agree with t he trial judge, Lische  J., that the City \nwas not an “employer” on the construction project as defined and intended by the Act. \nI also agree with Poupore  J., on appeal, that the trial judge “properly found that the \n[Ministry of the Attorney General (Ministr y of Labour, Immigration, Training and \nSkills Development)] for Ontario had not proved that the City acted as an employer on \n[the construction] site” (2019 ONSC 3285, 88 M.P.L.R. (5th) 158, at para.  35). \nInterpaving was both the “constructor” of the projec t and the “employer” of the road \ngrader operator who fatally struck and killed a pedestrian. It was charged with \nbreaching s.  104(3) of the accompanying regulation, Construction Projects , \nO. Reg. 213/91 (“Regulation”), which requires operators of vehicles,  machines and \nequipment to be assisted by signallers if the operator’s view is obstructed or if a person \ncould be endangered.  \n[165]  In my view, the City should not share statutory liability for Interpaving’s \nfailures at the construction site. To hold otherwise “ would change substantially what \nhas been the practice in Ontario on construction projects” (Ont. S.C. reasons, at \npara.  34). It would also create a clear disincentive for municipal project owners to \nengage in laudable quality control efforts and would thus  tend to frustrate, not further, \nthe statutory purpose of protecting workers. I would allow the appeal and restore the \nacquittals entered by the trial court on all charges.  \n2023 SCC 28 (CanLII)\n\n--- Page 110 ---\n \n II. Analysis  \n[166]  My analysis proceeds in three parts. First, I discuss why I substantially \nagree with Rowe and O’Bonsawin  JJ.’s interpretation of the duties of employers under \ns. 25(1)(c) of the Act, which must be read in context and together with the applicable \nregulations. I further agree that the definition of “employer” in s.  1(1) of the Act  does \nnot capture the construction -specific relationship between a project owner and its \ngeneral contractor (see Rowe and O’Bonsawin  JJ., at paras.  99-104). With respect, \nMartin  J. fails to consider the structure of the Act and the carefully legislated dis tinction \nbetween construction projects and other workplaces.  \n[167]  Second, I consider the purpose of the Act and explain why the “belt and \nbraces” approach to worker safety should not be interpreted in a manner that extends \nthe reach of the Act “far beyond what was intended by the legislature” ( Blue Mountain \nResorts Ltd. v. Ontario (Ministry of Labour) , 2013 ONCA 75, 114 O.R. (3d) 321, at \npara.  27; see also R. v. Bondfield Construction Co. , 2022 ONCA 302, at para.  59 \n(CanLII)). Even a “generous approach to the in terpretation of public welfare statutes \ndoes not call for a limitless interpretation of their provisions” ( Blue Mountain , at \npara.  26). While due diligence remains available as a defence, it should not affect the \nproper interpretation of the term “employer ” or alter the nature of the statutory offence \nof a failure to comply with s.  25(1)(c) of the Act.  \n[168]  Third, and where I depart from Rowe and O’Bonsawin  JJ., I explain why a \nmunicipal project owner is not an employer on the construction site merely because it  \n2023 SCC 28 (CanLII)\n\n--- Page 111 ---\n \n employs quality control inspectors (see Ont. C.J. reasons, at paras.  84-90; Ont. S.C. \nreasons, at paras.  33-35). Rowe and O’Bonsawin  JJ. find that “the applicability of the \nregulatory measures depends on whether [the City] controlled work being performed \nnear public ways (s.  65) or controlled the operation of vehicles, machines and \nequipment (s.  104(3))” (para.  160). With respect, the trial court answered these \nquestions. Over the course of a 5 -day trial, the trial judge heard",
    "token_count": 1000,
    "start_token": 45900,
    "end_token": 46900,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 52,
    "source_file": "2023scc28.txt",
    "text": "35). Rowe and O’Bonsawin  JJ. find that “the applicability of the \nregulatory measures depends on whether [the City] controlled work being performed \nnear public ways (s.  65) or controlled the operation of vehicles, machines and \nequipment (s.  104(3))” (para.  160). With respect, the trial court answered these \nquestions. Over the course of a 5 -day trial, the trial judge heard from 10  witnesses and \nconside red 16  exhibits. In her careful and thorough analysis, she repeatedly rejected \nthe Ministry’s position that the City or its inspectors exercised control over any \nconstruction work at the project (see paras.  24-26, 64 -67, 71, 81 -82 and 86 -89). In the \naltern ative, the trial judge was satisfied that the City exercised due diligence, taking \n“every precaution reasonable in the circumstances to prevent the tragedy that occurred” \n(para.  91; see also paras.  92-103).  \n[169]  As a result, I would not remit the matter to the trial court. The City was not \nstatutorily obligated to ensure compliance with ss.  65 and 104(3) of the Regulation, \nboth of which applied only to the workplace parties involved in actual construction \nwork at the Elgin Project.  \nA. Points of Agreement With Rowe and O’Bonsawin  JJ. \n(1) Section 25(1)(c) of the Act Must Be Read in Context  \n[170]  I agree that it would be absurd to interpret s.  25(1)(c) literally  — that is, to \nrequire each employer on a construction project to ensure compliance with all \n2023 SCC 28 (CanLII)\n\n--- Page 112 ---\n \n applicable regulations (se e Rowe and O’Bonsawin  JJ., at para.  105). As Rowe and \nO’Bonsawin  JJ. hold, s.  25(1)(c) must be read in context, and its interpretation must be \ninformed by the content of the applicable regulations. Martin  J.’s textual interpretation \nof s. 25(1)(c) is incon sistent with a textual reading of the accompanying regulations. \nFor example, under her interpretation, employers would be required to ensure \ncompliance with safety obligations specifically imposed on other parties, such as the \nduty of a constructor under s . 17(1) of the Regulation to establish emergency \nprocedures for a project.  \n[171]  Through the Act and Regulation, the legislature has made it clear that \nconstruction projects are distinct from other regulated workplaces. On a construction \nproject, while each empl oyer is responsible for the health and safety of its own workers, \nthe constructor is responsible for health and safety across the project (see, e.g., R. v. \nK.B. Home Insulation Ltd. , [2008] O.J. No.  6019 (QL), 2008 CarswellOnt 10891 (WL) \n(C.J.), at para.  18; R. v. Bradsil 1967 Ltd. , [1994] O.J. No.  837 (QL), 1994 CarswellOnt \n4450 (WL) (C.J. (Prov. Div.)), at para.  33; D.  McKechnie, “Occupational Health and \nSafety in Construction Law”, in L.  Ricchetti and T.  J. Murphy, Construction Law in \nCanada  (2010), 209,  at pp.  213-17; R. v. Grant Forest Products Inc.  (2002), 98 C.R.R. \n(2d) 149 (Ont. C.J.), at para.  55). This is confirmed by the Ministry’s own interpretation \nof the Act. The Ministry’s publicly accessible Constructor guideline  \n(February  11, 2022 (online)) states the following:  \nDefinition of “constructor”  \n \n2023 SCC 28 (CanLII)\n\n--- Page 113 ---\n \n The intent of the Occupational Health and Safety Act  (OHSA or the Act) \nis to have one person with overall authority f or health and safety matters \non a project. This person is the constructor of the project.  \n \n. . . \n \nHealth and safety at a project are a shared responsibility. Though each \nemployer at a project has significant responsibilities for the health and \nsafety of th eir workers, the constructor is the party with the greatest degree \nof control over health and safety at the entire project and is ultimately \nres",
    "token_count": 1000,
    "start_token": 46800,
    "end_token": 47800,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 53,
    "source_file": "2023scc28.txt",
    "text": "OHSA or the Act) \nis to have one person with overall authority f or health and safety matters \non a project. This person is the constructor of the project.  \n \n. . . \n \nHealth and safety at a project are a shared responsibility. Though each \nemployer at a project has significant responsibilities for the health and \nsafety of th eir workers, the constructor is the party with the greatest degree \nof control over health and safety at the entire project and is ultimately \nresponsible for the health and safety of all workers. The constructor must \nensure that all the employers and worker s on the project comply with the \nAct and its regulations.  \n \n. . . \n \nRelationship of the constructor to the other parties on a project  \n \nThe constructor has overall responsibility on a project for compliance \nwith the Act, the Regulation for Construction Projec ts (O. Reg. 213/91) \nand other applicable regulations. The constructor may also have duties as \nan employer or as an owner. [Emphasis in original.]  \n[172]  I therefore disagree with Martin  J.’s reliance on R. v. Wyssen  (1992), 10 \nO.R. (3d) 193 (C.A.), for the princi ple that an employer acts as the virtual “insurer” of \nhealth and safety. While this may be true in the window cleaning industry, which was \nat issue in Wyssen , it is not true on construction projects. In this specific and unique \ncontext, the general contrac tor or constructor acts as the insurer of health and safety \nacross the project.  \n(2) A Project Owner Is Not the “Employer” of the Constructor or the \nConstructor’s Workers  \n[173]  As with s.  25(1)(c) of the Act, Martin  J.’s literal interpretation of s.  1(1) \nfails to acc ount for the industry context. I agree with Rowe and O’Bonsawin  JJ. that a \n2023 SCC 28 (CanLII)\n\n--- Page 114 ---\n \n project owner who hires a constructor is not the employer of the constructor itself or its \nworkers (paras.  99-104). Wyssen established that an employer cannot evade its \noccupational  health and safety responsibilities by hiring an independent contractor \ninstead of entering a typical employment relationship (see Rowe and O’Bonsawin  JJ., \nat para.  96). But it does not follow from Wyssen that an employer is responsible for the \nemployees a nd independent contractors of other employers. In Wyssen , Blair  J.A.’s \nreference to the employer as being “virtually in the position of an insurer” related only \nto the employer’s own independent contractor  — there, the deceased window cleaner, \nwith whom th e employer had a direct contractual relationship (see p.  198). In this case, \nthe City was therefore not the employer of the workers hired by its general contractor, \nInterpaving.  \n[174]  As to the City’s hiring of Interpaving itself, this reflects an \nowner -construc tor relationship, not an employer -worker relationship (Rowe and \nO’Bonsawin  JJ., at para.  89). With respect, Martin  J.’s finding that the City was \nInterpaving’s employer defeats the structure and purpose of the Act. It reads out the \nstatutory role of constr uctor and renders the legislature’s express distinction between \nthe duties of project owners and those of non -project owners in ss.  29 and 30 \nmeaningless. Without exception, every project owner would have a strict duty to ensure \ncompliance with all applica ble regulations. While Martin  J. laments the risk of reading \ntoo much into the Act, her own interpretation would impose positive duties on project \nowners, in every case, far beyond those set out by the legislature in s.  30. The Act is \nspecifically designed  to accommodate  — and promote  — the delegation of \n2023 SCC 28 (CanLII)\n\n--- Page 115 ---\n \n construction projects, including responsibility for health and safety, to qualified \nconstructors.  \nB. The “Belt and Braces” Approach to Worker Safety Is Not Limitless  \n(1) Statutory Purpose  \n[175]  I do not accept that the “belt and braces” approach to occupational health \nand safety relied on by my colleagues is without reasonable limits. In Bondfield , \nvan Rensburg  J.A., writing for the Court of Appeal, noted that the Act seeks to achieve \na reasonabl e level of worker protection:  \n A generous interpretation, however, should not be confused with a \nlimitless",
    "token_count": 1000,
    "start_token": 47700,
    "end_token": 48700,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 54,
    "source_file": "2023scc28.txt",
    "text": " Approach to Worker Safety Is Not Limitless  \n(1) Statutory Purpose  \n[175]  I do not accept that the “belt and braces” approach to occupational health \nand safety relied on by my colleagues is without reasonable limits. In Bondfield , \nvan Rensburg  J.A., writing for the Court of Appeal, noted that the Act seeks to achieve \na reasonabl e level of worker protection:  \n A generous interpretation, however, should not be confused with a \nlimitless one: Blue Mountain Resorts Ltd. , at para.  26. While the OHSA  \naims to protect workers from both deliberate and inadvertent conduct, \nincluding accidents that result when workers make mistakes or are careless \nor reckless, it is important to remember that the OHSA  seeks to achieve a \nreasonable level of worker protection, not an entirely risk -free work \nenvironment . [Emphasis added; citations omitted; para.  59.] \n[176]  While Martin  J. purports to accept that the purpose of the Ac t is to \n“promote a reasonable level of protection for the health and safety of workers” \n(para.  38), her interpretation of the “belt and braces” strategy goes far beyond what was \nintended by the legislature (see Blue Mountain , at para.  27). There is no disp ute that \nthe purpose of the Act is to promote worker safety. I simply disagree that it furthers \nthis aim to impose duties on employers that they cannot possibly fulfill ( Canada Post \nCorp. v. Canadian Union of Postal Workers , 2019 SCC 67, [2019] 4 S.C.R. 90 0, at \n2023 SCC 28 (CanLII)\n\n--- Page 116 ---\n \n para.  59). This is true whether or not the notion of “control” is explicit in the statutory \nlanguage.  \n[177]  This point is exemplified by Ontario (Ministry of Labour) v. Nor Eng \nConstruction & Engineering Inc. , 2008 ONCJ 296, one of the cases that Martin  J. \ndisapproves of as “irreconcilable” with Wyssen (see Martin  J., at para.  21). I strongly \ndisagree. In Nor Eng , a bridge structure collapsed at a construction project in Sudbury. \nThe Ministry sought to hold an engineering company (“Remisz”) liable, as an \nemployer, for breaching s.  31(1)(a) of the Regulation, which reads as follows:  \n31. (1) Every part of a project, including a temporary structure,  \n \n(a) shall be designed and constructed to support or resist all loads and \nforces to which it is likely to be subjected without exceeding the \nallowable unit stress for each material used;  \n[178]  Remisz, based in Ottawa, had produced a sum total of two drawings in \naccordance with design criteria made available to it from contract drawings for the \nbridge. It had done so mo nths before the accident occurred. Once the drawings were \nprovided, Remisz received no further communication. The engineering firm acting as \nthe constructor on -site did not review the drawings but “simply filed the[m] away” \n(para.  86 (CanLII)). The ultimat e design of the bridge “varied markedly from the design \nprovided” by Remisz (para.  87). As a result, the court found that Remisz was not an \n“employer in th[e] workplace on or about [the date of the collapse and] in a position to \nensure that the measures an d procedures prescribed in section  31(1)(a) of the \n[R]egulation” were carried out (para.  88). The trial judge explained this as follows:  \n2023 SCC 28 (CanLII)\n\n--- Page 117 ---\n \n Remisz Engineers was removed geographically, temporally, contractually \nfrom the situation at the workplace.  \n \nHow can it  be said that pursuant to s.  25(1), the defendant corporation \ncould do anything on or about May  7, 2004 to ensure that prescribed \nmeasures and procedures were carried out. It is patent and the court finds \nthat on May  7, 2004, there is no evidence suggestin g that the defendant, if \nit be deemed an “employer” within the meaning of the Act, had any control \nover the workplace in question. In fact, the defendant learned only after the \ncollapse, that the project had not yet been completed. The court concludes \nthat the defendant did not have sufficient or any control on the conduct of \nthe workplace to bring it within the obligations intended and created by \nthis legislation",
    "token_count": 1000,
    "start_token": 48600,
    "end_token": 49600,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 55,
    "source_file": "2023scc28.txt",
    "text": "  7, 2004, there is no evidence suggestin g that the defendant, if \nit be deemed an “employer” within the meaning of the Act, had any control \nover the workplace in question. In fact, the defendant learned only after the \ncollapse, that the project had not yet been completed. The court concludes \nthat the defendant did not have sufficient or any control on the conduct of \nthe workplace to bring it within the obligations intended and created by \nthis legislation. [paras.  88-89] \n[179]  I agree. In my view, Nor Eng is “irreconcilable” only with Martin  J.’s \nflawed interpretation of Wyssen . When the correct interpretation of Wyssen  is applied \nto the facts in Nor Eng , it is clear that Remisz was responsible for the health and safety \nof its own employees or independent contractors, that is, those working in Ottawa. But  \nRemisz was not an employer at the construction project hundreds of kilometres away \nin Sudbury. The trial judge correctly declined to hold that Remisz was obligated to \nprevent safety breaches that occurred months after it prepared its drawings and that had  \nnothing to do with its involvement in the project.  \n[180]  The thrust of Martin  J.’s position is that workplaces will be safer if every \nemployer is made responsible for every possible safety obligation. While this approach \nhas superficial appeal (see Rowe and O’B onsawin  JJ., at para.  146), it also creates a \nclear disincentive  for a municipal project owner to engage in quality control efforts. A \nmunicipality cannot monitor quality and/or contract compliance without exposing its \npersonnel to safety breaches already existing  at the construction site. Nonetheless, \n2023 SCC 28 (CanLII)\n\n--- Page 118 ---\n \n Martin  J. would hold every project owner strictly liable for all safety hazards it \nencountered in its quality control efforts  — and which it did nothing to create. It is this \nexact concern that the legislatur e sought to address in s.  1(3) of the Act.  \n[181]  As the trial judge correctly noted, “[t]he OHSA anticipates that an Owner \nwho has contracted with a third -party constructor will have a quality control role on the \nproject” (para.  102). Martin  J.’s interpretation,  and that of the Court of Appeal, renders \nthe quality control exception meaningless (2021 ONCA 252, 15 M.P.L.R. (6th) 161). \nIt would no longer matter that owners do not become constructors by hiring quality \ncontrol personnel. They would simply become emplo yers who, in addition to \nconstructors, have a strict duty to ensure compliance across the construction project.  \n[182]  Martin  J.’s attempt to minimize the effect of the structural distinctions in \nthe Act falls short. She relies on a limitless application of the “ belt and braces” \napproach, repeatedly falling back on the notion of overlapping responsibilities. \nProperly interpreted, the Act still contemplates a significant degree of overlap. For \nexample, the health and safety obligations of individual employers with respect to their \nown workers are shared with the constructor. But the structure of the Act makes it clear \nthat constructors, not employers, are responsible for the health and safety of all workers \non a construction project.  \n[183]  I further agree with the submiss ion of the intervener municipalities that \ngeneral contractors bring needed expertise to the management of construction sites. By \ncontrast, many municipalities or other project owners neither have the resources nor \n2023 SCC 28 (CanLII)\n\n--- Page 119 ---\n \n the institutional capacity to assume that role. The Act recognizes that worker health \nand safety are promoted by delegation to experts in the construction field.  \n(2) Due Diligence  \n[184]  Martin  J. is of the view that “fairness” concerns are addressed at the due \ndiligence stage (see para.  50). With respect, t he due diligence defence only becomes \nrelevant once the elements of the statutory offence have been established. An \nemployer’s ability to make out a potentially costly and burdensome defence is \nirrelevant to the proper interpretation of who is an employer on a construction site and \nto the scope of its corresponding statutory duties. This has nothing to do with “stigma” \n(para.  49), which is applicable in the context of strict liability offences. My concern is \nrather that, as a matter of purpose, it does not prevent future harm ( ibid., citing R. v. \nWholesale Travel Group Inc. , [1991] 3 S.C.R. 154",
    "token_count": 1000,
    "start_token": 49500,
    "end_token": 50500,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 56,
    "source_file": "2023scc28.txt",
    "text": " to the proper interpretation of who is an employer on a construction site and \nto the scope of its corresponding statutory duties. This has nothing to do with “stigma” \n(para.  49), which is applicable in the context of strict liability offences. My concern is \nrather that, as a matter of purpose, it does not prevent future harm ( ibid., citing R. v. \nWholesale Travel Group Inc. , [1991] 3 S.C.R. 154, at p.  219) to impose statutory \nliability on employers who have no connection to, or control over, the safety obligation \nin question.  \n[185]  More fundamentally, a due dilige nce defence will simply be unavailing in \nmany circumstances. I fail to see how a typical employer could possibly exercise due \ndiligence, for example, over a constructor’s obligation to complete an approved \nnotification form before using a suspended work pl atform (s.  7.1 of the Regulation). \nSimilarly, I fail to see how, in Nor Eng , the engineering company working in Ottawa \ncould possibly have demonstrated due diligence to ensure the integrity of a bridge \nstructure with which it had no involvement.  \n2023 SCC 28 (CanLII)\n\n--- Page 120 ---\n \n [186]  Curiously,  Martin  J. finds that a “close examination of the statutory scheme \ndispels any  . . . absurdity” in similar hypothetical circumstances (para.  52). Despite her \nconclusion that all employers act as the virtual “insurer” of health and safety across \nconstructio n projects, she appears to suggest, at para.  52, that an employer’s duties may \nnot “span the entirety of the construction project”. This contradicts her own \ninterpretation of the sweeping duties of employers under s.  25(1)(c) of the Act.  \n[187]  Properly interpret ed, the Act does, however, contemplate a meaningful role \nfor the due diligence defence. I simply agree with Rowe and O’Bonsawin  JJ. that the \ndefence applies only after it is found that a given safety obligation applied to the \nemployer in question (see para s. 143-44). Where an employer on a construction site did \nhave some measure of control over the safety obligation in question, the burden shifts \nto the employer to demonstrate that it took “every precaution reasonable in the \ncircumstances” (s.  66(3)).  \nC. Application  \n(1) The City Was Not an “Employer” on the Construction Project  \n[188]  The real issue in this appeal is whether the City, as project owner and \nemployer of its quality control inspectors, had a statutory duty to ensure compliance \nwith ss.  65 and 104(3) of t he Regulation (see Rowe and O’Bonsawin  JJ., at para.  160). \nFor the reasons set out below, I agree with the trial judge that the City was not an \n“employer” on the construction site as defined and intended by the Act (para.  90). \n2023 SCC 28 (CanLII)\n\n--- Page 121 ---\n \n [189]  In this case, the Ministry ar gued at trial that the City had become the \nconstructor of the Elgin Project by virtue of the amount of control it exercised (see Ont. \nS.C. reasons, at para.  28). The trial judge clearly and repeatedly rejected this position:  \nThe role of the Inspector was t o ensure that the work being performed by \nInterpaving was consistent with the Contract.  This included the quality of \nworkmanship, materials and compliance with the Contract’s terms  . . . . \n \nThe Inspectors were responsible for ensuring that requests for pro gress \npayments to contractors were supported by the nature and quality of work \ncompleted. The Inspectors also dealt with the public.  \n \nThe Inspectors were not responsible for the completion of any \nconstruction work. The Inspectors did not direct any workers  on the Elgin \nProject.  The Inspectors were required to comply with Interpaving’s \npolicies, including health and safety and personal protective equipment. \n[Emphasis added; paras.  24-26.] \n[190]  Throughout her reasons, the trial judge further emphasized that the Ci ty \nhad no control over the project site or involvement in any construction work:  \nThe fact remains that in actuality, the City did not undertake control of the \nElgin Project.  \n \nInterpaving had actual, factual control and direction of the Elgin Project.  \n \n. . . \n \nThe City did not control the Elgin Project. Interpaving,",
    "token_count": 1000,
    "start_token": 50400,
    "end_token": 51400,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 57,
    "source_file": "2023scc28.txt",
    "text": ".  24-26.] \n[190]  Throughout her reasons, the trial judge further emphasized that the Ci ty \nhad no control over the project site or involvement in any construction work:  \nThe fact remains that in actuality, the City did not undertake control of the \nElgin Project.  \n \nInterpaving had actual, factual control and direction of the Elgin Project.  \n \n. . . \n \nThe City did not control the Elgin Project. Interpaving, the constructor, \nwas responsible for health and safety.  The City did not exercise control \nover the site to the point where they became the constructor. The City did \nnot direct Interpaving employee s. The City’s Inspectors were primarily \nfocused on the quality of the work being performed by Interpaving. The \nInspectors assessed the quality of the materials on the Elgin Project and \nensured that the work was properly performed prior to Interpaving \nrecei ving progress payments.  \n \n. . . \n2023 SCC 28 (CanLII)\n\n--- Page 122 ---\n \n  \n. . . the City did not exercise control over the work at the Elgin Project. \nThe City was clearly an Owner. The Inspector(s) were subject to the \nConstructor’s requirements pertaining to health and safety.  The Inspector \nwas fo cussed on ensuring that the work materials and work product \nreflected what was set out in the contract and provided feedback with \nregard to same. The City was clearly not an Employer. The City was not \nsupervising the work. The City was not directing the wo rk. The City hired \na third party, Interpaving, because it had the knowledge and resources to \ncomplete the work.  \n \nThere is no credible evidence in this matter that the City had control \nover the workplace.  [Emphasis added; paras.  64-87.] \n[191]  The City’s involvement in the project was thus limited to quality control. \nIt was not responsible for the completion of any construction work. It did not direct or \nsupervise any construction workers. Rather, it sent inspectors to ensure compliance \nwith the terms of i ts contract, and to protect public funds, before making progress \npayments. This is not only commendable but also standard industry practice. The trial \njudge’s conclusions on the City’s lack of control at the project are findings of fact that \ndeserve defere nce. \n[192]  It is entirely conceivable that a different employer at the Elgin Project could \nshare liability with Interpaving, the constructor, for breaches of ss.  65 and/or 104(3) of \nthe Regulation. For example, if Interpaving had hired a paving company to do the  \ngrading work, that company would be an employer on the project and strictly liable for \nany failure to ensure the assistance of a signaller. This liability would be shared with \nInterpaving, which would remain responsible (as constructor) for health and saf ety \n2023 SCC 28 (CanLII)\n\n--- Page 123 ---\n \n across the project. The Act is designed to accommodate delegation and overlapping \nresponsibilities of this nature.  \n[193]  However, the role of a municipal project owner who hires quality control \ninspectors is necessarily different from that of the employer(s)  involved in the actual \nconstruction work. The City undoubtedly had health and safety obligations vis -à-vis its \nown employees. For example, if it had engaged five or more inspectors, it would have \nbeen required to appoint a supervisor for them under s.  15(1) of the Regulation. But the \nprovisions of the Regulation at issue in this case establish safety requirements  — the \nneed for fencing to be erected between construction work and the public and for a \nsignaller to assist operators of heavy machinery  — that c an apply only to the \nconstruction project parties who undertake the construction work itself. The trial judge \nmade it clear that the City was not involved in that work and had no control over it. She \ncorrectly held, in my view, that the City was therefore not an employer on the \nconstruction site merely by virtue of employing quality control inspectors.  \n(2) Due Diligence  \n[194]  In the alternative, the trial judge found that if the City was an employer, it \nexercised due diligence (paras.  91-103). To fully understand her  conclusion, it is \nnecessary to consider her extensive review of the evidence. Part of the issue at trial \nrelated to the requirement that police officers be present at active or “lit” intersections \nwhile construction took place (“Police Requirement”). This  requirement was \nincorporated into Interpaving’s contract with the City (para.  18).",
    "token_count": 1000,
    "start_token": 51300,
    "end_token": 52300,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 58,
    "source_file": "2023scc28.txt",
    "text": " if the City was an employer, it \nexercised due diligence (paras.  91-103). To fully understand her  conclusion, it is \nnecessary to consider her extensive review of the evidence. Part of the issue at trial \nrelated to the requirement that police officers be present at active or “lit” intersections \nwhile construction took place (“Police Requirement”). This  requirement was \nincorporated into Interpaving’s contract with the City (para.  18). To satisfy the Police \n2023 SCC 28 (CanLII)\n\n--- Page 124 ---\n \n Requirement, Interpaving would, when necessary, request officers from the Greater \nSudbury Police Service (“GSPS”) through the City, which acted as a c onduit. Two \nweeks prior to the accident, the City’s quality control inspector raised concerns:  \n [the] Inspector .  . . noted that the Interpaving employees were using an \nexcavator in the intersection of Beech Street and Elm Street while \npedestrians and vehi cles were also using the lit intersection. Flagmen from \nInterpaving were attempting to direct traffic. There had not been a request \nby Interpaving as per the Contract or the Police Requirement for GSPS \nofficer(s). [para.  27] \n[195]  In response, the inspector conv eyed his observations to an Interpaving \nsupervisor, “who took no action” (para.  28). He then advised the chief inspector for the \nCity, who contacted a manager at Interpaving. The manager came to the site and \n“stopped the work in the intersection” (para.  29). The inspector issued an instruction \nstating that work could not be performed at a lit intersection until police were present \n(para.  29). Nonetheless, on the day of the accident, Interpaving again worked through \na lit intersection without making a reques t for the police (para.  30). \n[196]  By the express terms of its contract with the City, Interpaving was \nresponsible for compliance with the Police Requirement as well as for ensuring that the \nrequirements of the Act were met (Ont. C.J. reasons, at paras.  10 and 1 8). The trial \njudge found that when the City’s inspectors advised Interpaving of their view that it \nwas breaching the Police Requirement and thus the terms of its contract, the City was \n“act[ing] appropriately by making Interpaving aware of the violation”:  \n2023 SCC 28 (CanLII)\n\n--- Page 125 ---\n \n [The manager] of Interpaving stopped the work through the intersection. \nThat was the Constructor, Interpaving’s decision. Moreover, if this act by \nthe City were to constitute taking over the role as Constructor, it may \ndissuade the City from bringing the breach to the attention of the \nConstructor, for fear that it would assume the role of the Constructor and \nall that it entails. [para.  79] \n[197]  On Martin  J.’s interpretation, the City would have shared the constructor’s \nstatutory obligations merely by being the employer of its quality control personnel. Not \nonly would it have been “dissuade[d]” from raising issues regarding violations of the \nterms of its contract with Interpaving, but it would also have been dissuaded from \nmonitoring quality and contract complian ce at the project in the first place. The \ndisincentive that Martin  J.’s interpretation creates  — which s.  1(3) of the Act seeks to \navoid  — is borne out on the facts of this case.  \n[198]  As the trial judge concluded, “[t]he City should be commended and not \ncondemn ed for its behaviour” two weeks before the accident in raising concerns about \nthe lack of police at a “lit” intersection (para.  80). This was an “issue of public safety” \n(para.  80). I agree. By contrast, Martin  J.’s approach penalizes the City for choosing  to \nmonitor quality and contract compliance. While the Police Requirement derives from \nthe Ontario Traffic Manual: Book  7 — Temporary Conditions  (2022) and the City’s \nrole in maintaining the road network, the same disincentive issue arises with respect to \nInterpaving’s obligations under the Act. The City “suggested to Interpaving that there \nwas insufficient signage, issues with signage and insufficient access to crosswalks for \nthe public” and “advised Interpaving that fencing had been knocked down on the El gin \n2023 SCC 28 (CanLII)\n\n---",
    "token_count": 1000,
    "start_token": 52200,
    "end_token": 53200,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 59,
    "source_file": "2023scc28.txt",
    "text": " — Temporary Conditions  (2022) and the City’s \nrole in maintaining the road network, the same disincentive issue arises with respect to \nInterpaving’s obligations under the Act. The City “suggested to Interpaving that there \nwas insufficient signage, issues with signage and insufficient access to crosswalks for \nthe public” and “advised Interpaving that fencing had been knocked down on the El gin \n2023 SCC 28 (CanLII)\n\n--- Page 126 ---\n \n Project” (Ont. C.J. reasons, at paras.  95-96). Such action should be encouraged, not \ncondemned.  \n[199]  For these reasons, the trial judge correctly found that even if she was wrong \nin concluding that the City was not an employer on the construction site, it t ook every \nprecaution reasonable in the circumstances to ensure safety at the project (para.  91). \nWith respect, my colleagues ignore both the trial judge’s findings on the City’s lack of \ncontrol and her alternative findings on the due diligence exercised by  the City in \nchoosing to remit the matter to the trial court to reconsider the exact same issues. I \nstrongly disagree.  \nIII. Summary and Disposition  \n[200]  In sum, it is an “extravagant proposition”, as noted by the intervener \nmunicipalities, to say that a municipal pr oject owner “becomes an employer of every \nperson on a project” by attending the project for the limited purpose of quality \nassurance (transcript, at p.  51). Properly interpreted, the obligations prescribed by \nss. 65 and 104(3) of the Regulation were the re sponsibility of the constructor and/or \nthe employers who performed the relevant construction work. The City had no \ninvolvement in or control over that work and was therefore not an employer at the \nconstruction project. To impose statutory liability on the City in these circumstances \nwould be a regrettable departure from the established scheme of the Act. I would allow \nthe appeal and restore the acquittals entered by the trial court on all charges.  \n2023 SCC 28 (CanLII)\n\n--- Page 127 ---\n \n [201]  Finally, in the interests of clarity, I would respond to the  three questions \nposed by Martin  J. at para.  61 of her reasons  — in the unique and distinct context of \nconstruction projects  — as follows:  \n1. Was the accused an “employer” under s.  1(1) of the Act?  \na. The fact that a municipal project owner is the employer of \nquality control inspectors does not make it an employer on \nthe construction project itself or an employer of any \nconstruction workers. The Act expressly permits a project \nowner to employ quality control inspectors without taking \non health and safety responsi bility for the project (s.  1(3)). \nLikewise, a project owner is not the employer of its \nconstructor, as this would render the statutory role of \nconstructor redundant.  \n2. Did the accused breach s.  25(1)(c) of the Act?  \na. Section  25(1)(c) of the Act must be read in  context, and its \ninterpretation must be informed by the content of the \naccompanying, industry -specific regulations. On \nconstruction projects, employers are not responsible for \nobligations specifically imposed on other workplace parties \nor over which they have no control. As the Ministry \n2023 SCC 28 (CanLII)\n\n--- Page 128 ---\n \n acknowledges, the constructor is the sole authority \nresponsible for health and safety across construction \nprojects. Each employer is responsible for the health and \nsafety of its own workers.  \n3. Should the accused avoid liabili ty because it exercised due \ndiligence under s.  66(3) of the Act?  \na. The due diligence defence only becomes relevant once the \nelements of the offence have been established. It does not \naffect the proper interpretation of the term “employer” or \nalter the nature  of the offence. The defence can only possibly \nbe discharged by an employer on a construction project with \nsome connection to, or control over, the safety obligation in \nquestion. Otherwise, the defence will simply be unavailing.  \n Appeal  dismissed on equal division, KARAKATSANIS , CÔTÉ, ROWE and \nO’B ONSAWIN  JJ. dissenting . \n Solicitor s for the appellant:  Stringer, Toronto.  \n Solicitor for the respondent:  Ministry of the Attorney General of \nOntario  — Ministry of Labour, Immigration, Training and Skills",
    "token_count": 1000,
    "start_token": 53100,
    "end_token": 54100,
    "total_tokens_in_source": 54268
  },
  {
    "chunk_id": 60,
    "source_file": "2023scc28.txt",
    "text": " control over, the safety obligation in \nquestion. Otherwise, the defence will simply be unavailing.  \n Appeal  dismissed on equal division, KARAKATSANIS , CÔTÉ, ROWE and \nO’B ONSAWIN  JJ. dissenting . \n Solicitor s for the appellant:  Stringer, Toronto.  \n Solicitor for the respondent:  Ministry of the Attorney General of \nOntario  — Ministry of Labour, Immigration, Training and Skills Development, Legal \nService Branch , Toronto.  \n2023 SCC 28 (CanLII)\n\n--- Page 129 ---\n \n  Solicitors for the intervener the Retail Council of Canada:  Norton Rose \nFulbright Canada, Ottawa.  \n Solicitor s for the intervener s the Regional Municipality of York, the \nRegional Municipality of Peel, the Regiona l Municipality of Durham, the Regional \nMunicipality of Halton, the Regional Municipality of Waterloo and the Regional \nMunicipality of Niagara:  Lax O ’Sullivan Lisus Gottlieb, Toronto.  \n Solicitor  for the intervener the Workers ’ Compensa tion Board of British \nColumbia:  Workers ’ Compensation Board  of British Columbia , Richmond.  \n2023 SCC 28 (CanLII)\n\n",
    "token_count": 268,
    "start_token": 54000,
    "end_token": 54268,
    "total_tokens_in_source": 54268
  }
]