[
  {
    "chunk_id": 0,
    "source_file": "2023scc34.txt",
    "text": "--- Page 1 ---\n \n  \nSUPREME COURT OF CANADA  \n \nCITATION : R. v. Lawlor, 2023 SCC \n34   \nAPPEAL HEARD : December 15, 2023  \nJUDGMENT RENDERED : December 15, \n2023  \nDOCKET : 40500  \n \nBETWEEN : \n \nDerrick Michael Lawlor  \nAppellant  \n \nand \n \nHis Majesty T he King  \nRespondent  \n \n \n \nCORAM : Rowe, Martin, Kasirer, O’Bonsawin and Moreau JJ.  \n \nJUDGMENT READ \nBY: \n(paras.  1 to 5) \n O’Bonsawin  J. \nDISSENT READ BY: \n(paras.  6 to 8) \n Kasirer  J. \nMAJORITY : \n Rowe, Martin, O’Bonsawin and Moreau JJ.  \nDISSENT : \n Kasirer  J. \n \n2023 SCC 34 (CanLII)\n\n--- Page 2 ---\n \n  \n \n \nNOTE: This do cument is subject to editorial revision before its reproduction in final form in the \nCanada Supreme Court Reports . \n   \n \n \nDerrick Michael Lawlor  Appellant  \nv. \nHis Majesty The King  Respondent  \nIndexed as: R. v. Lawlor  \n2023 SCC 34  \nFile No.: 40500.  \n2023:  December  15. \nPresent: Rowe, Martin, Kasirer, O’Bonsawin and Moreau  JJ. \nON APPEAL FROM THE C OURT OF APPEAL FOR O NTARIO  \n Criminal law — Charge to jury — Evidence — Murder — Intent — Accused’s mental \nhealth — Post-offence co nduct — Accused convicted of first degree murder by jury — Accused \nappealing conviction on basis of alleged deficiencies in jury charge — Court of Appeal upholding \n2023 SCC 34 (CanLII)\n\n--- Page 3 ---\n \n conviction — Trial judge did not err in failing to provide limiting instruction on permitted  use of \nevidence of accused’s after -the-fact conduct but erred in failing to mention relevance and use of \nevidence relating to accused’s mental health when instructing jury on element of intent for murder \n— Conviction set aside and new trial ordered.  \nCases  Cited  \nBy Kasirer  J. (dissenting)  \n R. v. Abdullahi , 2023 SCC 19.  \n APPEAL from a judgment of the Ontario Court of Appeal (van  Rensburg, Nordheimer \nand George  JJ.A.), 2022 ONCA 645 , 418 C.C.C. (3d) 87, [2022] O.J. No.  4053 (Lexis), 2022 \nCarswellOnt 13061 (WL), affirming the conviction of the accused for first degree murder. Appeal \nallowed, Kasirer  J. dissenting.  \n John M. Rosen  and Amy J. Ohler , for the appellant.  \n Benita Wassenaar , for the respondent.  \n The judgment of Rowe, Martin, O’Bonsawin and Moreau  JJ. was delivered orally by  \n[1] O’B ONSAWIN  J. — This is an appeal from R. v. Lawlor , 2022 ONCA 645, 418 C.C.C. \n(3d) 87, in which the majority dismissed an appeal by Derrick Lawlor of his conviction for first \n2023 SCC 34 (CanLII)\n\n--- Page 4 ---\n \n degree murder by a jury. The majority in the Ontario Court of Appeal dismissed the appeal; Justice \nNordheimer would have allowed the appeal and ordered a new trial.  \n[2] Only two grounds of appeal are before this Court. The first is  whether the trial judge \nerred in his instructions to the jury regarding the use of evidence as to the accused’s mental health \nand the requisite intent for first degree murder. The second relates to evidence of after -the-fact \nconduct.  \n[3] A majority of thi s Court would allow the appeal on the ground relating to the requisite \nintent for murder and for first degree murder, but not on the ground relating to after -the-fact \nconduct. As to the first ground, we are in substantial agreement with the reasons of Just ice \nNordheimer. As to the second ground, we are in substantial agreement with the reasons of the \nOntario Court of Appeal majority. We would add the following comment.  \n[4] As has been stated on many occasions, and we repeat here, courts need to be mindful \nof evidence as to mental health where this is relevant to issues of criminal responsibility. This is \n",
    "token_count": 1000,
    "start_token": 0,
    "end_token": 1000,
    "total_tokens_in_source": 1384
  },
  {
    "chunk_id": 1,
    "source_file": "2023scc34.txt",
    "text": "-fact \nconduct. As to the first ground, we are in substantial agreement with the reasons of Just ice \nNordheimer. As to the second ground, we are in substantial agreement with the reasons of the \nOntario Court of Appeal majority. We would add the following comment.  \n[4] As has been stated on many occasions, and we repeat here, courts need to be mindful \nof evidence as to mental health where this is relevant to issues of criminal responsibility. This is \nespecially so in instructing a jury, to assist them in the proper use of such evidence.  \n[5] Accordingly, the appeal is allowed, the conviction is set aside  and a new trial is \nordered.  \n The following are the reasons delivered orally by  \n[6] KASIRER  J. — I would dismiss the appeal. I allow myself two observations.  \n2023 SCC 34 (CanLII)\n\n--- Page 5 ---\n \n [7] First, I agree with my colleagues that courts need to be mindful of mental health \nevidence in criminal matters, including in instructions to the jury. As the majority in the Court of \nAppeal wrote, there is no question that evidence of mental health problems may be relevant to \nissues of intent and planning and deliberation, including in an assessmen t of the adequacy of a jury \ncharge (see paras.  41 and 44 -48). \n[8] Second, and with the utmost respect for other views, I conclude that the trial judge’s \ncharge properly equipped the jury, in light of all the circumstances, to decide the case according \nto the exacting standard set forth in R. v. Abdullahi , 2023 SCC 19. In sum, in respect of both the \nmental health and the after -the-fact evidence, I see no reviewable errors in the jury charge and, on \nthese points, I would adopt the majority reasons of van Rens burg J.A. as my own, without reserve.  \n Judgment accordingly.  \n Solicitors for the appellant:  Rosen & Company, Toronto; Amy  J. Ohler, Barrister, \nToronto.  \n Solicitor for the respondent:  Ministry of the Attorney General for Ontario — Crown \nLaw Office — Crimina l, Toronto.  \n \n2023 SCC 34 (CanLII)\n\n",
    "token_count": 484,
    "start_token": 900,
    "end_token": 1384,
    "total_tokens_in_source": 1384
  }
]