[
  {
    "chunk_id": 0,
    "source_file": "2023scc32.txt",
    "text": "--- Page 1 ---\n \n  \nSUPREME COURT OF CANADA  \n \nCITATION : R. v. B.E.M., 2023 SCC \n32   \nAPPEAL HEARD : December 8, 2023  \nJUDGMENT RENDERED : December 8, \n2023  \nDOCKET : 40221  \n \nBETWEEN : \n \nB.E.M.  \nAppellant  \n \nand \n \nHis Majesty The King  \nRespondent  \n \n- and - \n \nDirector of Public Prosecution s, Attorney General of Ontario   \nand Criminal Trial Lawyers’ Association  \nInterveners  \n \n \n \nCORAM : Karakatsanis, Côté, Martin, Kasirer and Moreau JJ.  \n \nUNANIMOUS \nJUDGMENT READ \nBY: \n(paras.  1 to 9) \n Kasirer  J. \n \nNOTE: This do cument is subject to editorial revision before its reproduction in final form in the \nCanada Supreme Court Reports . \n2023 SCC 32 (CanLII)\n\n--- Page 2 ---\n \n    \n \nB.E.M.  Appellant  \nv. \nHis Majesty The King  Respondent  \nand \nDirector of Public Prosecutions,  \nAttorney General of Ontario and  \nCriminal Trial Lawyers’ Association  Interveners  \nIndexed as: R. v. B.E.M.  \n2023 SCC 32  \nFile No.: 40221.  \n2023:  December  8. \nPresent: Karakatsanis, Côté, Martin, Kasirer and Moreau  JJ. \nON APPEAL FROM THE C OURT OF APPEAL OF ALBERTA  \n2023 SCC 32 (CanLII)\n\n--- Page 3 ---\n \n  Criminal law — Trial — Closing submissions — Crown counsel recounting anecdote \nabout personal childhood memory during closing submissions at accused’s trial — Accused \nappealing convictions for sexual assault and sexual interference and claiming th at trial judge \nfailed to instruct jury to ignore improper submissions made by Crown on matters not in evidence \n— Court of Appeal dismissing appeal — Crown counsel’s improper anecdote did not render \naccused’s trial unfair — Convictions upheld.  \nCases Cited  \n Referred to:  Pisani v. The Queen , [1971] S.C.R. 738; Boucher v. The Queen , [1955] \nS.C.R. 16; R. v. Stephan , 2017 ABCA 380, 61 Alta. L.R. (6th) 26, rev’d 2018 SCC 21, [2018] 1 \nS.C.R. 633; R. v. Manasseri , 2016 ONCA 703, 132 O.R. (3d) 401; R. v. Abdullahi , 2023 SCC 19.  \n APPEAL from a judgment of the Alberta Court of Appeal (Slatter, Veldhuis and \nSchutz  JJ.A.), 2022 ABCA 207 , 45 Alta. L.R. (7th) 1, 414 C.C.C. (3d) 296, [2022] 9 W.W.R. 569, \n[2022] A.J. No.  712 (QL), 202 2 CarswellAlta 1444 (WL), affirming the convictions of the accused \nfor sexual assault and sexual interference. Appeal dismissed.  \n Peter Sankoff  and Elsa Wyllie , for the appellant.  \n Cheryl Schlecker , for the respondent.  \n Monique Dion  and Alex Bernard , for the intervener the Director of Public \nProsecutions.  \n2023 SCC 32 (CanLII)\n\n--- Page 4 ---\n \n  Dena Bonnet  and Vallery Bayly , for the intervener the Attorney General of Ontario.  \n Alexandra Seaman  and Laura Matalas , for the intervener the Criminal Trial Lawyers’ \nAssociation.  \n The judgment of the Co urt was delivered orally by  \n[1] KASIRER  J. — We are all of the view that the appeal should be dismissed.  \n[2] It is common ground that, in closing submissions to the jury, Crown counsel should \nnot have recounted an anecdote about a personal childhood memory  that had no connection to the \nevidence (see Pisani v. The Queen , [1971] S.C.R. 738, at p.  740). Personal anecdotes have no place \nin closing submissions and are fundamentally at odds with the role of counsel, and particularly the \nrole of Crown counsel (see  Boucher v. The Queen , [1955] S.C.R. 16). But the majority of the Court \nof Appeal was correct to conclude that this",
    "token_count": 1000,
    "start_token": 0,
    "end_token": 1000,
    "total_tokens_in_source": 1808
  },
  {
    "chunk_id": 1,
    "source_file": "2023scc32.txt",
    "text": " that had no connection to the \nevidence (see Pisani v. The Queen , [1971] S.C.R. 738, at p.  740). Personal anecdotes have no place \nin closing submissions and are fundamentally at odds with the role of counsel, and particularly the \nrole of Crown counsel (see  Boucher v. The Queen , [1955] S.C.R. 16). But the majority of the Court \nof Appeal was correct to conclude that this error did not result in an unfair trial or a miscarriage of \njustice in this case (2022 ABCA 207, 45 Alta. L.R. (7th) 1).  \n[3] Both the majori ty and the dissent relied on the relevant factors set out in  R. v. Stephan , \n2017 ABCA 380, 61 Alta. L.R. (6th) 26, rev’d on other grounds  2018 SCC 21, [2018] 1 S.C.R. \n633, but disagreed on their application.  \n[4] At issue before the jury was both the veraci ty and accuracy of the complainant’s own \nmemory of the events relating to the sexual assaults she allegedly suffered as a child. The defence \nargued that these events never took place and challenged the complainant’s recollections as \n2023 SCC 32 (CanLII)\n\n--- Page 5 ---\n \n uneven. Insofar as this  challenged the complainant’s version of events as lacking both credibility \nand reliability, the improper comments of Crown counsel were potentially serious as they touched \non a core issue at the trial.  \n[5] That said, the context of the anecdote considerab ly limited its prejudicial effect. First, \nand unlike Pisani , the personal anecdote was not about an offence or about conduct comparable to \nthe substance of the allegations at issue. Moreover, the anecdote was not a prominent feature of \nthe Crown’s closing address.  \n[6] Furthermore, while defence counsel did object to other aspects of the Crown’s closing \nsubmissions that are not relevant to the appeal, no objection was made to the Crown’s personal \nanecdote. The failure of defence counsel to object to the anec dote is not of course dispositive, but \nit is a factor to be considered in measuring the impact on trial fairness on appeal (see R. v. \nManasseri , 2016 ONCA 703, 132 O.R. (3d) 401, at para.  107).  \n[7] The trial judge did caution the jury not to consider what counsel said as evidence. And \nwhile the trial judge did not undertake specific remedial steps to alert the jury to the improper \ncomments of the Crown, the judge’s observation that jury members should use their “common \nsense understanding of how memories op erate” (A.R., vol.  I, at p.  63) is consonant with the idea \nthat, although improper, the Crown’s anecdote should be read in that light. Nothing would suggest \nthat the charge did not achieve its purpose “to properly equip the jury in the circumstances of the  \ntrial to decide the case according to the law and the evidence” ( R. v. Abdullahi , 2023 SCC 19, at \npara.  72). \n2023 SCC 32 (CanLII)\n\n--- Page 6 ---\n \n [8] In sum, we agree with the view that Crown counsel’s improper anecdote did not render \nthe appellant’s trial unfair.  \n[9] The appeal is dismissed.  \n Judgment accordingly.  \n Solicitors for the appellant:  Sankoff Criminal Law, Edmonton; Wyllie Law, \nVancouver.  \n Solicitor for the respondent:  Alberta Crown Prosecutor Service, Appeals and \nSpecialized Prosecutions Office, Edmonton.  \n Solicitor for the intervener the Director of Public Prosecutions:  Public Prosecution \nService of Canada, Edmonton.  \n Solicitor for the intervener the Attorney General of Ontario: Ministry of the Attorney \nGeneral, Crown Law Office — Criminal , Toronto.  \n Solicitors for the i ntervener the Criminal Trial Lawyers’ Association:  Dawson \nDuckett Garcia & Johnson, Edmonton; Pringle Law, Edmonton.  \n \n2023 SCC 32 (CanLII)\n\n",
    "token_count": 908,
    "start_token": 900,
    "end_token": 1808,
    "total_tokens_in_source": 1808
  },
  {
    "chunk_id": 2,
    "source_file": "2023scc32.txt",
    "text": " SCC 32 (CanLII)\n\n",
    "token_count": 8,
    "start_token": 1800,
    "end_token": 1808,
    "total_tokens_in_source": 1808
  }
]