[
  {
    "chunk_id": 0,
    "source_file": "2023canlii96444.txt",
    "text": "--- Page 1 ---\n \n  \nSUPREME COURT OF CANADA  \n \nCITATION : Canadian \nBroadcasting Corp. v. Manitoba, \n2023 SCC 27    \nAPPEAL HEARD AND JUDGMENT \nRENDERED : October 19, 2023  \nREASONS FOR JUDGMENT : \nNovember  9, 2023  \nDOCKET : 38992  \n \nBETWEEN : \n \nCanadian Broadcasting Corporation  \nAppellant  \n \nand \n \nHis Majesty The King, B.B., spouse of the late M.D., and J.D., in his capacity \nas executor of the estate of the late M.D.  \nRespondents  \n \n- and - \n \nAttorney General of Ontario, Attorney General of British Columbia, Centre \nfor Free Expression, Canadian Association of Journalists, News Media \nCanada, Communications Workers of America/Canada and Ad \nIdem/Canadian Media Lawyers Association  \nInterveners  \n \n \n \nCORAM : Wagner C.J. and Karakat sanis, Côté, Rowe, Martin, Kasirer and Jamal JJ.  \nREASONS   \nFOR JUDGMENT : \n(paras.  1 to 15) The Court  \n2023 SCC 27 (CanLII)\n\n--- Page 2 ---\n \n  \n \nNOTE: This document is subject to editorial revision before its reproduction in final \nform in the Canada Supreme Court Reports . \n \n \n   \n \n  \n2023 SCC 27 (CanLII)\n\n--- Page 3 ---\n \n Canadian Broadcasting Corporation  Appellant  \nv. \nHis Majesty T he King,  \nB.B., spouse of the late M.D., and  \nJ.D., in his capacity as executor of the estate of the late M.D.  Respondents  \nand \nAttorney General of Ontario,  \nAttorney General of British Columbia,  \nCentre for Free Expression,  \nCanad ian Association of Journalists,  \nNews Media Canada , \nCommunications Workers of America/Canada  and \nAd Idem /Canadian Media Lawyers Association  Interveners  \nIndexed as: Canadian Broadcasting Corp . v. Manitoba  \n2023  SCC 27 \nFile No.: 38992.  \n2023: October 19 ; 2023: November 9 . \nPresent: Wagner C.J. and Karakatsanis, Côté, Rowe, Martin, Kasirer and Jamal JJ.  \nON APPEAL  FROM  THE  COURT OF APPEAL OF M ANITOBA  \n2023 SCC 27 (CanLII)\n\n--- Page 4 ---\n \n  Courts — Open court principle — Publication bans — Discretionary limits \non court openness — Important public interest — Privacy — Dignity — Court of \nAppeal ordering publication ban on affidavit filed in criminal proceedings before it — \nMedia representative challenging publication ban — Whether Court of Appeal erred \nin imposing publication ban . \n During wrongful conviction proceedings before the Court of Appeal, an \naccused sought to introduce as new evidence an affidavit concerning the death of a \nwitness involved in those proceedings. The Court of Appeal issued a publication ban \nover the affidavit a nd, in its reasons for judgment, ordered that the publication ban \nremain in effect. The CBC now calls upon the Court to set aside the publication ban.  \n Held : The appeal should be dismissed.  \n The Court of Appeal did not make a reversible error in issuing th e \npublication ban or in ordering that it remain in effect. The publication ban should \ntherefore not be rescinded or varied.  \n Under Sherman  Estate v. Donovan , 2021 SCC 25, the person asking a court \nto exercise discretion in a way that limits the open court principle  must establish that: \n(1) court openness poses a serious risk to an important public interest; (2 ) the order \nsought is necessary to prevent this serious risk to the identified interest because \nreasonably alternative measures will  not prevent this risk; and (3)  as a matter of \nproportionality, the benefits of the order outweigh its negative effects.  \n2023 SCC 27 (CanLII)\n\n--- Page 5 ---\n \n  In this case, the first branch of the Sherman  test is satisfied. There is a \nstrong public interest in protecting the privacy of the spouse of the deceas ed witness, \nand disclosure of the affidavit would reveal highly sensitive and acutely personal \ninformation that would result in an affront to the spouse’s dignity interest in her own \nright. The second branch of the test is also satisfied, as the publicatio n ban is necessary \nto prevent a serious risk to the dignity of the witness’s spouse, the publication ban was \nnot overbroad or vague and there was no reasonable alternative to its terms. Finally, as \nto the third branch, the benefit of the publication ban , which is to protect the dignity",
    "token_count": 1000,
    "start_token": 0,
    "end_token": 1000,
    "total_tokens_in_source": 3526
  },
  {
    "chunk_id": 1,
    "source_file": "2023canlii96444.txt",
    "text": " acutely personal \ninformation that would result in an affront to the spouse’s dignity interest in her own \nright. The second branch of the test is also satisfied, as the publicatio n ban is necessary \nto prevent a serious risk to the dignity of the witness’s spouse, the publication ban was \nnot overbroad or vague and there was no reasonable alternative to its terms. Finally, as \nto the third branch, the benefit of the publication ban , which is to protect the dignity of \nthe witness’s spouse, significantly outweighs its minimal deleterious effect on the right \nof free expression and, by extension, the principle of open and accessible court \nproceedings. The affidavit did not play a role in d etermining that a wrongful conviction \nhad occurred.  \nCases Cited  \n Applied:  Sherman Estate v. Donovan , 2021 SCC 25; referred to:  R. v. \nOstrowski , 2019 MBCA 122; Canadian Broadcasting Corp. v. Manitoba , 2021 SCC \n33; R. v. Ostrowski , 2023 MBCA 6, [2023] 9 W.W.R. 210 . \n APPEAL from a judgment of the Manitoba Court of Appeal  (Beard, \nBurnett and Pfuetzner JJ.A.), 2018 MBCA 125 , 369 C.C.C. (3d) 139 ( sub nom. R. v. \nOstrowski ), [2018] M.J. No.  306 (QL), 2018 CarswellMan 55 0 (WL), ordering inter \nalia that a publication ban remain in effect . Appeal dismissed.  \n2023 SCC 27 (CanLII)\n\n--- Page 6 ---\n \n  Jonathan B. Kroft , K.C., Sean Moreman and Jennifer Soka l, for the \nappellant.  \n Michael Bodner and Joel N. Myskiw , for the respondent His Majesty The \nKing . \n Robert Gosman , for the respondents B.B., spouse of the late M.D., and  \nJ.D., in his capacity as executor of the estate of the late M.D . \n Michael Bernstein , for the intervener the Attorney General of Ontario . \n Lesley Ruzicka , K.C., and Chantelle Rajotte , for the intervener the Attorney \nGeneral of British Columbia . \n Fredrick Schumann and Karen Bernofsky , for the interveners the Centre \nfor Free Expression, the Canadian Association of Journalists, News Media Canada and \nCommunications Workers of America/Canada . \n Iain MacKinnon , for the intervener Ad Idem/Canadian Media Lawyers \nAssociation . \n The following are the reasons for judgment delivered by  \n \n THE COURT —  \n2023 SCC 27 (CanLII)\n\n--- Page 7 ---\n \n [1] At the hearing, the Court unanimously dismissed the appeal, without costs, \nwith reasons to follow. These are t hose reasons.  \n[2] During wrongful conviction proceedings before the Court of Appeal of \nManitoba, an accused sought to introduce as new evidence an affidavit sworn by his \nlawyer concerning the death of a witness involved in those proceedings. On May 28, \n2018, t he Court of Appeal issued a publication ban over the affidavit. In its reasons for \njudgment on the appeal, the court ordered that the publication ban remain in effect \n(2018 MBCA 125, 369 C.C.C. (3d) 139 (“2018 Publication Ban Judgment”)). The \nappellant, th e Canadian Broadcasting Corporation (“CBC”), filed a motion to set aside \nthe publication ban. In 2019, the Court of Appeal held that it did not have jurisdiction \nto hear the motion to set aside the publication because it was functus officio  (2019 \nMBCA 122 (“2019 Jurisdiction Judgment”)). The CBC sought and obtained leave to \nappeal both judgments to this Court.  \n[3] In 2021, this Court heard the appeals from the 2018 Publication Ban \nJudgment and the 2019 Jurisdiction Judgment together. The Court allowed the appea l \nfrom the 2019 Jurisdiction Judgment and remanded to the Court of Appeal the motion \nto have the publication ban set aside. It also adjourned the appeal of the 2018 \nPublication Ban Judgment sine die  (see 2021 SCC 33, which sets out the procedural \nbackgroun d in fuller detail).  \n[4] On January 23, 2023, the Manitoba Court of Appeal rendered judgment on \nthe CBC’s remanded motion to have the publication ban set aside (2023 MBCA 6, \n2023 SCC 27 (Can",
    "token_count": 1000,
    "start_token": 900,
    "end_token": 1900,
    "total_tokens_in_source": 3526
  },
  {
    "chunk_id": 2,
    "source_file": "2023canlii96444.txt",
    "text": " publication ban set aside. It also adjourned the appeal of the 2018 \nPublication Ban Judgment sine die  (see 2021 SCC 33, which sets out the procedural \nbackgroun d in fuller detail).  \n[4] On January 23, 2023, the Manitoba Court of Appeal rendered judgment on \nthe CBC’s remanded motion to have the publication ban set aside (2023 MBCA 6, \n2023 SCC 27 (CanLII)\n\n--- Page 8 ---\n \n [2023] 9 W.W.R. 210 (“Judgment on Remand”)). The Court of Appeal dismissed the \nmotion to reconsider the publication ban. First, the Court of Appeal denied the CBC \nstanding to bring the motion as it had notice of the ban. Second, the Court of Appeal \ndeclined to hear the motion as the CBC failed to act with due dispatch in seeking to set \nthe ban aside. In addition, the Court of Appeal wrote that in the event that it was wrong \nto deny standing to the CBC or to decline to hear the motion because of the delay, it \nwould nonetheless have refused to reconsider the ban. Applying the  test in Sherman \nEstate v. Donovan , 2021 SCC 25, the Court of Appeal was of the view that the ban was \nnecessary to prevent a serious risk to privacy, and in particular to dignity, an important \npublic interest. Moreover, the benefits of the publication ban outweigh any negat ive \neffects on court openness.  \n[5] While the Judgment on Remand has not been appealed to this Court, in \ncoming to our decision we have had the benefit of the Court of Appeal’s reasons. Those \nreasons explain why, in light of the principles set forth in Sherman , the publication ban \nwas justified notwithstanding the open court principle.  \n[6] The CBC now calls upon this Court to decide the appeal of the \n2018  Publication Ban Judgment for which leave was granted in 2020 and which was \nadjourned sine die  in 2021. The parti es were invited to provide additional written \nsubmissions and a new hearing was held to address the implications of Sherman , which \nwas decided after the initial hearing of the two appeals before this Court in 2021.  \n2023 SCC 27 (CanLII)\n\n--- Page 9 ---\n \n [7] For the reasons that follow, we are unani mously of the view that the appeal \nfrom the 2018 Publication Ban Judgment should be dismissed. The Court of Appeal \ndid not commit a reversible error in issuing the publication ban and ordering that it \nremain in effect in 2018.  \n[8] Under Sherman , “the person as king a court to exercise discretion in a way \nthat limits the open court presumption must establish that: (1) court openness poses a \nserious risk to an important public interest; (2) the order sought is necessary to prevent \nthis serious risk to the identifi ed interest because reasonably alternative measures will \nnot prevent this risk; and (3) as a matter of proportionality, the benefits of the order \noutweigh its negative effects” (para.  38). Each branch of the test is deserving of \ncomment.  \n[9] We agree with the view that, under the first branch of the Sherman  test, \nthere is a strong public interest in protecting the privacy of the witness’s spouse with \nrespect to the witness’s death in order to prevent an affront to the spouse’s dignity (see \nJudgment on Remand, a t para.  77). We agree that personal information in the affidavit \nis a direct affront to the dignity of the spouse in her own right. In the words of the Court \nof Appeal, the information “goes to the core of both the witness and the spouse as \nhuman beings at  their most vulnerable” (para.  77). In this case, disclosure of the \naffidavit would reveal highly sensitive and acutely personal information that would \ndirectly engage the spouse’s dignity interest.  \n2023 SCC 27 (CanLII)\n\n--- Page 10 ---\n \n [10] For the purposes of measuring the relevant dignity intere st, it is sufficient \nto observe that the dignity of the witness’s spouse is compromised. It is not necessary \nto decide the question of whether there is a dignity interest for the deceased witness to \njustify the publication ban here. The first branch of the  Sherman  test is satisfied because \ncourt openness would pose a serious risk to the spouse’s dignity as an important public \ninterest.  \n[11] We also agree that the publication ban is necessary to prevent a serious risk \nto the important public interest of protectin g the dignity of the witness’s spouse (see \nJudgment on Remand,",
    "token_count": 1000,
    "start_token": 1800,
    "end_token": 2800,
    "total_tokens_in_source": 3526
  },
  {
    "chunk_id": 3,
    "source_file": "2023canlii96444.txt",
    "text": " \nto decide the question of whether there is a dignity interest for the deceased witness to \njustify the publication ban here. The first branch of the  Sherman  test is satisfied because \ncourt openness would pose a serious risk to the spouse’s dignity as an important public \ninterest.  \n[11] We also agree that the publication ban is necessary to prevent a serious risk \nto the important public interest of protectin g the dignity of the witness’s spouse (see \nJudgment on Remand, at para.  78); that the ban was not overbroad or vague, and should \nbe permanent (para.  80); and that there was no reasonable alternative to the terms of \nthe publication ban (para.  83). In partic ular, as the Court of Appeal noted in 2023, it \nwould be easy to identify the witness if parts of the affidavit were to be disclosed. In \nthe circumstances, the Court of Appeal was entitled to conclude in 2018 that publishing \ndetails of the affidavit without  the witness’s name would risk associating the \ninformation with the witness and making the publication ban moot (see Judgment on \nRemand, at para.  81). The second branch of the test is therefore satisfied.  \n[12] Finally, as to the third branch, we agree with the Court of Appeal in the \nJudgment on Remand that the benefits of the 2018 publication ban significantly \noutweigh its minimal deleterious effect on the right of free expression and, by \nextension, the principle of open and accessible court proceedings. The ben efit of the \npublication ban is to protect the dignity of the witness’s spouse as already explained, \n2023 SCC 27 (CanLII)\n\n--- Page 11 ---\n \n whereas the publication ban has a minimal negative effect on the right of free \nexpression and the open court principle (paras.  92-93). The affidavit did not  relate to \nthe wrongful conviction or the legitimacy of the accused’s appeal before the Court of \nAppeal in 2018. As the Court of Appeal observed in the Judgment on Remand, the \naffidavit was “capable of proving nothing” (para.  91). Here, the affidavit was n ot \nadmitted as evidence in the wrongful conviction proceedings and, therefore, did not \nplay a role in determining that a wrongful conviction had occurred.  \n[13] In light of the foregoing, no reversible error was made in issuing the \n2018  publication ban or orderi ng it remain in effect and it should not be rescinded or \nvaried in the circumstances.  \n[14] None of the parties sought an order for costs.  \n[15] For the foregoing reasons, we dismissed the appeal without costs.  \n Appeal dismissed without costs.  \n Solicitors for the appellant: MLT Aikins, Winnipeg; Canadian \nBroadcasting Corporation , Toronto . \n Solicitor for the respondent  His Majesty The King : Department of Justice \nManitoba, Constitutional Law Section , Winnipeg.  \n2023 SCC 27 (CanLII)\n\n--- Page 12 ---\n \n  Solicitors for the respondents B.B., spouse of the late M.D., and  J.D., in \nhis capacity as executor of the estate of the late M.D .: Robert Gosman Law \nCorporation, Winnipeg.  \n Solicitor for the intervener the Attorney General of Ontario: Crown Law \nOffice — Criminal, Ministry of the Attorney Gen eral, Toronto.  \n Solicitor for the intervener the Attorney General of British Columbia: \nAttorney General of British Columbia , Prosecution Service , Victoria.  \n Solicitors for the interveners the Centre for Free Expression, the Canadian \nAssociation of Journali sts, News Media Canada and Communications Workers of \nAmerica/Canada : Stockwoods, Toronto.  \n Solic itors for the intervener Ad Idem /Canadian Media Lawyers \nAssociation: Linden & Associates, Toronto.  \n2023 SCC 27 (CanLII)\n\n",
    "token_count": 826,
    "start_token": 2700,
    "end_token": 3526,
    "total_tokens_in_source": 3526
  }
]