[
  {
    "chunk_id": 0,
    "source_file": "2023scc30.txt",
    "text": "--- Page 1 ---\n \n  \nSUPREME COURT OF CANADA  \n \nCITATION : R. v. Zacharias, 2023 \nSCC  30   \nAPPEAL HEARD : May 15, 2023  \nJUDGMENT RENDERED : \nDecember  1, 2023  \nDOCKET : 40117  \n \nBETWEEN : \n \nGeorge Zacharias  \nAppellant  \n \nand \n \nHis Majesty The King  \nRespondent  \n \n- and - \n \nAttorney General of Ontario and Attorney General of Alberta  \nInterveners  \n \n \n \nCORAM : Côté, Rowe, Martin, Kasirer and O’Bonsawin JJ.  \n \nJOINT REASONS :  \n(paras. 1 to 76) Rowe and O’Bonsawin JJ.  \n  \nCONCURRING \nREASONS :  \n(paras. 77 to 105) Côté J.  \n  \n2023 SCC 30 (CanLII)\n\n--- Page 2 ---\n \n JOINT DISSENTING \nREASONS :  \n(paras. 106 to 161)  Martin and Kasirer JJ.  \n \n \nNOTE: This document is subject to editorial revision before its reproduction in final \nform in the Canada Supreme Court Reports . \n   \n \n  \n2023 SCC 30 (CanLII)\n\n--- Page 3 ---\n \n George Zacharias  Appellant  \nv. \nHis Majesty The King  Respondent  \nand \nAttorney General of Ontario and  \nAttorney General of Alberta  Interveners  \nIndexed as: R. v. Zacharias  \n2023  SCC  30 \nFile No.: 40117.  \n2023:  May 15; 2023:  December  1. \nPresent:  Côté, Rowe, Martin, Kasirer  and O ’Bonsawin  JJ. \nON APPEAL  FROM  THE  COUR T OF APPEAL OF ALBER TA \n Constitutional law — Charter of Rights — Search and seizure — Arbitrary \ndetention — Consequential breaches — Remedy — Exclusion of evidence — Police \nsuspecting illegal drug activity following lawful traffic stop of accused — Police \n2023 SCC 30 (CanLII)\n\n--- Page 4 ---\n \n detaining accused and co nducting several searches — Accused arrested and charged \nwith drug related offences — Trial judge finding initial search and investigative \ndetention breached accused’s Charter rights but declining to exclude evidence — \nWhether arrests and searches conseque ntial to initial violation further breached \nCharter — Whether breaches warrant exclusion of evidence — Canadian Charter of \nRights and Freedoms, ss.  8, 9, 24(2).  \n Z was pulled over in a traffic stop because of a burnt -out light and illegally \ntinted windows.  The police officer made several observations that resulted in placing \nZ under investigative detention and calling for a sniffer dog to scan for drugs. After a \npat-down search, the officer placed Z in a police vehicle until the sniffer dog arrived. \nThe dog  signalled that drugs were present and Z was arrested for possession of a \ncontrolled substance. The police then searched Z’s truck, including duffel bags located \nin the truck box under a tonneau cover. The police discovered a large quantity of \ncannabis and  cash. Z was arrested for possession for the purpose of trafficking, \nhandcuffed, and driven to a police detachment. He was then searched and arrested for \npossession of proceeds of crime over  $5,000.  \n Z alleged that the police had breached his rights under ss. 8 and 9 of the \nCharter  during the investigation and that the drug evidence seized by the police should \nbe excluded under s.  24(2) of the Charter . The trial judge found that the sniffer dog \nsearch and investigative detention breached Z’s ss.  8 and  9 Charter rights but held that \nthe evidence should not be excluded under s.  24(2) because excluding the evidence \n2023 SCC 30 (CanLII)\n\n--- Page 5 ---\n \n would bring the administration of justice into disrepute. Z was convicted of possession \nof 101.5 pounds of marijuana for the purpose of trafficking.  He appealed, arguing that \nthe trial judge erred by failing to consider the consequences that flowed from the \nunlawful investigative detention and sniffer dog search.  A majority of the Court of \nAppeal dismissed the appeal.   \n Held  (Martin and Kasirer  JJ. di ssenting): The appeal should be dismissed.  \n Per Rowe  and O’Bonsawin  JJ.: The arrests and the searches incident to \narrest following the sniffer dog search and investigative detention  constituted breaches \nof",
    "token_count": 1000,
    "start_token": 0,
    "end_token": 1000,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 1,
    "source_file": "2023scc30.txt",
    "text": "the trial judge erred by failing to consider the consequences that flowed from the \nunlawful investigative detention and sniffer dog search.  A majority of the Court of \nAppeal dismissed the appeal.   \n Held  (Martin and Kasirer  JJ. di ssenting): The appeal should be dismissed.  \n Per Rowe  and O’Bonsawin  JJ.: The arrests and the searches incident to \narrest following the sniffer dog search and investigative detention  constituted breaches \nof Z’s rights under ss.  8 and 9 of the Charter . They must be considered when \ndetermining whether the evidence should be excluded under s.  24(2) of the Charter . \nHowever, absent additional or independent state misconduct, a breach that is entirely \nconsequential on an initial violation is unlikely to significan tly increase the overall \nseriousness of the Charter -infringing state conduct. In the instant case, additional \nCharter breaches occurred in a sequence of events: an arrest followed as a consequence \nof the sniffer dog search, searches followed incident to arrest, and additional arrests \nfollowed. These additional consequential breaches do not raise the seriousness of the \nstate conduct as these breaches were breaches only because of the officer’s \nmiscalculation in assessing the grounds for suspicion; the focal point under s.  24(2) \nremains the initial breaches that set the sequence of state conduct into motion. \nBalancing the Grant factors applicable to determine whether evidence should be \nexcluded under s. 24(2), the evidence should not be excluded . \n2023 SCC 30 (CanLII)\n\n--- Page 6 ---\n \n  The Criminal Code  sets out strict standards for when police may exercise \npowers of arrest. The police must demonstrate reasonable and probable grounds to \nbelieve that the person arrested committed an offence. Where the arrest is without a \nwarrant, the arresting officer  must honestly believe that the suspect committed the \noffence in question and those subjective grounds must be justif iable from an objective \npoint of view. Reasonable grounds however cannot be supplied by actions that involved \nviolations of the Charter . Where grounds for arrest are based on evidence that was \nunlawfully obtained, the court must excise this evidence from t he factual matrix and \ndetermine whether the police had reasonable and probable grounds for arrest having \nregard to the totality of the circumstances known to the officer based on the remaining \nevidence. Warrantless arrests are often carried out in dynamic situations and police are \nnot required to inquire into the constitutionality of prior investigative steps before \nacting on the information they yielded. However, they are required to consider whether \nthey are acting within constitutional limits when they a ct. Canadians have a legitimate \nexpectation that the police will know and comply with the law, especially the Charter. \nIn the case of an arrest made without a warrant, it is even more important for the police \nto demonstrate they had reasonable and probable  grounds for the arrest.   \n In a situation of linked or cascading Charter breaches, a subsequent arrest \nmay be unlawful only as a consequence of the initial breach or breaches that preceded \nit. An arrest that can be viewed only as a consequential breach is distinct from state \naction that is characterized by additional or independent misconduct. An unlawful \narrest that is a consequential breach must be factored into the first and second stages of \n2023 SCC 30 (CanLII)\n\n--- Page 7 ---\n \n the s. 24(2) Grant analysis, but is unlikely to significantly i mpact the overall \nseriousness of the Charter -infringing state conduct absent additional state misconduct. \nThe first Grant factor asks whether the Charter ‑infringing state conduct is so serious \nthat the court must dissociate itself from it. In the absence o f additional state \nmisconduct, the focal point for evaluating seriousness is likely to remain the initial \nbreach.  In these circumstances and where the police honestly believed they were \nproceeding lawfully, subsequent state conduct should be situated on th e less serious \nend of the scale of culpability. The second Grant  factor looks to the Charter -protected \ninterests of the accused engaged by the infringed right and the degree to which the \nviolation impacted on those interests. A consequential breach will be  most relevant at \nthis stage. When additional rights and breaches of those rights are factored into the \nanalysis, there will necessarily be a more significant impact. Consideration of all \nbreaches is necessary to get an accurate picture of the effects of t he breaches. To fail to \nhave regard to the impact of an arrest that occurred as a consequence of a preceding \nCharter breach would fail to take into account all the circumstances. The third Grant  \nfactor examines society’s interest in an adjud",
    "token_count": 1000,
    "start_token": 900,
    "end_token": 1900,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 2,
    "source_file": "2023scc30.txt",
    "text": " most relevant at \nthis stage. When additional rights and breaches of those rights are factored into the \nanalysis, there will necessarily be a more significant impact. Consideration of all \nbreaches is necessary to get an accurate picture of the effects of t he breaches. To fail to \nhave regard to the impact of an arrest that occurred as a consequence of a preceding \nCharter breach would fail to take into account all the circumstances. The third Grant  \nfactor examines society’s interest in an adjudication of the case on the merits. \nConsideration of additional breaches may not change the analysis for this Grant  factor.  \n In the instant case, the state cannot rely on the evidence unlawfully \nobtained from the sniffer dog search to satisfy the reasonable and probable g rounds \nrequirement for Z’s subsequent arrests.  The police breached ss.  8 and 9 of the Charter \nin conducting the sniffer dog search and by holding Z in investigative detention while \nwaiting for a sniffer dog to arrive. The arresting officer’s subsequent sub jective belief \n2023 SCC 30 (CanLII)\n\n--- Page 8 ---\n \n that Z was in possession of a controlled substance relied primarily on the results of the \nsniffer dog search; therefore, the first arrest for possession was unlawful. Because the \nfirst arrest was unlawful, the subsequent searches breached s.  8 of the Charter  and the \nsecond and third arrests constituted breaches of s. 9 of the Charter . The placement of \nZ in the police vehicle in handcuffs and at the police detachment were continuations of \nthe s. 9 breaches.  \n Even considering the consequential breaches, the first Grant  factor does \nnot strongly favour exclusion of the evidence.  The consequential Charter breaches are \nnot characterized by additional or independent misconduct and were not \nintentional.  The focal point remains  the initial breach, which was inadvertent, not \nwilful, and which does not show a pattern or attitude of disregard for Charter rights or \nthe law. The second Grant factor moderately favours exclusion. The sniffer dog search \nwas brief, minimally intrusive an d followed a lawful stop and detention for traffic \ninfractions. However, as a result, Z was arrested, handcuffed, brought to the police \nstation, detained for several hours and the police obtained significant evidence against \nhim. The arrests and searches i ncident to arrest resulted in more significant impact on \nZ’s Charter -protected interests . The third Grant factor strongly favours admission of \nthe evidence.  The evidence was real, reliable, and crucial to the Crown’s case. Given \nthe large quantity of canna bis, the offence is serious and there is a strong societal \ninterest in adjudication of the case on its merits. Balancing the Grant factors, the first \ntwo are insufficient to outweigh the third; thus, overall the circumstances favour \nadmission of the eviden ce.  \n2023 SCC 30 (CanLII)\n\n--- Page 9 ---\n \n  Per Côté  J.: There is agreement that the appeal should be dismissed. \nHowever, the proposition that the state cannot rely on unlawfully obtained evidence to \nsatisfy the reasonable and probable grounds requirement for arrest is difficult to \nreconcile w ith the longstanding s. 24(2) Charter jurisprudence and the framework for \nwarrantless arrests set out in R. v. Storrey , [1990] 1 S.C.R. 241. A Charter breach that \nleads to incriminating evidence being uncovered will inevitably result in an arrest or \nother investigative steps by the police. Absent independent or additional police \nmisconduct, the Court has never treated such arrests or investigative steps as separate \nCharter breaches in its s.  24(2) analysis. A decision to arrest must be made quickly in \nvolat ile and rapidly changing situations based on available information which is often \nless than exact or complete. In the instant case, the circumstances known to the \narresting officer at the time of the arrest included the sniffer dog’s clear and \nunequivocal indication of controlled substances in Z’s vehicle. The focus of the s.  24(2) \nanalysis should be  on the investigative detention while awaiting the arrival of the dog \nfor the sniffer search.  The presence of additional breaches was not argued at trial and \nhas little, if any, impact on the s.  24(2) analysis.  \n The reasonable and probable grounds standard for a warrantless arrest is \nbased on the totality of the circumstances known to the officer at the time of the arrest . \nThe analysis under s. 24(2) must be cond ucted from the perspective of a reasonable \nperson standing in the shoes of the arresting officer. Operating after -the-fact,",
    "token_count": 1000,
    "start_token": 1800,
    "end_token": 2800,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 3,
    "source_file": "2023scc30.txt",
    "text": " was not argued at trial and \nhas little, if any, impact on the s.  24(2) analysis.  \n The reasonable and probable grounds standard for a warrantless arrest is \nbased on the totality of the circumstances known to the officer at the time of the arrest . \nThe analysis under s. 24(2) must be cond ucted from the perspective of a reasonable \nperson standing in the shoes of the arresting officer. Operating after -the-fact, automatic \nexcision of unconstitutionally  obtained information would nullify the subjective focus \nby artificially altering the inform ation on which the arresting officer relied at the time. \n2023 SCC 30 (CanLII)\n\n--- Page 10 ---\n \n It is artificial and inconsistent with the reasonable and probable grounds standard to \nhold that an arrest made based on clear and reliable evidence of a crime is unlawful. \nThis understanding is why the Court has declined to apply the logic behind excision to \nthe context of warrantless arrests. To classify all subsequent police conduct as \nCharter -infringing merely because it flows from the results of an initial breach comes \ndangerously close to the fr uit of the poisoned tree doctrine eschewed by s.  24(2).  \n In the instant case, all police conduct subsequent to the sniff search was \nbased on an intervening discovery of incriminating evidence. The focus of the first \nGrant factor is on misconduct from which  the court should be concerned to dissociate \nitself. An arrest made on the basis of clear and reliable evidence of a crime is not \nmisconduct from which the court should be concerned to dissociate itself. To hold \notherwise artificially distorts the s.  24(2)  analysis and represents a shift towards \nautomatic exclusionary rules that have been rejected. The trial judge correctly \ncharacterized the arresting officer’s failure to meet the reasonable suspicion standard \nas miniscule. That conduct only weakly favours exclusion; its impact on Z was \nmoderate; and the evidence is highly reliable and integral to the Crown’s case. On \nbalance, the drug evidence should not be excluded and Z’s conviction should be upheld.  \n Per Martin  and Kasirer  JJ. (dissenting): The appeal sh ould be allowed. \nSection 24(2) of the Charter  directs courts to have regard to all the circumstances in \ndetermining whether admitting evidence would bring the administration of justice into \ndisrepute. Consequential, linked or cascading breaches necessarily  result in more \n2023 SCC 30 (CanLII)\n\n--- Page 11 ---\n \n significant impacts on the Charter -protected interests of an accused. All such breaches \nmust be given weight under the Grant analysis. Section 24(2) mandates assessing the \ncumulative, and potentially compounding, seriousness of all of the conduct related to \neach of the violations at issue. Applying this approach, s.  24(2) directs that the evidence \nshould be excluded.  \n The first  line of inquiry mandated by Grant is an evaluation of the \nseriousness of the state conduct. Seriousness is focused on the rule of law. All state \naction that violates the Charter necessarily deviates from the rule of law. However, not \nall conduct that viol ates the Charter  deviates from the rule of law to the same extent. \nThere is a sliding scale or spectrum. Relevant considerations that may inform the \nassessment of the gravity of the offending conduct include the extent to which the \nconduct reflects deliber ate disregard for Charter standards, whether the conduct was \npart of a pattern and the social values that underlie the Charter rights that were violated. \nThe full range of relevant values entrenched in the Charter  should be considered, and \nwhere multiple r ights are violated, the court must consider how the state conduct \nimplicates each underlying value and how those values interact. All Charter -infringing \nstate conduct must be factored into the analysis, therefore the seriousness of conduct \nrelated to all b reaches must be considered even if some of them may be said to have \nbeen caused by earlier Charter  violations. To treat consequential breaches as having an \ninconsequential effect on the seriousness inquiry would be a departure from settled law. \nBreaches th at, in isolation, may appear minor or technical can contribute meaningfully \nto the seriousness of the misconduct that a judge must consider when deciding whether \n2023 SCC 30 (CanLII)\n\n--- Page 12 ---\n \n to admit or exclude evidence under s.  24(2). Thus, it would be an error of law to decline \nto a nalyze the extent to which each consequential breach reflects serious \nCharter -infringing state conduct. A cumulative approach is mandated by the emphasis \nthat the Grant analysis gives to the tot",
    "token_count": 1000,
    "start_token": 2700,
    "end_token": 3700,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 4,
    "source_file": "2023scc30.txt",
    "text": " meaningfully \nto the seriousness of the misconduct that a judge must consider when deciding whether \n2023 SCC 30 (CanLII)\n\n--- Page 12 ---\n \n to admit or exclude evidence under s.  24(2). Thus, it would be an error of law to decline \nto a nalyze the extent to which each consequential breach reflects serious \nCharter -infringing state conduct. A cumulative approach is mandated by the emphasis \nthat the Grant analysis gives to the totality of the circumstances. The Court’s \njurisprudence has neve r suggested that a relationship between two breaches eliminates \nthe need to assess their cumulative seriousness.  A sequence of state conduct may \nundermine the rule of law more gravely than would each action, considered \nindividually. The analysis is not a m athematical exercise and there is no necessary \nrequirement that the seriousness of the whole be the sum of the constituent parts.  \n In the instant case, with respect to the first Grant  line of inquiry, the initial \nunreasonable search may not have been in it self grave: the sniffer dog search and initial \ninvestigative detention breached Charter standards but inadvertently and without \nnegligence, and a systemic failing was not evident in the record. However that does not \nexhaust the relevant considerations. Inc reasingly invasive steps, which represent \nprogressively more serious ways in which the state conduct undermined the rule of law, \nwere taken at each stage of the police action. The subsequent breaches at issue in this \ncase include the pat down search and th e search of the truck and of the duffle bags. In \naddition, the initial detention and each of the three arrests violated s.  9. Further, \nconfinement in a police vehicle, handcuffing, and being taken to the detachment \nconstituted arbitrary detentions. Thus, w hile the subsequent breaches did not \ndeliberately violate Charter rights, the entire course of conduct does reflect serious \nstate misconduct. On the spectrum of seriousness, the conduct at issue pulls between \n2023 SCC 30 (CanLII)\n\n--- Page 13 ---\n \n moderately and strongly towards exclusion, rest ing closer to a strong pull than a \nmoderate one.  \n The second Grant line of inquiry considers the seriousness of the impact \nof the Charter  breaches on the Charter -protected interests of the accused. Under this \nline of inquiry, the cumulative seriousness of the impacts on the accused’s \nCharter -protected interests flowing from the same state conduct considered under the \nfirst line of inquiry should be assessed. In the instant case, the impacts were substantial \nand they increased in severity at each stage of in terference.  The privacy -compromising \nimpact of an unreasonable vehicle search will generally militate in favour of exclusion, \nnotwithstanding the fact that a vehicle attracts a lesser expectation of privacy than a \ndwelling house. More substantial was the i mpact of police officers’ opening of Z’s \nduffel bags. Opening duffel bags covered by a tonneau in the box of the truck \nsignificantly intruded upon Z’s privacy interests. Moreover, t he breaches of s.  9 were \nsubstantial and prolonged. Z was handcuffed, confi ned to a police vehicle, and arrested \nthree times. He was unlawfully detained for approximately seven hours, including \nseveral hours in the police detachment. These sustained deprivations had substantial \nimpacts on Z’s liberty, autonomy and bodily integrit y. Accordingly, the second line of \ninquiry pulls strongly in favour of exclusion of the evidence.  \n Finally, the third Grant line of inquiry considers whether the truth -seeking \nfunction of the criminal trial process would be better served by admission of th e \nevidence or by its exclusion. In the instant case, the evidence is highly reliable and is \n2023 SCC 30 (CanLII)\n\n--- Page 14 ---\n \n undoubtedly critical to the Crown’s case. The offences are serious, in view of the very \nlarge quantity of drugs at issue. Accordingly, the third line of inquiry str ongly favours \nthe admission of the evidence.  \n On balance, however, the third factor is not enough to overwhelm the \ncumulative seriousness of the Charter -infringing conduct along with the impact on Z’s \nCharter -protected interests. In these circumstances, t he administration of justice would \nbe brought into disrepute by the admission of the evidence. The evidence should \ntherefore be excluded.  \nCases Cited  \nBy Rowe  and O’Bonsawin  JJ. \n Overruled: R. v.  Love , 2022 ABCA 269, [2023] 1 W.W.R. 296; R. v. \nJennings , 2018 ON",
    "token_count": 1000,
    "start_token": 3600,
    "end_token": 4600,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 5,
    "source_file": "2023scc30.txt",
    "text": " -protected interests. In these circumstances, t he administration of justice would \nbe brought into disrepute by the admission of the evidence. The evidence should \ntherefore be excluded.  \nCases Cited  \nBy Rowe  and O’Bonsawin  JJ. \n Overruled: R. v.  Love , 2022 ABCA 269, [2023] 1 W.W.R. 296; R. v. \nJennings , 2018 ONCA 260, 45 C.R. (7th) 224; applied: R. v. Grant , 2009 SCC 32, \n[2009] 2 S.C.R. 353; considered: R. v. Storrey , [1990] 1 S.C.R. 241; R. v. Monney  \n(1997), 153 D.L.R. (4th) 617, rev’d on other grounds [1999] 1 S.C.R. 652; R. v. \nMacEachern , 2007 NSCA 6 9, 255 N.S.R. (2d) 180; R. v. Blanchard , 2011 NLCA 33, \n308 Nfld. & P.E.I.R. 91; R. v. Pelucco , 2015 BCCA 370, 327 C.C.C. (3d) 151; R. v. \nChaisson , 2006 SCC 11, [2006] 1 S.C.R. 415; referred to:  R. v. J.F., 2022 SCC 17; \nGuindon v. Canada , 2015 SCC 41, [2015 ] 3 S.C.R. 3; R. v. Beaver , 2022 SCC 54; R. \nv. Feeney , [1997] 2 S.C.R. 13; R. v. Stillman , [1997] 1 S.C.R. 607; R. v. Caslake , [1998] \n1 S.C.R. 51; R. v. Tim , 2022 SCC 12; R. v. Grant , [1993] 3 S.C.R. 223; Kosoian v. \n2023 SCC 30 (CanLII)\n\n--- Page 15 ---\n \n Société de transport de Montréal , 2019 SCC 59, [2019] 4 S.C.R. 335; R. v. McGuffie , \n2016 ONCA 365, 131 O.R. (3d) 643; R. v. Lambert , 2020 NSPC 37, 472 C.R.R. (2d) \n1, aff’d 2023 NSCA 8 ; R. v. Lauriente , 2010 BCCA 72, 251 C.C.C. (3d) 492; R. v. \nKossick , 2017 SKPC 67, 392 C.R.R. (2d) 250, aff’d 2018 SKCA 55, 365 C.C.C. (3d) \n186; R. v. White , 2022 NSCA 61, 419 C.C.C. (3d) 123; R. v. Loewen , 2018 SKCA 69, \n[2018] 12 W.W.R. 280; R. v. Reilly , 2021 SCC 38; R. v. Au -Yeung , 2010 ONSC 2292, \n209 C.R.R. (2d) 140; R. v. McColman , 2023 SCC 8; R. v. Vu , 2013 SCC 60, [2013] 3 \nS.C.R. 657; R. v. Chehil , 2013 SCC 49, [2013] 3 S.C.R. 220 ; R. v. MacKenzie , 2013 \nSCC 50, [2013] 3 S.C.R. 250; R. v. Cole , 2012 SCC 53, [2012] 3 S.C.R. 34; R. v. Le , \n2019 SCC 34, [2019] 2 S.C.R. 692; R. v. Harrison , 2009 SCC 34, [2009] 2 S.C.R. 494 . \nBy Côté  J. \n Considered: R. v. Storrey , [1990] 1 S.C.R. 241; R. v. Grant , 2009",
    "token_count": 1000,
    "start_token": 4500,
    "end_token": 5500,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 6,
    "source_file": "2023scc30.txt",
    "text": ".C.R. 34; R. v. Le , \n2019 SCC 34, [2019] 2 S.C.R. 692; R. v. Harrison , 2009 SCC 34, [2009] 2 S.C.R. 494 . \nBy Côté  J. \n Considered: R. v. Storrey , [1990] 1 S.C.R. 241; R. v. Grant , 2009 SCC 32 , \n[2009] 2 S.C.R. 353 ; R. v. Harrison , 2009 SCC 34 , [2009] 2 S.C.R. 494; R. v. \nMcColman , 2023 SCC 8; R. v. MacKenzie , 2013 SCC 50, [2013] 3 S.C.R. 250; R. v. \nLove , 2022 ABCA 269, [2023] 1 W.W.R. 296; R. v. Jennings , 2018 ONCA 260, 45 \nC.R. (7th) 224; referred to:  R. v. Tim , 2022 SCC 12; R. v. Beaver , 2022 SCC 54; R. v. \nGolub  (1997), 34 O.R. (3d) 743; R. v. Feeney , [1997] 2 S.C.R. 13; R. v. Stillman , [1997] \n1 S.C.R. 607; R. v. Caslake , [1998] 1 S.C.R. 51; R. v. Côté , 2011 SCC 46, [2011] 3 \nS.C.R. 215; R. v. Aucoin , 2012 SCC 66, [2012] 3 S.C.R. 408; R. v. Paterson , 2017 SCC \n15, [2017] 1 S.C.R. 202; R. v. Le , 2019 SCC 34 , [2019] 2 S.C.R. 692; R. v. Lafrance , \n2022 SCC 32; R. v. Chehil , 2013 SCC 49, [2013] 3 S.C.R. 220; R. v. Kang -Brown , \n2023 SCC 30 (CanLII)\n\n--- Page 16 ---\n \n 2008 SCC 18, [2008] 1 S.C.R. 456; R. v.  A.M. , 2008 SCC 19, [2008] 1 S.C.R. 569; \nKosoian v. Société de transport de Montréal , 2019 SCC 59, [2019] 4 S.C.R. 335; Frey \nv. Fedoruk , [1950] S.C.R. 517; R. v. Grant , [1993] 3 S.C.R. 223; R. v. Reilly , 2021 SCC \n38. \nBy Martin and Kasirer  JJ. (dissenting)  \n R. v. Plaha  (2004), 188 C.C.C. (3d) 289; R. v. Grant , 2009 SCC 32, [2009] \n2 S.C.R. 353; R. v. Collins , [1987] 1 S.C.R. 265; R. v. Simmons , [1988] 2 S.C.R. 495; \nR. v. Le , 2019 SCC 34, [2019] 2 S.C.R. 692; R. v. Tim , 2022 SCC 12; R. v. Beaver , \n2022 SCC 54; R. v. McColman , 2023 SCC 8; R. v. Harrison , 2009 SCC 34, [2009] 2 \nS.C.R. 494; Hunter v. Southam Inc. , [1984] 2 S.C.R. 145; Re B.C. Motor Vehicle Act , \n[1985] 2 S.C.R. 486; Kosoian v. Société de transport de Montréal , 2019 SCC 59, \n[2019] 4 S.C.R. 335; Dedman v. The Queen , [1985] 2 S.C.R. 2; R. v. Sharma , [1993] 1 \nS.C.R. 650; R. v. Paterson , 2017 SCC 15",
    "token_count": 1000,
    "start_token": 5400,
    "end_token": 6400,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 7,
    "source_file": "2023scc30.txt",
    "text": "[1985] 2 S.C.R. 486; Kosoian v. Société de transport de Montréal , 2019 SCC 59, \n[2019] 4 S.C.R. 335; Dedman v. The Queen , [1985] 2 S.C.R. 2; R. v. Sharma , [1993] 1 \nS.C.R. 650; R. v. Paterson , 2017 SCC 15, [2017] 1 S.C.R. 202; Hamel v. R. , 2021 \nQCCA 801, 72 C.R. (7th) 132; R. v. Oakes , [1986] 1 S.C.R. 103; R. v. Lyons , [1987] 2 \nS.C.R. 309; R. v. Reilly , 2021 SCC 38; R. v. Jennings , 2018 ONCA 260, 45 C.R. (7 th) \n224; R. v. Love , 2022 ABCA 269, [2023] 1 W.W.R. 296; R. v. Lauriente , 2010 BCCA \n72, 251 C.C.C. (3d) 492; R. v. Boudreau -Fontaine , 2010 QCCA 1108; R. v. Poirier , \n2016 ONCA 582, 131 O.R. (3d) 433; R. v. Kossick , 2018 SKCA 55, 365 C.C.C. (3d) \n186; R. v. Culotta , 2018 ONCA 665, 142 O.R. (3d) 241, aff’d 2018 SCC 57, [2018] 3 \nS.C.R. 597 ; R. v. Adler , 2020 ONCA 246, 388 C.C.C. (3d) 114; R. v. White , 2022 \nNSCA 61, 419 C.C.C. (3d) 123; R. v. Greffe , [1990] 1 S.C.R. 755; R. v. Vu , 2013 SCC \n2023 SCC 30 (CanLII)\n\n--- Page 17 ---\n \n 60, [2013] 3 S.C.R. 65 7; R. v. Lafrance , 2022 SCC 32; R. v. Huynh , 2013 ABCA 416, \n8 C.R. (7th) 146; R. v. Mann , 2004 SCC 52, [2004] 3 S.C.R. 59; R. v. Shinkewski , 2012 \nSKCA 63 , 289 C.C.C. (3d) 145; R. v. Askov , [1990] 2 S.C.R. 1199; R. v. Côté , 2011 \nSCC 46, [2011] 3 S.C.R. 215; R. v. Spencer , 2014 SCC 43, [2014] 2 S.C.R. 212; R. v. \nTaylor , 2014 SCC 50, [2014] 2 S.C.R. 495; R. v. Cole , 2012 SCC 53, [2012] 3 S.C.R. \n34; R. v. Kokesch , [1990] 3 S.C.R. 3; R. v. Buhay , 2003 SCC 30, [2003] 1 S.C.R. 63 1. \nStatutes and Regulations Cite d \nCanadian  Charter of Rights and Freedoms , ss. 8, 9, 24(2).  \nCriminal Code , R.S.C. 1985, c.  C-46, ss. 495(1)(a), 507. \nTraffic Safety Act , R.S.A. 2000, c.  T-6. \nAuthors Cited  \nAsma, Matthew, and Matthew Gourlay. Charter Remedies  in Criminal Cases , 2nd ed. \nToronto: Emond  Montgomery , 2023. \nCoughlan, Steve, and Glen Luther. Detention and Arrest , 2nd ed. Toronto: Irwin Law, \n2017.  \nFontana, James  A., and David  Keeshan. The Law of Search and Seizure in Canada , \n12th ed. Toronto: LexisNexis, ",
    "token_count": 1000,
    "start_token": 6300,
    "end_token": 7300,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 8,
    "source_file": "2023scc30.txt",
    "text": " Gourlay. Charter Remedies  in Criminal Cases , 2nd ed. \nToronto: Emond  Montgomery , 2023. \nCoughlan, Steve, and Glen Luther. Detention and Arrest , 2nd ed. Toronto: Irwin Law, \n2017.  \nFontana, James  A., and David  Keeshan. The Law of Search and Seizure in Canada , \n12th ed. Toronto: LexisNexis, 2021.  \nPaciocco, David  M., Palma Paciocco and L ee Stuesser . The Law of Evidence , 8th ed. \nToronto: Irwin Law, 2020 . \nParent,  Hugues. Traité de droit criminel , t. IV, Les garanties juridiques , 2e éd. \nMontréal: Wilson & Lafleur, 2021.  \nStuart, Don. “Uncertainty on Charter Section 24(2) Remedy of Exclusion of Evidence” \n(2023), 86 C.R. (7th) 255.  \n2023 SCC 30 (CanLII)\n\n--- Page 18 ---\n \n Vauclair, Martin, Tristan Desjardins et Pauline Lachance. Traité général de preuve et \nde procédure pénales 2023 , 30e éd. Montréal: Yvon Blais, 202 3. \n APPEAL f rom a judgment of the Alberta Court of Appeal (Wakeling, \nCrighton and Khullar  JJ.A. ), 2022 ABCA 112 , 44 Alta. L.R. (7th) 5, [2022] 8 W.W.R. \n231, 506 C.R.R. (2d) 174, [2022] A.J. No. 400 (QL), 2022 CarswellAlta  772 (WL), \naffirming the conviction of the accused for possession of cannabis for the purpose of \ntrafficking. Appeal dismissed, Martin and Kasirer JJ. dissenting . \n Rubinder Dhanu , Rebecca  J. K. Gill  and Uphar  K. Dhaliwal , for the \nappellant.  \n Amber Pashuk  and Kyra Kondro , for the respondent.  \n Jeremy Streeter  and Jacob Millns , for the intervener the Attorney General \nof Ontario.  \n Tom Spark , for the intervener the Attorney General of Alberta.  \n The following are the reasons delivered by  \n ROWE AND O’B ONSAWIN JJ. —  \nI. Overview  \n2023 SCC 30 (CanLII)\n\n--- Page 19 ---\n \n [1] The appellant, George Zacharias, was pulled over on the highway for a \ntraffic stop. After a sniffer dog gave a positive indication for drugs in the appellant’s \nvehicle, police searched the vehicle and seized over 100 pou nds of marijuana. The \nappellant was convicted of possession of marijuana for the purpose of trafficking. The \ntrial judge found that the police had breached the appellant’s rights under ss.  8 and 9 of \nthe Canadian  Charter of Rights and Freedoms in conductin g a sniffer search and \ninvestigative detention. This appeal is about the lawfulness of the state actions which \nfollowed those initial Charter  breaches and whether the various breaches warrant \nexclusion of the evidence under s.  24(2).  \n[2] In our view, the arres ts that followed the sniffer search in this case were \nalso in violation of the Charter . The state cannot rely on unlawfully obtained evidence \nto satisfy the reasonable and probable grounds requirement for arrest. Where the court \nfinds a breach of the Chart er has occurred, the breach must be considered in the s.  24(2) \nanalysis. However, absent additional or independent state misconduct, a breach that is \nentirely consequential on an initial violation is unlikely to significantly increase the \noverall seriousne ss of the Charter -infringing state conduct under the s.  24(2) analysis. \nRather, a consequential breach will be most relevant to the impact on the Charter -\nprotected interests of the accused.  \n[3] For the reasons that follow, while we accept that the arrests and searches \nincident to arrest in this case constituted additional violations of the Charter , we would \n2023 SCC 30 (CanLII)\n\n--- Page 20 ---\n \n affirm the decision not to exclude the evidence under s.  24(2) of the Charter . \nAccordingly, the appeal is dismissed.  \nII. Facts  \n[4] On February 17, 2017, the appell ant was pulled over on Highway",
    "token_count": 1000,
    "start_token": 7200,
    "end_token": 8200,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 9,
    "source_file": "2023scc30.txt",
    "text": " reasons that follow, while we accept that the arrests and searches \nincident to arrest in this case constituted additional violations of the Charter , we would \n2023 SCC 30 (CanLII)\n\n--- Page 20 ---\n \n affirm the decision not to exclude the evidence under s.  24(2) of the Charter . \nAccordingly, the appeal is dismissed.  \nII. Facts  \n[4] On February 17, 2017, the appell ant was pulled over on Highway 1 near \nBanff by Constable MacPhail of the Royal Canadian Mounted Police (“RCMP”). The \nstop was a traffic stop initiated as a result of a burnt -out light and illegally tinted \nwindows on the appellant’s truck. After pulling ove r the appellant, Constable MacPhail \nmade several observations that resulted in him placing the appellant under investigative \ndetention and calling for a sniffer dog to scan for drugs.  \n[5] During the initial stop, Constable MacPhail asked the appellant questio ns \nabout where he was travelling and why. When he requested the appellant’s driver’s \nlicence and registration, the appellant responded that his wallet had been stolen and \noffered his passport instead. Constable MacPhail described the appellant as “extremel y \nnervous” and noted that his hands were shaking. This nervousness diminished over \ntime. He also observed a large amount of luggage in the truck and a commercial grade \ntonneau cover concealing the contents of the truck box.  \n[6] When Constable MacPhail ran the appellant’s name and identification \nthrough the police database, he discovered an entry from 2014 related to drugs. The file \nwas locked down and he had to call the Real Time Information Centre for further \ninformation. The Information Centre informed Consta ble MacPhail that the appellant \n2023 SCC 30 (CanLII)\n\n--- Page 21 ---\n \n was the subject of “a complaint of unknown reliability but was said to be an individual \ntied to the distribution of large quantities of marihuana and cocaine” (A.R., vol.  I, at \np. 14). \n[7] According to Constable MacPhail, the in formation from the Real Time \nInformation Centre confirmed his suspicions that the appellant was transporting drugs. \nIn addition to the 2014 entry on his record, he made the following observations and \ninferences: (i) Highway 1, the route the appellant was t ravelling, was a known drug \ncorridor and Calgary a known destination for drugs; (ii) the appellant’s story of visiting \nhis sister for “a couple of days” was inconsistent with the large amount of luggage; (iii) \nit was suspicious that the luggage was in the cab of the truck rather than the box; (iv) \nthe type of tonneau cover on the truck bed was often used by drug couriers; (v) “Back \nthe Blue” stickers like the one the appellant had on his window were often used to avoid \nbeing pulled over; (vi) the appellant’ s claim that his son had purchased the truck with \nthe decal on it was inconsistent with the fact that the truck was registered in the \nappellant’s name; and (vii) the appellant was extremely nervous, albeit less so over \ntime.  \n[8] Constable MacPhail placed the a ppellant under investigative detention and \ncalled for a sniffer dog. The appellant declined the opportunity to speak to counsel. \nConstable MacPhail conducted a pat -down search of the appellant’s front pocket area \nand placed him in a police vehicle. After a round 20 minutes, the sniffer dog arrived \nwith its handler and signalled that drugs were present. Constable MacPhail concluded \n2023 SCC 30 (CanLII)\n\n--- Page 22 ---\n \n that he had reasonable and probable grounds to arrest the appellant for possession of a \ncontrolled substance and did so.  \n[9] Upon pla cing the appellant under arrest, Constable MacPhail conducted a \nsearch of the appellant’s truck, including of duffel bags located in the truck box. He \ndiscovered 101.5 pounds of cannabis, some cannabis pastries or edibles, a jar with a \nsubstance he took to  be cannabis, and $12,600 in cash. Constable MacPhail re -arrested \nthe appellant for possession for the purpose of trafficking. The appellant was then \nremoved from the first police car, handcuffed, and driven to the Banff police \ndetachment in a second polic e vehicle. At the detachment, the appellant was required \nto strip to one layer of clothing and remove his shoes. He was arrested for a third time \nfor possession of proceeds of crime over $5",
    "token_count": 1000,
    "start_token": 8100,
    "end_token": 9100,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 10,
    "source_file": "2023scc30.txt",
    "text": ", and $12,600 in cash. Constable MacPhail re -arrested \nthe appellant for possession for the purpose of trafficking. The appellant was then \nremoved from the first police car, handcuffed, and driven to the Banff police \ndetachment in a second polic e vehicle. At the detachment, the appellant was required \nto strip to one layer of clothing and remove his shoes. He was arrested for a third time \nfor possession of proceeds of crime over $5,000. He was released from police custody \nat 1:37 a.m., approximate ly six hours after arriving to the detachment and seven hours \nafter being pulled over.  \n[10] At the voir dire , Constable MacPhail testified that he had been an RCMP \nofficer for 14 years. At the time of the appellant’s arrest, he was part of the Roving \nTraffic Un it, which specializes in detecting and intercepting criminals travelling on the \nhighway. Constable MacPhail had been a member of this unit for 8½ years and, in that \ntime, had conducted between 12,000 to 15,000 traffic stops. Constable MacPhail had \nalso act ed as an RCMP instructor for the past 3 years and taught over 15 courses on \ntraffic enforcement investigations.  \nIII. Judicial History  \n2023 SCC 30 (CanLII)\n\n--- Page 23 ---\n \n A. Alberta Court of King’s Bench  \n[11] The trial judge identified the primary issue before her to be whether \nConstable MacPhail had reas onable suspicion to enter into an investigative detention \nand deploy a sniffer dog. She concluded he did not, as the only objective element for \nsuspicion was a police database entry from 2014 which was unconfirmed and of \nunknown reliability. As a result, t he trial judge found that the police had breached the \nappellant’s ss.  8 and  9 Charter rights by virtue of the sniffer dog search and \ninvestigative detention.  \n[12] However, the trial judge went on to conclude that the evidence should not \nbe excluded under s.  24(2). First, with respect to the seriousness of the state conduct, \nthere was no evidence of a deliberate or systemic breach of the Charter . Constable \nMacPhail’s failure to meet the reasonable suspicion standard was “miniscule” and not \nthe result of negligenc e. While he did not meet the requisite standard, “he was \nextremely close to crossing it” (A.R., vol.  I, at p.  21). Second, with respect to the impact \nof the breach on the Charter -protected interests of the appellant, the trial judge noted \nthat the search w as of a vehicle on a public highway. This did not attract a high \nexpectation of privacy, as would be so in the case of a home or computer. The search \nalso did not demean the appellant’s dignity. Finally, with respect to society’s interest \nin an adjudicatio n on the merits, the trial judge found that the evidence was both highly \nreliable and the only evidence for the prosecution’s case. She also noted that the offence \nwas serious despite the legalization of marijuana, given the quantity. After conducting \n2023 SCC 30 (CanLII)\n\n--- Page 24 ---\n \n her s. 24(2) analysis, she concluded that excluding the evidence would bring the \nadministration of justice into disrepute.  \nB. Alberta Court of Appeal, 2022 ABCA 112, 44 Alta. L.R. (7th) 5  \n[13] The appellant appealed his conviction, arguing that the trial judge erred i n \nher s.  24(2) analysis on the voir dire . In particular, he argued that the trial judge erred \nby failing to consider the consequences that flowed from the unlawful investigative \ndetention and sniffer dog search.  \n[14] A majority of the Court of Appeal dismissed the appeal (per Wakeling and \nCrighton JJ.A.). The majority agreed with the Crown that trial judges are not required \nto consider conduct that might be relevant to a Charter -protected interest if that conduct \nwas n ot argued by the parties and no findings were made in respect of it. It was not \nsurprising that the trial judge only made findings on the investigative detention and \nsniffer dog search, as these were the only assertions set out in the appellant’s Charter \nnotice. The majority concluded that entertaining the new arguments raised on appeal \nwould undermine the role of the trial judge.  \n[15] The majority also concluded that while the trial judge had failed to consider \nthe s.  9 breach — the investigative detention — under the second factor of the s.",
    "token_count": 1000,
    "start_token": 9000,
    "end_token": 10000,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 11,
    "source_file": "2023scc30.txt",
    "text": ". It was not \nsurprising that the trial judge only made findings on the investigative detention and \nsniffer dog search, as these were the only assertions set out in the appellant’s Charter \nnotice. The majority concluded that entertaining the new arguments raised on appeal \nwould undermine the role of the trial judge.  \n[15] The majority also concluded that while the trial judge had failed to consider \nthe s.  9 breach — the investigative detention — under the second factor of the s.  24(2) \ntest, this did not affect the result.  \n2023 SCC 30 (CanLII)\n\n--- Page 25 ---\n \n [16] Khullar J.A. (as she then was), dissenting, would have allowed the appeal, \nexcluded the evidence, set aside the conviction, and entered an acquittal. She agreed \nwith the trial judg e that the first and third factors of the s.  24(2) test did not pull toward \nexclusion of the evidence. However, after a fresh analysis of the second factor, she \nconcluded that, on balance, the evidence should be excluded.  \n[17] In Khullar J.A.’s view, the record  was sufficient to consider the new \nCharter breaches alleged by the appellant and the Crown would not be prejudiced by \nthe court doing so. She concluded that the trial judge had failed to consider several \nbreaches of the appellant’s ss.  8 and  9 rights: the  pat-down search; the search of the \ntruck and its contents; the three arrests; and the detention which continued when the \npolice placed the appellant in the police vehicle, handcuffed him, and detained him at \nthe police detachment. Khullar J.A. considered these breaches at the second stage of \nthe s.  24(2)  test and determined that the impact of the breaches on the appellant’s \nCharter -protected interests strongly favoured exclusion of the evidence. On balance, \nthe factors pulled toward exclusion.  \nIV. Issues  \n[18] This appeal raises the following two issues.  \n[19] First, should this Court consider the new issues raised by the appellant for \nthe first time at the Alberta Court of Appeal?  \n2023 SCC 30 (CanLII)\n\n--- Page 26 ---\n \n [20] Second, did the trial judge properly consider all of the relevant Charter -\ninfringing state c onduct? Answering this raises two further questions. First, did the \npolice commit further breaches of the appellant’s Charter rights by relying on the \nresults of the unlawful sniffer dog search? And second, if so, how are these breaches to \nbe factored into  the s.  24(2) analysis?  \nV. Analysis  \nA. New Issues on Appeal  \n[21] The trial judge, based on the arguments before her, found two breaches of \nthe Charter : s. 8 was breached, by virtue of the unlawful sniffer dog search, and s.  9 \nwas breached, by virtue of the roadside i nvestigative detention leading up to and during \nthe sniffer dog search.  On appeal before the Alberta Court of Appeal, the appellant \nargued that the trial judge had failed to consider several other breaches of ss.  8 and  9 \nof the Charter  (paras.  43-44). Thes e arguments engaged new issues beyond those \nraised at the voir dire .  \n[22] The appellant asks this Court to consider the new issues which the majority \nbelow declined to address, arguing that there is a sufficient record, no prejudice to the \nrespondent, the Crown, and that a purposive and generous approach to the Charter \nrequires the court to consider whether other state action constituted a breach of the \nappellant’s Charter rights. The Crown, on the ot her hand, argues that the record is \ninsufficient to address the new issues because it “could have elicited additional \n2023 SCC 30 (CanLII)\n\n--- Page 27 ---\n \n evidence” in order “to flesh out the record” on several points, including the scope of \nthe pat -down search, the reasons why Constable MacP hail placed the appellant in the \nback of the police car, and the circumstances of the appellant’s detention at the station \n(R.F., at para.  47). In addition, the Crown argues it would be unfair to allow the \nappellant to shift so far from his trial strategy and that there is no broader interest served \nby addressing the new issues.  \n[23] This Court has made clear that such  new issues should be entertained only \nin “exceptional circumstances” ( R. v. J.F., 2022 SCC 17, at para.",
    "token_count": 1000,
    "start_token": 9900,
    "end_token": 10900,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 12,
    "source_file": "2023scc30.txt",
    "text": " the appellant’s detention at the station \n(R.F., at para.  47). In addition, the Crown argues it would be unfair to allow the \nappellant to shift so far from his trial strategy and that there is no broader interest served \nby addressing the new issues.  \n[23] This Court has made clear that such  new issues should be entertained only \nin “exceptional circumstances” ( R. v. J.F., 2022 SCC 17, at para.  40, citing Guindon v. \nCanada , 2015 SCC 4 1, [2015] 3 S.C.R. 3 ). Nevertheless, we conclude that the issue of \nwhether police conduct in this case breached s.  8 or 9 of the Charter should be \nconsidered by this Court. The legal question on which the Court of Appeal diverged \nrequires this Court to con sider the dissenting judge’s path of reasoning.  \n[24] Like Khullar J.A., we are of the view that addressing this issue would not \nresult in unfairness to the Crown. The appellant, in making his argument, alleges \n“nothing further other than the fact that [the arre sts, searches, and detention in question] \noccurred” (A.F., at para.  70). The Crown does not dispute that these events occurred. \nAt the voir dire , the Crown adduced evidence from the arresting officer Constable \nMacPhail, the backup officer, and the dog hand ler. In the Court of Appeal, the Crown \ndid not suggest it would have called any further evidence, except in relation to the strip \nsearch, which is no longer at issue (C.A. reasons, at para.  48). With respect to the legal \n2023 SCC 30 (CanLII)\n\n--- Page 28 ---\n \n issues before this Court, the Crown  has had ample opportunity to respond to the \npositions taken in the reasons for the majority and the dissent in the Court of Appeal.  \n[25] The appellant’s arguments rely on undisputed facts relating to his arrest; \nthey can therefore be fairly considered on appe al. Given that no further evidence was \ngiven on these events, however, the Court will only consider the bare fact that this \npolice conduct occurred. In other words, while it is appropriate for this Court to \nconsider the fact of the appellant’s arrest after  the sniffer search, there were neither \nsubmissions nor evidence seeking to establish any circumstances of the arrest that were \nimproper. In this way, no prejudice results to the Crown. Given the absence of \nprejudice, the importance of having the issue res olved by this Court, and with the \nbenefit of the dissenting reasons below, we would exercise our discretion to address \nthis new issue (see Guindon , at para.  20; see also J.F., at paras.  40-41). \nB. Arrests Made as a Consequence of a Charter Breach  \n[26] This appeal raises the question of whether the police breached the \nappellant’s Charter rights by arresting him based on the results of an unlawful search. \nLower courts across the country have reached divergent conclusions on the question of \nwhether such arrests are la wful. As we will explain, a principled approach to the \nCharter mandates that police cannot rely on unlawfully obtained evidence in order to \nconduct a warrantless arrest. Where the grounds for arrest are based on evidence that \nis subsequently found to have been unlawfully obtained, the court must excise this \n2023 SCC 30 (CanLII)\n\n--- Page 29 ---\n \n evidence from the factual matrix in order to determine whether the police had \nreasonable and probable grounds for arrest.  \n[27] In R. v. Storrey , [1990] 1 S.C.R. 241, this Court explained that in order to \nsafeguard the liberty of Canadians, the Criminal Code , R.S.C. 1985, c. C -46, sets out \nstrict standards for when police may exercise powers of arrest. In order to obtain a \nwarrant for arrest, the police must demonstrate that they have reasonable and probable \ngrounds to believe that the person they are seeking to arrest has committed an offence. \nSection  507 of the Code provides for a review mechanism whereby a justice, upon \nreceipt of an information, determines whether the requisite grounds for arrest have been \nmade out.  \n[28] The same standard of reasonable and probable grounds applies where the \npolice arrest an individual without a warrant ( Storrey , at p. 249). Section  495(1)(a) of \nthe Code grants police the power to arrest individuals without judicial authorization if, \non reasonable grounds, the",
    "token_count": 1000,
    "start_token": 10800,
    "end_token": 11800,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 13,
    "source_file": "2023scc30.txt",
    "text": " 507 of the Code provides for a review mechanism whereby a justice, upon \nreceipt of an information, determines whether the requisite grounds for arrest have been \nmade out.  \n[28] The same standard of reasonable and probable grounds applies where the \npolice arrest an individual without a warrant ( Storrey , at p. 249). Section  495(1)(a) of \nthe Code grants police the power to arrest individuals without judicial authorization if, \non reasonable grounds, the police believe the person has committed or is about to \ncommit an indictable offence. The test for whether the police were acting within their \nauthority to conduct a warrantless arrest has both a subjective and an objective \ncomponent (pp.  250-51). Subjectively, the arresting officer must honestly believe that \nthe suspect committed the offence in question. In addition, those subjective grounds \nmust be justifiable from an objective point of view. In evaluating whether the officer  \nhad reasonable and probable grounds for arrest, the court must conduct the analysis \n2023 SCC 30 (CanLII)\n\n--- Page 30 ---\n \n from the perspective of a reasonable person standing in the shoes of the arresting officer \n(R. v. Beaver , 2022 SCC 54, at para.  72).  \n[29] In considering whether the police had reasonable and probable grounds to \narrest the appellant in this case, Khullar J.A. concluded that “reasonable and probable \nground[s] cannot be supplied by the results of an unlawful sniffer dog search” \n(para.  54). We agree.  \n[30] The conclusion that reasonable g rounds for lawful arrest cannot be \nsupplied by actions that involved violations of the Charter accords with principle and \npolicy. Indeed, this conclusion is a logical extension of the applicable principles in \nother contexts where an initial Charter breach forms the basis for subsequent state \naction. An unlawful search, for example, cannot furnish the requisite grounds for a \nsearch warrant ( R. v. Feeney , [1997] 2 S.C.R. 13, at para.  59). Similarly, a lawful arrest \nis a pre -requisite for any search conducted incident to it ( R. v. Stillman , [1997] 1 S.C.R. \n607, at para.  27; R. v. Caslake , [1998] 1 S.C.R. 51, at paras.  13-14; R. v. Tim , 2022 \nSCC 12 , at paras.  49-50).  \n[31] This Court in R. v. Grant , [1993] 3 S.C.R. 223, explained the rationale that \nanimates this rule  in the search warrant context: in excluding justification for state \nconduct that is itself unconstitutional, “the state is prevented from benefiting from the \nillegal acts of police officers” (p.  251).  In the same vein, a search incident to arrest is \ninvalid if the arrest was not lawful because “the legality of the search is derived from \n2023 SCC 30 (CanLII)\n\n--- Page 31 ---\n \n the legality of arrest [and] if the arrest is later found to be invalid, the search will be \nalso” ( Caslake , at para.  13). \n[32] The need to ensure that the state cannot rely  on conduct that violates the \nCharter applies regardless of whether the police are knowingly in breach of the law.  \nThe policy rationale is two -fold.  \n[33] First, respect for the Charter and robust protection of civil liberties \nmandates that the state not be per mitted to minimize the impact of earlier \nunconstitutional actions that lead to a cascading series of well -meaning investigative \nsteps. To allow the police to rely on their misconduct in such a way would fail to give \nmeaningful effect to rights protected un der the Charter .  \n[34] Furthermore, allowing the state to rely on Charter violations “through the \nback door” could incentivize police to be less careful in adherence to the law. For \nexample, as this Court held in Tim, at para.  30:  \nAllowing the police to arrest  someone based on what they believe the law \nis — rather than based on what the law actually is — would dramatically \nexpand police powers at the expense of civil liberties. This would leave \npeople at the mercy of what particular police officers happen to un derstand \nthe law to be and would create disincentives for the police to know the law. \nCanadians rightly expect the police to follow the law .  . . .  \n2023 SCC 30 (CanLII)\n\n--- Page 32 ---\n \n While the fact that the police erred unknowingly or in good",
    "token_count": 1000,
    "start_token": 11700,
    "end_token": 12700,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 14,
    "source_file": "2023scc30.txt",
    "text": " law actually is — would dramatically \nexpand police powers at the expense of civil liberties. This would leave \npeople at the mercy of what particular police officers happen to un derstand \nthe law to be and would create disincentives for the police to know the law. \nCanadians rightly expect the police to follow the law .  . . .  \n2023 SCC 30 (CanLII)\n\n--- Page 32 ---\n \n While the fact that the police erred unknowingly or in good faith will be considered at \nthe s.  24(2) stage, it has no bearing on whether there has been a further violation of the \nCharter as a consequence of the initial misconduct.  \n[35] This conclusion is also s upported by the preponderance of the \njurisprudence. In R. v. Monney  (1997), 153 D.L.R. (4th) 617 (Ont. C.A.), rev’d on other \ngrounds [1999] 1 S.C.R. 652, the Court of Appeal for Ontario analogized the \nwarrantless arrest context to search warrants. Rosenber g J.A., writing for the majority \nof the court, concluded that, similarly, when considering the validity of a warrantless \narrest, “facts obtained as a result of a breach of the Charter . . . are excised from the \n[grounds for arrest]. The court must then det ermine whether the [arrest would have \nbeen valid] without the improperly obtained facts” (para.  98). \n[36] In R. v. MacEachern , 2007 NSCA 69, 255 N.S.R. (2d) 180, the Nova \nScotia Court of Appeal accepted the Crown’s concession that the arrest in question was \nunlawful in light of it being based on an earlier breach of s.  10(b) of the Charter . In \nthat case, a sniffer dog detected drugs in the appellant’s backpack. The police detained \nand questioned the appellant without informing him of his right to counsel. In res ponse \nto his answers to police, the appellant was arrested for possession. The Crown conceded \nin its factum on appeal that without the appellant’s responses to the police, the officer \ndid not have a subjective belief that the appellant was illegally in pos session of drugs \nand had thereby committed an offence. The court agreed with the Crown that as a result, \nthe arrest was unlawful.  \n2023 SCC 30 (CanLII)\n\n--- Page 33 ---\n \n [37] In R. v. Blanchard , 2011 NLCA 33, 308 Nfld. & P.E.I.R. 91, the \nNewfoundland and Labrador Court of Appeal agreed with the cour t below that as the \ninitial sniffer dog search of the appellant’s car was unlawful and led to a further search \nand arrest, the subsequent search and arrest were also in violation of the Charter \n(para.  34). Both the search warrant and the warrantless arrest  were based on the results \nof the illegal sniff search (para.  13). The Court of Appeal characterized these breaches \nas a “cascade of Charter  violations” (para.  34).  \n[38] Similarly, in R. v. Pelucco , 2015 BCCA 370, 327 C.C.C. (3d) 151, the \nmajority of the Briti sh Columbia Court of Appeal agreed with the trial judge that the \narrest at issue was unlawful, given that it was based on evidence that had been \ndiscovered unlawfully. In that case, unbeknownst to the appellant, the police had seized \nthe cellphone of the p erson to whom he was arranging to sell cocaine. When the \nappellant arrived to complete the sale, he was arrested and drugs were found in his \ntruck as well as, following execution of a search warrant, his home. The trial judge \nconcluded that the search and seizure of the original buyer’s cellphone was unlawful, \nas was the search of the appellant’s vehicle and backpack. Therefore, the arrest, which \nwas “based on” evidence uncovered from these unlawful searches, was also unlawful \n(para.  23). The Court of Appea l agreed (para.  72). \n[39] Finally, we note that this Court has endorsed similar reasoning. In R. v. \nChaisson , 2006 SCC 11, [2006] 1 S.C.R. 415 , a police officer became suspicious when \nhe noticed the appellant and a passenger sitting in a dark car behind a close d service \n2023 SCC 30 (CanLII)\n\n--- Page 34 ---\n \n station. When he approached the vehicle",
    "token_count": 1000,
    "start_token": 12600,
    "end_token": 13600,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 15,
    "source_file": "2023scc30.txt",
    "text": "para.  72). \n[39] Finally, we note that this Court has endorsed similar reasoning. In R. v. \nChaisson , 2006 SCC 11, [2006] 1 S.C.R. 415 , a police officer became suspicious when \nhe noticed the appellant and a passenger sitting in a dark car behind a close d service \n2023 SCC 30 (CanLII)\n\n--- Page 34 ---\n \n station. When he approached the vehicle, he saw the occupants react with shock and \nthought he saw the appellant throw something to the other side of the car. He ordered \nthe occupants to exit the vehicle, detaining them, and arrested the appellant  after seeing \na bag of marijuana in the car. The trial judge concluded that the appellant’s rights under \nss. 8, 9 and  10(b) of the Charter had been violated: “.  . . ‘but for the [arbitrary] \ndetention the marijuana [found by the police officer] on the floor  [of the appellant’s \nautomobile] would not have been discovered and but for the marijuana on the floor \nbeing discovered, there would have been no right to arrest these men’” (para.  4). This \nCourt held that the trial judge was entitled to conclude on the fa cts as stated that the \nappellant’s ss.  8, 9 and  10(b) rights had been violated (para.  7). \n[40] While some courts have reached the opposite conclusion on this question, \nwe do not find their reasoning persuasive. The intervener the Attorney General of \nAlberta poi nts to the recent decision of R. v. Love , 2022 ABCA 269, [2023] 1 W.W.R. \n296, in which the Alberta Court of Appeal declined to apply the automatic excision rule \nto grounds for arrest premised on unlawful searches. The Court of Appeal based its \ndecision on criticism of the automatic excision rule in the search warrant context and \nits conclusion that automatic excision in the arrest context “would nullify the subjective \nfocus [and objective aspect] of the Storrey  test” (para.  94).  \n[41] The rule that reasonable and probable grounds for arrest cannot be supplied \nby the results of unconstitutional state conduct does not conflict with the test set out in \nStorrey . As set out above, the Storrey test requires that the police have a subjective \n2023 SCC 30 (CanLII)\n\n--- Page 35 ---\n \n belief, that is also objectively reasonable, that the arrestee has committed an offence. \nThe onus is on the state to establish that these grounds exist ( Storrey , p. 250). In order \nto ensure that the state is not able to rely on violations of the Charter , the reviewing \njudge must excise evidence that has been unconstitutionally obtained at the outset of \nthis inquiry. Once this evidence has been removed from the factual matrix, the court \napplies the Storrey test to determine whether reasonable and probable gro unds exist, \nhaving regard to both the subjective and objective components. In this inquiry, the court \nconsiders the totality of the circumstances known to the officer at the time of the arrest, \nbut does not include evidence found to have been unconstitutio nally obtained.  \n[42] Both the Attorney General of Alberta in its intervener submissions and the \nAlberta Court of Appeal in Love emphasize that unlike when drafting an information \nto obtain a search warrant, warrantless arrests are often carried out in dynamic \nsituations (I.F., at para.  37; Love , at paras.  91-92). This is true. Nonetheless, the purpose \nof preventing police from being able to rely on unlawful conduct is not to prevent them \nfrom acting in the dynamics of the moment. The same constraint that should guide \npolice in their interactions with individuals continues to apply: such actions must \ncomply with the Charter . Thus, police are not required to take an additional step “to \ninquire into the constitutionality of prior investigative steps before acting on  the \ninformation they yielded” ( Love , at para.  92; see also I.F., Attorney General of Ontario, \nat para.  18, arguing this suggests police should be “required to stop their \ninvestigation”). Rather, police have been and continue to be required to consider \nwhether they are acting within constitutional limits when they act. In short, the police \n2023 SCC 30 (CanLII)\n\n--- Page 36 ---\n \n need to respond to exigencies, but in doing so must be mindful of the authority that the \nlaw confers and also the constraints that the law",
    "token_count": 1000,
    "start_token": 13500,
    "end_token": 14500,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 16,
    "source_file": "2023scc30.txt",
    "text": ", \nat para.  18, arguing this suggests police should be “required to stop their \ninvestigation”). Rather, police have been and continue to be required to consider \nwhether they are acting within constitutional limits when they act. In short, the police \n2023 SCC 30 (CanLII)\n\n--- Page 36 ---\n \n need to respond to exigencies, but in doing so must be mindful of the authority that the \nlaw confers and also the constraints that the law imposes.  \n[43] Canadians have a legit imate expectation that the police will know and \ncomply with the law, especially the Charter (Tim, at para.  30; Kosoian v. Société de \ntransport de Montréal , 2019 SCC 59, [2019] 4 S.C.R. 335 , at para.  6; R. v. McGuffie , \n2016 ONCA 365, 131 O.R. (3d) 643, at p ara. 67). This applies no less in dynamic \nsituations. As this Court highlighted in Storrey , “[i]n the case of an arrest made without \na warrant, it is even more important  for the police to demonstrate that they have those \nsame reasonable and probable ground s upon which they base the arrest” (p.  249 \n(emphasis added); see also S. Coughlan and G. Luther, Detention and Arrest (2nd ed. \n2017), at p.  91). This rule is also consistent with the principles that apply in the search \nwarrant and search incident to arrest  contexts.  \n[44] Before turning to how breaches of the Charter resulting from earlier \nbreaches are to be factored into the s.  24(2) analysis, we pause to note the important \ndifference between excision and exclusion. Where grounds for arrest are based on \nunconsti tutionally obtained evidence, that evidence is to be excised from the factual \nmatrix. However, we leave open the possibility of situations where, even after this \nevidence is excised, the arresting officer still meets the standard of reasonable and \nprobable  grounds for arrest. For example, if police arrest an individual after conducting \nan unlawful search, but the evidence uncovered from the search is only one contributing \n2023 SCC 30 (CanLII)\n\n--- Page 37 ---\n \n factor to the decision to arrest, the arrest will still be lawful if the balance of th e \nevidence suffices to establish reasonable and probable grounds.  \n[45] The automatic excision rule also does not, as suggested by the Attorney \nGeneral of Ontario, create “categorical rules of exclusion” (I.F., at para.  16). The \nquestion of whether there has bee n a violation of the Charter is distinct from whether \nthe evidence obtained as a result of that violation should be excluded from trial. The \nlatter question is dealt with at the s.  24(2) stage, where the court considers the totality \nof the circumstances in  order to determine, on balance, whether admission of the \nevidence will bring the administration of justice into disrepute.  \n[46] We turn now to how this analysis is to be undertaken, with a brief note on \nterminology.  \nC. An Unlawful Arrest as a “Consequential” Breach in the Section 24(2) Analysis  \n[47] Where an arrest is unlawful because it is premised on the results of a \nCharter breach, it is the initial Charter breach that renders what follows unlawful. In \nother words, there is a situation of linked or “cascading” Charter breaches (see \nBlanchard , at para.  34). We use the term “consequential” to refer to such breaches in \nthe s.  24(2) analysis because the subsequent arrest is unlawful only as a consequence \nof the “initial” breach or breaches that preceded it.  \n2023 SCC 30 (CanLII)\n\n--- Page 38 ---\n \n [48] Importan tly, an arrest that can be viewed only as a consequential breach is \ndistinct from state action that is characterized by additional  or independent misconduct, \nincluding conduct that can be considered an “independent” breach of the Charter (such \nas failing t o give an arbitrarily detained accused their right to counsel upon arrest) . In \nthose circumstances, the subsequent state action is of a different character and will be \nfactored into the s.  24(2) analysis differently.  \n[49] A pattern of Charter breaches, for exa mple, may cumulatively increase the \nseriousness of the Charter -infringing state conduct (see  R.",
    "token_count": 1000,
    "start_token": 14400,
    "end_token": 15400,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 17,
    "source_file": "2023scc30.txt",
    "text": " “independent” breach of the Charter (such \nas failing t o give an arbitrarily detained accused their right to counsel upon arrest) . In \nthose circumstances, the subsequent state action is of a different character and will be \nfactored into the s.  24(2) analysis differently.  \n[49] A pattern of Charter breaches, for exa mple, may cumulatively increase the \nseriousness of the Charter -infringing state conduct (see  R. v. Grant , 2009 SCC 32, \n[2009] 2 S.C.R. 353  (“Grant 2009”),  at para.  75). Some factual scenarios will raise the \nissue of cumulative breaches, which may evidence a pattern of misconduct, rather than \nconsequential ones alone, which will likely not (see R. v. Lambert , 2020 NSPC 37, 472 \nC.R.R. (2d) 1,  at paras.  361-65, aff’d 2023 NSCA 8, at paras.  92-103 (CanLII); R. v. \nLauriente , 2010 BCCA 72, 251 C.C.C. (3d) 492, at  paras.  12 and  30; R. v. Kossick , \n2017 SKPC 67, 392 C.R.R. (2d) 250,  at paras.  97-98 and  126, aff’d 2018 SKCA 55, \n365 C.C.C. (3d) 186; R. v. White , 2022 NSCA 61, 419 C.C.C. (3d) 123, at paras.  44-\n61; Monney , at para.  120; M. Asma and M. Gourlay, Charter Remedies in Criminal \nCases  (2nd ed. 2023), at p.  51).  \n[50] Having set out the foregoing distinction, we now address how such an \nunlawful arrest — which is a breach only by consequence of its connection to an \nunlawful search, and which demonstrates no additiona l state misconduct — should be \nfactored into the s.  24(2) Grant analysis.  \n2023 SCC 30 (CanLII)\n\n--- Page 39 ---\n \n (1) The Section 24(2) Grant Analysis  \n(a) The Seriousness of the Charter -Infringing State Conduct  \n[51] The first line of inquiry under s.  24(2) asks whether the Charter ‑infringing \nstate conduct i s so serious that the court must dissociate itself from it. The spectrum of \nseriousness involves, at one end, “inadvertent or minor violations of the Charter ” and, \nat the other, “wilful or reckless disregard of Charter rights” ( Grant 2009 , at para.  74; \nsee also Beaver , at para.  120).  \n[52] An unlawful arrest that is a consequential breach must be factored into the \nfirst and second stages of the s.  24(2) analysis, but is unlikely to significantly impact \nthe overall seriousness of the Charter -infringing state cond uct. In the absence of \nadditional state misconduct, the focal point for evaluating seriousness is likely to \nremain the initial breach: in this case, the preceding unlawful search. Where, as in this \ncase, the police conduct is only off the mark to a “minisc ule” degree, the seriousness \nof the initial breach will tend to be on the lower end of the scale. However, in other \ncases, the initial misconduct may be characterized as more serious; for example, if the \npolice conduct was still inadvertent but further off  the mark. In the latter case, while \nthe consequential arrest would still be unlikely to significantly increase the overall \nseriousness of the misconduct, the seriousness would already be more severe given the \nfocus on the initial breach.  \n2023 SCC 30 (CanLII)\n\n--- Page 40 ---\n \n [53] This is consiste nt with the approach followed in other cases. For example, \nwhere a search incident to arrest has been found unlawful only by virtue of the \nunlawfulness of the preceding arrest and the arrest evidences no other misconduct, \ngreater emphasis is likely to be p laced on the arrest itself rather than the “unremarkable” \nor “normal consequences of the arrest” that follow (see R. v. Loewen , 2018 SKCA 69, \n[2018] 12 W.W.R. 280, at paras.  77-",
    "token_count": 1000,
    "start_token": 15300,
    "end_token": 16300,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 18,
    "source_file": "2023scc30.txt",
    "text": " to arrest has been found unlawful only by virtue of the \nunlawfulness of the preceding arrest and the arrest evidences no other misconduct, \ngreater emphasis is likely to be p laced on the arrest itself rather than the “unremarkable” \nor “normal consequences of the arrest” that follow (see R. v. Loewen , 2018 SKCA 69, \n[2018] 12 W.W.R. 280, at paras.  77-78; see also Tim, at paras.  49-50 and  84-87). \nWhere it is only the connection t o the initial Charter breach that is the source of the \nmisconduct, and where the police honestly believe they are proceeding lawfully, \nsubsequent state conduct is unlikely to meaningfully increase the seriousness of the \nCharter -infringing state conduct.  \n[54] At the same time, we do not rule out the possibility that where the initial \nbreach involves deliberate, intentional, or flagrant state misconduct, subsequent actions \ntaken as a consequence of that initial breach may increase the overall seriousness of the \nCharter -infringing state conduct. The s.  24(2) analysis, of course, will depend on the \nfacts of the case, and all cases will require “an evaluation of the seriousness of the state \nconduct that led to the breach” ( Grant 2009, at para.  73). But where the polic e honestly \nbelieve that they have not committed any initial breach, actions taken on the basis of \nthat initial breach are, to their mind, lawful, and do not demonstrate any heightened \ndisregard for Charter rights or the law. In such a case, the subsequent state action or \nconsequential breach is not deliberate, and therefore should be situated on the less \nserious end of the scale of culpability (see Tim, at para.  82).  \n2023 SCC 30 (CanLII)\n\n--- Page 41 ---\n \n (b) The Impact on the Charter -Protected Interests of the Accused  \n[55] The impact on the Charter -protected interests of the accused is distinct \nfrom the seriousness of the Charter -infringing conduct. As this Court stated in Grant \n2009 , in order to assess this factor, the court must “look to the interests engaged by the \ninfringed right and examine the deg ree to which the violation impacted on those \ninterests” (para.  77). \n[56] When additional rights and breaches of those rights are factored into the \ns. 24(2) analysis, there will necessarily be a more significant impact on the accused that \nis therefore relevant to the analysis of the second Grant factor. Consideration of all \nbreaches as found is necessary to get an “accurate picture of the effects of the breaches” \n(C.A. reasons, at para.  51). Section  24(2) of the Charter  requires “regard to all the \ncircumstances”. To fail to have regard to the impact of an arrest on an accused whe re \nit occurred as a consequence of a preceding Charter breach would fail to take into \naccount “all the circumstances”. The arrest here was unlawful and, therefore, must form \npart of the s.  24(2) analysis.  \n[57] Accordingly, we reject the Crown and interveners’ view that we should \nadopt the approach set out by the Court of Appeal for Ontario in R. v. Jennings , 2018 \nONCA 260, 45 C.R. (7th) 224 . In Jennings , the court in obiter  reasoned that, for s.  8 \nbreaches in br eath sample cases, it would be incorrect in the s.  24(2) analysis “to \nconsider not just the impact of the administration of the breath sample procedure, which \nis itself minimally intrusive, but the entirety of the procedure faced by the accused after \n2023 SCC 30 (CanLII)\n\n--- Page 42 ---\n \n arres t” because that would create a categorical rule of exclusion (paras.  27 and  32). \nThus, we would not adopt the approach suggested in Jennings in this case.  Rather, \nwhere a court finds that an arrest is made in breach of the Charter , it will be necessary \nto consider such a breach in the s.  24(2) analysis, including the impacts on the accused’s \nCharter -protected interests (see R. v. Reilly , 2021 SCC 38, at para.  3; see also  R. v. Au -\nYeung , 2010 ONSC 2292, 209 C.R.R. (",
    "token_count": 1000,
    "start_token": 16200,
    "end_token": 17200,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 19,
    "source_file": "2023scc30.txt",
    "text": " court finds that an arrest is made in breach of the Charter , it will be necessary \nto consider such a breach in the s.  24(2) analysis, including the impacts on the accused’s \nCharter -protected interests (see R. v. Reilly , 2021 SCC 38, at para.  3; see also  R. v. Au -\nYeung , 2010 ONSC 2292, 209 C.R.R. (2d) 140, at paras.  41, 50 and  59). This wil l be \nthe case whether or not the unlawful arrest can be considered to be a “consequential” \nbreach.  \n(c) Society’s Interest in an Adjudication on the Merits  \n[58] The third factor looks to society’s interest more broadly, focusing on the \ntruth -seeking function of a cr iminal trial ( Grant 2009 , at para.  79). The court considers \nfactors such as the reliability of the evidence, the importance of the evidence to the \nCrown’s case, and the seriousness of the alleged offence ( R. v. McColman , 2023 SCC \n8, at para.  70). In our vi ew, and in the absence of arguments on this point, consideration \nof conduct like the additional breaches in this case would not change the analysis for \nthe third Grant factor.   \n(2) Summary  \n[59] The foregoing is meant to offer guidance in specific situations. A \n“con sequential” breach is not a new “type” of Charter breach. It will not be necessary \nor useful in every case to determine whether the sequence of state conduct presents a \n2023 SCC 30 (CanLII)\n\n--- Page 43 ---\n \n “consequential” breach. But this operates as guidance for cases where an arrest follows  \nas a consequence of a search, and both are viewed as unlawful on judicial review. In \nthese cases, the court must assess the seriousness of both the search and the arrest. The \narrest, given that it is expected in the circumstances, is unlikely to significa ntly increase \nthe overall seriousness of the Charter -infringing state conduct, but it will often result \nin a more significant impact on the individual’s Charter -protected interests. In this way, \nthe s.  24(2) analysis does not become a rule of automatic exc lusion, while at the same \ntime, the court takes fully into account the impact on the Charter -protected interests of \nthe accused.   \nVI. Application  \n[60] Having set out the relevant principles, we now apply those principles in the \ncircumstances of this case.  \n(1) The Addi tional Charter  Breaches  \n[61] Turning first to the violation stage, it is useful to recall the three arrests that \ntook place in this case: (i) the first arrest for possession, based on the results of the \nsniffer dog search; (ii) the second arrest for possession for the purpose of trafficking, \nbased on the searches (incident to arrest) of the interior of the vehicle and the duffel \nbags; and (iii) the third arrest for possession of proceeds of crime, also based on the \nsearch incident to arrest of the vehicle and it s contents.  \n2023 SCC 30 (CanLII)\n\n--- Page 44 ---\n \n [62] Constable MacPhail testified to his grounds for the first arrest on the voir \ndire: “I was told by [the officer who deployed the sniffer dog] that I could place the \naccused under arrest for possession of a controlled substance, as his sniffer do g had \nprovided a positive indication and sit confirmation to an odour of a controlled substance \ninside the vehicle” (A.R., vol. II, at p.  38). In other words, Constable MacPhail’s \nsubjective belief that the appellant was in possession of a controlled subst ance relied \nprimarily on the results of the sniffer dog search. As the trial judge’s conclusion that \nthis sniffer search was unlawful is not at issue, we conclude that the subsequent arrest \nfor possession was also unlawful. Without the sniffer dog search, the police would not \nhave had reasonable and probable grounds for arrest.  \n[63] It is settled law that a lawful arrest is a prerequisite to a valid search \nincident to arrest ( Stillman , at para.  27; Caslake , at paras.  13-14; Tim, at paras.  49-50). \nTherefore, in l ight of our conclusion that the first arrest was unlawful, we agree with \nKhullar J.A. that the searches of the cab of the truck, the box of",
    "token_count": 1000,
    "start_token": 17100,
    "end_token": 18100,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 20,
    "source_file": "2023scc30.txt",
    "text": " for arrest.  \n[63] It is settled law that a lawful arrest is a prerequisite to a valid search \nincident to arrest ( Stillman , at para.  27; Caslake , at paras.  13-14; Tim, at paras.  49-50). \nTherefore, in l ight of our conclusion that the first arrest was unlawful, we agree with \nKhullar J.A. that the searches of the cab of the truck, the box of the truck, and the duffel \nbags inside the vehicle incident to arrest were also unlawful and constituted a further \nbreach of s.  8 of the Charter . \n[64] Finally, given our conclusion that an unlawful search cannot provide the \nrequisite grounds for an arrest, the second and third arrests are also unlawful. They \nwere based on the results of these unlawful incidental searches. Wit hout the unlawful \nsearches, the police would not have had the requisite grounds for either arrest. The three \narrests in this case therefore constituted further breaches of s.  9 of the Charter . The \n2023 SCC 30 (CanLII)\n\n--- Page 45 ---\n \n placement of the appellant in the police vehicle (with hand cuffs after the first arrest) \nand at the police detachment are further continuations of the s.  9 breaches occasioned \nby the arrests and investigative detention.  \n(2) The Section  24(2) Grant  Analysis  \n[65] Having determined that the arrests and the incidental searche s constituted \nbreaches of ss.  8 and  9 of the Charter , those breaches must be factored into the s.  24(2) \nanalysis. In addition, the Court of Appeal was correct to note, unanimously, that the \ntrial judge erred in failing to consider in her s.  24(2) analysis the s.  9 breach she found, \nrelating to the investigative detention. Where the trial judge has failed to consider a \nrelevant factor, it is necessary to perform a fresh s.  24(2) analysis ( R. v. Vu , 2013 SCC \n60, [2013] 3 S.C.R. 657 , at para.  67). Within this fresh analysis, the trial judge’s \nfindings of fact remain relevant and warrant deference, absent palpable and overriding \nerror (see Grant 2009,  at para.  129; Beaver , at para.  118).   \n(a) The Seriousness of the Charter -Infringing State Conduct  \n[66] The trial judge found that Constable MacPhail knew the applicable \nstandard and sought to apply it, and that he was only off the mark to a “miniscule” \ndegree. In her words, there was “no evidence of a deliberate or systemic breach” (A.R., \nvol. I, at p.  20). Although the trial judge failed to include the investigative detention in \nher s.  24(2) analysis, her findings on the sniffer search remain relevant, given that both \nstate actions share the requisite standard of “reasonable suspicion”. This finding — that \n2023 SCC 30 (CanLII)\n\n--- Page 46 ---\n \n Constable MacPhail was “extremely close” to the standard of reasonable suspicion — \nreduces the seriousness of both the unlawful sniffer search and the investigative \ndetention, the two Charter breaches she found (see, e.g., R. v. Chehil , 2013 SCC 49, \n[2013]  3 S.C.R. 220 ; R. v. MacKenzie , 2013 SCC 50, [2013] 3 S.C.R. 250 ). \n[67] On appeal, this Court has recognized that additional Charter breaches \noccurred in the sequence of events: the arrest which followed as a consequence of the \nsniffer search; the searches that  followed incident to arrest; and the additional arrests \nthat followed from those searches. There was nothing to indicate that those breaches \nwere state misconduct, save that they were consequential on the sniffer search being \nunlawful. It was entirely unr emarkable, for example, that the police would arrest the \nappellant after finding over 100 pounds of cannabis in his vehicle. The arrests (and \nsearches incident) were not characterized by additional or independent misconduct.  \n[68] Further, the Charter  breaches identified by the trial judge were not found \nto be intentional; it could not be said the police knew from the outset that they were \nacting beyond their lawful authority. Importantly, these additional breaches were \nbreaches only because of the officer’s mis calculation in assessing the grounds for \nsuspicion",
    "token_count": 1000,
    "start_token": 18000,
    "end_token": 19000,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 21,
    "source_file": "2023scc30.txt",
    "text": " finding over 100 pounds of cannabis in his vehicle. The arrests (and \nsearches incident) were not characterized by additional or independent misconduct.  \n[68] Further, the Charter  breaches identified by the trial judge were not found \nto be intentional; it could not be said the police knew from the outset that they were \nacting beyond their lawful authority. Importantly, these additional breaches were \nbreaches only because of the officer’s mis calculation in assessing the grounds for \nsuspicion. These additional “consequential” breaches, therefore, do not raise the \nseriousness of the state conduct in this case; the focal point of this analysis remains the \ninitial breaches that set the sequence of  state conduct into motion.  \n[69] The Charter -infringing state conduct in this case was inadvertent and not \nwilful; it does not show a pattern or attitude of disregard for the appellant’s Charter \n2023 SCC 30 (CanLII)\n\n--- Page 47 ---\n \n rights or the law. Therefore, even considering the additional bre aches on appeal, this \nfactor does not strongly favour exclusion.   \n(b) The Impact on the Charter -Protected Interests of the Accused  \n[70] First, in terms of the breaches found by the trial judge, the sniffer dog \nsearch was of a relatively “brief and non -intrusive” nature ( MacKenzie , at para.  133, \nper LeBel J., dissenting). Where a s.  8 violation has occurred, this inquiry focuses on \n“the protected interests of privacy, and more broadly, human dignity” ( Grant 2009,  at \npara.  78; R. v. Cole , 2012 SCC 53, [2012] 3 S.C.R . 34, at para.  91; R. v. Le , 2019 SCC \n34, [2019] 2 S.C.R. 692 , at para.  136). This Court has found that sniff searches are \n“minimally intrusive” ( Chehil , at paras.  1 and  28; MacKenzie , at para.  86). As the trial \njudge noted, this search of the exterior of the appellant’s motor vehicle occurred on a \npublic highway, which is a relevant factor.  \n[71] The s.  9 violations engage concerns over protecting the appellant’s \n“individual liberty from unjustified state interference” ( Grant 2009,  at para.  20; Le, at \npara.  152; Beaver , at para.  127). While the investigative detention unlawfully restricted \nthe appellant’s liberty and movement, the appellant was first lawfully detained for the \ntraffic infractions (see Tim, at para.  92). While the sniffer dog search pr olonged this \ndetention, the fact that the appellant was lawfully stopped in the first place remains \nrelevant.  \n2023 SCC 30 (CanLII)\n\n--- Page 48 ---\n \n [72] Second, while the additional breaches found on appeal did not heighten the \nseriousness of the Charter -infringing state conduct under the first Grant factor, they \nnecessarily result in a more significant impact for the second Grant factor, the Charter -\nprotected interests of the accused. As in McColman , as a result of the investigative \ndetention and sniffer dog search, the appellant was arrested, and  then brought to the \npolice station, where he was detained for several hours. The undisputed circumstances \nof this arrest (including the fact that he was handcuffed) are relevant to assessing the \nimpact on his liberty. In terms of his privacy interests, th e police obtained significant \nevidence against the appellant. Unlike in McColman , the police in this case went further \nand conducted a search of the appellant’s vehicle and its contents (including duffel \nbags). This Court has held that motorists have a red uced expectation of privacy in their \nvehicles ( R. v. Harrison , 2009 SCC 34, [2009] 2 S.C.R. 494 , at para.  30; Tim, at \npara.  93). The search of the duffel bags involves a greater intrusion on the appellant’s \nprivacy interests.  \n[73] Taken together, the arrests a nd searches which flowed from those arrests \nresulted in a more significant impact on the appellant’s privacy, liberty, and dignity. \nThe second Grant factor, therefore, moderately favours exclusion.   \n(c) Society’s Interest in an Adjudication on the Merits  \n[74] The evidence in this case — the drugs, drug paraphernalia, and cash — \nwas real, reliable, and crucial to the Crown",
    "token_count": 1000,
    "start_token": 18900,
    "end_token": 19900,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 22,
    "source_file": "2023scc30.txt",
    "text": " \nprivacy interests.  \n[73] Taken together, the arrests a nd searches which flowed from those arrests \nresulted in a more significant impact on the appellant’s privacy, liberty, and dignity. \nThe second Grant factor, therefore, moderately favours exclusion.   \n(c) Society’s Interest in an Adjudication on the Merits  \n[74] The evidence in this case — the drugs, drug paraphernalia, and cash — \nwas real, reliable, and crucial to the Crown’s case. Given the large quantity of cannabis \n(over 100 pounds), this is a serious offence. Both of these elements mean that there is \n2023 SCC 30 (CanLII)\n\n--- Page 49 ---\n \n a strong  societal interest in adjudication of the case on its merits. This remains so even \nwhen the additional breaches are factored in. This third Grant  factor, therefore, strongly \nfavours admission of the evidence.   \n(d) Balancing  \n[75] The first two Grant factors favour e xclusion, albeit not strongly for the first \nand moderately for the second. We pause to note, briefly, that it was incorrect for the \ndissenting judge to state that either of the first Grant factors would favour admission \n(C.A. reasons, at para.  63). The fir st two branches never favour admission — at most, \nthey can weakly favour exclusion (see Le, at para.  141).  \n[76] As mentioned, the third Grant factor tends strongly in favour of admission \nof the evidence. The pull of the first two factors in this case is insufficient to outweigh \nthe third; thus, overall the circumstances favour admission. This conclusion is \nconsistent with other decisions of this  Court that involved a less serious Charter breach, \na significant or moderately intrusive impact, and evidence that was real, reliable, and \ncrucial to the Crown’s case (see, e.g., Grant 2009,  at para.  140; Vu, at para.  74). Thus, \nhaving balanced the factor s, we would affirm the decision to admit the evidence and \ndismiss the appeal.  \n The following are the reasons delivered by  \n CÔTÉ  J. —  \n2023 SCC 30 (CanLII)\n\n--- Page 50 ---\n \n I. Introduction  \n[77] I agree with my colleagues Rowe and O’Bonsawin  JJ. that the appeal from \nthe Alberta Court of Appeal’s decisio n (2022 ABCA 112, 44 Alta. L.R. (7th) 5) should \nbe dismissed. However, I do not agree with their proposition that the state “cannot rely \non unlawfully obtained evidence to satisfy the reasonable and probable grounds \nrequirement for arrest” (para.  2; see al so Martin and Kasirer  JJ.’s reasons, at para.  107). \nWhile this Court has never directly considered the issue, my colleagues’ position is, in \nmy respectful view, difficult to reconcile with both (1) this Court’s longstanding \njurisprudence on s.  24(2) of the  Canadian Charter of Rights and Freedoms , and (2) the \nframework for warrantless arrests set out in R. v. Storrey , [1990] 1 S.C.R. 241.  \n[78] First, a Charter breach that leads to incriminating evidence being \nuncovered will inevitably result in an arrest or other  investigative steps by the police. \nAbsent independent or additional police misconduct, this Court has never treated such \narrests or investigative steps as separate Charter breaches in its s.  24(2) analysis.  \n[79] Second, the objective judicial assessment of a p olice officer’s subjective \ngrounds for a warrantless arrest must be based on the “totality of the circumstances \nknown to the officer at the time of the arrest” ( R. v. Tim , 2022 SCC 12, at para.  24, \nciting Storrey , at pp.  250-51). In evaluating the officer’ s objective grounds for arrest, \n“courts must recognize that, ‘[o]ften, the officer’s decision to arrest must be made \nquickly in volatile and rapidly changing situations. Judicial reflection is not a luxury \nthe officer can afford. The officer must make his or her decision based on available \n2023 SCC 30 (CanLII)\n\n--- Page 51 ---\n \n information which is often less than exact or complete’” ( R. v. Beaver , 2022 SCC 54, \nat para.  72, quoting R. v. Golub  (1997), 34 O.R. (3d) 743 (C.A.),",
    "token_count": 1000,
    "start_token": 19800,
    "end_token": 20800,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 23,
    "source_file": "2023scc30.txt",
    "text": " Judicial reflection is not a luxury \nthe officer can afford. The officer must make his or her decision based on available \n2023 SCC 30 (CanLII)\n\n--- Page 51 ---\n \n information which is often less than exact or complete’” ( R. v. Beaver , 2022 SCC 54, \nat para.  72, quoting R. v. Golub  (1997), 34 O.R. (3d) 743 (C.A.), at p.  750, per \nDoherty  J.A.).  \n[80] In this case, my four colleagues’ view o f whether Cst.  MacPhail had \nreasonable and probable grounds for arrest is not based on the circumstances known to \nhim at the time of the arrest, which included the sniffer dog’s clear and unequivocal \nindication of controlled substances in the appellant’s v ehicle. Rather, it hinges entirely \non a retroactive judicial assessment of the lawfulness of the sniff search. However, the \nfocus of this Court’s s.  24(2) analysis should be  — and always has been  — on that \ninitial search (and in this case, the accompanying  investigative detention while awaiting \nthe arrival of the dog). The presence of additional “breaches” was not argued at trial \nand has little, if any, impact on Rowe and O’Bonsawin  JJ.’s s.  24(2) analysis, with \nwhich I am in substantial agreement. I would dismiss the appeal and uphold the \nappellant’s conviction.  \nII. Analysis  \n[81] My colleagues Rowe and O’Bonsawin  JJ. restate their conclusion as \nfollows: “.  . . reasonable [and probable] grounds for lawful arrest cannot be supplied \nby actions that involved violations of the Charter  . . .” (para.  30; see Martin and \nKasirer  JJ.’s reasons, at para.  107, where this “sound proposition” is endorsed). They \nview this conclusion as a “logical extension” of the principles applicable in other \ncontexts where an initial Charter breach forms the basis for subsequent state action, \n2023 SCC 30 (CanLII)\n\n--- Page 52 ---\n \n referring in this regard to search warrants and searches incident to arrest (Rowe and \nO’Bonsawin  JJ.’s reasons, at para.  30, citing R. v. Feeney , [1997] 2 S.C.R. 13; R. v. \nStillman , [1997] 1 S.C.R. 607; R. v. Caslake , [1998] 1 S.C.R. 51; Tim). \n[82] To understand why these contexts are distinguishable, it is necessary to \nreview this Court’s s.  24(2) jurisprudence and its jurisprudence relating to Storrey  in \nsome detail. I consider each in turn below before discussi ng the implications of my \ncolleagues’ approach.  \nA. Section 24(2) of the Charter  \n(1) Our Court’s Section  24(2) Jurisprudence  \n[83] If, as my colleagues conclude, a lawful arrest cannot be based on \nunlawfully obtained evidence, then this Court has neglected or failed to consider a host \nof additional Charter breaches throughout its s.  24(2) jurisprudence. The accused’s \narrest  — made dir ectly on the basis of unlawfully obtained evidence  — would have \nbeen a Charter breach in, among others, R. v. Grant , 2009 SCC 32, [2009] 2 S.C.R. \n353 (“ Grant  2009”); R. v. Harrison , 2009 SCC 34, [2009] 2 S.C.R. 494; R. v. Côté , \n2011 SCC 46, [2011] 3 S.C.R.  215; R. v. Aucoin , 2012 SCC 66, [2012] 3 S.C.R. 408; \nR. v. Paterson , 2017 SCC 15, [2017] 1 S.C.R. 202; R. v. Le , 2019 SCC 34, [2019] 2 \nS.C.R. 692; R. v. Lafrance , 2022 SCC 32; and R. v. McColman , 2023 SCC 8. More \nparticularly, Grant  2009, Harrison , and, m ost recently, McColman  serve to illustrate \nthis point.  \n2023 SCC ",
    "token_count": 1000,
    "start_token": 20700,
    "end_token": 21700,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 24,
    "source_file": "2023scc30.txt",
    "text": "1 S.C.R. 202; R. v. Le , 2019 SCC 34, [2019] 2 \nS.C.R. 692; R. v. Lafrance , 2022 SCC 32; and R. v. McColman , 2023 SCC 8. More \nparticularly, Grant  2009, Harrison , and, m ost recently, McColman  serve to illustrate \nthis point.  \n2023 SCC 30 (CanLII)\n\n--- Page 53 ---\n \n (a) Grant 2009  \n[84] In Grant  2009, the accused was arbitrarily detained by the police at the side \nof the road. During his unlawful detention, he admitted to having a firearm. He was \nthen arrested and searched b y the police, who seized a loaded revolver (paras.  7-8). \nWriting for the majority of the Court, McLachlin  C.J. and Charron  J. identified two \nCharter violations: the initial arbitrary detention (s.  9), and the corresponding breach \nof the accused’s s.  10(b) right to counsel while the police officer was “probing for \nanswers that would give him grounds for search or arrest” (paras.  135-36). Though it \ndid not explicitly consider the issue, the Court did not treat the police’s subsequent \narrest or search as unlaw ful in its s.  24(2) analysis (paras.  131-40). \n(b) Harrison  \n[85] In Harrison , the companion appeal to Grant  2009, the police arbitrarily \ndetained the accused during an unlawful traffic stop. The accused was unable to provide \nhis driver’s licence. The police ran a co mputer check and learned that he was driving \nwhile his licence was suspended, for which he was arrested. The police then searched \nthe vehicle “‘incident to arrest’, ostensibly for the appellant’s missing driver’s licence, \neven though its whereabouts was ir relevant to the charge of driving while suspended” \n(para.  8). During that search, the police found two boxes of cocaine and arrested the \nappellant on drug charges as well (para.  9). Writing for the majority of the Court, \nMcLachlin  C.J. held that “[t]he Charter breaches in this case are clear”: (1) the initial \ndetention on the side of the road, and (2) the search of the vehicle, which was not \n2023 SCC 30 (CanLII)\n\n--- Page 54 ---\n \n incidental to the appellant’s arrest for driving with a suspended licence (para.  20). As \nin Grant  2009, McLachlin  C.J. did not factor in either of the accused’s arrests as \nseparate or additional Charter breaches in her s.  24(2) analysis, although she ultimately \nexcluded the cocaine evidence.  \n(c) McColman  \n[86] Most recently, in McColman , the police unlawfully detained the accused \non his driveway. “As a result of the unlawful stop, Mr.  McColman was arrested and \nbrought to the police station, where he was detained for several hours [and] [t]he police \nobtained significant evidence against h im” (para.  68), including the inculpatory results \nof two breathalyzer tests. The sole Charter breach identified by Wagner  C.J. and \nO’Bonsawin  J., writing for a unanimous Court, was the accused’s arbitrary detention \nprior to his arrest (see paras.  51-52). W hile the Court considered the circumstances of \nthe subsequent breathalyzer tests and arrest of the accused in its analysis of the factors \noutlined in Grant  2009 (see para.  68), it did not treat those breathalyzer tests or that \narrest as Charter breaches.  \n(d) Section 8  \n[87] In each of Grant  2009, Harrison , and McColman , the incriminating \nevidence flowed from an initial unlawful detention. The approach of my four \ncolleagues in the instant case is also inconsistent with how our Court has treated \nunlawful searches that uncover evidence of a crime. In their view, every s.  8 breach \n2023 SCC 30 (CanLII)\n\n--- Page 55 ---\n \n would become a breach of both s.  8 and s.  9 if the search resulted in an arrest. This is \nnot supported by our Court’s jurisprudence; for example, in Paterson , the Court treated \nan unlawful searc h that uncovered a firearm and drugs and resulted in the accused",
    "token_count": 1000,
    "start_token": 21600,
    "end_token": 22600,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 25,
    "source_file": "2023scc30.txt",
    "text": " that uncover evidence of a crime. In their view, every s.  8 breach \n2023 SCC 30 (CanLII)\n\n--- Page 55 ---\n \n would become a breach of both s.  8 and s.  9 if the search resulted in an arrest. This is \nnot supported by our Court’s jurisprudence; for example, in Paterson , the Court treated \nan unlawful searc h that uncovered a firearm and drugs and resulted in the accused’s \narrest solely as a breach of s.  8 (see paras.  2 and 41 -57). \n[88] That being said, it may happen that the police commit additional or \nindependent Charter  breaches during their investigation. If s o, those breaches must and \nwill be considered in the s.  24(2) analysis; this will be the case, for example, if an \naccused is subsequently denied the right to counsel upon arrest or is unreasonably \nsearched incident to their arrest.  \n(2) Sniff Searches  \n[89] Our Court  has considered the legality of sniffer dog searches on multiple \noccasions. It has affirmed that sniff searches are a minimally privacy intrusive form of \nsearch (see R. v. Chehil , 2013 SCC 49, [2013] 3 S.C.R. 220, at paras.  1 and 28; R. v. \nMacKenzie , 2013 SCC 50, [2013] 3 S.C.R. 250, at para.  86). Indeed, it is because of \nthe “minimally intrusive, narrowly targeted, and highly accurate nature” of sniff \nsearches that only a “reasonable suspicion” of criminal activity is required to justify \ntheir use ( Chehil , at para.  28, citing Binnie  J. in R. v. Kang -Brown , 2008 SCC 18, \n[2008] 1 S.C.R. 456, at para.  60; R. v.  A.M. , 2008 SCC 19, [2008] 1 S.C.R. 569, at \nparas.  81-84). \n2023 SCC 30 (CanLII)\n\n--- Page 56 ---\n \n [90] A unanimous Court in Chehil , and a majority of the Court in MacKenzie , \nheld that the sniff searches at issue were lawful and did not breach s.  8. The Court \ntherefore did not need to consider s.  24(2) or the issues arising in this appeal. However, \nin MacKenzie , the four dissenting judges who did find the sniff search to be a  breach \nof s. 8 (LeBel  J., together with McLachlin  C.J. and Fish and Cromwell  JJ.) did not treat \nthe accused’s arrest or any subsequent police conduct as unlawful. As in this case, the \npolice arrested the accused and searched his car following a positive i ndication by the \nsniffer dog (paras.  19-21). LeBel  J. identified two Charter breaches: the sniff search \nand the accompanying investigative detention (paras.  128-36). \n[91] Under the approach of my four colleagues in this case, LeBel  J. should also \nhave found tha t the appellant’s arrest, his ongoing detention, and all searches \nsubsequent to the unlawful sniff search were Charter breaches. According to my \ncolleagues Martin and Kasirer  JJ., these additional “breaches”  — all of which turn on \nwhether the initial sniff  search was lawful  — would materially alter the result of the \ns. 24(2) analysis. I will consider the jurisprudential difficulties as well as the \nimplications of this approach in more detail below.  \nB. Storrey  \n[92] The reasonable and probable grounds standard for a warrantless arrest was \nrecently summarized in Tim, at para.  24, referring to Storrey , at pp.  250-51: \n2023 SCC 30 (CanLII)\n\n--- Page 57 ---\n \n A warrantless arrest requires both subjective and objective grounds. The \narresting officer must subjectively have reasonable and probable grounds \nfor the a rrest, and those grounds must be justifiable from an objective \nviewpoint. The objective assessment is based on the totality of the \ncircumstances known to the officer at the time of the arrest , including the \ndynamics of the situation, as seen from the persp ective of a reasonable \nperson with comparable knowledge, training, and experience as the \narresting officer",
    "token_count": 1000,
    "start_token": 22500,
    "end_token": 23500,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 26,
    "source_file": "2023scc30.txt",
    "text": " grounds. The \narresting officer must subjectively have reasonable and probable grounds \nfor the a rrest, and those grounds must be justifiable from an objective \nviewpoint. The objective assessment is based on the totality of the \ncircumstances known to the officer at the time of the arrest , including the \ndynamics of the situation, as seen from the persp ective of a reasonable \nperson with comparable knowledge, training, and experience as the \narresting officer. [Emphasis added.]  \n[93] In Beaver , the Court affirmed that the analysis must be conducted “from \nthe perspective of a reasonable person ‘standing in the sh oes of the [arresting] officer’” \n(para.  72, citing Chehil , at paras.  45 and 47; MacKenzie , at para.  63). Writing for the \nmajority, Jamal  J., at para.  72, cited with approval part of the following passage from \nGolub , per Doherty  J.A.:  \nThe dynamics at play i n an arrest situation are very different than those \nwhich operate on an application for a search warrant. Often, the officer’s \ndecision to arrest must be made quickly in volatile and rapidly changing \nsituations. Judicial reflection is not a luxury the offi cer can afford. The \nofficer must make his or her decision based on available information which \nis often less than exact or complete. The law does not expect the same kind \nof inquiry of a police officer deciding whether to make an arrest that it \ndemands of a justice faced with an application for a search warrant. \n[p. 750] \n[94] In R. v. Love , 2022 ABCA 269, [2023] 1 W.W.R. 296, the Court of Appeal \nof Alberta directly considered whether the logic behind the excision of \nunconstitutionally obtained information, in th e search warrant context, should be \napplied to warrantless arrests. The Court of Appeal concluded that the automatic \nexcision rule, if applied to the context of warrantless arrests, would conflict with \nStorrey : \n2023 SCC 30 (CanLII)\n\n--- Page 58 ---\n \n Automatic excision, operating after -the-fact, would nullify the \nsubjective focus of the Storrey  test by artificially altering the information \non which the arresting officer relied at the time. It would distort the \nobjective aspect of the test by shifting the focus away from the factual basis \nfor the officer’s action. It would conflict with the Supreme Court’s \ndirection that an officer exercising a warrantless power “is entitled to \ndisregard only information which he has good reason to believe is \nunreliable”: Chehil  at para  33. [para.  94] \n[95] I agree. On m y colleagues’ approach, the assessment of an officer’s \ngrounds for arrest would no longer be based on the “circumstances known to the officer \nat the time of the arrest” (see Tim, at para.  24; Storrey , at pp.  250-51; MacKenzie , at \npara.  33; Beaver , at paras . 72 and 88; and Golub , p. 750). Rather, their approach hinges \nentirely on a retroactive judicial assessment of the underlying sniff search.  \n[96] This Court has made it clear that the reasonable and probable grounds \nstandard relates to the facts, not to the exi stence in law of the offence in question (see \nTim, at para.  28, quoting Kosoian v. Société de transport de Montréal , 2019 SCC 59, \n[2019] 4 S.C.R. 335, at para.  78; Frey v. Fedoruk , [1950] S.C.R. 517, at p.  531). \nJudicial reflection is not a luxury an offic er can afford. It is artificial and inconsistent \nwith the reasonable and probable grounds standard to hold that an arrest made based \non clear and reliable evidence of a crime is unlawful. If that evidence is later determined \nto have been obtained through a n unlawful search or detention, that search or detention \nwill be properly evaluated in the s.  24(2) inquiry.  \n[97] With this in mind, I would respectfully submit that it is understandable why \nthis Court has declined, in the three decades since R. v. Grant , [1993 ] 3 S.C.R. 223, to \n2023 SCC 30 (CanLII)\n\n--- Page 59 ---\n \n apply the logic behind excision to the context of warrant",
    "token_count": 1000,
    "start_token": 23400,
    "end_token": 24400,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 27,
    "source_file": "2023scc30.txt",
    "text": " detention, that search or detention \nwill be properly evaluated in the s.  24(2) inquiry.  \n[97] With this in mind, I would respectfully submit that it is understandable why \nthis Court has declined, in the three decades since R. v. Grant , [1993 ] 3 S.C.R. 223, to \n2023 SCC 30 (CanLII)\n\n--- Page 59 ---\n \n apply the logic behind excision to the context of warrantless arrests. Similarly, and with \nrespect, my colleagues’ reliance on searches incident to arrest (see Rowe and \nO’Bonsawin  JJ.’s reasons, at paras. 30 -31; Martin and Kasirer  JJ.’s reasons, at \npara.  128) is misplaced. Because the common law power to search incident to arrest is \nderived solely from the legality of the arrest, “if the arrest is later found to be invalid, \nthe search will be also” ( Caslake , at para.  13; see also Golub , at pp.  753-54, per \nDoherty  J.A.). By contrast, the legality of an arrest made based on the results of an \nunlawful search or detention is not derived solely from the basis for the underlying \nsearch or detention. The arrest is based on an additional factor  — the discovery of the \nincriminating evidence itself. Again, if the underlying search or detention is \nsubsequently found to be invalid, that breach will be properly assessed in the s.  24(2) \ninquiry.  \nC. Implications for the Exclusion of Evidence Under Section  24(2) \n[98] Inevitably, an unlawful search or detention that uncovers evidence of a \ncrime will result in an arrest or other investigative steps by the police. On my \ncolleagues’ approach, what transforms the initial Charter violations  — in this case, the \nunlawful sniff search and accompanying investigative detention  — into a series or \n“cascade” of additional Charter breaches has nothing to do with any subsequent police \nmisconduct. Rather, it depends entirely on whether the unlawful search or detention \nyields incrim inating evidence and thus naturally results in an arrest. With respect, to \nclassify all subsequent police conduct as Charter -infringing merely because it flows \n2023 SCC 30 (CanLII)\n\n--- Page 60 ---\n \n from the results of an initial breach comes dangerously close to the “fruit of the \npoisoned tree ” doctrine eschewed by this Court’s s.  24(2) jurisprudence.  \n[99] In this regard, in R. v. Jennings , 2018 ONCA 260, 45 C.R. (7th) 224, the \nCourt of Appeal for Ontario considered the Charter -protected interests at stake for \nthose who provide a breath sample to po lice. Writing for the court, Miller  J.A. (Watt \nand Hourigan  JJ.A. concurring) reasoned that in Grant 2009, this Court expressly chose \nthe breath sample procedure as an example of a minimally intrusive form of search \n(para.  29, citing Grant 2009, at paras.  106-11). He went on to state that this Court \n“assuredly did so in the knowledge that most formal demands for breath samples would \nbe accompanied by an arrest”, i.e., for drivers who test above the legal limit ( Jennings , \nat para.  29). Drivers in such cases are “almost invariably arrested and taken to the police \nstation to provide further breath samples” (para.  32). \n[100]  Like the breath sample procedure, this Court has characterized sniff \nsearches as a minimally intrusive form of search, and it has assuredly done so with the \nknowledge that a positive indication from a sniffer dog will lead to an arrest or other \ninvestigative steps by the police (see, e.g., Chehil , at para.  55). In their s.  24(2) analysis, \nmy colleagues Martin and Kasirer  JJ. do not refer to any of this Court’s jurisprudence \non sniff searches or address the relatively minimal impact of this form of search. With \nrespect, their analysis runs contrary to a sound characterization of the \nCharter -protected interests at stake for an individual subject to a sniff search (see \nChehil , para.  19; see also Kang -Brown ; A.M. ). \n2023 SCC 30 (CanLII)\n\n--- Page 61 ---\n \n [101]  My colleagues Martin and Kasirer  JJ. rely primarily on Tim and R. v. Reilly , \n2021",
    "token_count": 1000,
    "start_token": 24300,
    "end_token": 25300,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 28,
    "source_file": "2023scc30.txt",
    "text": " search. With \nrespect, their analysis runs contrary to a sound characterization of the \nCharter -protected interests at stake for an individual subject to a sniff search (see \nChehil , para.  19; see also Kang -Brown ; A.M. ). \n2023 SCC 30 (CanLII)\n\n--- Page 61 ---\n \n [101]  My colleagues Martin and Kasirer  JJ. rely primarily on Tim and R. v. Reilly , \n2021 SCC 38, for the undisputed proposition that all Charter  breaches must be \nconsidered in the s.  24(2) analysis. But this proposition does not establish that certain \npolice conduct constituted a Charter breach in the first place. Their approach is not \n“consonant” with Grant 2009, in which this Court did not treat the accused’s arrest and \nsearch as Charter violations by virtue of their connection to the initial breach. Likewise, \nthe need to consider “all the circumstances” under s.  24(2) (see Martin and Kasirer  JJ.’s \nreasons, at paras.  111-15 and 129 -33) — which, in my view, refers to the three avenues \nof inquiry set o ut in Grant  2009 (see para.  71) — does not mean that “all” of those \ncircumstances amount to Charter breaches.  \n[102]  Martin and Kasirer JJ.’s emphasis on the seriousness of the \nCharter -infringing state conduct in this case ignores the fact that all police conduct \nsubsequent to the sniff search was based on an intervening factor  — the discovery of \nincriminating evidence. The question at the first stage of the Grant 2009 analysis may \nbe fr amed as follows: “Did [the police conduct] involve misconduct from which the \ncourt should be concerned to dissociate itself?” ( McColman , at para.  57, quoting \nMcLachlin  C.J. in Harrison , at para.  22). In my view, an arrest made on the basis of \nclear and rel iable evidence of a crime is not “misconduct” from which the court should \nbe concerned to dissociate itself. The relevant misconduct in this case, from which the \nCourt should be concerned to dissociate itself, is Cst.  MacPhail’s initial decision to \ndeploy a sniffer dog without lawful authority to do so.  \n2023 SCC 30 (CanLII)\n\n--- Page 62 ---\n \n [103]  To hold otherwise artificially distorts the s.  24(2) analysis and, I would \nrespectfully submit, represents a shift towards automatic exclusionary rules that have \nbeen rejected in our jurisprudence. At the ve ry least, the issues raised in this appeal \nmerit attention by a full Court in a case where the additional breaches were argued and \nconsidered at trial.  \nIII. Disposition  \n[104]  In the result, labelling all police conduct subsequent to the sniff search in \nthis case as u nlawful does not change the outcome of Rowe and O’Bonsawin  JJ.’s \ns. 24(2) analysis, with which I substantially agree. The trial judge correctly \ncharacterized Cst.  MacPhail’s failure to meet the reasonable suspicion standard as \n“miniscule” (A.R., vol.  I, at p.  20). At the first stage of the Grant  2009 analysis, the \nseriousness of the Charter -infringing state conduct only w eakly favours exclusion. At \nthe second stage, I agree with my colleagues Rowe and O’Bonsawin  JJ. that the impact \non the appellant was moderate, bearing in mind the “minimally intrusive” nature of a \nsniff search and the reduced expectation of privacy in a m otor vehicle (see Chehil , at \npara.  28; MacKenzie , at paras.  31, 86 and 133). The investigative detention was brief, \nnecessary to facilitate deployment of the sniffer dog, and accompanied by the right to \ncounsel. At the third stage, the evidence is both hig hly reliable and integral to the \nCrown’s case, which strongly favours admission.  \n[105]  On balance, I would affirm the decision to admit the drug evidence, dismiss \nthe appeal and uphold the appellant’s conviction.  \n2023 SCC 30 (CanLII)\n\n--- Page 63 ---\n \n  The following are the reasons delivered by  \n MART IN AND KASIRER JJ. —  \nI. Overview  \n[106]  We have had the advantage of reading the reasons of our colleagues",
    "token_count": 1000,
    "start_token": 25200,
    "end_token": 26200,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 29,
    "source_file": "2023scc30.txt",
    "text": " the \nCrown’s case, which strongly favours admission.  \n[105]  On balance, I would affirm the decision to admit the drug evidence, dismiss \nthe appeal and uphold the appellant’s conviction.  \n2023 SCC 30 (CanLII)\n\n--- Page 63 ---\n \n  The following are the reasons delivered by  \n MART IN AND KASIRER JJ. —  \nI. Overview  \n[106]  We have had the advantage of reading the reasons of our colleagues Rowe \nand O’Bonsawin  JJ. We agree with much of their reasons but, most respectfully, we \ndisagree in the result. For the reasons that follow, we would allow the  appeal, order the \nexclusion of the evidence, set aside the appellant’s conviction and enter an acquittal.  \n[107]  First, we agree with our colleagues that in the circumstances of this case it \nis appropriate for the Court to exercise its discretion and consider t he new issues raised \non appeal, contrary to the reasoning of the majority at the Court of Appeal of Alberta. \nSecond, we accept the sound proposition that a lawful arrest cannot be based on \nunlawful grounds, as Khullar  J.A. (as she then was), dissenting at the Court of Appeal, \nwould have held (2022 ABCA 112, 44 Alta. L.R. (7th) 5). More specifically, reasonable \nand probable grounds for arrest cannot be based on unconstitutional police misconduct. \nThird, we accept that the evidence at issue in this case was “ obtained in a manner” that \ninfringed each of the Charter  rights that our colleagues recognize as violated, including \neach of the arrests and searches to which Mr.  Zacharias was subject. Thus, like our \ncolleagues and Khullar J.A. below, we conclude that the  “threshold requirement” of the \ns. 24(2) analysis is met (see R. v. Plaha  (2004), 188 C.C.C. (3d) 289 (Ont. C.A.), at \npara.  44, per Doherty  J.A.).  \n2023 SCC 30 (CanLII)\n\n--- Page 64 ---\n \n [108]  We respectfully disagree, however, with both the courts below and our \ncolleagues on the legal framework that  governs how multiple, connected breaches \nfactor into the evaluative stage of the s.  24(2) analysis governed by R. v. Grant , 2009 \nSCC 32, [2009] 2 S.C.R. 353. We observe that neither the trial judge nor the majority \njudges in the Court of Appeal properly s ubjected all breaches of the accused’s Charter \nrights to complete scrutiny under s.  24(2). In fairness to the trial judge, we recognize \nthat the additional breaches identified by Khullar J.A. and by this Court were not before \nher. However, the trial judge identified a breach of Mr.  Zacharias’s s.  9 right, resulting \nfrom an unlawful investigative detention, and erred in law by not considering this \nbreach within her s.  24(2) analysis. This approach is incompatible with the legal \nprinciples this Court articula ted in Grant . All state conduct that undermines the rule of \nlaw by violating the Charter must be subject to proper judicial scrutiny under all three \nbranches of  that test. In our respectful view, our colleagues carry this error forward \nwhen they conclude t hat consequential breaches are unlikely to increase the overall \nseriousness of Charter -infringing state conduct unless those breaches reflect a \n“pattern” of misconduct or an “independent” wrong. Less exclusionary weight should \nnot be attached to a breach i n respect of any of the branches of the Grant test merely \nbecause a court has determined that it  was “consequential” to another, earlier breach.  \n[109]  The fact that a consequential or cascading breach may be seen to be caused \nby an initial breach cannot obviate  the need to factor it into the analysis and give full \nconsideration to whether it reflects conduct from which courts must disassociate \nthemselves ( Grant , at para.  72). Even when a consequential breach discloses no \n2023 SCC 30 (CanLII)\n\n--- Page 65 ---\n \n independent misconduct it is nonetheless a breach of the rights that the Charter \nprotects. As such, it contributes to the measure of seriousness of the state misconduct \nrelevant to s.  24(2) pursuant to Grant . Each consequential breach serves to undermine \nthe rule of law and necessarily contribute s, to a greater or lesser extent, to the risk that \nadmitting",
    "token_count": 1000,
    "start_token": 26100,
    "end_token": 27100,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 30,
    "source_file": "2023scc30.txt",
    "text": " a consequential breach discloses no \n2023 SCC 30 (CanLII)\n\n--- Page 65 ---\n \n independent misconduct it is nonetheless a breach of the rights that the Charter \nprotects. As such, it contributes to the measure of seriousness of the state misconduct \nrelevant to s.  24(2) pursuant to Grant . Each consequential breach serves to undermine \nthe rule of law and necessarily contribute s, to a greater or lesser extent, to the risk that \nadmitting the evidence in question in the proceedings would bring the administration \nof justice into disrepute. For that reason, all state conduct that violates the Charter  must \nbe weighed carefully in the  balancing that s.  24(2) demands. Ignoring the fact that \nconsequential breaches add to the cumulative, and potentially compounding, measure \nof the seriousness of state misconduct is, in our respectful view, an error of law under \ns. 24(2) of the Charter as interpreted by this Court in Grant . There is no basis to \ndiscount its seriousness, either from the outset or at the end of the analysis, as advanced \nby the respondent and the intervening attorneys general.  \n[110]  When this principle, which we take to be settled l aw, is duly recognized, a \ncorrect application of the s.  24(2) framework mandated by Grant  compels exclusion of \nthe evidence in this case, given the seriousness of the state misconduct that would \notherwise be discounted. It is of course true that no single consideration  can be allowed \nto overwhelm the flexible, contextual balancing exercise that s.  24(2) demands. The \napproach that s.  24(2) entrenched in the Constitution “rejected the American rule \nexcluding all evidence obtained in violation of the Bill of R ights and the common law \nrule that all relevant evidence was admissible regardless of the means by which it was \nobtained” ( R. v. Collins , [1987] 1 S.C.R. 265, at p.  280, per Lamer  J. (as he then was); \nsee also R. v. Simmons , [1988] 2 S.C.R. 495, at p. 532,  per Dickson  C.J.; Grant , at \n2023 SCC 30 (CanLII)\n\n--- Page 66 ---\n \n paras.  61-65). The approach mandated by s.  24(2) is different: courts must take proper \naccount of the societal interests that can, on balance, favour either the admission or the \nexclusion of unconstitutionally obtained evidence . \n[111]  In this case, the conclusion that Mr.  Zacharias’s Charter rights were \nbreached cannot in itself compel exclusion — but neither can the existence of real, \nreliable and crucial evidence compel inclusion. Rather, as s.  24(2) of the Charter  itself \nmakes plain, “all the circumstances” are relevant and must be considered at each stage \nof the test in Grant . Taking into account the seriousness of all of the state conduct that \nviolated s.  8 and s.  9 of the Charter , the impact of that conduct on t he accused and \nsociety’s interest in proceeding to trial on the merits, we conclude that the \nadministration of justice would be brought into disrepute by admitting the evidence. \nFor that reason, it must be excluded.  \nII. Analysis  \nA. The Law in Relation to Section  24(2)  \n[112]  The Court is called upon to consider the legal framework that governs the \nanalysis under s.  24(2) of the Charter , which provides:  \nWhere, in proceedings under subsection (1), a court concludes that \nevidence was obtained in a manner that infringed or  denied any rights or \nfreedoms guaranteed by this Charter, the evidence shall be excluded if it is \nestablished that, having regard to all the circumstances , the admission of it \nin the proceedings would bring the administration of justice into disrepute.  \n2023 SCC 30 (CanLII)\n\n--- Page 67 ---\n \n [113]  This provision directs courts to have regard to “all the circumstances” in \ndetermining whether admitting evidence obtained in a manner that violated the Charter \nwould bring the administration of justice into disrepute. If admitting the evidence \nwould do so, then s.  24(2) directs that courts shall exclude it. Rather than asking \nwhether to exclude the evidence, the question to be decided is “whether the \nadministration of justice would be brought into disrepute by its admission” ( R. v. Le , \n2019 SCC 34, [2019] ",
    "token_count": 1000,
    "start_token": 27000,
    "end_token": 28000,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 31,
    "source_file": "2023scc30.txt",
    "text": " admitting evidence obtained in a manner that violated the Charter \nwould bring the administration of justice into disrepute. If admitting the evidence \nwould do so, then s.  24(2) directs that courts shall exclude it. Rather than asking \nwhether to exclude the evidence, the question to be decided is “whether the \nadministration of justice would be brought into disrepute by its admission” ( R. v. Le , \n2019 SCC 34, [2019] 2 S.C.R. 692, at para.  139). As a matter of settled law, the \ntripartite framework that this Court articulated in Grant structures courts’ answers to \nthis question.  \n[114]  Here, the Court must identify the legal principles that govern how “all the \ncircumstances” fa ctor into the analysis when “consequential”, “linked” or “cascading” \nbreaches of the Charter are at issue, that is to say breaches of the Charter  that flow \nfrom an initial breach of an accused’s Charter  rights by the state. We agree with our \ncolleagues tha t the presence of additional, consequential breaches will “necessarily” \nresult in more significant impacts on the Charter -protected interests of an accused and \nare “therefore relevant to the analysis of the second Grant  factor” (para.  56). Thus, all \nsuch b reaches must be given weight under the second line of inquiry mandated by \nGrant , which assesses the impact of the state misconduct on the accused .  \n[115]  However, we respectfully reject the view that consequential breaches of \nconstitutional rights can be charact erized as unlikely to significantly affect the overall \nseriousness of the state misconduct simply because they are “expected” to occur (Rowe \n2023 SCC 30 (CanLII)\n\n--- Page 68 ---\n \n and O’Bonsawin  JJ.’s reasons, at para.  59). We disagree that under the settled Grant  \nframework, the “focal point” f or evaluating seriousness is the initial breach (para.  68). \nFurther, we are unable to accept that “subsequent state conduct is unlikely to \nmeaningfully increase the seriousness of the Charter -infringing state conduct” merely \nbecause of the connection of th at conduct to earlier misconduct and the police’s honest \nbelief that they are acting lawfully (para.  53). To the contrary, s.  24(2) and the Grant \nanalysis mandate assessing the cumulative, and potentially compounding, seriousness \nof all of the conduct rela ted to each of the violations at issue, whether or not they are \nconsequential or cascade from an initial breach, and whether or not the police had such \nan honest belief. Two principles governing the assessment of the seriousness of \nCharter -infringing state  conduct  lead to this view: (1) seriousness is focused on the rule \nof law; and (2) the measure of seriousness is cumulative, necessarily taking into \naccount all circumstances and all of the state’s misconduct.  \n(1) Seriousness Is Focused on the Rule of Law  \n[116]  The first line of inquiry mandated by Grant is “an evaluation of the \nseriousness of the state conduct” that is at issue, viewed “in terms of the gravity of the \noffending conduct by state authorities whom the rule of law requires to uphold the \nrights guaran teed by the Charter ” (para.  73). \n[117]  In Grant , this Court recognized that the seriousness of state conduct is one \nfactor to be balanced in the s.  24(2) analysis because the courts cannot be seen to \n“condone state deviation from the rule of law by failing to di ssociate themselves from \n2023 SCC 30 (CanLII)\n\n--- Page 69 ---\n \n the fruits of that unlawful conduct” (para.  72; see also R. v. Tim , 2022 SCC 12, at \npara.  82; R. v. Beaver , 2022 SCC 54, at para.  120). In other words, the first line of \ninquiry mandated by Grant flows from the concern “to preserve  public confidence in \nthe rule of law and its processes” (para.  73). Commentators have rightly observed that \nthis “condonation theory” relating to the rule of law is the “key concept” that drives the \nlaw in relation to s.  24(2) (D.  M. Paciocco, P.  Paciocco  and L.  Stuesser, The Law of \nEvidence (8th ed. 2020), at p.  469; see also H.  Parent,",
    "token_count": 1000,
    "start_token": 27900,
    "end_token": 28900,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 32,
    "source_file": "2023scc30.txt",
    "text": "para.  73). Commentators have rightly observed that \nthis “condonation theory” relating to the rule of law is the “key concept” that drives the \nlaw in relation to s.  24(2) (D.  M. Paciocco, P.  Paciocco  and L.  Stuesser, The Law of \nEvidence (8th ed. 2020), at p.  469; see also H.  Parent, Traité de droit criminel , vol.  IV, \nLes garanties juridiques (2nd ed. 2021), at para.  584). This point is settled in our \njurisprudence: seriousness is to be evaluated based  on “the extent to which the state \nconduct at issue deviates from the rule of law” ( R. v. McColman , 2023 SCC 8, at \npara.  57, citing Grant  and R. v. Harrison , 2009 SCC 34, [2009] 2 S.C.R. 494, at \npara.  22).  \n[118]  All state action that violates the Charter necess arily deviates from the rule \nof law. The Charter functions to “constrain” and “limi[t]” all state actions inconsistent \nwith the rights it enshrines ( Hunter v. Southam Inc. , [1984] 2 S.C.R. 145, at p.  156, per \nDickson  J. (as he then was)). Indeed, the legal rights protected by ss.  7 to 14 of the \nCharter have been described by this Court as “essential elements of a system for the \nadministration of justice which is founded upo n the belief in the dignity and worth of \nthe human person and the rule of law” ( Re B.C. Motor Vehicle Act , [1985] 2 S.C.R. \n486, at p.  512, per Lamer  J. (as he then was)). Thus, instances where police officers \nsurpass these limits and violate the Charter  undermine the rule of law and must be seen \n2023 SCC 30 (CanLII)\n\n--- Page 70 ---\n \n as increasing the serious character of the state misconduct. There is accordingly a risk \nthat public confidence in the administration of justice will also be thereby diminished.  \n[119]  As this Court has repeatedly affirme d, “in a society founded on the rule of \nlaw, it is important that there always be a legal basis for the actions taken by police \nofficers” ( Kosoian v. Société de transport de Montréal , 2019 SCC 59, [2019] 4 S.C.R. \n335, at para.  38, citing Dedman v. The Quee n, [1985] 2 S.C.R. 2, at pp.  28‑29; R. v. \nSharma , [1993] 1 S.C.R. 650, at pp.  672‑73). This point bears repeating: there is no \ninstance in which a breach of the rights guaranteed by the Charter does not undermine \nthe rule of law.  \n[120]  The circumstances here pro vide a case in point. While the conduct related \nto the initial unreasonable search may not have been in itself grave, the seriousness of \nthe subsequent state misconduct — however “consequential” it may have been — was \nboth relevant and significant. Police acted without lawful authority in subjecting the \naccused to further searches, and by detaining him for several hours, part of which was \nin handcuffs; the fact that these breaches of s.  8 and s.  9 of the Charter  were \nconsequential or cascading from the init ial breach cannot mean that they should be \ndiscounted under the first branch of Grant . A breach is a breach. The consequential \nconduct was state conduct that violated the constitutional right to be free of arbitrary \ndetention. It was conduct that undermine d the rule of law.  \n[121]  Of course, not all conduct that violates the Charter deviates from the rule \nof law to the same extent. As this Court recognized in Grant , violations may undermine \n2023 SCC 30 (CanLII)\n\n--- Page 71 ---\n \n public confidence in the rule of law to a greater or lesser degree, depend ing on the \ngravity of the offending conduct that is at issue (paras.  73-74). There is a sliding scale \nor spectrum. We will not exhaustively review all of the considerations that may validly \ninform the assessment of the gravity of such conduct. Instead, we will focus on certain",
    "token_count": 1000,
    "start_token": 28800,
    "end_token": 29800,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 33,
    "source_file": "2023scc30.txt",
    "text": " , violations may undermine \n2023 SCC 30 (CanLII)\n\n--- Page 71 ---\n \n public confidence in the rule of law to a greater or lesser degree, depend ing on the \ngravity of the offending conduct that is at issue (paras.  73-74). There is a sliding scale \nor spectrum. We will not exhaustively review all of the considerations that may validly \ninform the assessment of the gravity of such conduct. Instead, we will focus on certain \nfactors that require discussion in the circumstances of this case.  \n[122]  One relevant factor is the extent to which the conduct reflects a deliberate \ndisregard for Charter standards. It is for this reason that the Court has recognized a \nscale from “inadvertent” violations to those that display a “wilful or reckless disregard \nof Charter rights” ( Grant , at para.  74). This scale is significant because it informs how \ngravely the rule of law is undermined. For instance, the rule of law is necess arily \nundermined, and the seriousness of the state misconduct is affected, when agents of the \nstate wilfully disregard the fundamental constitutional constraints on their actions. By \ncontrast, the Court has consistently recognized that state conduct at the  less serious end \nof this scale will generally weigh less heavily in favour of the view that admitting the \nevidence would undermine the rule of law (see, e.g., Grant , at para.  74; R. v. Paterson , \n2017 SCC 15, [2017] 1 S.C.R. 202, at para.  43; Le, at para.  143). But even inadvertent \nbreaches may still weigh in favour of exclusion (see, e.g., Tim, at paras.  84-89). As \nappellate jurisprudence has recognized, a deliberate breach is not the only form of \nserious breach (see, e.g., Hamel v. R. , 2021 QCCA 801, 72 C .R. (7th) 132, at para.  131, \nper Cournoyer  J.A.). This is because a breach based on an honest and unintentional \nmistake is nonetheless a state action taken in the absence of legal authority.  \n2023 SCC 30 (CanLII)\n\n--- Page 72 ---\n \n [123]  The extent to which state actors deliberately violate Charter standards is \nnot the only consideration that is relevant to assessing how gravely the rule of law has \nbeen undermined. For instance, as our colleagues rightly recognize, in Grant this Court \nnoted that “evidence that the Charter -infringing conduct was part of  a pattern of abuse” \nwill increase the exclusionary weight that flows from the first line of inquiry (para.  75). \nThis consideration reflects the reality that “for every Charter  breach that comes before \nthe courts, many others may go unidentified and unredr essed because they did not turn \nup relevant evidence leading to a criminal charge” ( ibid.). The recognition that a pattern \nmay increase the seriousness of the state conduct is significant. It implies that police \nofficers may believe they are proceeding law fully, yet there may still be a serious \ndeparture from the requirements of the rule of law.  Thus, it is an error to proceed as if \nthe seriousness inquiry may only consider police officers’ states of mind. This is \nbecause the focus of the seriousness inquir y, like the s.  24(2) analysis as a whole, is \n“societal” rather than aimed at determining the blameworthiness of the particular police \nofficers whose actions resulted in a Charter violation (para.  70). \n[124]  The societal focus of s.  24(2) also implies that the as sessment of the \nseriousness of state misconduct that undermines the rule of law must take account of \nthe values that underlie the Charter rights that were violated. As Dickson  C.J. wrote in \nanother context, “[t]he underlying values and principles of a free  and democratic \nsociety are the genesis of the rights and freedoms guaranteed by the Charter ” (R. v. \nOakes , [1986] 1 S.C.R. 103, at p.  136). These values and principles therefore inform \nthe assessment of how seriously Charter -infringing state conduct under mines the rule \n2023 SCC 30 (CanLII)\n\n--- Page 73 ---\n \n of law. They inform the key consideration of the nature and character of the police \nconduct that is at issue, viewed from a societal perspective. While Charter rights should \nnever be trivialized, some violations may be more “minor” than",
    "token_count": 1000,
    "start_token": 29700,
    "end_token": 30700,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 34,
    "source_file": "2023scc30.txt",
    "text": ".R. 103, at p.  136). These values and principles therefore inform \nthe assessment of how seriously Charter -infringing state conduct under mines the rule \n2023 SCC 30 (CanLII)\n\n--- Page 73 ---\n \n of law. They inform the key consideration of the nature and character of the police \nconduct that is at issue, viewed from a societal perspective. While Charter rights should \nnever be trivialized, some violations may be more “minor” than othe rs when these \nunderlying values are accounted for ( Grant , at para.  74). By contrast, other violations \nmay show “a major departure from Charter standards” in light of the values the relevant \nrights were meant to protect ( Tim, at para.  82). Thus, the Court’s  reference in Grant to \nwhether a breach was “minor” referred to a breach at the low end of the sliding scale \nor spectrum for the assessment of the nature and character of police conduct, viewed in \nlight of the values the Charter protects.  \n[125]  The full range o f relevant values entrenched in the Charter  should be \nconsidered. As this Court has said, the values reflected in the Charter  “are not insular \nand discrete” ( R. v. Lyons , [1987] 2 S.C.R. 309, at p.  326, per La Forest  J.). Thus, where \nmultiple rights are vi olated, the court must consider how the state conduct that is at \nissue implicates each underlying value, and how those values interact in the \ncircumstances of the case. For instance, there is every reason to believe that state \nmisconduct that undermines bo th the privacy interests protected by s. 8 and the liberty \ninterests protected by s.  9 will be more serious than misconduct implicating only one \nof these underlying values, because the social interests in protecting privacy and liberty \nare intertwined and mutually reinforcing. But they are distinct breaches, whether or not \none is consequential on the other.  \n2023 SCC 30 (CanLII)\n\n--- Page 74 ---\n \n [126]  When this Court has discussed these considerations and others that inform \nthe seriousness inquiry, it has properly refrained from suggesting that some b reaches \nare sufficiently unremarkable, normal or routine that they will not significantly affect \nthe seriousness of the state conduct. We would decline the invitation from the \nrespondent and intervener Crowns to do so in this case. As this Court unanimousl y held \nin R. v. Reilly , 2021 SCC 38, all Charter -infringing state conduct must be factored into \nthe analysis. In that case, Moldaver J. wrote:  “Regardless of whether the [subsequent] \nbreach was caused by [earlier] breaches, and regardless of the fact that it was \nconsidered necessary .  . ., it was nonetheless a breach of Mr.  Reilly’s s.  8 \nCharter ‑protected rights and must be considered under the first Grant  factor. Trial \njudges cannot choose which relevant Charter ‑infringing state conduct to consider” \n(para.  3).  \n[127]  The seriousness of conduct related to all breaches thus must be considered \neven if some of them may be said to have been “caused” by earlier Charter violations. \nIt is irrelevant to the principle stated in Reilly that the Crown had conceded the \nsubsequent breaches in that case.  \n[128]  This Court recently assessed the seriousness of the state action related to \nthe “consequential” breaches of s.  8 of the Charter in Tim. These unreasonable searches \nwere consequential  breaches in the sense that they were unlawful only as a consequence \nof the initial breach (in that case an unlawful arrest) that preceded them (see \nparas.  48-50). The s.  8 breaches were “caused” by the breach of s.  9. Nevertheless, in \n2023 SCC 30 (CanLII)\n\n--- Page 75 ---\n \n the first stage of t he Grant  analysis, Jamal J. expressly considered the extent to which \nthese violations of s.  8 undermined the rule of law (see paras.  82-89; see also para.  102, \nper Brown  J., dissenting, but not on this point).  \n[129]  The approach applied in Reilly and Tim is con sonant with Grant  and should \nbe applied in this case as a matter of settled law. In our respectful view, to treat \nconsequential breaches as having an inconsequential effect on the seriousness inquiry \nis a departure from Grant , Reilly  and Tim and, in respec",
    "token_count": 1000,
    "start_token": 30600,
    "end_token": 31600,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 35,
    "source_file": "2023scc30.txt",
    "text": "82-89; see also para.  102, \nper Brown  J., dissenting, but not on this point).  \n[129]  The approach applied in Reilly and Tim is con sonant with Grant  and should \nbe applied in this case as a matter of settled law. In our respectful view, to treat \nconsequential breaches as having an inconsequential effect on the seriousness inquiry \nis a departure from Grant , Reilly  and Tim and, in respec t of the mandate that falls to \nthe Court under s.  24(2), an error in law. Thus, the Attorney General of Ontario is \nwrong to suggest that the post -Grant jurisprudence reflects a pattern whereby this Court \nhas “not once considered the chain of events that fl owed from a single, original breach” \n(I.F., at para.  20). Prior to the case at bar, the Court has not been squarely called upon \nto decide the relevance of consequential breaches to the s.  24(2) analysis. But, as this \nCourt’s recent jurisprudence makes plai n, subsequent conduct consequential to an \ninitial breach is part of “all the circumstances” to which s.  24(2) requires courts have \nregard.   \n[130]  It is of course true that the relationship between each stage of the events \nmay inform the analysis of how seriousl y the state conduct undermined the rule of law. \nFor instance, when an unconstitutional search uncovers incriminating evidence, police \nofficers may subjectively believe that they have the legal authority to detain, search or \narrest a suspect. However, a sub jective belief of this kind would be mistaken: when \nunconstitutionally obtained evidence forms the basis for a subsequent detention, search \n2023 SCC 30 (CanLII)\n\n--- Page 76 ---\n \n or arrest, then those subsequent actions will also generally violate the Charter . It may \nwell be true that, if these  subsequent actions do not disclose misconduct that is \nindependent from the initial breach, then they do not reflect a deliberate violation of \nconstitutional rights.  But as this Court’s existing jurisprudence in respect of s.  24(2) \ndemonstrates, a conclusi on that a violation was not deliberate  does not dispense the \ncourt from the requirement of measuring the seriousness of each breach in assessing \nthe gravity of the state misconduct at issue (see, e.g., Tim). Nor can the weight it will \ncarry be dismissed or  discounted, from the outset or categorically. Conduct that did not \ndeliberately breach the Charter may nonetheless have some exclusionary weight. \nSociety has a stake in considering the seriousness of “all the circumstances”, as the \nCharter  directs. Indeed , even breaches that, when looked at in isolation, appear “minor” \nor “technical” can nevertheless contribute meaningfully to the seriousness of the \nmisconduct that a judge must consider when deciding whether to admit or exclude \nevidence under s.  24(2).  \n[131]  Thus, in our respectful view it would be an error of law for a court to \ndecline to analyze the extent to which each consequential breach at issue in the \nevaluative stage of the s.  24(2) analysis reflects serious Charter -infringing state \nconduct, viewed from the perspective of how gravely the conduct undermines the rule \nof law. To suggest otherwise would trivialize the importance of fundamental \nconstitutional rights and undermine the rule of law that the Charter protects. In so \ndoing, it would inadvertently ac cept what we see, with due regard for opposing views, \nas the flawed premise of R. v. Jennings , 2018 ONCA 260, 45 C.R. (7th) 224, and R. v. \n2023 SCC 30 (CanLII)\n\n--- Page 77 ---\n \n Love , 2022 ABCA 269, [2023] 1 W.W.R. 296, by treating “consequential” breaches as \ninconsequential at the seriousness stage of the analysis. And it would prevent s.  24(2) \nfrom fulfilling its purpose of “maintaining the rule of law and upholding Charter  rights \nin the justice system as a whole” ( Grant , at para.  67). \n(2) Seriousness Is Cumulative  \n[132]  As a number of appellate courts have properly recognized, it is the \ncumulative seriousness of the Charter -infringing state conduct that factors into the \nGrant  analysis (see, e.g., R. v. Lauriente , 2010 BCCA 72, 251 C.C.C. (3d) 492, at \npara",
    "token_count": 1000,
    "start_token": 31500,
    "end_token": 32500,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 36,
    "source_file": "2023scc30.txt",
    "text": " system as a whole” ( Grant , at para.  67). \n(2) Seriousness Is Cumulative  \n[132]  As a number of appellate courts have properly recognized, it is the \ncumulative seriousness of the Charter -infringing state conduct that factors into the \nGrant  analysis (see, e.g., R. v. Lauriente , 2010 BCCA 72, 251 C.C.C. (3d) 492, at \npara.  30; R. v. Boudreau -Fontaine , 2010 QCCA 1108, at  para.  59 (CanLII); R. v. \nPoirier , 2016 ONCA 582, 131 O.R. (3d) 433, at para.  91; R. v. Kossick , 2018 SKCA \n55, 365 C.C.C. (3d) 186, at paras.  58-59; R. v. Culotta , 2018 ONCA 665, 142 O.R. (3d) \n241, at para.  62, aff’d 2018 SCC 57, [2018] 3 S.C.R. 597; R. v.  Adler , 2020 ONCA \n246, 388 C.C.C. (3d) 114, at para.  39; R. v. White , 2022 NSCA 61, 419 C.C.C. (3d) \n123, at para.  61). This approach assesses the entire chain of events relevant to the \nCharter violations and considers how seriously the state conduct — taken as a whole \n— undermined the rule of law.  \n[133]  In our view, a cumulative approach is mandated by the emphasis that the \nGrant analysis gives to the totality of the circumstances (see J.  A. Fontana and \nD. Keeshan, The Law of Search and Seizure in Canada (12th e d. 2021), at \npp. 1711 -12). It bears noting that even before Grant , this Court’s jurisprudence \nemployed a cumulative approach (see R. v. Greffe , [1990] 1 S.C.R. 755, at pp.  795-97, \n2023 SCC 30 (CanLII)\n\n--- Page 78 ---\n \n per Lamer  J. (as he then was)). This Court has never suggested that a relati onship \nbetween two breaches, as in the case of “consequential” violations, eliminates the need \nto assess the cumulative seriousness of the state conduct. To do so would be to ignore \n“all the circumstances” that s.  24(2) directs courts to consider, in favou r of a narrower \nfocus on only one of the state actions taken without legal authority. Once again, to do \nso would lead, by another path, to the incorrect result that Jennings and Love  reach. It \nwould wrongly focus courts’ analysis on whether state conduct is “consequential” \n(itself a question of fact) rather than on whether the long -term repute of the \nadministration of justice requires the courts, as mandated by the Charter , to \ndisasso ciate themselves from the unconstitutional state actions.  \n[134]  In our view, this principle in conjunction with the focus of the seriousness \ninquiry on the rule of law implies that the intervener the Attorney General of Ontario \nis wrong to assert that consequen tial or subsequent breaches only have “value to the \nGrant analysis” if they disclose “independent wrongdoing” (I.F., at fn.  1). The \nrespondent and the Attorney General of Alberta are also wrong to adopt similar \napproaches. Conduct that does not deliberatel y violate the Charter may nonetheless \nundermine the public’s confidence in the administration of justice and pull in favour of \nexcluding the evidence. Even if a breach that is not deliberate will sometimes only pull \nweakly towards exclusion, courts cannot discount the possibility that a chain of such \nbreaches will, when assessed cumulatively, demonstrate more serious state misconduct. \nThus, it may be that the whole sequence of state conduct undermines the rule of law \nmore gravely than would each action in i solation. The analysis of the seriousness of \n2023 SCC 30 (CanLII)\n\n--- Page 79 ---\n \n state conduct, like the Grant analysis as a whole, is not a mathematical exercise \n(para.  86). For that reason, there is no necessary requirement that the seriousness of the \nwhole be the sum of the constituent pa rts. \nB. Application of Section 24(2)  \n[",
    "token_count": 1000,
    "start_token": 32400,
    "end_token": 33400,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 37,
    "source_file": "2023scc30.txt",
    "text": " of law \nmore gravely than would each action in i solation. The analysis of the seriousness of \n2023 SCC 30 (CanLII)\n\n--- Page 79 ---\n \n state conduct, like the Grant analysis as a whole, is not a mathematical exercise \n(para.  86). For that reason, there is no necessary requirement that the seriousness of the \nwhole be the sum of the constituent pa rts. \nB. Application of Section 24(2)  \n[135]  Because we have come to a different conclusion than the trial judge on the \nrelevant Charter violations, we owe no deference to her overall conclusion in respect \nof s. 24(2) (see, e.g., R. v. Vu , 2013 SCC 60, [2013] 3 S.C.R . 657, at para.  67; Grant , \nat para.  129; Le, at para.  138; Beaver , at para.  118). Conducting the analysis afresh and \nconsidering all the circumstances of this case, and with respect for other views, we \nconclude that the administration of justice would be b rought into disrepute by admitting \nthe evidence. Accordingly, s.  24(2) compels exclusion of the evidence. This result \nflows from balancing the three factors this Court identified in Grant : (1) the seriousness \nof the Charter -infringing state conduct; (2) th e impact of the breaches on the \nCharter ‑protected interests of the accused; and (3) society’s interest in the adjudication \nof the case on its merits.  \n(1) Seriousness of the Charter -Infringing Conduct  \n[136]  We begin by assessing the seriousness of the state conduct at issue in light \nof how gravely that conduct undermined the rule of law, in line with the principles \narticulated above. The extent to which the police officers deliberately violated Charter \nstandards is one relevant consideration. Here, the trial judge co ncluded that in \n2023 SCC 30 (CanLII)\n\n--- Page 80 ---\n \n conducting the initial sniffer dog search the police officer “acted honestly”, “was well \ntrained”, “knew the applicable standard”, and sought to apply it (A.R., vol.  I, at p.  20). \nShe concluded that the breach this conduct occasioned was no t deliberate or systemic \nand did not reflect negligence. Thus, she concluded that the initial error was “on the \nlow end of the scale” (p.  21).  \n[137]  We find no reversible error in the trial judge’s determination that the officer \ninitially breached Charter standards inadvertently and without negligence, nor in her \nconclusion that there was not a systemic failing evident in the record. It bears \nemphasizing, however, that the reasonable suspicion standard that was to be applied is \na “well -established constitut ional nor[m]” ( Paterson , at para.  53). This was not a case \nwhere there was legal uncertainty at the time that the police officer acted (see, e.g., \nMcColman ). The public is entitled to expect that police officers will apply the \nreasonable suspicion standard  that flows from the jurisprudence of this Court. The \nseniority of the officer in question only reinforces this expectation: an officer who has \nserved for 14 years and conducted between 12,000 to 15,000 traffic stops should know \nthe law. Thus, while the in itial error was on the low end of the deliberateness scale, in \nour view it was not at the absolute lowest end. In addition, because the other, \nsubsequent breaches were not argued before the trial judge, she did not assess their \nseriousness. Within the fres h assessment this Court is called to conduct, the subsequent \nbreaches must factor into the analysis, which is necessarily cumulative.  \n2023 SCC 30 (CanLII)\n\n--- Page 81 ---\n \n [138]  The subsequent breaches at issue in this case include the pat down search \nand the search of the truck and the duffle bags  that were inside it. These searches \nviolated s.  8 of the Charter , which is intended to protect against unjustified intrusions \non privacy interests (see, e.g., Hunter , at p.  159). Yet, in spite of the constitutional \nprotection for these interests, increasi ngly invasive steps were taken at each stage of \nthe police action at issue. Adopting the broad, social perspective that Grant mandates, \nthese increasingly invasive steps represent progressively more serious ways in which \nthe state conduct undermined the ru le of law.  \n[139]  The unreasonable",
    "token_count": 1000,
    "start_token": 33300,
    "end_token": 34300,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 38,
    "source_file": "2023scc30.txt",
    "text": " to protect against unjustified intrusions \non privacy interests (see, e.g., Hunter , at p.  159). Yet, in spite of the constitutional \nprotection for these interests, increasi ngly invasive steps were taken at each stage of \nthe police action at issue. Adopting the broad, social perspective that Grant mandates, \nthese increasingly invasive steps represent progressively more serious ways in which \nthe state conduct undermined the ru le of law.  \n[139]  The unreasonable searches were not, however, all of the unlawful conduct \nthat occurred in this case. The initial detention without reasonable grounds and the three \nsubsequent arrests each violated the constitutionally distinct s.  9 protections for \nindividual liberty ( Grant , at para.  54). Further, confinement in a police vehicle, \nhandcuffing, and being taken to the detachment to be detained there, all also constituted \narbitrary detention.  \n[140]  There is no suggestion that these subsequent violations w ere deliberate or \nsystemic. They arose from actions taken based on the honest but mistaken \nunderstanding that the initial search had furnished lawful grounds for the police to \nsearch, arrest and detain. But it must be stressed that, objectively, the police  had no \nlegal authority to interfere with privacy and liberty. Respect for these interests lies at \nthe core of Canadian society’s commitment to the rule of law. So, while there was no \nintention to undermine the rule of law, it was nevertheless undermined.  \n2023 SCC 30 (CanLII)\n\n--- Page 82 ---\n \n [141]  The respondent is wrong to assert that there is no need for the Court to \ndisassociate itself from the state conduct that is at issue in this case. Far from being \nunremarkable events, police officers conducted a series of increasingly invasive \nsearches, arr ests and detentions in the absence of lawful authority. There is a strong \nsocial interest in denouncing a course of conduct that disregards both individual privacy \nand liberty, thereby undermining the rule of law. Thus, while the subsequent breaches \ndid no t deliberately violate Charter rights, in our view the entire course of conduct does \nreflect serious state misconduct. On the spectrum of seriousness this Court identified \nin Grant , the conduct at issue in this case pulls between moderately and strongly \ntowards exclusion, resting closer to a strong pull than a moderate one.  \n(2) Impact on the Charter -Protected Interests of the Accused  \n[142]  The second line of inquiry mandated by Grant is to consider the \n“seriousness of the impact” of the Charter  breaches on the Charte r-protected interests \nof the accused (para.  76). As this Court has affirmed, “[t]he more serious the impact on \nthe accused’s protected interests, the greater the risk that admission of the evidence \nmay signal to the public that Charter  rights, however high -sounding, are of little actual \navail to the citizen, breeding public cynicism and bringing the administration of justice \ninto disrepute” ( ibid.; see also Le, at para.  151; Tim, at para.  90; R. v. Lafrance , 2022 \nSCC 32, at para.  96; Beaver , at para.  123). Thus, the task is to “situate the impact on \nthe accused’s Charter -protected interests on a spectrum, ranging from impacts that are \n2023 SCC 30 (CanLII)\n\n--- Page 83 ---\n \n fleeting, technical, transient, or trivial, to those that are profoundly intrusive or that \nseriously compromise the interests  underlying the rights infringed” ( Tim, at para.  90).  \n[143]  While the first and second lines of inquiry mandated by Grant are distinct, \nthe seriousness of the impact [ TRANSLATION ] “complements to some degree [the factor]  \nof the seriousness of the  Charter -infringing state conduct ” (M.  Vauclair, T.  Desjardins \nand P.  Lachance, Traité général de preuve et de procédure pénales 2023 (30th ed. \n2023), at para.  28.208). This is because the second line of inquiry [ TRANSLATION ] “is \nmeant to take into consideration th e impact of the Charter violation, as opposed to its \ninherent seriousness” ( ibid.). In this sense, it is settled law that the two lines of inquiry \n“work in tandem” ( Le, at para.  141; see also Lafrance , at para.  90; Paciocco, Paciocco \nand Stuesser, at p.  486). The two",
    "token_count": 1000,
    "start_token": 34200,
    "end_token": 35200,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 39,
    "source_file": "2023scc30.txt",
    "text": " [ TRANSLATION ] “is \nmeant to take into consideration th e impact of the Charter violation, as opposed to its \ninherent seriousness” ( ibid.). In this sense, it is settled law that the two lines of inquiry \n“work in tandem” ( Le, at para.  141; see also Lafrance , at para.  90; Paciocco, Paciocco \nand Stuesser, at p.  486). The two lines of inquiry cannot be artificially disconnected by \nweighing different state conduct at different stages of the analysis. To say otherwise \ncreates, in our respectful view, an incoherent disjuncture between the first two branches \nof Grant . Under the first line of inquiry, the cumulative seriousness of the state conduct \nthat led to each of those violations should be considered from a broad, social \nperspective; under the second, the cumulative seriousness of the impacts on the specific \naccused’ s Charter -protected interests flowing from that same conduct should be \nassessed.  \n[144]  Applying this approach and weighing the impacts flowing from the same \nconduct we have considered under the first branch of the analysis, we respectfully \ndisagree with our col leagues’ conclusion that the impacts of the Charter breaches on \n2023 SCC 30 (CanLII)\n\n--- Page 84 ---\n \n Mr. Zacharias’s Charter -protected interests only moderately favour exclusion (Rowe \nand O’Bonsawin  JJ.’s reasons, at para.  72). In light of the fact that the impacts on \nMr. Zacharias were subst antial — increasing in severity at each stage of the state’s \ninterference with his rights — we conclude instead that this factor pulls strongly in \nfavour of exclusion.  \n[145]  First, we consider the impacts of the searches. Where non -bodily physical \nevidence is ta rgeted, privacy is the primary interest engaged by searches that violate \ns. 8 (Grant , at para.  113). Here, the cumulative impacts of the s.  8 breaches on \nMr. Zacharias’s privacy interests were significant and became more invasive with each \nstep. \n[146]  While we a cknowledge that a dwelling house attracts a higher expectation \nof privacy than a vehicle ( Grant , at para.  113), privacy interests in vehicles and their \ncontents are not trivial. The privacy -compromising impact of an unreasonable vehicle \nsearch will still g enerally militate in favour of exclusion, notwithstanding the \ncomparatively reduced expectation of privacy in that context (see, e.g., R. v. Huynh , \n2013 ABCA 416, 8 C.R. (7th) 146, at para.  7). Indeed,  when assessing the impact of \nroadside Charter  breaches  on an individual’s protected interests, courts must not lose \nsight of the fact that, beyond the scope of a valid highway traffic stop, the individual \nrightly “has every expectation of being left alone” ( Harrison , at paras.  30-31, citing R. \nv. Mann , 2004 S CC 52, [2004] 3 S.C.R. 59, at para.  56). That observation should \nremain the starting point of the analysis.  \n2023 SCC 30 (CanLII)\n\n--- Page 85 ---\n \n [147]  More substantial was the impact of police officers’ opening of \nMr. Zacharias’s duffel bags, which were covered by a tonneau in the box of the truck . \nThis conduct amounted to a significant intrusion upon his privacy interests. \nMr. Zacharias’s concealment of the box of his truck with a tonneau cover evinces a \nclear intention to assert privacy over its contents. His intent in this regard makes the \nsearc h of Mr.  Zacharias’s truck unlike cases of “reduced expectation” vehicle searches \nwhere no steps were taken to conceal the subject matter of the search (see, e.g., R. v. \nShinkewski , 2012 SKCA 63 , 289 C.C.C. (3d) 145,  at para.  35). \n[148]  Second, we now turn to the impacts that flowed from the arrests and \ndetention Mr.  Zacharias was subjected to. The purpose of s.  9 is “to protect individual \nliberty from unjustified state interference” ( Grant , at para.  20). Here, the restrictions \nimposed on  Mr. Zacharias’s liberty by the breaches of his s.  9 rights were substantial.  \n[149]  The majority below concluded that the investigative detention that ensued \nafter the initial",
    "token_count": 1000,
    "start_token": 35100,
    "end_token": 36100,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 40,
    "source_file": "2023scc30.txt",
    "text": " the impacts that flowed from the arrests and \ndetention Mr.  Zacharias was subjected to. The purpose of s.  9 is “to protect individual \nliberty from unjustified state interference” ( Grant , at para.  20). Here, the restrictions \nimposed on  Mr. Zacharias’s liberty by the breaches of his s.  9 rights were substantial.  \n[149]  The majority below concluded that the investigative detention that ensued \nafter the initial valid traffic safety stop was “necessary to facilitate deployment of the \nsniffer dog relative to a vehicle in which Mr.  Zacharias’ expectation of privacy is low” \n(para.  7). We respectfully disagree. That assessment justifies the impacts of a breach of \ns. 9 — an unlawful investigative detention — by reasoning that it was “necessary” to \neffect a breach of s. 8. Such reasoning trivializes the impacts of these Charter breaches. \nAbsent any reasonable suspicion to justify a further investigative detention, \nMr. Zacharias ought to have been free to go once the matters related to the Traffic \nSafety Act, R.S.A. 2000, c. T -6, had been addressed. Instead, he was unlawfully \n2023 SCC 30 (CanLII)\n\n--- Page 86 ---\n \n detained for approximately seven hours, handcuffed, confined to a police vehicle, \narrested three times, and detained for several hours in the police detachment. We place \nlittle weight  on the trial judge’s finding that the arresting officers were respectful and \ncourteous over the course of these interactions. The fact that a police officer is \nappropriately courteous when interacting with a citizen is not relevant to the lawful \ncharacter  of their conduct.  \n[150]  These sustained deprivations had substantial impacts on Mr.  Zacharias’s \nliberty, autonomy and bodily integrity. They were not momentary but prolonged. \nKhullar  J.A. properly accounted for these impacts (para.  58). By contrast, because th ey \ndid not consider the subsequent breaches, in our respectful view the majority below \ninappropriately discounted their impacts. And while our colleagues do recognize the \nother breaches of Mr.  Zacharias’s constitutional rights, we respectfully disagree wit h \ntheir assessment that seven hours of arbitrary detention, physical restraint, relatively \ninvasive searches, and other associated impacts only moderately favour exclusion \n(Rowe and O’Bonsawin  JJ.’s reasons, at para.  72). \n[151]  In sum, the impacts of the state c onduct on Mr.  Zacharias’s liberty and \nprivacy interests, when taken together and considered cumulatively as the law requires, \nwere considerable.  Accordingly, this factor pulls strongly in favour of exclusion of the \nevidence.  \n(3) Society’s Interest in Adjudicat ion of the Case on Its Merits  \n2023 SCC 30 (CanLII)\n\n--- Page 87 ---\n \n [152]  The third line of inquiry mandated by Grant is to consider “whether the \ntruth -seeking function of the criminal trial process would be better served by admission \nof the evidence, or by its exclusion” (para.  79). In essence, thi s inquiry is directed at \nassessing “society’s ‘collective interest in ensuring that those who transgress the law \nare brought to trial and dealt with according to the law’” ( ibid., quoting R. v. Askov , \n[1990] 2 S.C.R. 1199, at pp.  1219 -20). Several consider ations may be relevant.  \n[153]  First, the reliability of the evidence factors into the third line of inquiry \n(Grant , at para.  80; see also Paterson , at para.  51; Le, at para.  297; Tim, at para.  96; \nBeaver , at para.  129; McColman , at para.  70). Nevertheless, this Court has been clear \nthat “[t]he view that reliable evidence is admissible regardless of how it was obtained \n(see R. v. Wray , [1971] S.C.R. 272) is inconsistent with the Charter ’s affirmation of \nrights”  (Grant , at para.  80). For instance, even though real evidence may be highly \nreliable, that fact alone is not determinative of whether the evidence’s admission would \nbring the administration of justice into disrepute. To adopt a contrary approach that \ngives overriding importance to the reliability of real evi dence [ TRANSLATION ] “is at \nodds with the consideration of all the circumstances required by subsection  24(",
    "token_count": 1000,
    "start_token": 36000,
    "end_token": 37000,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 41,
    "source_file": "2023scc30.txt",
    "text": " affirmation of \nrights”  (Grant , at para.  80). For instance, even though real evidence may be highly \nreliable, that fact alone is not determinative of whether the evidence’s admission would \nbring the administration of justice into disrepute. To adopt a contrary approach that \ngives overriding importance to the reliability of real evi dence [ TRANSLATION ] “is at \nodds with the consideration of all the circumstances required by subsection  24(2) of the \nCharter” (Vauclair, Desjardins and Lachance, at para.  28.217).  \n[154]  Second, the importance of the evidence to the Crown’s case is a relevant \nconsideration ( Grant , at para.  83; see also Paterson , at para.  51; Le, at para.  297; Tim, \nat para.  96; Beaver , at para.  129; McColman , at para.  70). The Court has recognized \nthat exclusion may more adversely affect “the repute of the administration of justice \n2023 SCC 30 (CanLII)\n\n--- Page 88 ---\n \n where the remedy effectively guts the prosecution” ( Grant , at para.  83). Nevertheless, \nthis Court has rightly been willing to exclude even “critical evidence, virtually \nconclusive of guilt on the offence charged” where the admission of that evidence would \n— having regard to all circumstances — bring the administration of justice into \ndisrepute ( Harrison , at para.  34; see also para.  42). \n[155]  Third, courts are also to consider the seriousness of the offence at issue \n(Grant , at para.  84; see also Paterson , at para . 52; Le, at para.  297; Tim, at para.  97; \nBeaver , at para.  129; McColman , at para.  70). The seriousness of the offence, however, \nmay “cut both ways” ( Grant , at para.  84). As this Court has affirmed, “[w]hile society \nhas a greater interest in seeing a serio us offence prosecuted, it has an equivalent interest \nin ensuring that the judicial system is above reproach, particularly when the stakes are \nhigh for the accused person”  (R. v. Côté , 2011 SCC 46, [2011] 3 S.C.R. 215, at para.  53; \nsee also R. v. Spencer , 2014 SCC 43, [2014] 2 S.C.R. 212, at para.  80; R. v. Taylor , \n2014 SCC 50, [2014] 2 S.C.R. 495, at para.  38; Le, at para.  159; McColman , at \npara.  70). The fact that an offence is serious “must not be permitted to overwhelm the \ns. 24(2) analysis” ( R. v. Cole , 2012 SCC 53, [2012] 3 S.C.R. 34, at para.  95; see also \nHarrison , at para.  40). This is because, at minimum, [ TRANSLATION ] “the rights \nguaranteed by the Charter are also guaranteed to all persons who are in Canada, \nregardless of the crime” (Vauclair, Desja rdins and Lachance, at para.  28.216). There is \na danger “that if the seriousness of the offence is treated as .  . . determinative it will \nbecome a bright line to admission of evidence obtained in violation of the Charter ” \n(D. Stuart, “Uncertainty on Charte r Section 24(2) Remedy of Exclusion of Evidence” \n2023 SCC 30 (CanLII)\n\n--- Page 89 ---\n \n (2023), 86 C.R. (7th) 255, at p.  257). Such an approach would be contrary to s.  24(2) \nand its requirement for a careful balancing in light of all the circumstances.  \n[156]  Here, the evidence is highly reliable. It  is undoubtedly critical to the \nCrown’s case. But the fact that the evidence is, as the respondent characterizes it, “real, \nreliable and crucial” (R.F., at para.  3), does not overwhelm the flexible balancing \nprocess that s.  24(2) demands. This Court’s juri sprudence has consistently emphasized \nthe importance of this principle. For instance,",
    "token_count": 1000,
    "start_token": 36900,
    "end_token": 37900,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 42,
    "source_file": "2023scc30.txt",
    "text": "  \n[156]  Here, the evidence is highly reliable. It  is undoubtedly critical to the \nCrown’s case. But the fact that the evidence is, as the respondent characterizes it, “real, \nreliable and crucial” (R.F., at para.  3), does not overwhelm the flexible balancing \nprocess that s.  24(2) demands. This Court’s juri sprudence has consistently emphasized \nthe importance of this principle. For instance, the majority of this Court in Harrison  \nexcluded 35 kilograms of cocaine that had been seized from the accused’s vehicle, \nnotwithstanding the fact that it was also undoubt edly real, reliable and crucial evidence \n(para.  34).  \n[157]  With respect to the seriousness of the offence at issue, it is true that this \nCourt has long acknowledged that cannabis offences are “generally regarded as less \nserious than those involving ‘hard’ drugs  such as cocaine and heroin” ( R. v. Kokesch , \n[1990] 3 S.C.R. 3, at p.  34, per Sopinka  J.; see also R. v. Buhay , 2003 SCC 30, [2003] \n1 S.C.R. 631, at para.  68). Further, this Court has stated that while trafficking offences \nin relation to “hard” drugs are “ very serious”, even they are “not one of the most serious \n[offences] known to our criminal law” ( Harrison , at para.  35). Nevertheless, we are \npersuaded that the offences at issue in this case are serious. Like the trial judge and \nboth the majority and diss enting judges at the Court of Appeal, we are of the view that \nthis result flows from the very large quantity of drugs at issue in this case.  \n2023 SCC 30 (CanLII)\n\n--- Page 90 ---\n \n [158]  Taking into account each of the foregoing considerations,  we are persuaded \nthat there is a strong social interest that favours the adjudication of these charges on the \nmerits. Accordingly, the third line of inquiry strongly favours the admission of the \nevidence.  \n(4) Would the Admission of the Evidence Bring the Administration of Justice \nInto Disrepute?  \n[159]  After engaging wit h the three lines of inquiry mandated by Grant , the \nweight assigned to each factor must be balanced (para.  86). This process “involves a \nqualitative exercise, one that is not capable of mathematical precision” ( Tim, at \npara.  98; see also Grant , at paras.  86 and 140; Harrison , at para.  36). Thus, “[n]o \noverarching rule governs how the balance is to be struck” ( Grant , at para.  86). But as \nthis Court has held, “[i]t is the sum, and not the average, of [the] first two lines of \ninquiry that determines the pull t owards exclusion” ( Le, at para.  141; see also Beaver , \nat para.  134, McColman , at para.  74). The third factor’s weight “will seldom tip the \nscale in favour of admissibility when the two first lines, taken together, make a strong \ncase for exclusion” ( Lafranc e, at para.  90; see also Paterson , at para.  56, Le, at \npara.  142, Beaver , at para.  134).  \n[160]  In this case, the first line of inquiry exerts a moderate to strong pull towards \nexclusion, while the second pulls strongly in the same direction. The third factor \nstrongly favours admission. But it is not enough to overwhelm the cumulative \nseriousness of the Charter -infringing conduct along with impacts on Mr.  Zacharias, \n2023 SCC 30 (CanLII)\n\n--- Page 91 ---\n \n which together make a relatively strong case for the evidence’s exclusion. For that \nreason, we conclude that the administration of justice would be brought into disrepute \nby its admission.  Accordingly, s.  24(2) directs that the evidence shall be excluded.  \nIII. Conclusion  \n[161]  We would allow the appeal. Because the evidence in question was essential \nto the Crown’s case, rather than order a new trial, we would enter an acquittal.  \n Appeal  dismissed, MARTIN and  KASIRER  JJ. dissenting . \n Solicitor s for the appellant:  Dhanu  Dhaliwal Law Group, Abbotsford, B.C.",
    "token_count": 1000,
    "start_token": 37800,
    "end_token": 38800,
    "total_tokens_in_source": 38915
  },
  {
    "chunk_id": 43,
    "source_file": "2023scc30.txt",
    "text": "24(2) directs that the evidence shall be excluded.  \nIII. Conclusion  \n[161]  We would allow the appeal. Because the evidence in question was essential \nto the Crown’s case, rather than order a new trial, we would enter an acquittal.  \n Appeal  dismissed, MARTIN and  KASIRER  JJ. dissenting . \n Solicitor s for the appellant:  Dhanu  Dhaliwal Law Group, Abbotsford, B.C.  \n Solicitor s for the respondent:  Public Prosecution Service of Canada  — \nOntario Regional Office , Brampton ; Public Prosecution Service of Canada — Alberta \nRegional Office, Calgary . \n Solicitor for the intervener t he Attorney General of Ontario:  Attorney \nGeneral of Ontario, Crown Law Office — Criminal , Toronto.  \n Solicitor  for the intervener the Attorney General of Alberta:  Alberta \nCrown Prosecution Servi ce — Appeals and Specialized Prosecutions Office , Calgary.   \n2023 SCC 30 (CanLII)\n\n",
    "token_count": 215,
    "start_token": 38700,
    "end_token": 38915,
    "total_tokens_in_source": 38915
  }
]