[
  {
    "chunk_id": 0,
    "source_file": "2023scc33.txt",
    "text": "--- Page 1 ---\n \n  \nSUPREME COURT OF CANADA  \n \nCITATION : R. v. Lindsay, 2023 SCC \n33 \n   \nAPPEAL HEARD : December 14, 2023  \nJUDGMENT RENDERED : December 14, \n2023  \nDOCKET : 40569  \n \nBETWEEN : \n \nTrevor Ian James Lindsay  \nAppellant  \n \nand \n \nHis Majesty T he King  \nRespondent  \n \n \n \nCORAM : Karakatsanis, Kasirer, Jamal, O’Bonsawin and Moreau  JJ. \n \nUNANIMOUS \nJUDGMENT READ \nBY: \n(paras.  1 to 4) \n Jamal  J. \nCOUNSEL : \n \nAlias Sanders , for the appellant.  \nKatherine Elizabeth Fraser , for the respondent.  \n \n \n \n \n2023 SCC 33 (CanLII)\n\n--- Page 2 ---\n \n NOTE: This do cument is subject to editorial revision before its reproduction in final form in the \nCanada Supreme Court Reports . \n   \n \n \nTrevor Ian James Lindsay  Appellant  \nv. \nHis Majesty The King  Respondent  \nIndexed as: R. v. Lindsay  \n2023 SCC 33  \nFile No.: 40569.  \n2023: December 14.  \nPresent: Karakatsanis, Kasirer, Jamal, O’Bonsawin and Moreau JJ.  \nON APPEAL FROM THE C OURT OF APPEAL OF AL BERTA  \n Criminal law — Defences — Use of force by peace officer — Peace officer convicted \nof aggravated assault relating to his use of force in interactions with detainee — Trial judge \nconcluding that peace officer did not have reasonable grounds to use force against detainee and \n2023 SCC 33 (CanLII)\n\n--- Page 3 ---\n \n therefore could not invoke statutory defence for use of necessary force by pers ons administering \nand enforcing law — Majority of Court of Appeal upholding conviction on basis that trial judge \nmade comprehensive and detailed findings of fact amply supported by evidence and that pathway \nto conviction was clear and based on correct appl ication of relevant legal principles — Conviction \nupheld — Criminal Code, R.S.C. 1985, c.  C-46, s.  25(1).  \n \nCases Cited  \n Referred to:  R. v. G.F. , 2021 SCC 20; R. v. Nasogaluak , 2010 SCC 6, [2010] 1 S.C.R. \n206. \nStatutes and Regulations Cited  \nCriminal Code , R.S.C. 1985, c. C -46, s.  25(1).  \n APPEAL from a judgment of the Alberta Court of Appeal (Veldhuis, Wakeling and \nAntonio  JJ.A.), 2022 ABCA 424 , [2022] A.J. No.  1564 (QL), 2022 CarswellAlta 3738 (WL), \naffirming the conviction entered by Lema  J., 2019 ABQB 462, [2019] A.J. No.  818 (QL), 2019 \nCarswellAlta 1252 (WL). Appeal dismissed.  \n Alias Sanders , for the appellant.  \n Katherine Elizabeth Fraser , for the respondent.  \n The judgment of the Court was delivered orally by  \n2023 SCC 33 (CanLII)\n\n--- Page 4 ---\n \n [1] JAMAL  J. — We are all of the view that the appeal should be dismissed.  \n[2] We do not accept the appellant’s submission that the trial judge misinterpreted the \nconcession of defence counsel that if an assault occurred, it was an aggravated assault. The \nappellant did not raise this as a ground of appeal before the Court of Appeal. The appellant now \nclaims that the trial judge interpreted this concession as meaning that he did not need to decide \nwhether the Crown had proved the elements of aggravated assault . We disagree. Reading the \njudgment as a whole, the trial judge concluded that the appellant committed aggravated assault \nwhen he intentionally struck and threw the person in his custody to the ground. As the majority of \nthe Court of Appeal correctly noted , based on the trial judge’s reasons, “the pathway to conviction \nis clear and based on the correct application of relevant legal principles” (para.  6). A trial judge is \npresumed to know the law and is entitled to focus on the live issues at trial. In our v iew, the trial \njudge’s reasons are sufficient in law (see R. v. G.F. , 2021 SCC 20, at para.  74). \n",
    "token_count": 1000,
    "start_token": 0,
    "end_token": 1000,
    "total_tokens_in_source": 1355
  },
  {
    "chunk_id": 1,
    "source_file": "2023scc33.txt",
    "text": " noted , based on the trial judge’s reasons, “the pathway to conviction \nis clear and based on the correct application of relevant legal principles” (para.  6). A trial judge is \npresumed to know the law and is entitled to focus on the live issues at trial. In our v iew, the trial \njudge’s reasons are sufficient in law (see R. v. G.F. , 2021 SCC 20, at para.  74). \n[3] Nor do we accept the appellant’s argument that the trial judge erred in concluding that \ns. 25(1) of the Criminal Code , R.S.C. 1985, c. C -46, did not provid e a defence for the appellant’s \nuse of force against the individual. Section 25(1) “essentially provides that a police officer is \njustified in using force to effect a lawful arrest, provided that he or she acted on reasonable and \nprobable grounds and used only as much force as was necessary in the circumstances” ( R. v. \nNasogaluak , 2010 SCC 6, [2010] 1 S.C.R. 206, at para.  34). The matters raised by the dissenting \njudge in the Court of Appeal in essence impugn the trial judge’s findings of fact. In our view,  the \ntrial judge was entitled to find on the evidence before him that the appellant had no reasonable \ngrounds to strike the person initially, and that his use of force in striking him three more times in \nthe head and then throwing him to the ground was unn ecessary and excessive on a proper standard. \n2023 SCC 33 (CanLII)\n\n--- Page 5 ---\n \n The trial judge’s findings of fact were amply supported by the record. We see no basis for this \nCourt to intervene.  \n[4] The appeal is dismissed.  \n Judgment accordingly.  \n Solicitor for the appellant: Alias Sanders , Calgary.  \n Solicitor for the respondent: Alberta Crown Prosecution Service, Appeals and \nSpecialized Prosecutions Office, Edmonton.  \n \n2023 SCC 33 (CanLII)\n\n",
    "token_count": 455,
    "start_token": 900,
    "end_token": 1355,
    "total_tokens_in_source": 1355
  }
]