[
  {
    "chunk_id": 0,
    "source_file": "2023scc25.txt",
    "text": "--- Page 1 ---\n \n  \nSUPREME COURT OF CANADA  \n \nCITATION : Ponce v. Société \nd’investissements Rhéaume ltée, \n2023 SCC 25    \nAPPEAL HEARD : January 12, 2023  \nJUDGMENT RENDERED : October \n27, 2023  \nDOCKET : 39931  \n \nBETWEEN : \n \nAntoine Ponce and Daniel Riopel  \nAppellants  \n \nand \n \nSociété d’investissements Rhéaume ltée, Michel Rhéaume investissement ltée, \nAgence André Beaulne ltée and 9098 -3289 Québec inc.  \nRespondents  \n \nOFFICIAL ENGLISH TRANSLATION  \n \nCORAM : Wagner C.J. and Karakatsanis, Brown, Rowe, Kasirer, Jamal and \nO’Bonsawin JJ.  \n \nREASONS FOR \nJUDGMENT :  \n(paras.  1 to 119)  Kasirer J. (Wagner C.J. and Karakatsanis, Rowe, Jamal and \nO’Bonsawin JJ. concurring)  \n  \n \n \nNOTE: This document is subject to editorial revision before its reproduction in final \nform in the Canada Supreme Court Reports . \n \n \n* Brown J. did not participate in the final disposition of the judgment.  \n2023 SCC 25 (CanLII)\n\n--- Page 2 ---\n \n  \n \n   \n \n  \n2023 SCC 25 (CanLII)\n\n--- Page 3 ---\n \n Antoine Ponce  and \nDaniel Riopel  Appellants  \nv. \nSociété d ’investissements Rhéaume ltée,  \nMichel Rhéaume investissement ltée,  \nAgence André Beaulne ltée and  \n9098 -3289 Québec inc.  Respondents  \nIndexed as: Ponce v. Société d ’investissements Rhéaume ltée  \n2023  SCC 25  \nFile No.: 39931.  \n2023:  January  12; 2023:  October  27. \nPresent: Wagner  C.J. and Karakatsanis, Brown, Rowe, Kasirer, Jamal and \nO’Bonsawin  JJ. \nON APPEAL FROM THE C OURT OF APPEAL FOR Q UEBEC  \n Civil liability — Obligation of loyalty — Implied contractual obligations \n— Duty to inform — Obligation to act in good faith — Remedy — Company informing \npresidents of group of companies that it was interested in acquiring group — \n                                                 \n Brown  J. did not participate in the final disposition of the judgment.  \n2023 SCC 25 (CanLII)\n\n--- Page 4 ---\n \n Presidents not disclosing  information to group’s majority shareholders — Presidents \npurchasing shareholders’ interests  in group and reselling them to company for profit \n— Whether presidents’ non -disclosure of interest expressed by company in acquiring \ngroup constitutes civil fault  — Appropriate remedy if fault established — Civil Code of \nQuébec, arts.  1375 , 1434 . \n Two presidents of a group of three companies in the insurance industry \nlearned that a major company was interested in acquiring the group. Rather than \nrevealing this to t he group’s majority shareholders, the presidents decided to buy the \nwhole of the shareholders’ interests  themselves in order to resell them to the company \nfor a substantial profit. Before the resale, the presidents and the purchaser company \nentered into an  undertaking of confidentiality, which prevented the company from \ndealing directly with  the group’s majority shareholders.  \n Upon learning of the resale, the shareholders filed a motion to institute \nproceedings for damages in the Superior Court, claiming ap proximately $24 million as \ncompensation for the gain they would have made through that transaction of which they \nwere deprived . They alleged that the presidents had breached  their contractual and legal \nobligations and their fiduciary obligations, and in pa rticular their obligations to act in \ngood faith, with loyalty and transparency,  by failing to inform them of the interest \nexpressed by the purchaser company in acquiring the group.  The shareholders argued \nthat, because of the presidents’ unlawful actions, they were entitled to claim the \nequivalent of the excess profits made  by the presidents.  \n2023 SCC 25 (CanLII)\n\n--- Page 5 ---\n \n  The Superior Court ruled in the shareholders’ favour and ordered the \npresidents solidarily to pay them $11,884,743, an amount equal to the profits earned by \nthe pres idents on the resale. The court found that, under both",
    "token_count": 1000,
    "start_token": 0,
    "end_token": 1000,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 1,
    "source_file": "2023scc25.txt",
    "text": " argued \nthat, because of the presidents’ unlawful actions, they were entitled to claim the \nequivalent of the excess profits made  by the presidents.  \n2023 SCC 25 (CanLII)\n\n--- Page 5 ---\n \n  The Superior Court ruled in the shareholders’ favour and ordered the \npresidents solidarily to pay them $11,884,743, an amount equal to the profits earned by \nthe pres idents on the resale. The court found that, under both the Civil Code of Québec  \nand the Canada Business Corporations Act , the presidents, in their capacity as \ndirectors, owed duties of honesty, loyalty, prudence and diligence to the group. The \ntrial judge found that these same duties could be extended to the shareholders because \nof an incentive pay agreement entered into by the shareholders and the presidents \n(“Presidents’ Agreement”) that governed the parties’ relationship and entailed implied \nobligations for the presidents. The Court of Appeal affirmed the trial judgment and \nupheld the remedy awarded by the trial judge. However, it was of the view that the trial \njudge erred in finding that the duties of honesty and loyalty provided for in the Civil \nCode of  Québec  and the Canada Business Corporations Act  could be extended to the \nshareholders. The court held that the presidents’ conduct fell within  the three criteria \nset out in Bank of Montreal v. Bail Ltée , [1992] 2 S.C.R. 554, and that the presidents \nbreached the obligation of contractual good faith and the obligation to inform they \nowed to the shareholders.  \n Held : The appeal should be dismissed.  \n The presidents’ failure to inform the majority shareholders of the purchaser \ncompany’s interest in acquiri ng the group was a breach of the requirements of good \nfaith. They breached the obligation of contractual loyalty linked to good faith, which \nwas an implied obligation under the contract through the combined effect of arts.  1434 \n2023 SCC 25 (CanLII)\n\n--- Page 6 ---\n \n and 1375 C.C.Q.  The Presiden ts’ Agreement involved an implied obligation to inform \nthat required the presidents to provide the shareholders with all information relevant to \nmaking an informed decision about the sale of their shares. This implied obligation \nflowed from the nature of t hat agreement, which reflected the presumed intention of \nthe parties, in accordance with art.  1434 C.C.Q.  The presidents were also required to \nperform the Agreement in accordance with the requirements of good faith,  which was \nincluded in the contract throu gh imperative law under art.  1375 C.C.Q . With regard to \nthe remedy, the purpose of damages is to compensate for the gain lost as a result of \nfault, and the quantum must be assessed so as to place the shareholders in the position \nthey would have been in but  for the presidents’ fault. Disgorgement of profits is not \navailable where there has simply been a breach of the obligation of good faith; in \nprinciple, it is available only where a person is charged with exercising powers in the \ninterest of another. Howev er, where a breach of the requirements of good faith prevents \nthe aggrieved party from proving the injury sustained, it should be presumed that the \ninjury is equivalent to the profits made by the party at fault. The presidents have shown \nno palpable and ov erriding error in the trial judge’s conclusion that the shareholders’ \nlost gain is equivalent to the profits made by the presidents. There is therefore no reason \nto interfere with the assessment of the quantum of damages.  \n With regard to the possible legal  bases for the presidents’ obligation to \ninform the shareholders of the interest expressed by the purchaser company in \nacquiring the group, the obligation of maximalist loyalty arising from the exercise of \npowers in the interest of another, like the one re sting on an administrator of the property \n2023 SCC 25 (CanLII)\n\n--- Page 7 ---\n \n of others or a mandatary, is not at issue in th is case. The presidents are neither the \nshareholders’ mandataries nor administrators of the property of others, which means \nthat they cannot be held to an obligation o f loyalty like the one provided for in \narts. 1309 para.  2 and 2138 para.  2 C.C.Q.  In addition, the extracontractual obligation \nto inform related to good faith in the formation of contracts is of only theoretical \nimport ance in this case given the contractua l relationship that the parties chose to \nestablish with one another. The shareholders do not allege that there was a breach of \nthe requirements of good faith at the pre -contractual stage, nor do they ask that the \ncontracts for the sale",
    "token_count": 1000,
    "start_token": 900,
    "end_token": 1900,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 2,
    "source_file": "2023scc25.txt",
    "text": "  2 and 2138 para.  2 C.C.Q.  In addition, the extracontractual obligation \nto inform related to good faith in the formation of contracts is of only theoretical \nimport ance in this case given the contractua l relationship that the parties chose to \nestablish with one another. The shareholders do not allege that there was a breach of \nthe requirements of good faith at the pre -contractual stage, nor do they ask that the \ncontracts for the sale of their interests i n the group to the presidents be annulled. Rather, \ntheir focus is on the good faith performance of the Presidents’ Agreement, which was \nfully applicable at the relevant time.  \n The first legal basis for the duty to inform incumbent on the presidents is \ntherefore the implied contractual obligation to inform the shareholders under the \nPresidents’ Agreement. Pursuant to art.  1434 C.C.Q. , a contract binds the parties not \nonly as to what they have expressed in it but also as to what is incident to it according \nto its nature and in conformity with usage, equity or law. In th is case, the nature of the \nPresidents’ Agreement leads to the conclusion that an implied obligation to inform was \nincident to it. The Presidents’ Agreement was the cornerstone of the business \nrelationship between the presidents and the shareholders. The role of each party in this \nrelationship was clear. The Presidents’ Agreement was a long -term agreement \nformalizing a mutually beneficial business relationship between the presidents and the \nshareh olders, and it required reciprocal contractual loyalty. It reinforced the high level \n2023 SCC 25 (CanLII)\n\n--- Page 8 ---\n \n of trust that the shareholders placed in the presidents, and it expressly set out incentive \npay terms and conditions for the presidents’ benefit without spelling out recip rocal \nobligations for them. In light of the very nature of the Presidents’ Agreement, the \npresidents had an implied obligation to inform the shareholders of any fact that might \nenable them to assess the companies’ profits and value and decide whether to se ll their \nshares and, if so, at what price. The non -disclosure of the purchaser company’s interest \nwas a direct breach of this implied obligation.  \n The second legal basis is the obligation to perform the Presidents’ \nAgreement in accordance with the requirem ents of good faith under art.  1375 C.C.Q.  \nGood faith in Quebec civil law is now an enacted standard of public order. Unlike \nmaximalist loyalty arising from the exercise of legal powers, contractual loyalty is \nreciprocal because of the mutual nature of good  faith. It requires a contracting party to \nact with loyalty by taking into account, within the limits of reasonable conduct, the \ninterests of the other contracting party. Nevertheless, the obligation of loyalty rooted \nin contractual good faith in the perfo rmance of a contract does not require a contracting \nparty to subordinate their interests to those of the other party. In this case , contractual \nloyalty tied to good faith did not prevent the presidents from performing the contract \nto further their self -interest, but it did require them to consider the interests of the other \ncontracting parties. For this reason, it could impose on them a duty to inform. While \nthey did not have to subordinate their interests to those of the shareholders, the \npresidents could not conceal the purchaser company’s interest in the group without \n2023 SCC 25 (CanLII)\n\n--- Page 9 ---\n \n incurring contractual liability to the shareholders. By concealing that interest, they \nbreached their obligation of good faith.  \n The interest expressed by the purchaser company satisfies, in  the context \nof the Presidents’ Agreement, each of the three criteria set out in Bail, which serve to \ndetermine whether particular information falls within the duty to inform: \n(1) knowledge of the information, whether actual or presumed, by the party owing  the \nobligation to inform; (2)  the fact that the information in question is of decisive \nimportance; (3)  the fact that it is impossible for the party to whom the duty to inform \nis owed to inform itself, or that the creditor is legitimately relying on the de btor of the \nobligation. With regard to the first criterion, the presidents knew of the purchaser \ncompany’s interest and were fully aware of the financial value of that information. The \nsecond criterion is also satisfied because the purchaser company’s inte rest would have \nhad a major impact on the decision and on the determination of the value of the \nshareholder’s shares and the sale price. The last criterion is doubly satisfied given the \natmosphere of trust that existed between the parties and the fact that  it was impossible \nfor the shareholders to inform themselves of the",
    "token_count": 1000,
    "start_token": 1800,
    "end_token": 2800,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 3,
    "source_file": "2023scc25.txt",
    "text": " presidents knew of the purchaser \ncompany’s interest and were fully aware of the financial value of that information. The \nsecond criterion is also satisfied because the purchaser company’s inte rest would have \nhad a major impact on the decision and on the determination of the value of the \nshareholder’s shares and the sale price. The last criterion is doubly satisfied given the \natmosphere of trust that existed between the parties and the fact that  it was impossible \nfor the shareholders to inform themselves of the purchaser company’s interest. As a \nresult, the requirements of good faith in the performance of the Presidents’ Agreement \nimposed a duty on the presidents to inform the shareholders of the  interest expressed \nby the purchaser company.  \n Determining the appropriate remedy in this case  helps to clarify the \nboundary between restitution and compensation in the civil law. Compensation for the \n2023 SCC 25 (CanLII)\n\n--- Page 10 ---\n \n injury caused by a breach of contractual loyalty is dis tinct from disgorgement of profits \narising from non -performance of the obligation of maximalist loyalty in the exercise of \npowers. Disgorgement of profits without regard to injury is not an appropriate remedy \nin this case, because it is not in keeping with  the compensatory function of civil \nliability. It is available only where a person is charged with exercising powers in the \ninterest of another, and it is meant to ensure compliance with the obligation of \nmaximalist loyalty owed by a person on whom a power  is conferred. An award of \ndamages, on the other hand, serves to compensate the victim of a fault for the injury \nsustained, reflecting a compensatory logic related to contractual loyalty under art.  1375 \nC.C.Q. , and its purpose is to compensate for the gain  lost as a result of fault. To justify \nan award of damages, the party wronged by a breach of contractual loyalty bears the \nburden of establishing compensable injury, in accordance with the fundamental \nprinciple of restitutio in integrum  (or full reparation ) that is central to the law of civil \nliability in Quebec.  \n In this case , the gain lost by the shareholders is compensable under the rule \nfor assessing damages set out in art.  1611 C.C.Q.  Although the law of civil liability \ndoes not, as a general rule, exc use a plaintiff from proving the injury sustained, it is the \npresidents’ disloyal conduct that prevents the shareholders from making such proof. \nThe presidents’ non -disclosure of information to the shareholders was accompanied by \nefforts to conceal the pur chaser company’s interest in the group.  The presidents cannot \nbe allowed to profit from their breach of the requirements of good faith by arguing that \nthe shareholders failed to prove their injury. In accordance with Biotech Electronics \n2023 SCC 25 (CanLII)\n\n--- Page 11 ---\n \n Ltd. v. Baxter , [19 98] R.J.Q. 430 (C.A.), the presidents’ wrongdoing gives rise to a \nrebuttable presumption that the shareholders’ lost advantage is equivalent to the profits \nunjustly realized by the presidents. The presumption established in Baxter  serves as the \nbasis for a  method of calculating damages to compensate the aggrieved party for the \ninjury sustained. It is based on a compensatory objective that is distinct from \ndisgorgement of profits where disgorgement is awarded for a restitutionary purpose in \nthe absence of an y injury. The presidents have not rebutted this presumption, and the \ndamages owed to the shareholders are equivalent to the difference between the sale \nprice received by the presidents on their resale of the shares to the company and the \nprice received by the shareholders on the initial sale of the shares to the presidents.  \nCases Cited  \n Applied: Biotech Electronics Ltd. v. Baxter , [1998] R.J.Q. 430; Bank of \nMontreal v. Bail Ltée , [1992] 2 S.C.R. 554; distinguished: Bank of Montreal v. Kuet \nLeong Ng , [1989] 2 S.C.R. 429; considered: Uni-Sélect inc. v. Acktion Corp. , [2002] \nR.J.Q. 3005; referred to:  Resolute FP Canada Inc. v. Hydro -Québec , 2020 SCC 43; \nWastech Services Ltd. v. Greater Vancouver Sewerage and Drainage District , 2021 \nSCC 7; Gravino v. Enerchem Transport inc. , 2008 QCCA 1820, [2008] R.J.Q. 2178; \nBhasin v. Hrynew , 201",
    "token_count": 1000,
    "start_token": 2700,
    "end_token": 3700,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 4,
    "source_file": "2023scc25.txt",
    "text": "3005; referred to:  Resolute FP Canada Inc. v. Hydro -Québec , 2020 SCC 43; \nWastech Services Ltd. v. Greater Vancouver Sewerage and Drainage District , 2021 \nSCC 7; Gravino v. Enerchem Transport inc. , 2008 QCCA 1820, [2008] R.J.Q. 2178; \nBhasin v. Hrynew , 2014 SCC 71, [2014] 3 S.C.R. 494; Churchill Falls (Labrador) \nCorp. v. Hydro -Québec , 2018 SCC 46, [2018] 3 S.C.R. 101; Provigo Distribution Inc. \nv. Supermarché A.R.G. Inc. , 1997 CanLII 10 209; Cabiakman v. Industrial Alliance Life \nInsurance Co. , 2004 SCC 55, [2004] 3 S.C.R. 195; Housen v. Nikolaisen , 2002 SCC \n2023 SCC 25 (CanLII)\n\n--- Page 12 ---\n \n 33, [2002] 2 S.C.R. 235; National Bank of Canada v. Soucisse , [1981] 2 S.C.R. 339; \nHoule v. Canadian National Bank , [1990] 3 S.C.R. 1 22; Tardif v. Succession de Dubé , \n2018 QCCA 1639, 51 C.C.L.T. (4th) 54; Dunkin’ Brands Canada Ltd. v. Bertico Inc. , \n2015 QCCA 624, 41 B.L.R. (5th) 1; C.M. Callow Inc. v. Zollinger , 2020 SCC 45; \nDesjardins Financial Services Firm Inc. v. Asselin , 2020 SCC 3 0, [2020] 3 S.C.R. 298; \nAbbas -Turqui v. Labelle Marquis Inc. , 2004 CanLII 26082; Rainbow Industrial \nCaterers Ltd. v. Canadian National Railway Co. , [1991] 3 S.C.R. 3; Lamb v. Kincaid  \n(1907), 38 S.C.R. 516; National Bank of Canada v. Corbeil , [1991] 1 S.C.R . 117; \nProvincial Bank of Canada v. Gagnon , [1981] 2 S.C.R. 98; Andrews v. Grand & Toy \nAlberta Ltd. , [1978] 2 S.C.R. 229; Grenier v. Grenier , 2011 QCCA 964; M.H. v. Axa \nAssurances inc. , 2009 QCCA 2358, [2010] R.R.A. 15.  \nStatutes and Regulations Cite d \nCanad a Business Corporations Act , R.S.C. 1985, c.  C-44, s.  122(1)(a).  \nCivil Code of Québec , arts.  322, 431, 432, 1309  para.  2, 1365, 1366 para.  1, 1375, 1434,  \n1611 et seq., 2088, 2098, 2100 para.  1, 2138 para.  2, 2139, 2146 para.  2, 2184.  \nCode civil  (France), arts.  1112, 1112 -1. \nAuthors Cited  \nBaudouin, Jean -Louis. “Justice et équilibre: la nouvelle moralité contractuelle du droit \ncivil québécois”, dans Gilles Goubeaux et autres, dir., Études offertes à Jacques \nGhestin: Le contrat au début du XXIe siècle . Paris: LGD J, 2001, 29.  \nBaudouin, Jean -Louis, et Pierre -Gabriel Jobin. Les obligations , 7e éd. par \nPierre -Gabriel Jobin et Nathalie Vézina. Cowansville, Que.: Yvon Blais, 2013.  \n2023 SCC 25 (CanLII)\n\n--- Page 13 ---\n \n Bénabent, Alain. Droit des obligations , 19e éd. Paris: LGDJ, 2021.  \nCantin Cumyn, Madeleine. “L’obligation de lo",
    "token_count": 1000,
    "start_token": 3600,
    "end_token": 4600,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 5,
    "source_file": "2023scc25.txt",
    "text": "7e éd. par \nPierre -Gabriel Jobin et Nathalie Vézina. Cowansville, Que.: Yvon Blais, 2013.  \n2023 SCC 25 (CanLII)\n\n--- Page 13 ---\n \n Bénabent, Alain. Droit des obligations , 19e éd. Paris: LGDJ, 2021.  \nCantin Cumyn, Madeleine. “L’obligation de loyauté dans les services de placement” \n(2012), 3:1 B.D.E.  19. \nCantin Cumyn, Madeleine. “Le pouvoir juridique” (2007), 52 McGill L.J.  215. \nCantin Cumyn, Madeleine, et Michelle Cumyn. L’administration du bien d’autr ui, 2e \néd. Cowansville, Que.: Yvon Blais, 2014.  \nCornu, Gérard, ed. Dictionary of the Civil Code . Paris: LexisNexis, 2014, “ loyauté ”. \nCrépeau, Paul -André. “Le contenu obligationnel d’un contrat” (1965), 43 Can. Bar \nRev. 1. \nFréchette, Pasc al. La restitution des prestations . Montréal: Yvon Blais, 2018.  \nGrammond, Sébastien, Anne -Françoise Debruche and Yan Campagnolo. Quebec \nContract Law , 3rd ed. Montréal: Wilson & Lafleur, 2020.  \nGraziadei, Michele. “Virtue and Utility: Fiduciary Law in Civil Law and Common Law \nJurisdictions”, in Andrew  S. Gold and Paul  B. Miller, eds., Philosophical \nFoundations of Fiduciary Law . New York: Oxford University Press, 2014, 287.  \nGrégoire, Marie Annik. Le rôle de la bonne foi dans la formation et l’élaboration du \ncontrat . Cowansville, Que.: Yvon Blais, 2003.  \nGrégoire, Marie Annik. Liberté, responsabilité et utilité: la bonne foi comme \ninstrument de justice . Cowansville, Que.: Yvon Blais, 2010.  \nLefebvre, Brigitte. “La bonne foi”, dans Benoît Moore, dir., Les grandes notions . \nMontréal: Thémis, 2015, 75.  \nLefebvre, Brigitte. “La négociation d’un contrat: source potentielle de responsabilité \nextracontractuelle”, dans Pierre -Claude Lafond, dir., Mélanges Claude  Masse: \nEn quête de justice et d’équité . Cowansville, Que.: Yvon Blais, 2003, 571.  \nLluelles, Didier, et Benoît Moore. Droit des obligations , 3e éd. Montréal: Thémis, \n2018.  \nMalaurie, Philippe, Laurent Aynès et Philippe Stoffel -Munck. Droit des obligations , \n12e éd. Paris: LGDJ, 2022 . \nPicod, Yves. Le devoir de loyauté dans l’exécution du contrat . Paris: Librairie générale \nde droit et de jurisprudence, 1989.  \nPineau, Jean, et autres . Théorie des obligations , 5e éd. par Catherine Valcke . Montréal: \nThémis, 2023 . \n2023 SCC 25 (CanLII)\n\n--- Page 14 ---\n \n Private Law Dictionary and Bilingual Lexicons: Obligations . Cowansville, Que.: Yvon \nBlais, 2003, “ concealment ”. \nSmith, Lionel. “Loyalty” (2020), 66 McGill L.J.  121. \nSmith, Lionel, and Jeff Berryman. “Disgorgement of Profits in Canada”, in Ewoud \nHondius and  André Janssen, eds., Disgorgement of Profits: Gain -Based \nRemedies throughout the World . New York: Springer, 2015, 281.  \nStoffel -Munck, Philippe. L’abus dans le contrat: Essai d’une théorie . Paris: LGD J, \n2000.  \nViney, Geneviève. “La condamnation de l’auteur d’une faute lucrative à restituer le \nprofit illicite qu’il a",
    "token_count": 1000,
    "start_token": 4500,
    "end_token": 5500,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 6,
    "source_file": "2023scc25.txt",
    "text": "orgement of Profits: Gain -Based \nRemedies throughout the World . New York: Springer, 2015, 281.  \nStoffel -Munck, Philippe. L’abus dans le contrat: Essai d’une théorie . Paris: LGD J, \n2000.  \nViney, Geneviève. “La condamnation de l’auteur d’une faute lucrative à restituer le \nprofit illicite qu’il a retiré de cette faute”, dans Benoît Moore, dir., Mélanges \nJean -Louis Baudouin . Cowansville, Que.: Yvon Blais, 2012, 949.  \n APPEAL from a judgment of the Quebec Cour t of Appeal ( Mainville, \nRancourt and Fournier JJ.A.), 2021 QCCA 1363 , [2021] AZ -51794090, [2021] J.Q. \nno 10987 (QL), 2021 CarswellQue 14386 (WL), affirming a decision of Déziel  J., 2018 \nQCCS 3538, [2018] AZ -51519694, [2018] J.Q.  no 7285 (QL), 2018 CarswellQue 7079 \n(WL). Appeal  dismissed . \n Audrey Boctor , Étienne Morin -Lévesque  and Laurence Boudreau , for the \nappellant s. \n Jean -Rémi Thibault , Louis  P. Bélanger  and Samuel Nadeau , for the \nrespondent s. \nEnglish version of the judgment of  the Court delivered by  \n \n KASIRER  J. —  \n2023 SCC 25 (CanLII)\n\n--- Page 15 ---\n \n I. Overview  \n[1] Antoine Ponce and Daniel Riopel, presidents of a group of three thriving \ncompanies in the insurance industry, learned that a major company was interested in \nacquiring the group of companies that they ran. Ra ther than revealing this to the group’s \nmajority shareholders, Michel Rhéaume and André Beaulne and their investment \ncompanies (“the shareholders”), the two presidents decided to buy the companies \nthemselves and then resell them at a substantial profit. Th e shareholders felt betrayed; \nnot only had they trusted the presidents, but they had entered into an incentive pay \nagreement that gave the presidents significant benefits, including a right of first refusal \nin the event that the shareholders decided to div est themselves of their interests in the \ngroup.  \n[2] Considering this conduct to be disloyal, the majority shareholders blamed \nthe presidents for not disclosing to them the interest expressed by a prospective \npurchaser in acquiring the companies, arguing that t his was a breach of the presidents’ \nduty to inform that justified disgorgement of the profits they had made by unlawfully \nappropriating that business opportunity. The presidents answered that, during the \nnegotiations leading to their purchase of the compan ies, they had been under no legal \nobligation to subordinate their interests to those of the shareholders in such a manner.  \n[3] The Superior Court ruled in the shareholders’ favour and ordered the \npresidents solidarily to pay them an amount equal to the profits  earned on the resale of \nthe shares. The Court of Appeal confirmed the trial judge’s conclusions, while \n2023 SCC 25 (CanLII)\n\n--- Page 16 ---\n \n specifying the nature of the obligations breached by the presidents in relation to the \nshareholders, and upheld the remedy awarded at trial.  \n[4] This appeal  requires the Court to consider the basis for and parameters of \nthe obligation of loyalty in order to determine whether a duty to inform was incumbent \non the presidents. The Court must also clarify the conditions under which a court may \naward disgorgement of profits as a remedy, in particular for a contracting party’s \ndisloyal conduct. Specifically, it must trace the boundaries of the moral precept that \n“no one should profit from their own wrongdoing”, on which the shareholders rely, as \na justification for the remedy of disgorgement of profits made in bad faith.  \n[5] A first observation flows from the debate between the parties: the \nobligation of loyalty arising from the exercise of powers in the interest of another — \nlike the one resting on an administrator of t he property of others or a mandatary — is \nnot at issue here. An obligation of that kind would have required the presidents to \nsubordinate their interests to those of the shareholders by requiring them to disclose the \nprospective purchaser’s interest in acq uiring the group. But as Professor Madeleine \nCantin Cumyn has",
    "token_count": 1000,
    "start_token": 5400,
    "end_token": 6400,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 7,
    "source_file": "2023scc25.txt",
    "text": " the \nobligation of loyalty arising from the exercise of powers in the interest of another — \nlike the one resting on an administrator of t he property of others or a mandatary — is \nnot at issue here. An obligation of that kind would have required the presidents to \nsubordinate their interests to those of the shareholders by requiring them to disclose the \nprospective purchaser’s interest in acq uiring the group. But as Professor Madeleine \nCantin Cumyn has written, the [ TRANSLATION ] “basis for this loyalty .  . . differs \nsubstantially from the one dictating contractual loyalty, which applies to a person who \nperforms a prestation or exercises a righ t under a contract and who is bound to act in \ngood faith” (“L’obligation de loyauté dans les services de placement” (2012), 3:1 \nB.D.E.  19, at p.  21). Unlike loyalty tied to legal powers that must be exercised in the \ninterest of another or to achieve a part icular purpose, the obligation of contractual \n2023 SCC 25 (CanLII)\n\n--- Page 17 ---\n \n loyalty rooted in good faith in the performance of a contract under art.  1375 of the Civil \nCode of Québec  (“C.C.Q. ”) does not require a contracting party to subordinate their \ninterests to those of the other par ty. In this case, the presidents are neither the \nshareholders’ mandataries nor administrators of the property of others, which means \nthat they cannot be held to an obligation of loyalty like the one provided for in \narts. 1309 para.  2 and 2138 para.  2 C.C.Q . \n[6] A second observation is in order: despite the absence of an obligation of \nloyalty arising from the exercise of powers in the interest of another, the presidents’ \nconduct is nonetheless wrongful. Although contractual loyalty tied to good faith did \nnot pre vent the presidents from performing the contract to further their self -interest, it \ndid require them to consider the interests of the other contracting parties and, for this \nreason, it could impose on them a duty to inform. Accordingly, while the president s did \nnot have to subordinate their interests to those of the shareholders, the fact remains that, \nin pursuing their own interests, they could not conceal the prospective purchaser’s \ninterest in the companies without incurring contractual liability to the shareholders. By \ndoing so, they breached contractual loyalty linked to good faith, which was an implied \nobligation under the contract through the combined effect of arts.  1434 and 1375 \nC.C.Q.  Moreover, the trial judge was correct to conclude that the incentive pay \nagreement involved an implied obligation to inform that required the presidents to \nprovide the shareholders with all information relevant to making an informed decision \nabout the sal e of their shares. This implied obligation flowed from the nature of the \n2023 SCC 25 (CanLII)\n\n--- Page 18 ---\n \n contract, reflecting the presumed intention of the parties, in accordance with art.  1434 \nC.C.Q.  \n[7] The wrongful nature of the presidents’ conduct raises a second issue: Could \nthe non -disclosure of the prospective purchaser’s interest justify, as a remedy, \ndisgorgement of profits to the shareholders, who lost a business opportunity as a result \nof that wrongful conduct? An obligation of loyalty like the one resting on an \nadministrator of th e property of others or a mandatary in the exercise of their powers \nmay justify disgorgement of profits for a restitutionary purpose, but generally not for a \ncompensatory one. However, the presidents are correct to say that they had no such \nobligation of l oyalty.  \n[8] Determining the appropriate remedy in this case therefore presents an \nopportunity for the Court to clarify what Professor Pascal Fréchette calls \n[TRANSLATION ] “the boundary between restitution and compensation” in the civil law \n(La restitution des prestations  (2018), at p.  9). Compensation for the injury caused by \na breach of contractual loyalty is distinct from disgorgement of profits arising from \nnon-performance of the obligation of loyalty in the exercise of powers. To justify an \naward of damages , the party wronged by a breach of contractual loyalty bears the \nburden of establishing compensable injury, in accordance with the fundamental \nprinciple of restitutio in integrum  (or full reparation) that is central to the law of civil \nliability.  \n2023 SCC 25 (CanLII)\n\n--- Page 19 ---\n \n [9] Relying o n decisions of this Court in",
    "token_count": 1000,
    "start_token": 6300,
    "end_token": 7300,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 8,
    "source_file": "2023scc25.txt",
    "text": " in the exercise of powers. To justify an \naward of damages , the party wronged by a breach of contractual loyalty bears the \nburden of establishing compensable injury, in accordance with the fundamental \nprinciple of restitutio in integrum  (or full reparation) that is central to the law of civil \nliability.  \n2023 SCC 25 (CanLII)\n\n--- Page 19 ---\n \n [9] Relying o n decisions of this Court in which good faith was in issue, \nparticularly Bank of Montreal v. Kuet Leong Ng , [1989] 2 S.C.R. 429, the shareholders \nseek disgorgement of profits as a remedy for the presidents’ breach of the requirements \nof good faith. In my r espectful view, the shareholders are misreading Kuet , which \nrelates to the exercise of a power similar to that of a mandatary. Absent proof of injury, \nKuet  cannot justify disgorgement of profits based solely on the breach of the presidents’ \nobligation of c ontractual loyalty. That said, this misreading of Kuet  does not preclude \nan award of damages to the shareholders for an amount equivalent to what would have \nbeen disgorged to them to compensate for the advantage they lost due to the presidents’ \nfault.  \n[10] In this case, the harm resulting from the presidents’ contractual fault must \ntherefore be proved in accordance with the typical rules of civil liability. The \nshareholders seek compensation for lost profits under the rule for assessing damages \nset out in art.  1611 C.C.Q.  Although the law of civil liability does not, as a general rule, \nexcuse a plaintiff from proving the injury sustained, it is the defendant’s disloyal \nconduct that prevents the plaintiff from making such proof here. This is because, in this \ncase,  the presidents’ non -disclosure of information to the shareholders was \naccompanied by efforts to conceal the prospective purchaser’s interest in the companies \nand, according to a determination that is ultimately left to the trier of fact, by lies told \nto the shareholders to shut them out of the proposed deal.  \n2023 SCC 25 (CanLII)\n\n--- Page 20 ---\n \n [11] The presidents cannot be allowed to profit from their breach of the \nrequirements of good faith by arguing that the shareholders failed to prove their injury. \nIn a case such as this one, the presidents’  wrongdoing gives rise to a rebuttable \npresumption that the shareholders’ lost advantage is equivalent to the profits unjustly \nrealized by the presidents (see Biotech Electronics Ltd. v. Baxter , [1998] R.J.Q. 430 \n(C.A.)). The presidents could rebut this pr esumption by establishing the actual quantum \nof the lost gain on a balance of probabilities. They did not do so. Since the presidents \nhave shown no palpable and overriding error in the trial judge’s conclusion that the \nshareholders’ lost gain is equivalent  to the profits made by the presidents, I am of the \nview that there is no reason to interfere with the assessment of the quantum of damages.  \n[12] I would dismiss the appeal with costs.  \nII. Background  \n[13] Groupe Excellence was comprised of three companies operating in t he \ninsurance industry: two brokerage firms, Michel Rhéaume & Associés inc. and Beaulne \n& Rhéaume Assurance ltée, as well as The Excellence Life Insurance Company. At the \ntime of the events in dispute, Michel Rhéaume and André Beaulne, through the \nresponden t investment companies, owned all the shares of the two brokerage firms and \n93.1 percent of the shares of The Excellence. Mr.  Rhéaume and Mr.  Beaulne, who were \nin their late sixties at the relevant time, describe themselves as having little formal \neducatio n. However, they were very successful in the insurance field over the years, \nhaving founded the companies making up Groupe Excellence in the late 1970s.  \n2023 SCC 25 (CanLII)\n\n--- Page 21 ---\n \n [14] In February 2002, the appellants, Antoine Ponce and Daniel Riopel, were \nappointed presidents of the Gro upe Excellence companies. An actuary since 1978, \nMr. Ponce became the president of The Excellence Life Insurance Company, a position \nthat Mr.  Rhéaume had offered him several times before. Mr.  Riopel, who became a \nlawyer in 1986, is Mr.  Beaulne’s nephew. He  worked with both of the brokerage firms \nfor more than 20 years before becoming",
    "token_count": 1000,
    "start_token": 7200,
    "end_token": 8200,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 9,
    "source_file": "2023scc25.txt",
    "text": ", were \nappointed presidents of the Gro upe Excellence companies. An actuary since 1978, \nMr. Ponce became the president of The Excellence Life Insurance Company, a position \nthat Mr.  Rhéaume had offered him several times before. Mr.  Riopel, who became a \nlawyer in 1986, is Mr.  Beaulne’s nephew. He  worked with both of the brokerage firms \nfor more than 20 years before becoming their president.  \n[15] On March  15, 2002, Mr.  Ponce and Mr.  Riopel, designated in their \ncapacity as [ TRANSLATION ] “presidents” of the Groupe Excellence companies, and the \ninvestment companies of Mr.  Rhéaume and Mr.  Beaulne, as “majority shareholders”, \nentered into a contract described in its preamble as an “incentive pay agreement” \n(“Presidents’ Agreement” or “Agreement”) (A.R., vol.  X, at p.  3652). The Agreement \ngoverned the parties’  relationship during the entire period relevant to this litigation, \nincluding during the negotiations and then the sale by Mr.  Rhéaume’s and \nMr. Beaulne’s investment companies of their shares in Groupe Excellence to \nMr. Ponce and Mr.  Riopel. The Agreement,  which had an initial term of five years, was \nto be renewed automatically for additional two -year periods unless written notice to the \ncontrary was given.  \n[16] The Presidents’ Agreement formalized a business relationship between the \nparties that was based on their commitment to work toward the common goal of \nensuring the success of Groupe Excellence as an ongoing business, even with a view \nto a potential sale. To this end, the Agreement provided for various forms of incentive \n2023 SCC 25 (CanLII)\n\n--- Page 22 ---\n \n pay for the presidents in addition  to what they received as directors of the companies. \nThe Agreement had only eight clauses and, aside from requiring the subsequent \nnegotiation of a non -competition clause in favour of the shareholders, imposed no \nexpress obligation on the presidents.  \n[17] It was in this context, and while the Agreement was still applicable, that \nthe actions alleged took place.  \n[18] In April 2005, Industrial Alliance Insurance and Financial Services Inc. \n(“IA”) informed the presidents, Mr.  Ponce and Mr.  Riopel, of its interest in acq uiring \nGroupe Excellence. A series of discussions and exchanges of documents between the \npresidents and IA took place over several months. In July 2005, during that process, \nthe presidents and IA entered into an [ TRANSLATION ] “Undertaking of Confidentialit y” \nconcerning “a potential partnership agreement and/or any other form of transaction that \nmay be entered into by the [p]arties” (A.R., vol.  IV, at p.  1110, cl.  2). In the \nUndertaking, the presidents and IA agreed to the mutual disclosure of confidential \ninformation relative to their circumstances. At the presidents’ request, an exclusivity \nclause in their favour was also included with respect to any transaction involving IA \nand Groupe Excellence. The purpose of that clause  — according to the presidents \nthemselves — was to prevent IA from dealing directly with Mr.  Rhéaume and \nMr. Beaulne as well as with their holding companies.  \n2023 SCC 25 (CanLII)\n\n--- Page 23 ---\n \n [19] The presidents never informed the shareholders of these exchanges with IA \nor of IA’s interest in acquiring Groupe Excellence, nor  were the shareholders told of \nthe existence of the Undertaking of Confidentiality.  \n[20] In 2006, when the shareholders had been contemplating the possibility of \nselling their interests in Groupe Excellence for some time , Mr.  Beaulne asked \nMr. Ponce whether IA wou ld be interested in buying the shares. Despite the prior \nexchanges between IA and the presidents, Mr.  Ponce answered that he had already \nchecked and that IA was not interested. The parties disagree as to the exact date of that \ninteraction. The appellants s ay that the conversation took place before IA’s interest led \nto a preliminary valuation in May 2006 and an acquisition proposal in August 2006. \nThe respondents say instead that the conversation took place following these events. \nThus, according to the resp ondents, Mr.  Ponce deliberately lied to Mr.  Beaulne.  \n[21] In any event,",
    "token_count": 1000,
    "start_token": 8100,
    "end_token": 9100,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 10,
    "source_file": "2023scc25.txt",
    "text": " was not interested. The parties disagree as to the exact date of that \ninteraction. The appellants s ay that the conversation took place before IA’s interest led \nto a preliminary valuation in May 2006 and an acquisition proposal in August 2006. \nThe respondents say instead that the conversation took place following these events. \nThus, according to the resp ondents, Mr.  Ponce deliberately lied to Mr.  Beaulne.  \n[21] In any event, the respondents did not know about the interest expressed by \nIA in acquiring Groupe Excellence at the time they agreed to sell the whole of their \ninterests to the presidents. Mr. Rhéaume di d so in the fall of 2006, and Mr.  Beaulne \nfollowed suit in the spring of 2007. As consideration for that sale, Mr.  Rhéaume \nreceived approximately $23,500,000 together with a full release for his debts under the \nAgreement. Mr.  Beaulne received $10,371,210 t ogether with a release similar to \nMr. Rhéaume’s. In the months following those transactions, the presidents in turn \nresold to IA, for a total of $74,280,000, the interests they had acquired from the \nshareholders.  \n2023 SCC 25 (CanLII)\n\n--- Page 24 ---\n \n [22] In December 2007, IA issued a press release  announcing its acquisition of \nGroupe Excellence from the presidents. The respondents learned of the sale at that time. \nIn response, they filed a motion to institute proceedings for damages in the Superior \nCourt, claiming approximately $24 million as compe nsation for the gain they would \nhave made through that transaction of which they were deprived.  \n[23] In their motion, the respondents alleged that the presidents’ failure to \ninform them of IA’s interest had caused them a [ TRANSLATION ] “serious loss”  (motion \nto institute proceedings, at para.  57, reproduced in A.R., vol.  II, at p.  674). They stated \nthat they had been deprived of the difference between the price they received when \nthey sold their shares to the presidents and the higher price the presid ents obtained on \nthe resale to IA. They alleged that the presidents had breached [ TRANSLATION ] “their \ncontractual and legal obligations, their fiduciary obligations and their obligations to act \nin good faith, with loyalty and transparency”  by “intentionall y” failing to inform the \nshareholders of the interest expressed by IA in acquiring Groupe Excellence (para.  41). \nThe respondents stated that, because of the [TRANSLATION ] “unlawful actions” of \nMr. Ponce and Mr.  Riopel, they were entitled to claim “the equi valent” of the excess \nprofits made  by them (paras.  57-57.1).  \n[24] In defence, the appellants argued that the respondents were conflating the \nobligations the appellants owed to the companies and the obligations they owed to the \nshareholders. Here, they said, the  appellants [TRANSLATION ] “are under no obligation \nwhatsoever to the former shareholders, Beaulne and Rhéaume”  (A.R., vol.  II, at p.  689, \n2023 SCC 25 (CanLII)\n\n--- Page 25 ---\n \n para.  93). The appellants also argued that they had complied with their obligations \nunder the Presidents’ Agreement an d, more broadly, that they had committed \n[TRANSLATION ] “no fault” against the respondents  (para.  240). In addition, according \nto the appellants, Mr.  Rhéaume and Mr.  Beaulne had been aware of the prospective \npurchaser’s interest in acquiring Groupe Excellen ce, so the appellants could not be \naccused of hiding or concealing relevant information about the transactions that led to \nthe resale of the shares to IA. Finally, the appellants disputed the calculation of the \ndamages arising from the harm allegedly suffe red by the respondents, saying that they \nwere in no way [TRANSLATION ] “indebted” to the respondents  (para.  241).  \nIII. Judicial History  \nA. Quebec Superior Court, 2018 QCCS 3538 (Déziel  J.) \n[25] The trial judge granted the respondents’ motion in part. He stated that, \nunder both the Civil Code of Québec  and the Canada Business Corporations Act , \nR.S.C. 1985, c.  C-44",
    "token_count": 1000,
    "start_token": 9000,
    "end_token": 10000,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 11,
    "source_file": "2023scc25.txt",
    "text": " way [TRANSLATION ] “indebted” to the respondents  (para.  241).  \nIII. Judicial History  \nA. Quebec Superior Court, 2018 QCCS 3538 (Déziel  J.) \n[25] The trial judge granted the respondents’ motion in part. He stated that, \nunder both the Civil Code of Québec  and the Canada Business Corporations Act , \nR.S.C. 1985, c.  C-44, the appellants, in their capacity as directors, owed duties of \nhonesty, loyalty, prudence and diligence to Groupe Excellence. The trial judge found \nthat these same duties can be extended to shareholders [TRANSLATION ] “where there is \nan independent relationship between the directors .  . . and the shareholders” (para.  427 \n(CanLII)).  In his view, this kind of independent relationship existed here, particularly \nbecause of the Presidents’ Agreement, which [TRANSLATION ] “is key in illustrating the \nobligations assumed by the [appellants]” (para.  430).  \n2023 SCC 25 (CanLII)\n\n--- Page 26 ---\n \n [26] In the trial judge’s opinion, the Agreement entailed three implied \nobligations for the appellants: (1)  to maximize, in t he performance of their mandate \nand for the shareholders’ benefit, the profits and value of Groupe Excellence; (2)  to \nreport to the shareholders, in a full and transparent manner, all information that might \nenable them to assess the value of Groupe Excelle nce or make a decision to sell their \nshares and, in such a case, to determine a sale price; and (3)  not to use information for \ntheir personal benefit without obtaining the shareholders’ consent.  \n[27] The judge then found that the appellants had secretly negotia ted the resale \nof Groupe Excellence with IA. He noted that the appellants had signed an Undertaking \nof Confidentiality with IA to ensure that IA did not deal directly with the shareholders. \nBy doing so, the appellants had intentionally concealed from the s hareholders the \ninterest expressed by IA in acquiring Groupe Excellence, knowing that if the \nshareholders had been told of it, they [TRANSLATION ] “would have sought to maximize \nthe sale price for their shares and it would then have been more costly for the  \n[appellants] to exercise their right of first refusal under the Presidents’ Agreement”  \n(para.  487; see also paras.  436-37, 445 -46 and 486). Considering the appellants’ \nconduct in light of the obligational content of the Agreement, the trial judge held tha t \nthey had breached their duties of good faith and loyalty as well as their duty to inform \nowed to shareholders Rhéaume and Beaulne.  \n[28] The trial judge then assessed the injury resulting from the appellants’ fault, \napplying the principle of full reparation ( restitutio in integrum ). For that purpose, he \n2023 SCC 25 (CanLII)\n\n--- Page 27 ---\n \n essentially used the method of assessing injury proposed by the respondents’ expert, \nwhich was based on the following key assumption: [TRANSLATION ] “. . . had it not been \nfor the acts alleged against the [appell ants], the [respondents] would have received \nconsideration equivalent to what IA paid to acquire the [appellants’] interests in Groupe \nExcellence rather than the amount they obtained from the [appellants] .  . .” (A.R., \nvol. VII, at p.  2295, quoted with app roval by the trial judge at para.  598; see also \nparas.  615 and 638 -39). \n[29] Accepting the hypothesis put forward by the respondents’ expert, the trial \njudge held that the injury corresponded to the gains lost on the business opportunity \nunlawfully appropriated  by the appellants. The gains lost were therefore equivalent to \nthe profits made by the appellants when they resold the shares to IA, which the judge \nassessed at $11,884,743. He ordered the appellants solidarily to pay that amount and, \ntaking note of the a greement reached by Mr.  Rhéaume and Mr.  Beaulne concerning the \ndistribution of their respective interests in Groupe Excellence, he allocated \n$7,368,540.60 to Mr.  Rhéaume’s investment companies and $4,516,202.40 to \nMr. Beaulne’s investment companies.  \nB. Quebec  Court of",
    "token_count": 1000,
    "start_token": 9900,
    "end_token": 10900,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 12,
    "source_file": "2023scc25.txt",
    "text": ". He ordered the appellants solidarily to pay that amount and, \ntaking note of the a greement reached by Mr.  Rhéaume and Mr.  Beaulne concerning the \ndistribution of their respective interests in Groupe Excellence, he allocated \n$7,368,540.60 to Mr.  Rhéaume’s investment companies and $4,516,202.40 to \nMr. Beaulne’s investment companies.  \nB. Quebec  Court of Appeal, 2021 QCCA 1363 (Rancourt J.A., Mainville and \nFournier  JJ.A. concurring)  \n[30] The Court of Appeal, per Rancourt  J.A., unanimously dismissed the appeal \nand affirmed the trial judgment. However, the court noted that the trial judge erred in \nfindi ng that the duties of honesty and loyalty provided for in art.  322 C.C.Q.  and \n2023 SCC 25 (CanLII)\n\n--- Page 28 ---\n \n s. 122(1)(a) of the Canada Business Corporations Act , which the appellants had owed \nto Groupe Excellence in their capacity as directors, could be extended to the \nshareholders. But the court found that this error was not an overriding one given the \nother bases for the appellants’ liability, which were correctly identified by the trial \njudge. His analysis of the obligational content of the Presidents’ Agreement supported \nhis concl usions regarding the appellants’ fault, namely that they had breached their \ncontractual obligation of good faith and duty to inform (see paras.  84, 94 and 110 -11 \n(CanLII)).  \n[31] Discussing the duty to inform in greater detail, the Court of Appeal held \nthat the appellants’ conduct fell within the three criteria set out in Bank of Montreal v. \nBail Ltée , [1992] 2 S.C.R. 554. The Court of Appeal focused specifically on the fact \nthat it had been impossible for the shareholders to inform themselves of the interest \nexpressed by IA in acquiring Groupe Excellence as well as on the atmosphere of trust \nthat had existed between the appellants and the shareholders (see paras.  90-91). The \ncourt therefore concluded that the appellants breached the obligation of contractual \ngood  faith and the obligation to inform they owed to the shareholders, including by \nkeeping them out of the negotiations with IA and secretly signing the Undertaking of \nConfidentiality with IA (see paras.  93-94; see also paras.  110-11). \n[32] With respect to the rem edy, the Court of Appeal noted that it was not the \nrole of an appellate court to substitute itself for the trial judge in assessing contradictory \n2023 SCC 25 (CanLII)\n\n--- Page 29 ---\n \n expert evidence or in fixing the quantum of damages (para.  119). The total award of \n$11,884,743 in damages was  upheld.  \nIV. Parties’ Arguments and Issues  \n[33] Broadly speaking, two lines of argument are made by the parties before this \nCourt . First, the debate turns on whether the appellants’ failure to inform the \nshareholders of the interest expressed by IA in acquiring Gro upe Excellence was a \nbreach of an obligation, be it contractual or legal. In this regard, the appellants argue \nthat their failure cannot constitute a civil fault because there was no legal basis \nrequiring them to share that information in this case. As for  the respondents, they take \nthe view that the appellants are minimizing the scope and impact of the Presidents’ \nAgreement, which was applicable during the entire period in issue. In their opinion, the \nrequirements of good faith in the performance of that a greement made it obligatory for \nthe appellants to disclose to the respondents the interest expressed by IA in acquiring \nGroupe Excellence.  \n[34] Second, the parties disagree as to the appropriate remedy in the event that \nfault is established. The appellants subm it that there were no grounds upon which the \ntrial judge could award disgorgement of profits or even compensatory damages to the \nrespondents by way of remedy. There are two possibilities: either the trial judge ordered \ndisgorgement of profits without havin g any legal basis for doing so, or he awarded \ndamages without having sufficient evidence of harm (A.F., at para.  92). Noting that the \nprofits flowed from the appellants’ wrongdoing, the respondents counter that the \n2023 SCC 25 (CanLII)\n\n--- Page 30 ---\n \n appellants must hand over to them the pro fits made on the resale of Groupe Excellence \nto IA, in accordance",
    "token_count": 1000,
    "start_token": 10800,
    "end_token": 11800,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 13,
    "source_file": "2023scc25.txt",
    "text": "disgorgement of profits without havin g any legal basis for doing so, or he awarded \ndamages without having sufficient evidence of harm (A.F., at para.  92). Noting that the \nprofits flowed from the appellants’ wrongdoing, the respondents counter that the \n2023 SCC 25 (CanLII)\n\n--- Page 30 ---\n \n appellants must hand over to them the pro fits made on the resale of Groupe Excellence \nto IA, in accordance with the general principle of full compensation that is at the heart \nof the law of civil liability.  \n[35] In light of the parties’ arguments, two main questions shape the debate \nbefore this Court:  \nA. Did the appellants’ non -disclosure of the interest expressed by IA \nin acquiring Groupe Excellence constitute a breach of a \ncontractual or legal obligation to inform owed to the respondents \nand therefore a civil fault?  \nB) If this fault is established, did the  courts below err in awarding the \nrespondents a sum representing the profits made by the appellants, \neither through the disgorgement of profits mechanism or as \ndamages to compensate for the gain of which the respondents were \ndeprived?  \n[36] These questions will be analyzed in turn.  \nV. Analysis  \nA. Did the Appellants’ Non -Disclosure of the Interest Expressed by IA Constitute a \nCivil Fault?  \n2023 SCC 25 (CanLII)\n\n--- Page 31 ---\n \n [37] The trial judge found that the appellants had failed to disclose to the \nrespondents the interest expressed by IA in acquiring Groupe Excellence \n(paras.  485-90). He also found that, in 2005, the appellants had entered into an \nUndertaking of Confidentiality with IA that was intended to prevent IA from dealing \ndirectly with the shareholders (para.  441). These events occurred while the appe llants \nwere the presidents of the Groupe Excellence companies and while the Presidents’ \nAgreement signed in 2002 was fully applicable.  \n[38] The issue in this case is therefore whether the appellants did have a duty to \ninform the shareholders of the interest exp ressed by IA in acquiring Groupe Excellence \nthat was breached. In this Court, the parties discussed four possible legal bases for such \nan obligation: (1)  an obligation of loyalty arising from a legal power conferred on the \npresidents that they had to exerc ise in the shareholders’ interest, like the obligation \nresting on a mandatary or an administrator of the property of others; (2)  an \nextracontractual obligation to inform related to good faith in the formation of the \ncontracts for the sale of the respondent s’ interests to the appellants in 2006 and 2007; \n(3) an implied contractual obligation to inform the shareholders under the Presidents’ \nAgreement; or (4)  an obligation to perform the Agreement in accordance with the \nrequirements of good faith. The appellan ts take the view that none of these four bases \nimposed an obligation on them to inform the respondents of IA’s interest in acquiring \nGroupe Excellence. This being the case, I propose to consider each of these four \npossibilities in order to determine whethe r the appellants were required to inform the \nshareholders of the interest expressed by IA.  \n2023 SCC 25 (CanLII)\n\n--- Page 32 ---\n \n (1) First Possible Basis: Obligation of Loyalty Arising From the Exercise of \nPowers in the Interest of Another  \n[39] The appellants correctly argue that their duty to inform c annot be based on \na “fiduciary -type” obligation of loyalty that would be “similar to the fiduciary duties \nof the common law .  . . requir[ing] the debtor to put the interests of the beneficiary \nfirst” (A.F., at para.  53). In this regard, the Court of Appeal  properly stated that, as \ndirectors of the Groupe Excellence companies, the presidents did not have such an \nobligation to act with loyalty toward the majority shareholders, although they did owe \nsuch an obligation to the legal persons of the group (see, e. g., art.  322 para.  2 C.C.Q. ). \nThe appellants had no duty to inform anchored in this type of loyalty, which would \nhave imposed on them “a duty to act selflessly” (A.F., at para.  54). The respondents \nthemselves recognize that [ TRANSLATION ] “[t]here was never  any question of requiring \nthe [a]ppellants to subordinate their interests to [theirs]” (R.F., at para",
    "token_count": 1000,
    "start_token": 11700,
    "end_token": 12700,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 14,
    "source_file": "2023scc25.txt",
    "text": " para.  2 C.C.Q. ). \nThe appellants had no duty to inform anchored in this type of loyalty, which would \nhave imposed on them “a duty to act selflessly” (A.F., at para.  54). The respondents \nthemselves recognize that [ TRANSLATION ] “[t]here was never  any question of requiring \nthe [a]ppellants to subordinate their interests to [theirs]” (R.F., at para.  76). \n[40] In my view, the parties are correct on this point: the appellants did not have, \nas Professor Lionel Smith puts it, an obligation of “maximalist” lo yalty grounded in \nthe loyal use of power by a fiduciary, that is, “not just power over another person, but \npower held for that other person” ( “Loyalty” (2020), 66 McGill L.J.  121, at p.  122 \n(emphasis in original)). In Quebec civil law, the obligation of ma ximalist loyalty \nreferred to by the appellants exists mainly where a person exercises a [ TRANSLATION ] \n“power” in the interest of another  or for the fulfilment of a purpose (such as where a \ntrustee exercises a prerogative over a patrimony by appropriation i n favour of the \nbeneficiary), not where the holder of a “legal right” exercises it in their own interest  \n2023 SCC 25 (CanLII)\n\n--- Page 33 ---\n \n (such as a borrower’s prerogative under a contract for the simple loan of property) (see \nM. Cantin Cumyn and M.  Cumyn, L’administration du bien d’autru i (2nd ed. 2014), \nat para.  91). This is because, [ TRANSLATION ] “[u]nlike the holder of a right, a person \non whom powers are conferred is legally bound to act in the interest of another or for \nthe achievement of the purpose for which the powers were granted ” (M.  Cantin Cumyn, \n“Le pouvoir juridique” (2007), 52 McGill L.J.  215, at p.  223; see Resolute FP Canada \nInc. v. Hydro -Québec , 2020 SCC 43, at para.  69). \n[41] Two types of loyalty must be carefully distinguished. On the one hand, \ncontractual loyalty arising from good faith requires a contracting party to \n[TRANSLATION ] “take the other party’s interests into account”. On the other hand, \nloyalty in the exercise of a power, because of the purpose of that power, must be \nexercised [ TRANSLATION ] “only in the benefic iary’s interest or to achieve the goal that \nled [it] to be conferred” (Cantin Cumyn (2012), at p.  22). \n[42] A comparison can be drawn between the obligation of maximalist loyalty \nin the civil law and the obligation of loyalty in the English legal tradition that  is \nanchored in the exercise of a fiduciary obligation. In both legal traditions, the person \nsubject to an obligation of maximalist loyalty must subordinate their own interests to \nthose of another (see, e.g., Resolute , at para.  63; Wastech Services Ltd. v.  Greater \nVancouver Sewerage and Drainage District , 2021 SCC 7, at para.  110). However, the \nprerogatives of a trustee in English law are based on the legal title held by the trustee. \nIn contrast, in Quebec law, an administrator of the property of others has  no legal right \n2023 SCC 25 (CanLII)\n\n--- Page 34 ---\n \n in the property being administered but only powers that must be exercised over a \npatrimony by appropriation in the interests of another (see Cantin Cumyn and Cumyn, \nat para.  4; Smith, at p.  122).  \n[43] The obligation of loyalty of an administrato r or mandatary in the civil law \ntradition therefore relates to the exercise of powers defined on the basis of a purpose \n— the interest of another or the achievement of a goal — rather than on the basis of the \nexercise of legal title, as in English law. As Professor Michele Graziadei notes, “many \nfiduciary relationships in civilian countries are framed so to leave title to property \nsubject to fiduciary administration in the name of the beneficiary. Hence, if the property \nproduces profits, those profits autom atically belong to the owner” ( “",
    "token_count": 1000,
    "start_token": 12600,
    "end_token": 13600,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 15,
    "source_file": "2023scc25.txt",
    "text": " on the basis of a purpose \n— the interest of another or the achievement of a goal — rather than on the basis of the \nexercise of legal title, as in English law. As Professor Michele Graziadei notes, “many \nfiduciary relationships in civilian countries are framed so to leave title to property \nsubject to fiduciary administration in the name of the beneficiary. Hence, if the property \nproduces profits, those profits autom atically belong to the owner” ( “Virtue and Utility: \nFiduciary Law in Civil Law and Common Law Jurisdictions”, in A.  S. Gold and \nP. B. Miller, eds., Philosophical Foundations of Fiduciary Law  (2014), 287, at p.  297). \nSince the mechanics of the civil law dif fer from those of English law, the expression \n“fiduciary -type loyalty” may seem inaccurate in the civil law tradition (see Gravino v. \nEnerchem Transport inc. , 2008 QCCA 1820, [2008] R.J.Q. 2178, at para.  39). Finally, \nI note that, in both traditions, the d uties associated with the general principle of good \nfaith in the performance of contracts “ha[ve] strong conceptual differences from the \nmuch higher obligations of a fiduciary” ( Bhasin v. Hrynew , 2014 SCC 71, [2014] 3 \nS.C.R. 494, at para.  65; see also Reso lute, at para.  63). \n[44] In this case, the appellants were not required, by the Presidents’ Agreement \nor otherwise, to exercise powers for the benefit of the shareholders. They were therefore \n2023 SCC 25 (CanLII)\n\n--- Page 35 ---\n \n not bound, on that basis, by an obligation of maximalist loyalty. In particular, the \nPresidents’ Agreement did not impose on the appellants an obligation of loyalty similar \nto that of a mandatary, with the attendant obligation to inform (arts.  2138 para.  2 and \n2139 C.C.Q. ), because they did not have the power to represent t he respondents in the \nsale of Groupe Excellence’s shares to IA. Moreover, given that they were also not \nadministrators of the shareholders’ property, the appellants are correct to say that they \ndid not have a duty of loyalty under art.  1309 para.  2 C.C.Q.  that required them to \nsubordinate their own interests to those of the shareholders or their holding companies \n(A.F., at para.  53). Accordingly, the duty to inform owed by the appellants to the \nshareholders could not originate in any obligation of loyalty i n the exercise of powers. \nThis means that the non -disclosure of IA’s interest did not breach an obligation of \nmaximalist loyalty.  \n[45] I note, however, that in Quebec civil law, the concept of loyalty does not \nrefer solely to the maximalist loyalty contemplated  by the appellants. The respondents \npoint out that good faith imposes on the parties a duty of loyalty with a nature and basis \nthat are entirely different, both at the stage of formation of the contract and at the stage \nof its performance and extinction. W hile contractual loyalty arising from good faith \ndoes not require a party to put the interests of another first, it does affect the way in \nwhich the holder of a legal right may exercise it (Cantin Cumyn (2012), at p.  21). \n[46] Given the absence in this case of an obligation of loyalty arising from the \nexercise of powers in the interest of another, the appellants’ alleged obligation to \n2023 SCC 25 (CanLII)\n\n--- Page 36 ---\n \n inform, if it exists, must have a different legal basis. I turn now to the other three bases \nraised by the parties, starting with  the appellants’ possible extracontractual liability for \nbreaching the obligation of good faith in the formation of the contracts for the sale of \nthe respondents’ interests in 2006 and 2007.  \n(2) Second Possible Basis: Extracontractual Obligation to Inform in t he \nNegotiation and Formation of a Contract  \n[47] The appellants ask this Court to examine their conduct from the standpoint \nof extracontractual liability. They say that the allegations made against them by the \nrespondents relate to the stage of formation of the contracts by which the respondents \nsold their interests in 2006 and 2007 (A.F., at para.  46). They submit that the \nAg",
    "token_count": 1000,
    "start_token": 13500,
    "end_token": 14500,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 16,
    "source_file": "2023scc25.txt",
    "text": " Basis: Extracontractual Obligation to Inform in t he \nNegotiation and Formation of a Contract  \n[47] The appellants ask this Court to examine their conduct from the standpoint \nof extracontractual liability. They say that the allegations made against them by the \nrespondents relate to the stage of formation of the contracts by which the respondents \nsold their interests in 2006 and 2007 (A.F., at para.  46). They submit that the \nAgreement did not apply in this case because it “does not govern the buy -out \nnegotiations” (outline of argument, at para.  2.5, in condensed b ook, at p.  2). As a result, \nthey say, any fault alleged at the stage of the negotiations that led to the making of \nthose contracts of sale can only be extracontractual.  \n[48] The appellants acknowledge that, at the stage of contract formation, the \nrequirements o f good faith give rise to a duty to inform (A.F., at para.  48). That said, \nthey submit that the scope of this duty did not extend so far as to require them to \ndisclose IA’s interest to the respondents. At the pre -contractual stage, nothing \nprevented them f rom acting in their own interests by not disclosing that information.  \n2023 SCC 25 (CanLII)\n\n--- Page 37 ---\n \n [49] The appellants are correct that the requirements of good faith must be met \nduring the formation of a contract (art.  1375 C.C.Q. ; see also B.  Lefebvre, “La \nnégociation d’un contrat: sourc e potentielle de responsabilité extracontractuelle”, in \nP.-C. Lafond, ed., Mélanges Claude Masse: En quête de justice et d’équité  (2003), 571, \nat pp.  573 and 586 -87). Some authors properly connect the legal obligation to act in \ngood faith during negotiatio ns with an obligation to act [ TRANSLATION ] “with loyalty \nand fair play” (J.  Pineau et al., Théorie des obligations  (5th ed. 2023), by C.  Valcke, at \nNo. 87). While it is not necessarily disloyal to pursue parallel negotiations at the \npre-contractual stage, good faith entails a duty to inform, which varies with the context \nand is intended in part to [ TRANSLATION ] “make up for a lack of information that might \nlead to a form of exploitation” (B.  Lefebvre, “La bonne foi”, in B.  Moore, ed., Les \ngrandes notions  (2015), 75, at p.  108). Baudouin, Jobin and Vézina suggest that the \ncriteria from Bail determine the scope of this duty to inform, even at the pre -contractual \nstage (J. -L. Baudouin and P. -G. Jobin, Les obligations  (7th ed. 2013), by P. -G. Jobin \nand N.  Vézina , at No.  313).  \n[50] Good faith during the pre -contractual phase — and, by extension, the duty \nto inform arising from it — must be assessed in light of the parties’ relationship, which \nin this case includes the atmosphere of trust that existed between them as well as the \nPresidents’ Agreement they had entered into (see J. -L. Baudouin, “Justice et équilibre: \nla nouvelle moralité contractuelle du droit civil québécois” , in G.  Goubeaux et al., eds., \nÉtudes offertes à Jacques Ghestin: Le contrat au début du XXIe siècle  (2001), 29, at \np. 33). In Quebec, this pre -contractual duty to inform does not require a party to \n2023 SCC 25 (CanLII)\n\n--- Page 38 ---\n \n disregard their own interests or subordinate them to those of another. I would note that \nin France, a recent reform to the law of obligations appears to be consistent, to a large \ndegree, with this understanding of the state of Quebec law (see arts.  1112 and 1112 -1 \nof the French Code civil ). As Malaurie, Aynès and Stoffel -Munck explain, the duty of \ngood faith in the formation of a contract in French law now formally recognizes that \neach party must refrain from any conduct that is likely to mislead the",
    "token_count": 1000,
    "start_token": 14400,
    "end_token": 15400,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 17,
    "source_file": "2023scc25.txt",
    "text": " recent reform to the law of obligations appears to be consistent, to a large \ndegree, with this understanding of the state of Quebec law (see arts.  1112 and 1112 -1 \nof the French Code civil ). As Malaurie, Aynès and Stoffel -Munck explain, the duty of \ngood faith in the formation of a contract in French law now formally recognizes that \neach party must refrain from any conduct that is likely to mislead the other about their \ntrue intentions, a duty that [ TRANSLATION ] “essentially involves obligations to say and \nnot to say” (P.  Malaurie, L.  Aynès and P.  Stoffel -Munck, Droit des obligations  \n(12th  ed. 2022), at No.  277).  \n[51] There would have been a meaningful debate in this case about the scope of \nthe extracontractual duty to inform owed to the respondents on the basis of good faith, \nbut it is not a debate that needs t o be settled here. The respondents do not allege either \nin their motion to institute proceedings or before this Court that there was a breach of \nthe requirements of good faith at the pre -contractual stage, nor do they ask that the \ncontracts of sale they en tered into with the appellants in 2006 and 2007 be annulled. \nRather, their focus in this Court is on the good faith performance of the Presidents’ \nAgreement, which was fully applicable at the relevant time. I note that the Agreement \nanticipated the possibi lity of the sale of shares by Mr.  Rhéaume and Mr.  Beaulne in \nvarious ways, including by granting the appellants a right of first refusal. In this context, \nboth the respondents and the courts below are right to have approached the issue of the \nappellants’ l iability from a contractual standpoint. In short, the cause of action defended \n2023 SCC 25 (CanLII)\n\n--- Page 39 ---\n \n against by the appellants relates not to the formation  of the 2006 and 2007 contracts \nbut rather to the performance  of the Presidents’ Agreement entered into in 2002.  \n[52] In sum, ar guments based on extracontractual liability are of only theoretical \nimport here given the contractual relationship that the parties chose to establish with \none another. That being so, I will now examine the obligational content of the \nPresidents’ Agreement  to determine whether the appellants were contractually bound \nto inform the respondents of the interest expressed by IA in acquiring Groupe \nExcellence.  \n(3) Third Possible Basis: Implied Contractual Obligation to Inform  \n[53] The appellants submit that the trial judg e erred in finding that the \nPresidents’ Agreement contained an implied obligation to inform, making their \nnon-disclosure of IA’s interest a contractual fault. Characterizing the Agreement \ninstead as simply a “remuneration agreement”, they argue that it cou ld not include such \nan obligation (outline of argument, at para.  2.5). \n[54] The appellants are mistaken. Before the scope of an obligation of \ncontractual good faith is even considered, the nature of the Presidents’ Agreement leads \nto the conclusion that an impl ied obligation to inform was incident to it. The Presidents’ \nAgreement was the cornerstone of the business relationship between the appellants and \nthe shareholders. The role of each party in this relationship was clear. The shareholders \nprovided the capita l needed for the common enterprise while retaining ownership of \n2023 SCC 25 (CanLII)\n\n--- Page 40 ---\n \n the shares and the right to dispose of them, while the appellants agreed to contribute \ntheir expertise. This was how the parties chose to join forces contractually to pursue a \ncommon goal, the  success of Groupe Excellence. As noted above, the wording of the \nPresidents’ Agreement created obligations only for the appellants’ benefit, as the \nparties did not expressly provide for any correlative obligation for the shareholders’ \nbenefit (aside from requiring the subsequent negotiation of a non -competition clause). \nIn this regard, art.  1434 C.C.Q.  provides that a contract binds the parties not only as to \nwhat they have expressed in it but also “as to what is incident to it according to its \nnature and in conformity with usage, equity or law”. Implied obligations result in what \nProfessor Crépeau, in an article discussing art.  1024 of the Civil Code of Lower \nCanada , called the [ TRANSLATION ] “widening of the contractual circle” \n(P.-A.",
    "token_count": 1000,
    "start_token": 15300,
    "end_token": 16300,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 18,
    "source_file": "2023scc25.txt",
    "text": " C.C.Q.  provides that a contract binds the parties not only as to \nwhat they have expressed in it but also “as to what is incident to it according to its \nnature and in conformity with usage, equity or law”. Implied obligations result in what \nProfessor Crépeau, in an article discussing art.  1024 of the Civil Code of Lower \nCanada , called the [ TRANSLATION ] “widening of the contractual circle” \n(P.-A. Crépeau, “Le contenu obligationnel d’un contrat” (1965), 43 Can. Bar Rev.  1, at \np. 7). \n[55] In this case, the appellants’ implied obligations arose primarily from the \nvery nature of the Presidents’ Agreement. As this Court has noted, the nature of a \ncontract will be the source of a n implied duty if “the contract’s coherency seems to \nrequire such a duty and if the duty is consistent with the general scheme of the contract” \n(Churchill Falls (Labrador) Corp.  v. Hydro -Québec , 2018 SCC 46, [2018] 3 S.C.R. \n101, at para.  74). In other word s, an implied obligation arising from the nature of a \ncontract must not have the effect of adding new obligations to the contract but must \ninstead fill the gaps in its express content (D.  Lluelles and B.  Moore, Droit des \nobligations  (3rd ed. 2018), at No.  1542). According to Professor Crépeau, the \n2023 SCC 25 (CanLII)\n\n--- Page 41 ---\n \n justification for the inclusion of implied obligations arising from the nature of a contract \nrests first and foremost on the presumed intention of the parties (pp.  7-8). In this sense, \nimplied obligations have the  same basis as express obligations, thereby linking \nautonomy of the will to the “[b]inding force and content of contracts”, as the \nsubheading preceding art.  1434 C.C.Q.  now states (see Churchill Falls , at para.  74, per \nGascon  J., and para.  170, per Rowe  J., dissenting, but not on this point).  \n[56] Here, by its very nature, the Presidents’ Agreement was a long -term \nagreement that formalized a business relationship between the appellants and the \nmajority shareholders, parties who each had different roles to play t o maximize the \nvalue of Groupe Excellence. Regardless of whether the Agreement is characterized as \na relational contract, it required reciprocal contractual loyalty ( Churchill Falls , at \nparas.  122-23, quoting Provigo Distribution Inc. v. Supermarché A.R.G.  Inc., 1997 \nCanLII 10209 (Que. C.A.), at p.  25). The Agreement was certainly not a contract of \nemployment — the element of subordination was absent — under which an obligation \nof contractual loyalty specific to that nominate contract would have arisen purs uant to \nart. 2088 C.C.Q.  (Cabiakman v. Industrial Alliance Life Insurance Co. , 2004 SCC 55, \n[2004] 3 S.C.R. 195, at paras.  27-28). As mentioned above, the Agreement was also \nnot analogous to a contract of mandate that involves an obligation of maximalist \nloyalty. However, the Agreement was similar in some respects to a contract for services \n(art. 2098 C.C.Q. ), since the appellants undertook, in exchange for compensation and \nwith no relationship of subordination, to perform physical and intellectual acts for  the \nrespondents’ benefit. From this standpoint, and by analogy with art.  2100 para.  1 \n2023 SCC 25 (CanLII)\n\n--- Page 42 ---\n \n C.C.Q. , the appellants were bound to act “in the best interests” of Mr. Rhéaume and \nMr. Beaulne, but without subordinating their interests to those of the shareholders \n(Cantin Cumyn (2012), at pp.  20-21; see also Smith, at p.  121).  \n[57] According to clause  1 of the Agreement, [ TRANSLATION ] “[t]he \nSHAREHOLDERS agree to share with the PRESIDENTS part of the excess profits \nand part of the increase in corporate value of [Groupe Ex cellence]” (A.R., vol.  X, at \np. 3652). In addition,",
    "token_count": 1000,
    "start_token": 16200,
    "end_token": 17200,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 19,
    "source_file": "2023scc25.txt",
    "text": "), at pp.  20-21; see also Smith, at p.  121).  \n[57] According to clause  1 of the Agreement, [ TRANSLATION ] “[t]he \nSHAREHOLDERS agree to share with the PRESIDENTS part of the excess profits \nand part of the increase in corporate value of [Groupe Ex cellence]” (A.R., vol.  X, at \np. 3652). In addition, clauses 2 and 3 of the Agreement suggested the possibility of a \nfuture sale by the shareholders of their interests in Groupe Excellence and stipulated \nthe benefits that the appellants could derive from su ch a sale. Specifically, clause 2 \ngave the appellants an option to purchase 40 percent of the majority shareholders’ \ncapital stock in the event of a full or partial transaction, and clause 3 gave the appellants \na right of first refusal in such a scenario. Clauses 4 to 8 were miscellaneous clauses \nthat, among other things, provided for special compensation owed to the appellants in \ncertain circumstances if there was a sale or merger of Groupe Excellence (clause 4) and \nstipulated the term of the Agreement — five years, renewable automatically for \ntwo-year periods (clause 6).  \n[58] An analysis of the general scheme of the Presidents’ Agreement shows that \nit was intended to formalize a mutually beneficial business relationship between the \nappellants and the shareholders. In this sense, the Agreement reflected and reinforced \nthe high l evel of trust on which a common enterprise of this kind rests, including, above \nall, the trust that the shareholders placed in the appellants, as the trial judge found based \n2023 SCC 25 (CanLII)\n\n--- Page 43 ---\n \n on the evidence (see, in particular, Sup. Ct. reasons, at para.  36). The sharing o f Groupe \nExcellence’s profits and increase in value was the centrepiece of the Agreement, \nbecause this mechanism encouraged the appellants to step up their efforts to ensure its \nsuccess, which would ultimately benefit each of the parties. Furthermore, the \nAgreement was such that it provided the appellants with significant benefits, even if \nthe shareholders sold their shares. It expressly set out these incentive pay terms and \nconditions for the appellants’ benefit without spelling out any reciprocal obligati ons \nfor them.  \n[59] Having regard to the very nature of the Presidents’ Agreement, the trial \njudge found that the appellants had an implied obligation to maximize the value of \nGroupe Excellence, including with a view to a sale. That interpretation of the contrac t \n— based on the evidence — is consistent with the way the parties’ relationship was \nstructured: the appellants took care of the management of the companies and left it to \nthe shareholders to decide Groupe Excellence’s ultimate destiny. Moreover, I agree \nwith the trial judge that the appellants also had an implied obligation to inform the \nshareholders of any fact [ TRANSLATION ] “that might enable the Shareholders to assess \nthe companies’ profits and value and decide whether to sell their shares and, if so, a t \nwhat price” (para.  432). These implied obligations served to ensure the Agreement’s \ninternal coherence. Grounded in the presumed intention of the parties, they could have \nbeen configured differently, through an express clause. They were the logical \ncount erpart of the significant benefits conferred on the appellants and of the high level \nof trust existing in such a business relationship. This is all the more reason why the trial \n2023 SCC 25 (CanLII)\n\n--- Page 44 ---\n \n judge’s interpretation of the contract is entitled to deference, as the Court of Appeal \nnoted, and the appellants have failed to raise any reviewable error in this regard \n(Housen v. Nikolaisen , 2002 SCC 33, [2002] 2 S.C.R. 235, at para.  32). \n[60] According to the appellants, the scope of this implied obligation to inform \nwas not so wide as to impose on them a duty to tell the shareholders of the interest \nexpressed by IA in acquiring Groupe Excellence (A.F., at para.  78). They submit that \nIA’s interest in Groupe Excellence was no more than an indication of its market value, \nwhich is inform ation that a buyer cannot be obligated to provide to a prospective seller \n(A.F., at para.  73). \n[61] This argument advanced by the appellants is without merit. In my view, \nthe scope of the implied obligation to inform recognized by the trial judge supports his \nconclusion regarding the",
    "token_count": 1000,
    "start_token": 17100,
    "end_token": 18100,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 20,
    "source_file": "2023scc25.txt",
    "text": ".F., at para.  78). They submit that \nIA’s interest in Groupe Excellence was no more than an indication of its market value, \nwhich is inform ation that a buyer cannot be obligated to provide to a prospective seller \n(A.F., at para.  73). \n[61] This argument advanced by the appellants is without merit. In my view, \nthe scope of the implied obligation to inform recognized by the trial judge supports his \nconclusion regarding the wrongful nature of the appellants’ omission. I reiterate that, \nin keeping with that obligation, the appellants had to provide the shareholders with \n[TRANSLATION ] “all information they have that might enable the Shareholders to asses s \nthe companies’ profits and value and decide whether to sell their shares and, if so, at \nwhat price” (Sup. Ct. reasons, at para.  432). According to the trial judge’s findings of \nfact, which are not directly contested in this Court, knowledge of the intere st expressed \nby IA in acquiring Groupe Excellence would have had a major impact on the \nshareholders’ decision to sell to the appellants and on the price of that sale (paras.  446, \n487, 492 and 499). IA’s interest in acquiring Groupe Excellence was therefore  \ninformation that might have helped the shareholders make a decision to sell their \n2023 SCC 25 (CanLII)\n\n--- Page 45 ---\n \n interests and determine a price. Accordingly, the non -disclosure of IA’s interest was a \ndirect breach of the implied obligation found by the trial judge.  \n[62] But there is more.  \n[63] Not only did the appellants breach their implied obligation to inform \narising from the nature of the Presidents’ Agreement, but they may also have breached \ntheir duty to perform the Agreement in a manner consistent with the requirements of \ngood faith (art.  1375 C.C.Q. ). Indeed, it is from this latter perspective that the \nrespondents invite us to assess the appellants’ fault, alleging that they failed to meet \nthese requirements in performing the Presidents’ Agreement (R.F., at paras.  46-48). As \nwe will see, regardless of the existence of an implied obligation to inform under the \nPresidents’ Agreement, it can be concluded that in this case the requirements of good \nfaith, on their own, imposed a duty on the appellants to inform the shareholders of IA’s \ninterest , as an obligation of public order (see S.  Grammond, A. -F. Debruche and \nY. Campagnolo, Quebec Contract Law  (3rd ed. 2020), at para.  327).  \n[64] Although they sometimes overlap, there is a fundamental difference \nbetween non -performance of a contractual obligation  and performance of the obligation \nin a manner contrary to the requirements of good faith. The former relates to \nimplementation of the content  of the contractual obligation, whereas the latter relates \ninstead to the manner  in which the obligation is perfor med. For example, if the \nappellants worked to maximize the value of Groupe Excellence but secretly took action \nto prevent the shareholders from reaping the resulting benefits in the event of a sale, \n2023 SCC 25 (CanLII)\n\n--- Page 46 ---\n \n the appellants would indeed have performed their contract ual obligation to maximize \nGroupe Excellence’s value, but they would have done so in a manner contrary to the \nrequirements of good faith. Of course, the content of an implied contractual obligation \nto inform — arising from the presumed intention of the par ties — may differ from the \ncontent of the duty to inform arising from good faith, which is imposed on the parties \nby imperative law.  \n[65] I note that it is not always easy, helpful or necessary to draw a distinction \nbetween non -performance of a contractual obli gation, on the one hand, and \nperformance of such an obligation in a manner contrary to the requirements of good \nfaith, on the other. That said, it may be relevant in certain respects to recognize that a \nparty has not only failed to perform a contractual ob ligation but has also breached the \nrequirements of good faith. As I note below, even once non -performance of a contract \nis established, evidence of an additional breach of the requirements of good faith can \nhave a significant impact at the remedy stage. In  this context, and in light of the \nrespondents’ arguments, it is therefore appropriate to continue our analysis in order to \ndetermine whether the appellants performed the obligational content of the Presidents’ \nAgreement in a manner consistent with the req uirements of good faith.  \n(4) Fourth Possible Basis:",
    "token_count": 1000,
    "start_token": 18000,
    "end_token": 19000,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 21,
    "source_file": "2023scc25.txt",
    "text": " non -performance of a contract \nis established, evidence of an additional breach of the requirements of good faith can \nhave a significant impact at the remedy stage. In  this context, and in light of the \nrespondents’ arguments, it is therefore appropriate to continue our analysis in order to \ndetermine whether the appellants performed the obligational content of the Presidents’ \nAgreement in a manner consistent with the req uirements of good faith.  \n(4) Fourth Possible Basis: Obligation to Perform the Presidents’ Agreement in \nAccordance With the Requirements of Good Faith  \n[66] The appellants submit that their non -disclosure of the interest expressed by \nIA in acquiring Groupe Excellence  was not contrary to the requirements of good faith. \n2023 SCC 25 (CanLII)\n\n--- Page 47 ---\n \n In their opinion, the trial judge erred in concluding that they [ TRANSLATION ] “clearly \nbreached their duties of good faith and loyalty and their duty to inform” (para.  544). \nThey say that the Court of Ap peal also erred in upholding that conclusion (para.  110).  \n[67] Specifically, according to the appellants, the trial judge erred at para.  546 \nof his reasons when he faulted them for breaching their duty to [ TRANSLATION ] “put \nthe interests of [the respondents] ah ead of their own”. In so doing, they argue, he \nmisapprehended the scope of the obligation to perform a contract in good faith. They \nargue that unlike the “fiduciary -type” obligation of loyalty, contractual loyalty flowing \nfrom art.  1375 C.C.Q.  does not req uire a contracting party to subordinate their interests \nto those of the other party.  \n[68] In keeping with what they consider to be the proper scope of the obligation \nof good faith under art.  1375 C.C.Q. , the appellants submit that they were not bound to \ndisclos e IA’s interest to the respondents because that information does not meet the \ncriteria laid down in Bail relating to the duty to inform arising from good faith. The \nappellants thus argue that, in reality, IA’s interest was simply an indication of market \nvalue, or “information that Rhéaume and Beaulne could, and should, [have] obtain[ed] \nfor themselves” (outline of argument, at para.  2.8). \n[69] The appellants are mistaken. It is true that the trial judge misspoke in \nstating that the appellants had to put the resp ondents’ interests “ahead” of their own \n(para.  546). Nonetheless, in finding that the appellants had breached the obligation to \nperform the Presidents’ Agreement in good faith, the trial judge correctly assessed the \n2023 SCC 25 (CanLII)\n\n--- Page 48 ---\n \n scope of contractual loyalty and did not  require the appellants to subordinate their \ninterests to those of the respondents. His findings concerning the appellants’ \nconcealment of IA’s interest in acquiring Groupe Excellence — as the Court of Appeal \naffirmed (at para.  93) — are not tainted by a r eviewable error. In short, the Superior \nCourt and the Court of Appeal were right in finding two breaches — which were also \ninterrelated — of contractual loyalty, which attached to the Presidents’ Agreement \nthrough art.  1375 C.C.Q. : failing to properly info rm the shareholders at the time their \ninterests in Groupe Excellence were purchased and thereby lacking the elementary \nprobity required by contractual public order.  \n[70] Good faith in Quebec civil law, which has been fully recognized since \nNational Bank of Cana da v. Soucisse , [1981] 2 S.C.R. 339, Houle v. Canadian National \nBank , [1990] 3 S.C.R. 122, and Bail, is now an enacted standard of public order; it \ninfuses every contract as if a clause provided for it (Lluelles and Moore, at No.  1977). \nThrough the combine d effect of arts.  1375 and 1434 C.C.Q. , good faith performance is \nan implied obligation that by law must be included in a contract ( Tardif v. Succession \nde Dubé , 2018 QCCA 1639, 51 C.C.L.T. (4th) 54, at para.  75; Provigo , at pp.  20-22; \nBaudouin, Jobin and Vézina, at No.  307;",
    "token_count": 1000,
    "start_token": 18900,
    "end_token": 19900,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 22,
    "source_file": "2023scc25.txt",
    "text": "1434 C.C.Q. , good faith performance is \nan implied obligation that by law must be included in a contract ( Tardif v. Succession \nde Dubé , 2018 QCCA 1639, 51 C.C.L.T. (4th) 54, at para.  75; Provigo , at pp.  20-22; \nBaudouin, Jobin and Vézina, at No.  307; Lluelles and Moore, at No.  2017). To this end, \nart. 1434 C.C.Q.  [TRANSLATION ] “sets out a mechanism of implied prestations ” and \nart. 1375 establishes one of those prestations by requiring reciprocally from the \ncontracting parties “a general attitude  — even ‘a state of being’ — in the course of \ntheir contractual relationship” (Lluelles and Moore, at No.  1977 (emphasis in original; \nfootnote omitted)).  \n2023 SCC 25 (CanLII)\n\n--- Page 49 ---\n \n [71] Even before art.  1375 C.C.Q.  was enacted, Professor Crépeau explained \nthat an implied obl igation may arise from legislation, under either a suppletive or an \nimperative provision (pp.  27-29). The inclusion of an implied obligation through a \nlegislative provision supplementing contractual intention is, of course, justified by the \nstatutory presu mption that this was what the parties intended; the parties may exclude \nthe obligation through an express clause (see, e.g., with respect to marriage contracts, \narts. 431 and 432 C.C.Q. ). The justification for the inclusion of an implied obligation \nbased on an imperative statutory provision rests upon another conception of contractual \nfairness grounded not in autonomy of the will but in public order. This is the foundation \nof the duty to  perform the Presidents’ Agreement in good faith, an imperative \nobligation under art.  1375 C.C.Q.  In this sense, good faith differs from the implied \nprestations that arise, in part, from the nature of the contract. The imperative standard \nof good faith app lies to all contracts; its implementation varies with the circumstances. \nDiscussing French law, Professor Bénabent explains that good faith, which is \n[TRANSLATION ] “flexible in its content”, involves a range of requirements tailored to \nthe specific circums tances of each case (A.  Bénabent, Droit des obligations  (19th ed. \n2021), at No.  303 (emphasis deleted)). Here, the Presidents’ Agreement — a long -term \ncontract formalizing a business relationship — was entered into in the context of the \natmosphere of trust  found by the trial judge and had to be performed accordingly. The \nAgreement did not, however, require the appellants to exercise powers for the \nrespondents’ benefit.  \n2023 SCC 25 (CanLII)\n\n--- Page 50 ---\n \n [72] The appellants are therefore right to say that, in this case, they did not have \nan obliga tion of loyalty in the exercise of powers  in the interest of another. But like any \ncontracting party in Quebec, they had to comply with an obligation of contractual \nloyalty  toward the respondents, which arose from the duty of good faith set out in \nart. 1375 C.C.Q.  Through its so -called completive function, good faith requires a \ncontracting party [ TRANSLATION ] “to act with loyalty, that is, taking into account, \nwithin the limits of reasonable conduct, the interests of [the] other [contracting] party” \n(M. A. Grégoire, Liberté, responsabilité et utilité: la bonne foi comme instrument de \njustice  (2010), at p.  209; see also Dunkin’ Brands Canada Ltd. v. Bertico Inc. , 2015 \nQCCA 624, 41 B.L.R. (5th) 1, at paras.  66-70). This obligation of loyalty \n[TRANSLATION ] “app lies to a person who performs a prestation or exercises a right \nunder a contract and who is bound to act in good faith” (Cantin Cumyn (2012), at p.  21). \nUnlike maximalist loyalty, contractual loyalty is reciprocal because of the mutual \nnature of good faith . It does not require contracting parties to act in the sole interest of \ntheir counterparty, but it does require them to consider the other party’s interests when \nperforming the contract (L",
    "token_count": 1000,
    "start_token": 19800,
    "end_token": 20800,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 23,
    "source_file": "2023scc25.txt",
    "text": " a person who performs a prestation or exercises a right \nunder a contract and who is bound to act in good faith” (Cantin Cumyn (2012), at p.  21). \nUnlike maximalist loyalty, contractual loyalty is reciprocal because of the mutual \nnature of good faith . It does not require contracting parties to act in the sole interest of \ntheir counterparty, but it does require them to consider the other party’s interests when \nperforming the contract (Lluelles and Moore, at No.  1987).  \n[73] I pause here to note that the Fren ch term “ loyauté ” is sometimes used to \ndescribe different concepts, which no doubt reflects the [ TRANSLATION ] “great \nterminological variety” characteristic of this field: “.  . . reference is made both to good \nfaith and to an obligation of loyalty, of coope ration or, more vaguely, to an obligation \nof prudence or consistency” (Bénabent, at No.  303; see, in Quebec law, Smith, at \np. 121). For example, some Quebec authors have used this term to refer to the generally \n2023 SCC 25 (CanLII)\n\n--- Page 51 ---\n \n prohibitive dimension of good faith (see, e.g ., Lluelles and Moore, at No.  1978). On \nthe other hand, Professor Picod distinguishes [ TRANSLATION ] “loyalty as absence of \nbad faith” from “loyalty as a diligent and conscientious attitude”, regarding loyalty as \nreflecting both the prohibitive and proactiv e dimensions of good faith in French law \n(Y. Picod, Le devoir de loyauté dans l’exécution du contrat  (1989), at p.  26). For his \npart, Professor Cornu explains that the term “ loyauté ” may, among other things, refer \nmore generally to “contractual good faith (in the performance of a contract)” (G.  Cornu, \ned., Dictionary of the Civil Code  (2014), definition of “ loyauté ”). This latter approach \nwas echoed in Quebec jurisprudence based on the Civil Code of Lower Canada , \nincluding the landmark case of Houle , in whi ch this Court wrote that the “implicit \nobligation of good faith .  . . mandates that rights be exercised in a spirit of fair play” \n(p. 158; see also, under the Civil Code of Québec , Provigo , at pp.  23-26). \n[74] In these reasons, I use the expression “contractual  loyalty” to refer to the \ngeneral attitude of a contracting party in good faith, who must take the other party’s \ninterests into account (see Cantin Cumyn (2012), at p.  21). In this sense, contractual \nloyalty is “minimalist”. It stands in contrast to “maxim alist” loyalty, which is the \ngeneral attitude that must be adopted by a person on whom a power is conferred and \nwhich requires the person to subordinate their interests to those of another (see Smith, \nat p. 122). I note that the legislature uses the term “ loyauté ” in French to describe both \nmaximalist loyalty (see arts.  322, 1309 para.  2 and 2138 para.  2 C.C.Q. ) and contractual \nloyalty (see art.  2088 C.C.Q. ). The term “loyalty” is used as the English equivalent of \n2023 SCC 25 (CanLII)\n\n--- Page 52 ---\n \n “loyauté ” in art.  322 C.C.Q. , but the legis lature sometimes uses the adverb “faithfully” \nin analogous contexts (see arts.  1309 para.  2, 2088 and 2138 para.  2 C.C.Q. ). \n[75] Authors have properly recognized that, depending on the context, good \nfaith may have both a prohibitive dimension and a proactive dimension (see Lluelles \nand Moore, at No.  1978; M. A. Grégoire, Le rôle de la bonne foi dans la formation et \nl’élaboration du contrat  (2003), at pp.  11-12; Baudouin, Jobin and Vézina, at No.  161). \nIn this case, I am of the view that the appellants, through their conduct, breached the \nobligations flowing from both of these dimensions of good faith.  \n[76] First, the prohibitive dimension of good faith requires, among other things, \n",
    "token_count": 1000,
    "start_token": 20700,
    "end_token": 21700,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 24,
    "source_file": "2023scc25.txt",
    "text": " la formation et \nl’élaboration du contrat  (2003), at pp.  11-12; Baudouin, Jobin and Vézina, at No.  161). \nIn this case, I am of the view that the appellants, through their conduct, breached the \nobligations flowing from both of these dimensions of good faith.  \n[76] First, the prohibitive dimension of good faith requires, among other things, \nthat parties to a contract not act dishonestly in performing it (Lefebvre (2015), at p.  93). \nIn this case, contractual loyalty did not require the appellants to forsake their own \ninterests to benefit the respondents, let alone to refrain from exercising the legal rights \nthey had under the Agreement. But in the pursuit of their interests and the exercise of \ntheir rights, parties to a contract must conduct themselves loyally by not u nduly \nincreasing the burden on the other party or behaving in an excessive or unreasonable \nmanner (see Churchill Falls , at paras.  112-13, per Gascon  J., and para.  177, per \nRowe  J., dissenting, but not on this point). The prohibitive dimension of good faith  also \nrequires each contracting party not to jeopardize the existence or equilibrium of the \ncontractual relationship (Lluelles and Moore, at No.  1979).  \n[77] However, I agree with the trial judge that in this case the appellants \nconducted themselves in a disloya l manner and lacked probity when they failed to \n2023 SCC 25 (CanLII)\n\n--- Page 53 ---\n \n disclose the interest expressed by IA to the shareholders and when they signed the \nUndertaking of Confidentiality with IA (paras.  544-47). They were, of course, not \nobliged to subordinate their interests to t hose of the respondents in performing the \nPresidents’ Agreement, but they did have to look out for the interests  of the respondents \nin the legitimate pursuit of their own interests (see Dunkin’ Brands , at paras.  74-75; \nProvigo , at pp.  24-25; see also Bhasi n, at para.  70). The respondents could therefore \nlegitimately expect the appellants to refrain from scheming in any way to enrich \nthemselves at their expense. In the context of the business relationship in question, the \nappellants thus engaged in dishonest  conduct that thwarted the respondents’ legitimate \nexpectations in pursuing the goal they all had, which was to maximize the profits and \nvalue of the Groupe Excellence companies for the benefit of both the appellants and \nthe respondents.  \n[78] Furthermore, I mak e note once again of the trial judge’s factual \ndetermination that when Mr.  Beaulne asked Mr.  Ponce whether IA was interested in \nacquiring Groupe Excellence, Mr.  Ponce lied to Mr.  Beaulne by telling him that he had \nchecked and that IA was not interested (pa ras. 67-68 and 449). The appellants urge us \nto review that finding of fact. According to them, IA’s offer to purchase the group had \nnot yet been made at the relevant time. Even if it had been, they say, IA never wanted \nto do business directly with the shar eholders (A.F., at para.  85), so Mr.  Ponce did not \nact dishonestly by telling Mr.  Beaulne that IA was not interested in acquiring his shares \nin the group.  \n2023 SCC 25 (CanLII)\n\n--- Page 54 ---\n \n [79] I disagree with the appellants on this point. Although the interplay of dates \nmakes the chronology of  events sometimes difficult to reconstruct on appeal, I am of \nthe view that the appellants have not discharged the onerous burden of showing that \nthe trial judge’s finding in this regard — which was based in part on his assessment of \nthe credibility of tho se involved — is tainted by a palpable and overriding error. \nRegardless of whether Mr.  Ponce’s answer was a lie in the strict sense, his failure to \nconvey to Mr.  Beaulne the information he had at the time concerning the definite \ninterest expressed by IA am ounted, at the very least, to dishonest concealment that was \nmeant to mislead the shareholders (see Private Law Dictionary and Bilingual Lexicons: \nObligations  (2003), definition of “concealment”; P.  Stoffel -Munck, L’abus dans le \n",
    "token_count": 1000,
    "start_token": 21600,
    "end_token": 22600,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 25,
    "source_file": "2023scc25.txt",
    "text": " sense, his failure to \nconvey to Mr.  Beaulne the information he had at the time concerning the definite \ninterest expressed by IA am ounted, at the very least, to dishonest concealment that was \nmeant to mislead the shareholders (see Private Law Dictionary and Bilingual Lexicons: \nObligations  (2003), definition of “concealment”; P.  Stoffel -Munck, L’abus dans le \ncontrat: Essai d’une théori e (2000), at Nos.  92-98; see also C.M. Callow Inc. v. \nZollinger , 2020 SCC 45, at para.  89). That choice not to reveal IA’s interest was in \nkeeping with the silence required by the Undertaking of Confidentiality, through which \nMr. Ponce and Mr.  Riopel sough t to prevent IA from dealing directly with the \nshareholders (Sup. Ct. reasons, at para.  441). In this context, the trial judge had \nsufficient grounds for finding that such disloyal conduct was contrary to the \nrequirement of honesty arising from art.  1375 C.C.Q.  \n[80] Second, in addition to these breaches of the prohibitive dimension of good \nfaith, the appellants also contravened its proactive dimension. In this regard, good faith \nrequires, from each contracting party, active behaviour that is intended to assist t heir \ncontracting partner but that still remains compatible with the party’s own interests. \nBased on the circumstances, each party must, in particular, [ TRANSLATION ] “inform \n2023 SCC 25 (CanLII)\n\n--- Page 55 ---\n \n [their partner], in the course of the contract, of events they had better know abou t for \nthe performance of the contract” (Lluelles and Moore, at No.  1997 (footnote omitted)). \nGood faith thus imposes on each contracting party a duty to inform that [ TRANSLATION ] \n“encompass[es] their partner’s legitimate expectations” (D.  Mazeaud, “Chroniq ue de \njurisprudence civile générale: Obligations et protection des consommateurs”, in \nRépertoire du notariat Defrénois  (1996), at p.  1010, quoted in Lluelles and Moore, at \nNo. 2001; see also Desjardins Financial Services Firm Inc. v. Asselin , 2020 SCC 30, \n[2020] 3 S.C.R. 298, at para.  61). In keeping with this proactive dimension, as Professor \nCantin Cumyn helpfully notes, [ TRANSLATION ] “the duty of [contractual] loyalty \nrequires [a contracting party] to provide the other party with the information that is \nrelevant to the performance of their prestation, in order to facilitate it or avoid making \nit more onerous than originally intended” (Cantin Cumyn (2012), at p.  20). Like its \nprohibitive counterpart, the proactive dimension of contractual good faith does n ot \nrequire a contracting party to act selflessly. However, it does always require a \ncontracting party to consider the other party’s perspective when exercising the legal \nrights conferred by the contract (p.  21; see, e.g., Dunkin’ Brands , at para.  74). \n[81] In the context of this case, which involves a long -term business \nrelationship, contractual good faith imposed a proactive duty to inform on the parties \nthrough art.  1375 C.C.Q.  Disclosure by the appellants of the interest expressed by IA \nwould not have amounte d, in this case, to the subordination of their interests to those \nof the respondents. Conversely, remaining silent about IA’s interest constituted disloyal \nconduct. Again, we are dealing with a contractual undertaking through which the \n2023 SCC 25 (CanLII)\n\n--- Page 56 ---\n \n parties joined force s to achieve a common goal. This is what French authors Malaurie, \nAynès and Stoffel -Munck describe as an [ TRANSLATION ] “alliance contract” or \n“cooperation contract”, under which the parties unite to some degree to pursue a \ncommon goal over time (No.  276). Such contracts are better able to accommodate the \nduties of initiative and cooperation based on good faith than [ TRANSLATION ] “exchange \ncontracts”, which are not meant to be long -lasting (No.  276; see also Grammond, \nDebruche and Campagn",
    "token_count": 1000,
    "start_token": 22500,
    "end_token": 23500,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 26,
    "source_file": "2023scc25.txt",
    "text": " an [ TRANSLATION ] “alliance contract” or \n“cooperation contract”, under which the parties unite to some degree to pursue a \ncommon goal over time (No.  276). Such contracts are better able to accommodate the \nduties of initiative and cooperation based on good faith than [ TRANSLATION ] “exchange \ncontracts”, which are not meant to be long -lasting (No.  276; see also Grammond, \nDebruche and Campagnolo, at paras.  49 an d 326).  \n[82] All that remains to be determined is the extent of this duty to inform in the \nspecific context of the business relationship that existed here. For this purpose, I will \nrefer to the landmark decision in Bail. In that case, the Court outlined a gener al theory \nregarding the duty to inform arising from the obligation of good faith in contractual \nmatters, which served to determine whether particular information fell within this duty. \nAs the Court of Appeal properly noted, this Court laid down the followi ng three criteria \nin Bail (at pp.  586-87): (1)  knowledge of the information, whether actual or presumed, \nby the party owing the obligation to inform; (2)  the fact that the information in question \nis of decisive importance; (3)  the fact that it is impossibl e for the party to whom the \nduty to inform is owed to inform itself, or that the creditor is legitimately relying on \nthe debtor of the obligation.  \n[83] In this case, Rancourt  J.A. carefully verified whether these criteria were \nmet in light of the facts found by  the trial judge, and I adopt his conclusion that the \nthree criteria are satisfied (paras.  86-91). With regard to the first criterion, the \n2023 SCC 25 (CanLII)\n\n--- Page 57 ---\n \n appellants do not dispute that they knew of the interest expressed by IA in acquiring \nGroupe Excellence (para.  87, re ferring to the examination after defence of Daniel \nRiopel, reproduced in A.R., vol.  XVIII, at p.  6699). I also note that they were fully \naware of the financial value of that information and of the fact that it was of interest to \nthe shareholders from the s tandpoint of a possible sale (Sup. Ct. reasons, at para.  492). \nThe second criterion is also satisfied in this case, as the trial judge found that the interest \nexpressed by IA in acquiring Groupe Excellence would have [ TRANSLATION ] “had a \nmajor impact on th e decision of Rhéaume and Beaulne to sell their interests to the \n[appellants] and, beyond a shadow of a doubt, on the determination of the value of the \nshares and the price” (para.  446). The trial judge also found that if the shareholders had \nknown of IA’s  interest, they [ TRANSLATION ] “would have sought to maximize the sale \nprice for their shares ”, and Mr.  Rhéaume “would not have signed the act of sale of \nSeptember  1, 2006” (paras.  487 and 494). Indeed, Mr.  Ponce himself acknowledged \nthat, in such circumstances, the presidents and the shareholders could have presented a \nunited front and, as a group of four, obtained a better sale price (paras.  492-93). \n[84] Finally, I am of the view that the last criterion from Bail is doubly satisfied \nin this case. Firs t, with regard to the atmosphere of trust between the parties, I repeat \nthat they had, for several years, been cultivating a business relationship that involved \nthe pursuit of a common goal, the success of Groupe Excellence. In this sense, the \nrespondents were perfectly entitled to expect to be duly informed of the interest \nexpressed by IA in acquiring Groupe Excellence. However, the appellants acted \ndisloyally in this regard, betraying the trust that their counterparties, the respondents, \n2023 SCC 25 (CanLII)\n\n--- Page 58 ---\n \n had legitimately placed in them. Second, irrespective of the atmosphere of trust that \nexisted between the parties, I am of the view that it was impossible for the shareholders \nto inform themselves of IA’s interest. As noted above, the appellants entered into an \nUndertaking  of Confidentiality with IA a few months after being approached by it, and \nclause  5 of that undertaking was specifically intended to prevent any transaction \nbetween IA and the shareholders (Sup. Ct. reasons, at para.  445). According to",
    "token_count": 1000,
    "start_token": 23400,
    "end_token": 24400,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 27,
    "source_file": "2023scc25.txt",
    "text": " the atmosphere of trust that \nexisted between the parties, I am of the view that it was impossible for the shareholders \nto inform themselves of IA’s interest. As noted above, the appellants entered into an \nUndertaking  of Confidentiality with IA a few months after being approached by it, and \nclause  5 of that undertaking was specifically intended to prevent any transaction \nbetween IA and the shareholders (Sup. Ct. reasons, at para.  445). According to the trial \njudge, cla use 5 [ TRANSLATION ] “no doubt explains why IA’s president .  . . never \nreturned Beaulne’s call in April 2006 to verify IA’s interest” (para.  447). In addition, \nwhen Mr.  Beaulne asked Mr.  Ponce whether IA would be interested in purchasing his \nshares in Group e Excellence, Mr.  Ponce  answered that he had checked and that IA was \nnot interested  (paras.  448-49). As I said above, regardless of whether it was a lie, that \ninteraction — coupled with the signing of the Undertaking of Confidentiality — \nillustrates the sh areholders’ unsuccessful efforts to inform themselves.  \n[85] In sum, I agree with the Court of Appeal that the interest expressed by IA \nin acquiring Groupe Excellence satisfies, in the context of the Presidents’ Agreement, \neach of the three criteria set out in Bail (paras.  87-91). As a result, the requirements of \ngood faith in the performance of the Agreement imposed a duty on the appellants to \ninform the shareholders of IA’s interest.  \n[86] Since the appellants’ failure to inform the shareholders of IA’s interest in \nacquiring Groupe Excellence was therefore a breach of the requirements of good faith, \nI turn now to the question of the appropriate remedy.  \n2023 SCC 25 (CanLII)\n\n--- Page 59 ---\n \n B. Basis for the Remedy and Amount Owed to the Respondents  \n[87] The parties disagree on the legal basis for the appropriate r emedy in this \ncase and on the amount, if any, owed to the respondents. As noted above, the trial judge \nordered the appellants solidarily to pay the respondents $11,884,743, an amount \nequivalent to the profits that he found had been made by the appellants i n reselling the \nshares of Groupe Excellence to IA. The Court of Appeal upheld that amount, as it was \nof the view that the appellants had not established any reviewable error.  \n[88] The appellants submit that the courts below erred in ordering disgorgement \nto the  respondents of the profits made on the resale of Groupe Excellence to IA. In their \nopinion, there was no legal basis for awarding that remedy in this case. They stress that \ndisgorgement of profits must remain an exceptional remedy, since it is a departure  from \nthe cardinal principle of corrective justice. They maintain that ordering disgorgement \nof profits can be justified only where there is a breach of an obligation of loyalty similar \nto that of a common law fiduciary, that is, the maximalist loyalty req uired of a person \nauthorized to exercise powers in the interest of another. According to the appellants in \nthis case, the Court of Appeal correctly found, unlike the trial judge, that the parties’ \nlegal relationship was not characterized by such a relation ship of loyalty. However, \nthey argue that the Court of Appeal erred in upholding disgorgement of profits anyway \nbased on the breach of an obligation of good faith. They submit that a breach of that \ncontractual obligation must be compensated for only where injury is duly proved by \nthe plaintiff.  \n2023 SCC 25 (CanLII)\n\n--- Page 60 ---\n \n [89] As disgorgement of profits was not, in their view, an available remedy in \nthis case, the appellants maintain that the onus was on the respondents to prove their \ninjury. However, the respondents adduced no evidence to  this effect, they say, which \nmeans that no damages should be awarded against them. In their opinion, awarding \ndamages without proof of injury, even for a possible breach of the obligation of good \nfaith, would be tantamount to awarding punitive damages, wh ich cannot be justified in \nthe circumstances.  \n[90] The respondents answer that the remedy awarded by the courts below is \nfully justified in light of the wrong committed (R.F., at para.  89). First, they state that \ndisgorgement of profits is simply an application  of the moral precept that no one should \nprofit from their own wrongdoing or bad faith (R",
    "token_count": 1000,
    "start_token": 24300,
    "end_token": 25300,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 28,
    "source_file": "2023scc25.txt",
    "text": " the obligation of good \nfaith, would be tantamount to awarding punitive damages, wh ich cannot be justified in \nthe circumstances.  \n[90] The respondents answer that the remedy awarded by the courts below is \nfully justified in light of the wrong committed (R.F., at para.  89). First, they state that \ndisgorgement of profits is simply an application  of the moral precept that no one should \nprofit from their own wrongdoing or bad faith (R.F., at paras.  84-85, citing on this point \nKuet , at pp.  439 and 441). Second, and in the alternative, the respondents allege that \nthe remedy awarded by the Superior Co urt and upheld on appeal can be seen as \nequivalent to an award of damages. The respondents say that these damages, which are \ndirectly related to the appellants’ fault, compensate here for the injury flowing from \nlost profits, as permitted by art.  1611 C.C.Q. They argue that this “serious loss”,  raised \nin the motion to institute proceedings in the Superior Court, materialized when the \nappellants resold Groupe Excellence to IA at a price higher than the one they had paid \nto purchase it from the respondents. T his price difference [ TRANSLATION ] “would \ntherefore be the value most representative” of the profits of which the respondents were \nallegedly deprived as a result of the appellants’ wrongful omission (R.F., at para.  118). \nIn support of their position, the r espondents rely in part on the testimony of Mr.  Ponce, \n2023 SCC 25 (CanLII)\n\n--- Page 61 ---\n \n who stated the following regarding the sale price for Groupe Excellence: \n[TRANSLATION ] “. . . of course, we could have gotten more, but as a group of four” \n(examination in chief, reproduced in A.R., vo l. XXVII, at p.  9465).  \n[91] To determine the appropriate remedy in this case before considering the \nissue of assessment of damages, I must begin by identifying the legal basis for awarding \ndisgorgement of profits.  \n(1) Availability of Disgorgement of Profits as a Re medy  \n(a) Disgorgement of Profits Where There Is an Obligation of Loyalty in the \nExercise of a Power  \n[92] The appellants are certainly right on one point: as a general rule, \ndisgorgement of profits does not have the same compensatory function as an award of \ndamages as a remedy for breach of a contractual obligation. “Reparation” in civil \nliability is intended to compensate for loss sustained or profit lost (art.  1611 C.C.Q. ). \nIn contrast, other remedies are aimed at “restitution” and involve returning what has \nbeen r eceived. As such, they do not have this compensatory aspect that reparation does \nin the law of liability (on this distinction, see the comments of Professor Pascal \nFréchette, particularly at pp.  14 and 135). As for disgorgement of profits — which \nstraddles  restitution and compensation in the law of liability, and which was recognized \nby this Court in Kuet  under the Civil Code of Lower Canada  — the conditions for its \n2023 SCC 25 (CanLII)\n\n--- Page 62 ---\n \n application, which are somewhat uncertain in positive law, are disagreed upon by the \nparties  in this case.  \n[93] To begin, the appellants are correct in stating that disgorgement of profits \nis, in principle, available only where a person is charged with exercising powers in the \ninterest of another: a mandatary and an administrator must hand over the pr operty when \nthe administration ends, and this [ TRANSLATION ] “normal restitution” would \nencompass the profits accrued during the administration (Fréchette, at p.  154; see also \nCantin Cumyn (2012), at p.  22). For example, because an administrator of the prop erty \nof others exercises the powers attached to their office for the benefit of others, any \nprofit resulting from the exercise of those powers, along with the administered \nproperty, returns to the administered patrimony when the administration ends \n(arts.  1365 and 1366 para.  1 C.C.Q. ). In this regard, the first part of art.  1366 para.  1 \nC.C.Q.  provides that an administrator of the property of others must hand over to the \nbeneficiary all that the administrator has received in performing the",
    "token_count": 1000,
    "start_token": 25200,
    "end_token": 26200,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 29,
    "source_file": "2023scc25.txt",
    "text": "profit resulting from the exercise of those powers, along with the administered \nproperty, returns to the administered patrimony when the administration ends \n(arts.  1365 and 1366 para.  1 C.C.Q. ). In this regard, the first part of art.  1366 para.  1 \nC.C.Q.  provides that an administrator of the property of others must hand over to the \nbeneficiary all that the administrator has received in performing the obligation of \nloyalty attached to their duties, even if the beneficiary has not sustained any injury (see \nL. Smith and J.  Berryman, “Disgorgement of Profits in Canada”, in E.  Hondius and \nA. Janssen, eds., Disgorgement of Profits: Gain -Based Remedies throughout the World  \n(2015), 281). Moreover, under the second part of art.  1366 para.  1 C.C.Q. , an \nadministrator “is also accountable for any personal profit or benefit he has realized by \nusing, without authorization, information he had obtained by reason of his \nadministratio n”. In this exceptional case, disgorgement of profits sanctions the breach \nof the administrator’s obligation of maximalist loyalty, from a perspective farther \n2023 SCC 25 (CanLII)\n\n--- Page 63 ---\n \n removed from restitution (Cantin Cumyn and Cumyn, at para.  376). Even in such a \ncase, disgorgemen t of profits differs, as I will endeavour to explain, from the traditional \nsanction of damages, which depends on proof of injury.  \n[94] These two remedies are indeed conceptually distinct. Disgorgement of \nprofits, which is more restitutionary in its focus, is in  principle meant to ensure \ncompliance with the obligation of maximalist loyalty owed by a person on whom a \npower is conferred. An award of damages, on the other hand, serves to compensate the \nvictim of a fault for the injury sustained and thus reflects a c ompensatory logic related \nin part to contractual loyalty under art.  1375 C.C.Q.  As some authors explain, \ndisgorgement of profits is therefore different from damages, as it is [ TRANSLATION ] \n“not in keeping with the compensatory function of civil liability” (Fréchette, at p.  161; \nsee also Grégoire (2010), at pp.  50-51). \n[95] The respondents assert that in Kuet , this Court extended the scope of the \nremedy of disgorgement of profits beyond just cases in which a party exercises a power \n(R.F., at paras.  84-85). More p articularly, they argue that Kuet  made disgorgement of \nprofits a remedy to sanction a person who has committed a fault for financial gain and \nbreached the requirements of good faith in contractual matters (paras.  84 and 88). The \nappellants, on the other ha nd, give Kuet  a much narrower scope. Noting that the bank \nin that case had sustained no injury due to the conduct of its foreign currency trader, \nwho had made personal profits in the performance of his duties, the appellants say that \nKuet  does not permit t he scope of the exceptional remedy of disgorgement of profits to \n2023 SCC 25 (CanLII)\n\n--- Page 64 ---\n \n be extended beyond cases in which the debtor at fault was required to subordinate their \nown interests to those of their creditor (A.F., at para.  101). This interpretation of Kuet  \nleads the ap pellants to conclude that disgorgement of profits is not available as a \nremedy in this case because, as we know, the appellants did not breach an obligation \nof “maximalist” loyalty given that they were not charged with exercising powers in the \nrespondents’  interest. Accordingly, the appellants say, the breach of the obligation of \ncontractual loyalty they were found to have committed can give rise only to damages \nas compensation for proven injury, not to disgorgement of profits. However, the \nrespondents have  not proved such injury.  \n[96] I agree with the appellants that Kuet  should not be given an interpretation \nthat departs from the foundations of the law of civil liability. That judgment, when \nproperly read, indicates that the remedy of disgorgement of profits is  not available to a \ncourt where there has simply been a breach of the obligation of good faith by a person \nwho is not subject to an obligation of loyalty in the exercise of a power. Kuet  therefore \nprovides no basis to",
    "token_count": 1000,
    "start_token": 26100,
    "end_token": 27100,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 30,
    "source_file": "2023scc25.txt",
    "text": " I agree with the appellants that Kuet  should not be given an interpretation \nthat departs from the foundations of the law of civil liability. That judgment, when \nproperly read, indicates that the remedy of disgorgement of profits is  not available to a \ncourt where there has simply been a breach of the obligation of good faith by a person \nwho is not subject to an obligation of loyalty in the exercise of a power. Kuet  therefore \nprovides no basis to support disgorgement of profits to the  respondents as a remedy.  \n[97] It is true, as the respondents note, that Gonthier  J. relied on the precept that \n“no one should profit from his own wrongdoing” in deciding to award disgorgement of \nprofits ( Kuet , at p.  439). That said, Gonthier  J. did not base his reasoning solely on that \nadage, which might have suggested that he tied disgorgement of profits simply to a \nbreach of good faith. He took care to ground his decision to award disgorgement of \nprofits in an analogy with the obligation of a mandatary to t urn over profits to the \n2023 SCC 25 (CanLII)\n\n--- Page 65 ---\n \n mandator, since the specific relationship between the bank and its currency trader in \nthat case was similar to mandate.  \n[98] A brief overview of the facts of the case is necessary to fully appreciate \nthis reality. In Kuet , a bank’s chief  foreign currency trader had taken advantage of his \nposition to make secret arrangements with his clients. Under those arrangements, he \nwas to conduct foreign exchange transactions for their benefit and, in return, keep a \npercentage of the profits made. Wh en the bank was made aware of those unauthorized \nactivities, it brought a civil action against the currency trader, who by that point had \nmade more than $600,000 in profits. Because the plaintiff bank had not suffered any \nloss, it did not seek damages but rather disgorgement of the profits made by the trader.  \n[99] Upon concluding his analysis, Gonthier  J. allowed the bank’s claim and \nordered the trader to turn over the profits he had made. That conclusion did not rest \nsolely on the trader’s misconduct but thus r elated “rather to the underlying function and \nrelationship between the parties to the contract” (p.  436). The strong resemblance \nbetween that relationship and the one arising under a contract of mandate, due to the \ncontrol exercised by the trader over the bank’s affairs, was what led Gonthier  J. to \nrequire the trader to account for all that he had received in the context of his \nadministration (see the analysis proposed by Professor Fréchette, at pp.  10 and 155 -56). \nGonthier  J. based that disgorgement of pro fits, by analogy, on art.  1713 of the Civil \nCode of Lower Canada  (see today art.  2184 C.C.Q. ), a provision applicable first and \n2023 SCC 25 (CanLII)\n\n--- Page 66 ---\n \n foremost to mandataries that required them to deliver all that they had received under \nthe authority of their mandate to the man dator, even if it was not due (p.  436).  \n[100]  Professor Fréchette, commenting on the case, is therefore right to \nemphasize the parallel between the role of mandatary and the representative position \nheld by the currency trader and in noting that this Court requir ed the trader \n[TRANSLATION ] “to account for all that he had received in the context of his \nadministration, in keeping with the general logic of the rules of mandate” (p.  155). \nSimilarly, Professors Cantin Cumyn and Cumyn, at para.  376, take the view that \nGonthier  J. required specific performance of an obligation to hand over profits, an \nobligation analogous to that of a mandatary or administrator of the property of others \n(arts.  1366 para.  1, 2146 para.  2 and 2184 C.C.Q. ). It was thus the existence of an \nobligation of maximalist loyalty in the context of exercising a power that justified \ndisgorgement of profits in Kuet  even though the bank had sustained no injury. I note \nthat in Abbas -Turqui v. Labelle Marquis Inc. , 2004 CanLII 26082 (Que.), which \nconcerned a fault committed by a contracting party for financial gain in the context of \na sale, the Court of Appeal took care to",
    "token_count": 1000,
    "start_token": 27000,
    "end_token": 28000,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 31,
    "source_file": "2023scc25.txt",
    "text": " existence of an \nobligation of maximalist loyalty in the context of exercising a power that justified \ndisgorgement of profits in Kuet  even though the bank had sustained no injury. I note \nthat in Abbas -Turqui v. Labelle Marquis Inc. , 2004 CanLII 26082 (Que.), which \nconcerned a fault committed by a contracting party for financial gain in the context of \na sale, the Court of Appeal took care to distinguish Kuet  based on this same logic (see \npara.  13). \n[101]  I conclude that the principles spoken to in Kuet  cannot be usefully \ntransposed to this case. Of course, it might be said that by concealing the interest \nexpressed by IA, the appellants, like the currency trader in Kuet , breached the \nobligation of good faith imposed on them through the combined effect of arts.  1434 \n2023 SCC 25 (CanLII)\n\n--- Page 67 ---\n \n and 1375 C.C.Q.  But unlike the defendant in Kuet , the appellants were not required to \nturn over profits, as a mandatary or administrator would be, because they were not \ncharged with exercising powers in the respondents’ interest.  \n[102]  Accordingly, I am of the view that unlike the  relationship that existed in \nKuet  but like the one in Abbas -Turqui , the specific relationship between the appellants \nand the respondents cannot ground disgorgement of the profits made by the appellants \nas a remedy.  \n(b) Disgorgement of Profits Where There Is N o Exercise of Power  \n[103]  In addition to Kuet , the respondents rely on Uni-Sélect inc. v. Acktion \nCorp. , [2002] R.J.Q. 3005, arguing that in that case the Quebec Court of Appeal \nordered disgorgement of profits where a fault was committed for financial gain but \nthere was no exercise of power in the interest of another. In Uni-Sélect , the contracting \nparty at  fault had purchased a company in violation of a non -competition clause. Faced \nwith the trial judge’s finding that injury had not been proved, the Court of Appeal held \nthat the injury was equivalent to the profits made by the contracting party at fault \n(paras. 58-63). The Court of Appeal thus reversed the trial judge’s factual \ndetermination, stating that the [ TRANSLATION ] “benefit in the marketplace” derived by \nthe contracting party at fault, that is, the profits it made, “inevitably caused, in [this] \nconte xt, a loss for the [aggrieved contracting party]” (para.  59). For this reason, it \ndeclared that the beneficiary of the non -competition clause [ TRANSLATION ] “must be \ncompensated for this loss” pursuant to art.  1611 C.C.Q.  (para.  59; see also para.  36). \n2023 SCC 25 (CanLII)\n\n--- Page 68 ---\n \n The respondents are therefore incorrect in arguing that the Court of Appeal in \nUni-Sélect  ordered the contracting party at fault to disgorge profits for a purpose other \nthan compensation and without any proof of injury. Accordingly, insofar as it was \nestablish ed that the profits realized were equivalent to the injury caused by the \ncontracting party’s wrongful conduct, disgorgement of profits in Uni-Sélect  was \njustified as compensation for fault. The respondents certainly cannot rely on that case \nto obtain disgo rgement of profits directly, in the absence of an obligation of maximalist \nloyalty.  \n[104]  Independently of the foregoing, the respondents argue that disgorgement \nof profits can be a non -compensatory remedy that is available in the case of conduct \n[TRANSLATION ] “that truly deviates from that of an honest, prudent contracting party” \n(R.F., at para.  100). But as I have said, it must be recognized that they are above all \nseeking disgorgement of profits based on the compensatory function of this remedy, \nsince they are  claiming the profits made by the appellants as the “equivalent” of the \ngain of which they were allegedly deprived because the appellants unlawfully \nappropriated the business opportunity. As the motion to institute proceedings clearly \nindicates, the disgor gement of profits sought by the respondents is more akin to \ndamages, which are in keeping with the general principles of civil liability (motion to \ninstitute proceedings, at para.  57.1). Unlike the bank in Kuet , the respondents say that",
    "token_count": 1000,
    "start_token": 27900,
    "end_token": 28900,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 32,
    "source_file": "2023scc25.txt",
    "text": " appellants as the “equivalent” of the \ngain of which they were allegedly deprived because the appellants unlawfully \nappropriated the business opportunity. As the motion to institute proceedings clearly \nindicates, the disgor gement of profits sought by the respondents is more akin to \ndamages, which are in keeping with the general principles of civil liability (motion to \ninstitute proceedings, at para.  57.1). Unlike the bank in Kuet , the respondents say that \nthey have sustained  “serious loss”. They are therefore seeking disgorgement of profits \nas compensation for that injury caused by the breach of the appellants’ obligation of \n“contractual” loyalty. It follows that there is no need, in the context of the facts of this \n2023 SCC 25 (CanLII)\n\n--- Page 69 ---\n \n case, to decide whether disgorgement of profits is available to a court as a confiscatory \nand [ TRANSLATION ] “rather novel” sanction in the absence of such injury (see Lluelles \nand Moore, at No.  2037; G.  Viney, “La condamnation de l’auteur d’une faute lucrative \nà restituer le profit illicite qu’il a retiré de cette faute”, in B.  Moore, ed., Mélanges \nJean -Louis Baudouin  (2012), 949).  \n[105]  In sum, I am of the view that disgorgement of profits without regard to \ninjury is not an appropriate remedy in this case. The sanction requested is to \ncompensate for a wrong. The demand is not simply for restitution of profits, much less \nfor disgorgement of profits for a confiscatory or punitive purpose, a remedy that would \npotentially deviate from the general law of civil liability. It i s thus appropriate to assess, \non the basis of the respondents’ alternative argument, the quantum of the damages to \nbe awarded to them to compensate for the loss they claim to have suffered.  \n(2) Award of Damages Pursuant to the Presumption in Baxter  \n[106]  In Quebec, the law of civil liability is based on the principle of full \ncompensation for injury sustained, often expressed through the phrase restitutio in \nintegrum . Pursuant to this principle, the purpose of damages is to compensate for loss \nsustained or gain lost a s a result of fault. The quantum of such damages must be \nassessed so as to place the respondents in the position they would have been in but for \nthe appellants’ fault (see arts.  1611 et seq. C.C.Q. ). \n2023 SCC 25 (CanLII)\n\n--- Page 70 ---\n \n [107]  Here, the trial judge found that the appellants’ failure  to tell the \nshareholders of the interest expressed by IA in acquiring Groupe Excellence had a \nmajor impact on the respondents’ decision to sell their shares and on the sale price \n(para.  446). In the Superior Court, Mr.  Ponce acknowledged that if the share holders \nhad been duly informed, they and the presidents could have presented a united front in \nnegotiating with IA and thus obtained a better price (paras.  492-93). That said, despite \nthat concession, the appellants argue that the outcome of such negotiati ons is \nspeculative and that it is therefore impossible to accurately determine the position the \nrespondents would have been in but for the appellants’ fault. Since the existence of lost \nprofits has not been established, they say, what the respondents are c laiming is \ncompensation for loss of chance, which is not compensable in Quebec law.  \n[108]  The respondents answer that, since the start of the proceedings, they have \nbeen seeking compensation for the gain lost due to the bad faith of the appellants, who \nunlawfull y appropriated the proceeds from the resale of Groupe Excellence to IA. The \ntrial judge accepted the existence of this lost gain, they say, and any difficulty proving \nit with precision is directly attributable to the appellants’ wrongdoing.  \n[109]  This situation is not unlike the one in Baxter , to which the trial judge \nreferred (paras.  590-93). In that case, the Quebec Court of Appeal held that the majority \nshareholders had breached the requirements of good faith by failing to disclose to the \nminority shareholders  the possibility of a public offering of their shares. Not having \nbeen informed of such a possibility, the minority shareholders agreed to sell their \n2023 SCC 25 (CanLII)\n\n--- Page 71 ---\n \n interests to the majority shareholders for $25 per share. A few",
    "token_count": 1000,
    "start_token": 28800,
    "end_token": 29800,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 33,
    "source_file": "2023scc25.txt",
    "text": "paras.  590-93). In that case, the Quebec Court of Appeal held that the majority \nshareholders had breached the requirements of good faith by failing to disclose to the \nminority shareholders  the possibility of a public offering of their shares. Not having \nbeen informed of such a possibility, the minority shareholders agreed to sell their \n2023 SCC 25 (CanLII)\n\n--- Page 71 ---\n \n interests to the majority shareholders for $25 per share. A few months later, the \nmajority shareholders re sold those shares in the public offering for $150 each, thus \nearning a profit of $125 per share.  \n[110]  Writing for the majority, Rothman  J.A. found that if the minority \nshareholders had been told of the possibility of a public offering, they would not have \nsold their interests for $25 per share. However, determining the price at which they \nwould have sold their interests — if they had indeed decided to sell them — involved \nspeculation ( Baxter , at p.  443), because the dishonest concealment of information \nprevented  the minority shareholders from precisely establishing the position they \nwould have been in but for the fault committed against them.  \n[111]  In that context, Rothman  J.A. stated that the loss sustained by the minority \nshareholders should be presumed to be equival ent to the profit made by the majority \nshareholders (p.  443). He explained that this presumption is compatible with the \nprinciples governing the awarding of damages in the civil law (pp.  443-44, quoting \nRainbow Industrial Caterers Ltd. v. Canadian National  Railway Co. , [1991] 3 S.C.R. \n3, at pp.  14-16). First, the presumption is consistent with the principle of restitutio in \nintegrum , which requires that the aggrieved party be restored to their former position. \nSecond, it is consistent, from an evidentiary s tandpoint, with the principle that “the \nperpetrator of a wrongful act should not be permitted to profit from his own bad faith \nor wrongdoing” ( Baxter , at p.  443).  \n2023 SCC 25 (CanLII)\n\n--- Page 72 ---\n \n [112]  I note that Deschamps  J.A., dissenting on the issue of the quantum of \ndamages, found instead that the evidence had established that, if they had been duly \ninformed, the minority shareholders would still have sold their interests prior to the \npublic offering, at a price of $91 per share (p.  447). That being said, there is nothing to \nsuggest that, i n reaching that conclusion, she rejected the soundness of the presumption \nendorsed by the majority. She agreed that the minority shareholders had provided \nsufficient proof of their injury; the disagreement concerned only the assessment of the \nquantum of da mages.  \n[113]  In accordance with the presumption helpfully identified by Rothman  J.A., \nwhere a breach of the requirements of good faith prevents the aggrieved party from \nproving the injury sustained, it should be presumed that the injury is equivalent to the \nprofits made by the party at fault. However, this presumption is rebuttable, as it can be \ndisplaced by evidence to the contrary showing that the quantum of damages differs \nfrom the amount of the profits (pp.  443-44, quoting Rainbow Industrial Caterers , at \npp. 14-16). \n[114]  The presumption relied upon in Baxter  draws from the common law, which \nhas long recognized that where a fact cannot be proved because of a party’s dishonesty, \nthat fact will be assumed to be true in the absence of evidence to the contrary (see \nRain bow Industrial Caterers , at pp.  14-16; Lamb v. Kincaid  (1907), 38 S.C.R. 516, at \npp. 539-40; see also Callow , at para.  116). In both legal traditions, this presumption is \nconsistent with the principle of restitutio in integrum  (see Rainbow Industrial Cater ers, \n2023 SCC 25 (CanLII)\n\n--- Page 73 ---\n \n at p. 16, where Sopinka  J. relied on National Bank of Canada v. Corbeil , [1991] 1 \nS.C.R. 117 , and Provincial Bank of Canada v. Gagnon , [1981] 2 S.C.R. 98; see also \nBaxter , at p.  444, citing Andrews v. Grand & Toy Alberta Ltd. , [1978] 2 S.C.R.",
    "token_count": 1000,
    "start_token": 29700,
    "end_token": 30700,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 34,
    "source_file": "2023scc25.txt",
    "text": "73 ---\n \n at p. 16, where Sopinka  J. relied on National Bank of Canada v. Corbeil , [1991] 1 \nS.C.R. 117 , and Provincial Bank of Canada v. Gagnon , [1981] 2 S.C.R. 98; see also \nBaxter , at p.  444, citing Andrews v. Grand & Toy Alberta Ltd. , [1978] 2 S.C.R. 229).  \n[115]  The presumption established in Baxter  therefore serves as the basis for a \nmethod of calculating damages to compensate the aggrieved party for the injury \nsustained. In this way, it is based on a compensatory objective that is distinct from \ndisgorgement of pro fits where disgorgement is awarded for a restitutionary purpose in \nthe absence of any injury. It should be noted that this presumption is not a departure \nfrom corrective justice, which is the foundation of the general rules of civil liability in \nQuebec: th e sanction dependent on it is not punitive or confiscatory, but compensatory. \nApplying the presumption set out in Baxter  therefore does not amount to awarding \npunitive damages, since the damages awarded on this basis have reparatory purposes.  \n[116]  In this case,  the respondents are seeking disgorgement of profits as the \n“equivalent” of the “serious loss” they claim to have sustained as a result of the \nappellants’ breach of the requirements of good faith in the performance of the \nAgreement (motion to institute pro ceedings, at paras.  1, 47, 57, 57.1 and 58). That \ninjury is equivalent here to the gain lost by the respondents, which is compensable \nunder art.  1611 C.C.Q.  Based on the presumption set out in Baxter , it can be assumed \nthat, had it not been for the appella nts’ wrongful omission, the respondents would have \nsold their interests to IA at the same price the appellants did. This was in fact the \npremise underlying the analysis by the respondents’ experts, which was accepted by \n2023 SCC 25 (CanLII)\n\n--- Page 74 ---\n \n the trial judge, as can be seen from  his explanations about calculating the value of the \nlost advantage (see paras.  598 and 615). Consequently, what the appellants describe as \n“loss of chance” to negotiate ceases to be hypothetical and becomes simply a “loss” for \nwhich the respondents must b e compensated in the absence of evidence to the contrary \n(A.F., at paras.  119-29; R.F., at para.  117). The onus was therefore on the appellants to \nestablish on a balance of probabilities that the respondents would have sold their \ninterests to IA for a pric e lower than the one obtained by the appellants.  \n[117]  The appellants did not discharge this burden. The trial judge accepted the \nassumption put forward by the respondents’ firm of experts, namely that, “had it not \nbeen for the acts alleged against the [appellan ts], the [respondents] would have received \nconsideration equivalent to what IA paid to acquire the [appellants’] interests in Groupe \nExcellence rather than the amount they obtained from the [appellants]” . At the hearing \nin this Court, the appellants did no t show that this finding of fact, which is entitled to \ndeference, was tainted by a palpable and overriding error ( Housen , at para.  10; Grenier \nv. Grenier , 2011 QCCA 964, at para.  45 (CanLII); M.H. v. Axa Assurances inc. , 2009 \nQCCA 2358, [2010] R.R.A. 15, a t para.  19). Therefore, because the presumption in \nBaxter  has not been rebutted, the damages owed to the respondents are equivalent to \nthe difference between the sale price received by the appellants on the resale to IA and \nthe price received by the respon dents on the initial sale to the appellants.  \n[118]  The injury sustained by the respondents in the form of a lost gain thus \namounts to $11,884,743, and the trial judge’s award, upheld on appeal, is solidary. I \n2023 SCC 25 (CanLII)\n\n--- Page 75 ---\n \n take note of the agreement reached by the respondents  that the amount awarded would \nbe divided in proportion to their shares in Groupe Excellence, that is, 62 percent for \n",
    "token_count": 1000,
    "start_token": 30600,
    "end_token": 31600,
    "total_tokens_in_source": 31741
  },
  {
    "chunk_id": 35,
    "source_file": "2023scc25.txt",
    "text": ".  \n[118]  The injury sustained by the respondents in the form of a lost gain thus \namounts to $11,884,743, and the trial judge’s award, upheld on appeal, is solidary. I \n2023 SCC 25 (CanLII)\n\n--- Page 75 ---\n \n take note of the agreement reached by the respondents  that the amount awarded would \nbe divided in proportion to their shares in Groupe Excellence, that is, 62 percent for \nMr. Rhéaume’s companies and 38 percent for Mr.  Beaulne’s companies. Accordingly, \nthe damages are allocated as follows: $7,368,540.60 to Mr . Rhéaume’s companies and \n$4,516,202.40 to Mr.  Beaulne’s companies.  \n[119]  For these reasons, I would dismiss the appeal, with costs.  \n Appeal  dismissed with costs.  \n Solicitor s for the appellant s: IMK, Montr éal. \n Solicitor s for the respondent s: Litige Forseti Inc., Montréal.  \n2023 SCC 25 (CanLII)\n\n",
    "token_count": 241,
    "start_token": 31500,
    "end_token": 31741,
    "total_tokens_in_source": 31741
  }
]