[
  {
    "chunk_id": 0,
    "source_file": "2023scc31.txt",
    "text": "--- Page 1 ---\n \n  \nSUPREME COURT OF CANADA  \n \nCITATION : Commission scolaire \nfrancophone des Territoires du \nNord -Ouest  v. Northwest \nTerritories (Education, Culture \nand Employment), 2023 SCC  31   \nAPPEAL HEARD : February 9, 2023  \nJUDGMENT RENDERED : \nDecember 8, 2023  \nDOCKET : 39915  \n \nBETWEEN : \n \nCommission scolaire francophone des Territoires du Nord -Ouest and A.B.  \nAppellants  \n \nand \n \nMinister of Education, Culture and Employment of the Northwest Territories  \nRespond ent \n \nAND BETWEEN : \n \nCommission scolaire francophone des Territoires du Nord -Ouest, A.B., F.A., \nT.B., E.S. and J.J.  \nAppellants  \n \nand \n \nMinister of Education, Culture and Employment of the Northwest Territories  \nRespondent  \n \n- and - \n \nAttorney General of Canada, Attorney General of Quebec, Attorney General \nof Manitoba, Attorney General of the Yukon Territory, Canadian \nFrancophonie Research Chair on Language Rights, Commissioner of Official \nLanguages of Canada, Fédération nationale des c onseils scolaires \n2023 SCC 31 (CanLII)\n\n--- Page 2 ---\n \n francophones, Commission nationale des parents francophones, Société de \nl’Acadie du Nouveau -Brunswick and Yukon Francophone School Board  \nInterveners  \n \nOFFICIAL ENGLISH TRANSLATION  \n \nCORAM : Wagner C.J. and Karakatsanis, Côté, Martin, Kasirer, Jamal and \nO’Bonsawin JJ.  \n \nREASONS FOR \nJUDGMENT :  \n(paras. 1 to 114)  Côté J. (Wagner C.J. and Karakatsanis, Martin, Kasirer, Jamal \nand O’Bonsawin  JJ. concurring ) \n \n \nNOTE: This document is subject to editorial revision before its reproduction in final \nform in the Canada Supreme Court Reports . \n   \n \n  \n2023 SCC 31 (CanLII)\n\n--- Page 3 ---\n \n Commission scolaire francophone des Territoires du Nord -Ouest  and \nA.B.  Appellant s \nv. \nMinister of Ed ucation, Culture and Employment  \nof the Northwest Territories  Respondent  \n- and - \nCommission scolaire francophone  des Territoires du Nord -Ouest,  \nA.B.,  F.A.,  T.B.,  E.S. and J.J. Appellant s \nv. \nMinister of Ed ucation, Culture and Employment  \nof the Northwest Territories  Respondent  \nand \nAttorney General of Canada,  \nAttorney General of Quebec,  \nAttorney General of Manitoba,  \nAttorney General of the Yukon Territory,  \nCanadian Francophonie Research Chair on Language Rights,  \nCommissioner of Official Languages of Canada,  \nFédération nationale des  conseils scolaires francophones,  \nCommission nationale des parents francophones,  \nSociété d e l’Acadie du Nouveau -Brunswick and  \nYukon Francophone School Board  Interveners  \n2023 SCC 31 (CanLII)\n\n--- Page 4 ---\n \n Indexed as: Commission scolaire francophone des Territoires du Nord -Ouest  v. \nNorthwest Territories (Education, Culture and Employment)  \n2023  SCC 31 \nFile No.: 39915.  \n2023: February 9 ; 2023: December 8 . \nPresent: Wagner  C.J. and Karakatsanis, Côté, Martin, Kasirer, Jamal and \nO’Bonsawin  JJ. \nON APPEAL  FROM  THE  COURT OF APPEAL FOR THE NORTHWEST TERRITORIES  \n Administrative law  — Judicial review — Discretionary administrative \ndecisions engaging Charter protections — Charter values — Territorial ministerial \ndirective allowing categories of parents not holding right to have their children receive \ninstruction in one of two official languages, where it is minority language, to apply to \nenrol their children in French first language education program — Minister \nresponsible denying applications for enrolment on ground that non -rights holder \nparents concern ed did not meet conditions for various categories established by \ndirective — Whether Minister had to consider purpose of minority language \neducational rights guaranteed by Charter in exercising her discretion — Whether \ndecisions made by Minister are reason able.  \n2023 SCC 31 (CanLII)\n\n--- Page 5 ---\n \n  Constitutional law — Charter of Rights — Minority language",
    "token_count": 1000,
    "start_token": 0,
    "end_token": 1000,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 1,
    "source_file": "2023scc31.txt",
    "text": " their children in French first language education program — Minister \nresponsible denying applications for enrolment on ground that non -rights holder \nparents concern ed did not meet conditions for various categories established by \ndirective — Whether Minister had to consider purpose of minority language \neducational rights guaranteed by Charter in exercising her discretion — Whether \ndecisions made by Minister are reason able.  \n2023 SCC 31 (CanLII)\n\n--- Page 5 ---\n \n  Constitutional law — Charter of Rights — Minority language educational \nrights — Non-rights holder parents applying to enrol their children in French first \nlanguage education program in Northwest Territories — Minister responsible denying \napplication s for enrolment — Whether Minister’s decisions engage Charter \nprotections  — Canadian Charter of Rights and Freedoms, s.  23. \n Five parents not holding the right guaranteed by s.  23 of the Charter  to \nhave their children receive instruction in one of the two official languages, where it is \nthe minority language, applied to the Minister of Education, Culture and Employment \nof the Northwest Territories (“Minister”) for their children’s admission to a French first \nlanguage education program. In each case, the Com mission scolaire francophone des \nTerritoires du Nord -Ouest (“CSFTNO”) recommended admission because it would \npromote the development of the Francophone community of the Northwest Territories. \nIn spite of those recommendations, the Minister denied each of t he applications for \nadmission on the ground that the non -rights holder parents did not meet the conditions \nestablished by the ministerial directive on enrolment in French first language education \nprograms, which created categories of eligible non -rights ho lders.  \n The parents and the CSFTNO applied for judicial review. They were \nsuccessful in the Supreme Court of the Northwest Territories, which set aside the \ndecisions and referred the applications for admission back to the Minister for \nreconsideration, chie fly because the Minister’s decisions did not reflect a proportionate \nbalancing of the protections conferred by s.  23. However, on appeals by the Minister, \n2023 SCC 31 (CanLII)\n\n--- Page 6 ---\n \n the Court of Appeal for the Northwest Territories restored the decisions that had been \nset aside. The  majority of the Court of Appeal found that the Minister was not required \nto consider s.  23 in exercising her discretion because the parents were not rights holders \nunder this provision.  \n Held : The appeal should be allowed.  \n The Minister was required not o nly to consider s.  23 of the Charter  in \nexercising her discretion to admit the children of non -rights holder parents to the \nschools of the Francophone minority in the Northwest Territories, but also to conduct \na proportionate balancing of the values reflec ted in the three  purpose s of s. 23 with the \ngovernment’s interests. The Minister’s decisions had a significant impact on the values \nenshrined in this provision. It follows from the requirements laid down in Doré v. \nBarreau du Québec , 2012 SCC 12, [2012] 1 S.C.R. 395, that those decisions were \nunreasonable. The Minister attached too much importance to her duty to make \nconsistent decisions and gave disproportionate weight to the cost of the contemplated \nservices in the exercise of her discretion. Given the re medial nature of s.  23, \npedagogical requirements had to have more weight. The orders made by the Court of \nAppeal are therefore set aside.  \n Under the approach set out in Doré , which governs the judicial review of \ndiscretionary administrative decisions that engage the Charter , a reviewing court must \nfirst determine whether the decision limits Charter  protections. The Doré  framework \napplies not only where an administrative decision directly infringes Charter  rights but \n2023 SCC 31 (CanLII)\n\n--- Page 7 ---\n \n also where it simply engages a value unde rlying one or more Charter  rights. Charter  \nvalues are inseparable from Charter  rights, which reflect them, and give meaning to \nthese rights. The choice made by the framers to entrench certain rights in the text of the \nsupreme law of Canada means that the p urpose of these rights is important for Canadian \nsociety as a whole and must be reflected in the decision -making process of the various \nbranches of government. Administrative decision makers must always consider the \nvalues relevant to the exercise of their  discretion.  \n If the discretionary decision limits Charter  protections at the first step of \nthe Doré  analysis, the reviewing court must then examine the decision maker’s \nreasoning process to assess whether, given the relevant factual and legal constraints, \nthe decision reflects a proportionate balancing of Charter  rights or the values \nunderlying them.",
    "token_count": 1000,
    "start_token": 900,
    "end_token": 1900,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 2,
    "source_file": "2023scc31.txt",
    "text": " reflected in the decision -making process of the various \nbranches of government. Administrative decision makers must always consider the \nvalues relevant to the exercise of their  discretion.  \n If the discretionary decision limits Charter  protections at the first step of \nthe Doré  analysis, the reviewing court must then examine the decision maker’s \nreasoning process to assess whether, given the relevant factual and legal constraints, \nthe decision reflects a proportionate balancing of Charter  rights or the values \nunderlying them. Th e focus of judicial review in this context is on the decision actually \nmade by the decision maker, including both the decision maker’s reasoning process \nand the outcome. To be reasonable, a decision must reflect the fact that the decision \nmaker considered the Charter  values that were relevant to the exercise of its discretion . \nIt will often be evident that a value is relevant, whether because of the nature of the \ngoverning statutory scheme, because the parties raised the value before the \nadministrative deci sion maker, or because of the link between the value and the matter \nunder consideration . The decision must also show that the decision maker meaningfully \naddressed the Charter  protections to reflect the impact that its decision may have on \nthe concerned gr oup or individual. The standard of reasonableness here requires a \nrobust analysis that works the same justificatory muscles as s.  1 of the Charter . The \n2023 SCC 31 (CanLII)\n\n--- Page 8 ---\n \n approach must take into account the role of the courts as guardians of the Constitution \nand must reflect  the particular importance of justification in decisions that engage \nCharter  protections. The prescribed approach requires reviewing courts to inquire into \nthe weight accorded by the decision maker to the relevant considerations in order to \nassess whether a proportionate balancing was conducted by the decision maker. The \nreviewing court must consider whether there were other reasonable possibilities that \nwould give effect to Charter  protections more fully in light of the applicable objectives, \nbeyond simply  asking whether the decision falls within a range of reasonable outcomes. \nIn this sense, reasonableness and proportionality become synonymous.  \n The Minister’s decisions in this case engage the protections of s.  23. First, \nthe values underlying s.  23 are re levant to the exercise of the Minister’s discretion , \nhaving regard to the purpose s of this provision. This constitutional provision has three \npurpose s: the right to instruction in the minority official language is at once preventive, \nremedial and unifying in nature. The provision is intended not only to prevent the \nerosion of official language communities, but also to redress past injustices and \npromote the development of these communities. This means that the preservation and \ndevelopment of minority langua ge communities are among the values underlying s.  23. \nProtection of the right to instruction in the minority official language is a reflection of \nthese values, insofar as education is a means of realizing the societal ideal that they \nembody.  \n2023 SCC 31 (CanLII)\n\n--- Page 9 ---\n \n  Second, the a dmission of children of parents who are not rights holders \nunder s.  23 of the Charter can have an impact on the preservation and development of \nminority language communities.  Population growth in the minority language \ncommunity helps to ensure its developm ent and prevent its decline, including by \nreducing the likelihood of assimilation and cultural erosion. The admission of children \nof non -rights holder parents also contributes to fulfilling the promise of s.  23, which is \nto give effect to the equal partner ship of Canada’s two official language groups in the \ncontext of education. It follows that these values are always relevant when the \ngovernment exercises its discretion to admit children of non -rights holder parents to \nminority language schools and that th ey must therefore always be taken into account, \neven when there is no direct infringement of the right guaranteed by s.  23. \n Here, the values of preservation and development of minority language \ncommunities were limited by the Minister’s decisions. Because  of their collective \ndimension, the protections conferred by s.  23 of the Charter  must be assessed in light \nof the unique language dynamics of a province or territory. At the time the Minister \nmade her decisions, there was a positive link between the admis sion of children of \nnon-rights holder parents to French -language schools in the Northwest Territories and \nthe preservation and development of the Francophone community there. The Minister \nacknowledged, among other things, that the assimilation rate and exo gamous marriages \nwere challenges to be overcome for the transmission of the French language within the \nFrancophone community of the Northwest Territories. The admission of the children \n2023",
    "token_count": 1000,
    "start_token": 1800,
    "end_token": 2800,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 3,
    "source_file": "2023scc31.txt",
    "text": " \nmade her decisions, there was a positive link between the admis sion of children of \nnon-rights holder parents to French -language schools in the Northwest Territories and \nthe preservation and development of the Francophone community there. The Minister \nacknowledged, among other things, that the assimilation rate and exo gamous marriages \nwere challenges to be overcome for the transmission of the French language within the \nFrancophone community of the Northwest Territories. The admission of the children \n2023 SCC 31 (CanLII)\n\n--- Page 10 ---\n \n in question would thus have helped to reduce the likelihood of assimila tion and to \nprevent cultural erosion.  \n The Minister therefore had to proportionately balance these values with the \ngovernment’s interests. The reasons for the Minister’s decisions do not show that she \ntruly took into account the constitutional values at st ake or that she meaningfully \naddressed the considerations arising therefrom. Several factors showed that the \nchildren’s admission was beneficial for the development of the Francophone \ncommunity of the Northwest Territories. First, the Minister did not duly  consider the \nfact that the applications for admission were supported by the CSFTNO, a body with \nthe expertise needed to assess the educational needs of the linguistic minority. Second, \nthe Minister also did not duly consider the individual characteristics  of each application \nin relation to the benefits that could result from a decision to grant it. Among other \nthings, each child concerned had a sound knowledge of French, had significant ties to \nthe Francophone community of the Northwest Territories through  their parents, and \nhad the support and commitment of their parents in learning that language.  A refusal \nof admission does not always mean that there was a disproportionate balancing , but in \nthis case, the parents’ motivation for applying for their childre n’s admission was \nmistakenly reduced to a mere desire to provide the children with a linguistic advantage.  \nCases Cited  \n Applied: Doré v. Barreau du Québec , 2012 SCC 12, [2012] 1 S.C.R. 395; \nreferred to:  Mahe v. Alberta , [1990] 1 S.C.R. 342; Conseil scolaire francophone de la \n2023 SCC 31 (CanLII)\n\n--- Page 11 ---\n \n Colombie -Britannique v. British Columbia , 2020 SCC 13, [2020] 1 S.C.R. 678 ; Mahe \nv. Alberta  (1987), 42 D.L.R. (4th) 514 ; Solski (Tutor of) v. Quebec (Attorney General) , \n2005 SCC 14, [2005] 1 S.C.R. 201; Arsenault -Cameron v. Princ e Edward Island , 2000 \nSCC 1, [2000] 1 S.C.R. 3; Doucet -Boudreau v. Nova Scotia  (Minister of Education) , \n2003 SCC 62, [2003] 3 S.C.R. 3;  Quebec (Education, Recreation and Sports) v. \nNguyen , 2009 SCC 47, [2009] 3 S.C.R. 208; Association des parents de l’ école \nRose -des-vents v. British Columbia (Education) , 2015 SCC 21, [2015] 2 S.C.R. 139; \nCanada (Minister of Citizenship and Immigration) v. Vavilov , 2019 SCC  65, [2019] 4 \nS.C.R. 653; Law Society of British Columbia v. Trinity Western University , 2018 SCC \n32, [2018] 2 S.C.R. 293; Loyola High School v. Quebec (Attorney General) , 2015 SCC \n12, [2015] 1 S.C.R. 613; Baker  v. Canada (Minister of Citizenship and Immigration) , \n[1999] 2 S.C.R. 817; R. v. Oakes , [1986] 1 S.C.R. 10 3; Suresh v. Canada (Minister of \nCitizenship and Immigration) , 2002 SCC 1, [2002] 1 S.C.R. 3; Ahani v. Canada \n(Minister of Citizenship and Immigration ), 2002 SCC 2, [2002] 1 S.C.R. 72; Dr Q v. \nCollege of Physicians and Surgeons of British Columbia , 2003 SCC 19, [2003] 1 \nS.C.R. 226; Lake v . Canada ( Minister of Justice ), 2008 SCC",
    "token_count": 1000,
    "start_token": 2700,
    "end_token": 3700,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 4,
    "source_file": "2023scc31.txt",
    "text": " SCC 1, [2002] 1 S.C.R. 3; Ahani v. Canada \n(Minister of Citizenship and Immigration ), 2002 SCC 2, [2002] 1 S.C.R. 72; Dr Q v. \nCollege of Physicians and Surgeons of British Columbia , 2003 SCC 19, [2003] 1 \nS.C.R. 226; Lake v . Canada ( Minister of Justice ), 2008 SCC 23, [2008] 1 S.C.R. 761; \nCanada ( Citizenship and Immigration ) v. Khosa , 2009 SCC 12, [2009] 1 S.C.R. 339; \nAgraira v. Canada ( Public Safety and Emergency Preparedness ), 2013 SCC 36, [2013] \n2 S.C.R. 559; Canada Post C orp. v. Canadian Union of Postal Workers , 2019 SCC 67, \n[2019] 4 S.C.R. 900;  RWDSU v. Dolphin Delivery Ltd. , [1986] 2 S.C.R. 573;  R. v. \nSalituro , [1991] 3 S.C.R. 654; Hill v. Church of Scientology of Toronto , [1995] 2 S.C.R. \n1130; M. (A.) v. Ryan , [1997] 1 S.C.R. 157;  Bell ExpressVu Limited Partnership v. Rex , \n2002 SCC 42, [2002] 2 S.C.R. 559; Reference re Public Schools Act (Man.), s.  79(3), \n2023 SCC 31 (CanLII)\n\n--- Page 12 ---\n \n (4) and (7) , [1993] 1 S.C. R. 839; Gosselin (Tutor of) v. Quebec (Attorney General) , \n2005 SCC 15, [2005] 1 S.C.R. 238; Yukon Francophone School Board, Education Area \n#23 v . Yukon ( Attorney General ), 2015 SCC  25, [2015] 2 S.C.R. 282;  Société des \nAcadiens du Nouveau -Brunswick Inc. v. Association of Parents for Fairness in \nEducation , [1986] 1 S.C.R. 549; R. v. McGregor , 2023  SCC  4; Attorney General (Que.) \nv. Cumming , [1978] 2 S.C. R. 605; R. v. Beaulac , [1999] 1 S.C.R. 768; Mazraani v. \nIndustrial Alliance Insurance and Financial Services Inc. , 2018 SCC  50, [2018] 3 \nS.C.R. 261; Bessette v. British Columbia (Attorney General) , 2019 SCC 31, [2019] 2 \nS.C.R. 535 . \nStatutes and Regulations Cite d \nCanadian Charter of Rights and Freedoms , ss. 19, 23. \nCommission scolaire francophone, Territoires du Nord -Ouest Regulations , N.W.T. \nReg. 071 -2000  [am. 117 -2020] , s. 11(1), (2). \nOfficial Languages Act , R.S.N.W.T.  1988, c.  O-1, s. 9(1).  \nAuthors Cited  \nDaly,  Paul.  “The Doré Duty: Fundamental Rights in Public Administration ” (2023), \n101 Can. Bar Rev. 297. \nFox-Decent , Evan,  and Alexander  Pless . “The Charter and Administrative Law: \nSubstantive Review ”, in Colleen  M. Flood  and Paul  Daly , eds. , Administrative \nLaw in Context , 4th ed. Toronto: Emond Montgomery , 2022 , 399 . \nNorthwest Territories . Minister of Education, Culture and Employment . Final Report : \nReview of the Ministerial Directive — Enrolme nt of Students in French First \nLanguage Education Programs , June  30, 2016 (online: \nhttps://www.ece.gov.nt.ca/sites/ece/files/resources/ministerial_french_first_dire\n2023 SCC 31 (CanLII)\n\n--- Page 13 ---\n \n ctive_ -_directive_review.pdf; archived version:  https://scc -csc.ca/cso -\ndce/2023SCC -CSC 31_2_eng.pdf ). \nNorthwest Territories . Minister of Education, Culture and Employment . French",
    "token_count": 1000,
    "start_token": 3600,
    "end_token": 4600,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 5,
    "source_file": "2023scc31.txt",
    "text": " 2016 (online: \nhttps://www.ece.gov.nt.ca/sites/ece/files/resources/ministerial_french_first_dire\n2023 SCC 31 (CanLII)\n\n--- Page 13 ---\n \n ctive_ -_directive_review.pdf; archived version:  https://scc -csc.ca/cso -\ndce/2023SCC -CSC 31_2_eng.pdf ). \nNorthwest Territories . Minister of Education, Culture and Employment . French First \nLanguage School Non -Rights Holder Admission Policy , Aug ust 11, 2016  (online: \nhttps://www.ece.gov.nt.ca/sites/ece/files/resources/ministerial_french_first_dire\nctive_ -_non -rights_holder_admission_policy_ -_en.pdf; archived \nversion:  https://scc -csc.ca/cso -dce/2023SCC -CSC 31_1_eng.pdf ). \nNorthwest Territories . Minister of Education, Culture and Employment . Ministerial \nDirective — Enrolment of Students in French First Language Education  \nPrograms , July 7, 2008.  \nNorthwest Territories . Minister of Education, Culture and Employment . Ministerial \nDirective — Enrolment of Students in French First Language Education \nPrograms (2016) , August 11, 2016.  \nRégimbald, Guy. Canadian Administrative Law , 3rd ed. Toronto: LexisNexis, 2021.  \nSossin, Lorne,  and Mark Friedman. “Charter Values and Administrative Justice” \n(2014), 67 S.C.L.R. (2d) 391.  \n APPEAL from a judgment of the Northwest Territories Court of Appeal \n(Slatter, Rowbotham and Crighton  JJ.A.), 2021 NWTCA 8 , 463 D.L.R. (4th) 277 , \n[2021] 12 W.W.R. 133, 90 Admin. L.R. (6th) 90, [2021] N.W.T.J. No.  43 (QL), 2021 \nCarswellNWT 49 (WL), setting aside two decisions of Rouleau  J., 2020 NWTSC 28, \n[2020] N.W.T.J. no 35 (QL), 2020 C arswellNWT 41 (WL) , and 2019 NWTSC 25, 62 \nAdmin. L.R. (6th) 300, [2019] N.W.T.J. no 26 (QL), 2019 CarswellNWT 29 (WL) . \nAppeal allowed . \n Perri Ravon , Audrey Mayrand , Mark  C. Power and Darius Bossé , for the \nappellant s. \n2023 SCC 31 (CanLII)\n\n--- Page 14 ---\n \n  Maxime Faille , Alyssa Tomkins , Paul McKenna  and Tristan Joanette , for \nthe respondent.  \n Ian Demers , for the intervener  the Attorney General of Canada.  \n Manuel Klein  and Vicky Samson , for the intervener  the Attorney General \nof Quebec.  \n Written submissions only by Deborah  L. Carlson , for the in tervener the \nAttorney General of Manitoba.  \n Keith Brown and Lauren Mar , for the intervener the Attorney General of \nthe Yukon Territory.  \n François Larocque , for the intervener the Canadian Francophonie \nResearch Chair on Language Rights.  \n Élie Ducharme , for the intervener the Commissioner of Official Languages \nof Canada.  \n Roger  J. F. Lepage , for the intervener Fédération nationale des conseils \nscolaires francophones.  \n2023 SCC 31 (CanLII)\n\n--- Page 15 ---\n \n  David Taylor  and Maritza Woël , for the intervener  Commission nationale \ndes parents francophones.  \n Dominic Caron , for the intervener Société de l ’Acadie du Nouveau -\nBrunswick.  \n Paul Daly , for the intervener the Yukon Francophone School Board.  \n English version of the judgment of the Court delivered by  \n CÔTÉ J. —  \n TABLE OF CONTENTS  \n \nParagraph  \nI. Overview  1 \nII. Background  10 \nA. Situation of the Appellant Parents  23 \n A.B. (Mother of Child  W.) 23 \n F.A. (Mother of Child  A.) 29 \n T.B. (Father of Child  V.) 35 \n E.S. (Mother of Child  E.) 38 \n J.J. (Father of Children  T. and N.)  40",
    "token_count": 1000,
    "start_token": 4500,
    "end_token": 5500,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 6,
    "source_file": "2023scc31.txt",
    "text": " CONTENTS  \n \nParagraph  \nI. Overview  1 \nII. Background  10 \nA. Situation of the Appellant Parents  23 \n A.B. (Mother of Child  W.) 23 \n F.A. (Mother of Child  A.) 29 \n T.B. (Father of Child  V.) 35 \n E.S. (Mother of Child  E.) 38 \n J.J. (Father of Children  T. and N.)  40 \nIII. Judicial History  44 \nA. Supreme Court of the Northwest Territories, 2019 NWTSC  25 (Rouleau  J.) 44 \nB. Supreme Court of the Northwest Territories , 2020 NWTSC  28 (Rouleau  J.) 46 \nC. Court of Appeal for the Northwest Territories , 2021 NWTCA 8, 463 D.L.R. (4th) \n277 (Slatter, Rowbotham and Crighton  JJ.A.)  50 \n2023 SCC 31 (CanLII)\n\n--- Page 16 ---\n \n \n Majority Reasons (Slatter and Crighton JJ.A.)  52 \n Concurring Reasons (Rowbotham  J.A.)  55 \nIV. Issues  58 \nV. Analysis  59 \nA. Doré Framework  60 \nB. The Decisions Engage the Protections of Section  23 75 \n The Values Underlying Section  23 Are Relevant to the Exercise of the \n Minister’s Discretion  75 \n The Minister’s Decisions Have the Effect of Limiting the Values  \n Underlying Section  2384 \nC. The Minister Did Not Proportionately Balance the Values Underlying Section  23 \n With the Government’s Interests  92 \nD. It Is Neither Necessary nor Appropriate for This Court To Rule on the  \n Allegation  That the Right To Use French or the Right To Be Heard Was  \n Infringed  104 \nVI. Disposition  114 \n \nI. Overview  \n[1] A legal guarantee with unique features, s.  23 of the Canadian Charter of \nRights and Freedoms  grants a defined category of Canadian citizens the right to have \ntheir children receive instruction in one of the two official languages where it is the \nminority language ( Mahe v. Alberta , [1990] 1 S.C.R. 342, at p.  365). The provision has \nthree purposes;  it is at once preventive, remedial and unifying ( Conseil scolaire \nfrancophone de la Colombie -Britannique v. British Columbia , 2020 SCC 13, [2020] 1 \nS.C.R. 678, at para.  15). \n[2] Section 23 has two features that make it stand out from the rest of Canada’s \nconstitutional landscape. First, unlike certain other constitutional provisions that \n2023 SCC 31 (CanLII)\n\n--- Page 17 ---\n \n impose only negative obligations, s.  23 imposes positive obligations on the state. This \nis the case because the very existence of s.  23 “implies the inadequacy of the present \nregime” ( Mahe , at p.  363, quoting Mahe v. Alberta  (1987), 42 D.L.R. (4th) 514 (C.A.), \nat p. 534, per Kerans  J.A.; Conseil scolaire francophone de la Colombie -Britannique , \nat para.  15). Section 23 is therefore meant to alter the status quo, and its application \n“will of necessity affect the future of minority language communities” (Solski  (Tutor \nof) v. Quebec (Attorney General) , 2005 SCC 14, [2005] 1 S.C.R. 201, at para.  23). \n[3] Second, s.  23 differs from other provisions of the Charter  because of the \ncollective scope of the individual rights it grants ( Arsenault -Cameron v. Prince Edward \nIsland , 2000 SCC 1, [2000] 1 S.C.R. 3, at paras.  27 and 29; Doucet -Boudreau v. Nova \nScotia  (Minister of Education) , 2003 SCC 62, [2003] 3 S.C.R. 3, at para.  23; Solski , at \npara.  33; Quebec (Education, Recreation and Sports) v. Nguyen , 2009 SCC 47, [2009] \n3 S.C.R",
    "token_count": 1000,
    "start_token": 5400,
    "end_token": 6400,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 7,
    "source_file": "2023scc31.txt",
    "text": ", at paras.  27 and 29; Doucet -Boudreau v. Nova \nScotia  (Minister of Education) , 2003 SCC 62, [2003] 3 S.C.R. 3, at para.  23; Solski , at \npara.  33; Quebec (Education, Recreation and Sports) v. Nguyen , 2009 SCC 47, [2009] \n3 S.C.R. 208, at para.  23; Conseil scolaire francophone de la Colombie -Britannique , at \npara.  17). \n[4] It is important to note that minority language schools play a vital role in \nfulfilling the promise contained in s.  23 of the Charter , which is to “give effect to the \nequal partnership of the two official language groups in the context of education” \n(Arsenault -Cameron , at para.  26; see also Mahe , at p.  364; Association des parents de \nl’école Rose -des-vents v. British Columbia (Education) , 2015 SCC 21, [2015] 2 S.C.R. \n139, at para.  27). These schools are settings for socialization where the language of \nminority language communities is passed on and where their culture can be expressed. \n2023 SCC 31 (CanLII)\n\n--- Page 18 ---\n \n The preservation and vitality of these educational environments promote the \ndevelopment of the minority language communities they serve ( Mahe , at p.  363; \nConseil scolaire francophone de la Colombie -Britannique , at para.  1). \n[5] There has been a Francophone presence in the Northwest Territories since \nthe 18th century, but instruction in French has been offered only since 1989 in \nYellowknife and since 1998 in Hay River. This appe al is about whether the refusal to \nadmit children of non -rights holder parents to minority language schools in the \nNorthwest Territories gave due consideration to the protections conferred by s.  23 of \nthe Charter , having regard to the three purposes of thi s section, which is at once \npreventive, remedial and unifying in nature.  \n[6] Five non -rights holder parents asked the then Minister of Education, \nCulture and Employment (“Minister”) to exercise her discretion to admit their children \nto a French first language education program. In each case, the Commission scolaire \nfrancophone des Territoires du Nord -Ouest (“CSFTNO”) recommended admission, \nessentially because it would promote the development of the Francophone community \nof the Northwest Territories. It is impor tant to note that the CSFTNO represents the \ninterests of the holders of s.  23 rights, including in their collective aspect. Nevertheless, \nin spite of the CSFTNO’s recommendations, the Minister denied each of the \napplications for admission.  \n[7] The parents and the CSFTNO applied for judicial review. They were \nsuccessful in the Supreme Court of the Northwest Territories, which set aside the \n2023 SCC 31 (CanLII)\n\n--- Page 19 ---\n \n decisions and referred the applications for admission back to the Minister for \nreconsideration, chiefly because the Minister ’s decisions did not reflect a proportionate \nbalancing of the protections conferred by s.  23. However, on appeals by the Minister, \nthe Court of Appeal for the Northwest Territories restored the decisions that had been \nset aside. The majority of the Court o f Appeal found that the Minister was not required \nto consider s.  23 in exercising her residual discretion given the fact that the appellant \nparents were not rights holders under this provision. The children of the appellant \nparents have since been admitted  or have ceased residing in the Northwest Territories. \nHowever, it remains important for this Court to determine what role, if any, s.  23 had \nto play in the Minister’s decision -making process. If this Court does not intervene, it \nmight be argued that gover nments need not give due consideration to the values \nreflected in the three purposes of s.  23 when making decisions that affect s.  23 rights \nholders or that engage this provision.  \n[8] For the reasons that follow, I conclude that the Minister was required not \nonly to consider the values embodied in s.  23 in exercising her discretion to admit the \nchildren of non -rights holder parents to the schools of the Francophone minority in the \nNorthwest Territories, but also to conduct a proportionate balancing of these val ues and \nthe government’s interests",
    "token_count": 1000,
    "start_token": 6300,
    "end_token": 7300,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 8,
    "source_file": "2023scc31.txt",
    "text": "23 when making decisions that affect s.  23 rights \nholders or that engage this provision.  \n[8] For the reasons that follow, I conclude that the Minister was required not \nonly to consider the values embodied in s.  23 in exercising her discretion to admit the \nchildren of non -rights holder parents to the schools of the Francophone minority in the \nNorthwest Territories, but also to conduct a proportionate balancing of these val ues and \nthe government’s interests. Since she did not do so, I am of the view that the appeal \nshould be allowed and the orders made by the Court of Appeal set aside on the basis of \nthis first ground of appeal.  \n2023 SCC 31 (CanLII)\n\n--- Page 20 ---\n \n [9] As a second ground of appeal, the appellants a llege that their right to use \nFrench, guaranteed to them by s.  19(1) of the Charter and s.  9(1) of the  Official \nLanguages Act , R.S.N.W.T. 1988, c.  O-1 (“OLA ”), was infringed by the Court of \nAppeal because they could not be understood by that court without an interpreter. In \nthe alternative, they argue that their right to natural justice was infringed because of the \nquality of the interpretation services. Given my conclusion on the first ground of \nappeal, I am of the view that it is neither necessary nor app ropriate for me to rule on \nthis second ground.  \nII. Background  \n[10] Two public schools offer a French first language education program in the \nNorthwest Territories. The first, École Allain St -Cyr, was built in 1999 and is located \nin Yellowknife. The second, École Bo réale, was built in 2005 and is located in Hay \nRiver.  \n[11] On July 7, 2008, the Northwest Territories Department of Education, \nCulture and Employment adopted the Ministerial Directive — Enrolment of Students \nin French First Language Education Programs  (“2008 Di rective”) to govern the \nadmission of children of rights holder and non -rights holder parents to French first \nlanguage education programs. In the case of children of non -rights holder parents, the \n2008 Directive simply stated that the minister could approve  their admission to a \nFrench first language education program. However, it said nothing about the basis for \nmaking such a decision.  \n2023 SCC 31 (CanLII)\n\n--- Page 21 ---\n \n [12] The 2008 Directive remained in force until a new directive was adopted in \n2016 further to the Final Report : Review of the Mi nisterial Directive — Enrolment of \nStudents in French First Language Education Programs  prepared on June 30, 2016, by \nthe Department of Education, Culture and Employment (online).  \n[13] The Report  recognizes that “the sustainability of the school and broader \ncommunity is dependent on the ability to expand” (p.  10). It notes a lack of \ntransparency in the handling of admissions of children of non -rights holder parents to \nthe schools of the Francophone minority in the Northwest Territories (p.  17). In \naddition, the Report  points out that natural growth of the rights holder population and \nthe migration of rights holders “may not be sufficient to maintain a level of population \nsufficient for supporting French first language schools, particularly in Hay River” \n(p. 20). \n[14] To “[a]llow for the sustainment and growth of the French first language \ncommunities” (p.  21), the Report  therefore recommends that the minister revise the \n2008 Directive to allow the admission of the following categories of children of \nnon-rights holder pa rents:  \n(a) Children of parents who would have been rights holders but for their \nparent’s or grandparent’s lack of opportunity to attend a French first \nlanguage school,  \n(b) Those who meet the criteria of section 23 of the Charter  but are not \nCanadian citizens, and  \n(c) Immigrants to Canada, who upon arrival, do not speak English or \nFrench and are enrolling in a Canadian school for the first time  . . . . \n2023 SCC 31 (CanLII)\n\n--- Page 22 ---\n \n  \n(p. 21) \n[15] The Report  also recommends that children of non -rights holder parents not \nbe admitted to a school of the Francophone minority in the Northwest Territories if \nenrolment at the school is at or exceeds 85 percent capacity, as per the Northwest \nTerritories Schools Capital Standards and Criteria (p.  21). \n[16] On August 11, ",
    "token_count": 1000,
    "start_token": 7200,
    "end_token": 8200,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 9,
    "source_file": "2023scc31.txt",
    "text": "2023 SCC 31 (CanLII)\n\n--- Page 22 ---\n \n  \n(p. 21) \n[15] The Report  also recommends that children of non -rights holder parents not \nbe admitted to a school of the Francophone minority in the Northwest Territories if \nenrolment at the school is at or exceeds 85 percent capacity, as per the Northwest \nTerritories Schools Capital Standards and Criteria (p.  21). \n[16] On August 11, 2016, the then Minister of Education, Culture and \nEmployment adopted the Ministerial Directive — Enrolment of Students in French \nFirst Language Education Programs (2016)  (“2016 Directive”) (reproduced in A.R., \nvol. III, at p.  34). The 2016 Directive stated that the Government of the Northwest \nTerritor ies is “committed to supporting language and culture revitalization”, an \n“inherent part” of which is supporting “population growth”. To this end, the 2016 \nDirective provided for the admission of children of “eligible non -rights holder parents”.  \n[17] To be eligi ble under the 2016 Directive, non -rights holder parents had to \nmeet the conditions for one of the following streams:  \n Reacquisition  — The parent would have been a rights holder but for his or \nher lack of opportunity to attend a French first language school or his or \nher parent’s lack of opportunity to attend a French first language school \n(i.e. the child’s grandparent);  \n Non-citizen francop hone  — The parent meets the criteria of section 23 of \nthe Canadian Charter of Rights and Freedoms  except for the fact that he \nor she is not a Canadian citizen; or  \n2023 SCC 31 (CanLII)\n\n--- Page 23 ---\n \n  New immigrant  — The parent is an immigrant to Canada, whose child \nupon arrival, does not spe ak English or French and is enrolling in a \nCanadian school for the first time.  \n[18] An eligible non -rights holder parent could therefore apply for their child’s \nadmission to a French first language education program managed by the CSFTNO, \nexcept where enrolment  at the school in question exceeded 85 percent capacity, as per \nthe Schools Capital Standards and Criteria. In such a situation, the 2016 Directive \nprovided that new enrolment was limited to children of rights holder parents until such \ntime as the enrolmen t numbers dropped below 85 percent capacity.  \n[19] An eligible non -rights holder parent wishing to enrol their child in a French \nfirst language education program had to provide the school administration with an \nenrolment form, a statement of eligibility for non -rights holder parents and official \ndocuments in support of the statement. The CSFTNO then verified that all the required \ndocumentation had been provided and assessed the child’s language skills and the \nimpact of the proposed admission on the quality and de livery of the education program, \nusing an assessment tool approved by the minister. Following the assessment, the \nCSFTNO made a recommendation to the minister.  \n[20] If the CSFTNO recommended denying the application, the unsuccessful \nparent could submit a writte n appeal to the minister, who then made a final decision \nthat could not be appealed. If, on the other hand, the CSFTNO recommended that the \nchild be admitted, the minister in turn assessed the admissions file. Approval of \nenrolment in such a case was based  on “whether the correct documentation has been \n2023 SCC 31 (CanLII)\n\n--- Page 24 ---\n \n provided in full, the assessment of CSFTNO with respect to language skills, the current \ncapacity of the school and any other relevant considerations” (2016 Directive). The \ndecision was final and could not be appealed.  \n[21] Also on August 11, 2016, the then Minister of Education, Culture and \nEmployment adopted the French First Language School Non -Rights Holder Admission \nPolicy  (online) . The Policy  specified how applications for admission were to be \ntransmitted and h ow the minister’s decisions under the 2016 Directive were to be \ncommunicated. It also set out the time within which the minister’s decision had to be \ncommunicated and the time limit for appealing a negative recommendation by the \nCSFTNO.  \n[22] It should be noted that the 2016 Directive is no longer in force. On \nAugust  28, 2020, the Commission scolaire francophone, Territoires du Nord -Ouest \nRegulations , N.W.T. Reg. 071 -2000, were amended to introduce a scheme for the \nadmission of children of non -rights holder paren ts to",
    "token_count": 1000,
    "start_token": 8100,
    "end_token": 9100,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 10,
    "source_file": "2023scc31.txt",
    "text": " and the time limit for appealing a negative recommendation by the \nCSFTNO.  \n[22] It should be noted that the 2016 Directive is no longer in force. On \nAugust  28, 2020, the Commission scolaire francophone, Territoires du Nord -Ouest \nRegulations , N.W.T. Reg. 071 -2000, were amended to introduce a scheme for the \nadmission of children of non -rights holder paren ts to a French first language education \nprogram that is similar to the scheme in the 2016 Directive but is directly managed by \nthe CSFTNO ( Regulations , s. 11(2)). This scheme provides for a new class of eligible \nchildren, the “Francophile” category, for ch ildren who have at least one parent who is \nproficient in French ( Regulations , s. 11(1)).  \nA. Situation of the Appellant Parents  \n(1) A.B. (Mother of Child W.)  \n2023 SCC 31 (CanLII)\n\n--- Page 25 ---\n \n [23] On April 9, 2018, A.B. applied for the admission of her child, W., to the \npreschool program at École Allai n St-Cyr. The application was made in the “New \nimmigrant” stream. A.B. and W.’s father are citizens of the Netherlands who settled in \nYellowknife in 2014. W. was born in Canada. At the time of the first application for \nadmission, W. was attending Garderie Plein Soleil, a French daycare centre in \nYellowknife. The CSFTNO recommended that the application for admission be \ngranted.  \n[24] On May 28, 2018, the Minister denied the application for admission on the \nground that W. had been born in Canada and that his situat ion therefore did not meet \nthe criteria for the “New immigrant” stream of the 2016 Directive. On August 3, 2018, \nthe CSFTNO requested that the Minister reconsider her decision and exercise her \nresidual discretion. In the CSFTNO’s opinion, it was unfair and  unreasonable to deny \nthe application for W.’s admission on the basis of an overly restrictive interpretation of \nthe “New immigrant” stream.  \n[25] On August 29, 2018, the Minister denied the request for reconsideration \nbecause admission to École Allain St -Cyr wa s limited to children of rights holder \nparents as well as children of non -rights holder parents who were eligible under the \n2016 Directive. A.B. and the CSFTNO filed an application for judicial review.  \n[26] On July 2, 2019, the Supreme Court of the Northwest Te rritories set aside \nthe initial decision of May 28, 2018, and the decision of August 29, 2018, on the request \nfor reconsideration on the ground that the Minister had fettered her discretion by \n2023 SCC 31 (CanLII)\n\n--- Page 26 ---\n \n refusing to admit W. because his situation did not fit into one  of the streams of the 2016 \nDirective. The Supreme Court of the Northwest Territories accordingly referred the \napplication for admission back to the Minister for reconsideration. I will come back to \nthis. The Minister announced her intention to appeal the Supreme Court’s judgment, \nbut she abided by it in the meantime.  \n[27] On the occasion of this reconsideration, A.B. sent the Minister a letter \ndated August 6, 2019, in which she described her family’s ties to Yellowknife’s \nFrancophone community. A.B. sat on the board of directors of Garderie Plein Soleil. \nAll of her children attended that French daycare centre. Her family participated in the \nactivities organized by Yellowknife’s Francophone community. A.B. also explained \nthat, as a result of the Minister’s negati ve decisions, W. had to attend a French \nimmersion school, which had a negative impact on his level of French.  \n[28] On August 30, 2019, the Minister again denied the application for W.’s \nadmission on the ground that his situation involved no distinctive element,  apart from \nthe fact that his admission would support his development and that he already spoke \nFrench. The Minister was of the opinion that, if she granted the application for \nadmission on that basis, she would, in the interests of fairness, have to grant  \napplications for the admission of all children in the same situation, which would have \nunforeseen and unpredictable budgetary consequences for the government. In a notice \nof application dated September 25, 2019, A",
    "token_count": 1000,
    "start_token": 9000,
    "end_token": 10000,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 11,
    "source_file": "2023scc31.txt",
    "text": ",  apart from \nthe fact that his admission would support his development and that he already spoke \nFrench. The Minister was of the opinion that, if she granted the application for \nadmission on that basis, she would, in the interests of fairness, have to grant  \napplications for the admission of all children in the same situation, which would have \nunforeseen and unpredictable budgetary consequences for the government. In a notice \nof application dated September 25, 2019, A.B. and the CSFTNO sought judicial review \nof that decision.  \n2023 SCC 31 (CanLII)\n\n--- Page 27 ---\n \n (2) F.A. (Mother of Child A.)  \n[29] On February 18, 2019, F.A. applied for the admission of her child, A., to \nÉcole Allain St -Cyr. A.’s parents had arrived in Yellowknife in 2013. French is their \nsecond language, and they routinely spoke it with their children. Since arriving in \nYellowknife, the parents had been involved in Francophone community life in the \nNorthwest Territories.  F.A.’s spouse was on the board of directors of Garderie Plein \nSoleil, and A. attended that daycare centre. In addition, F.A. and her spouse, who are \nboth physicians, made an effort to offer their patients services in French.  F.A. applied \nfor admission in the “Reacquisition” stream of the 2016 Directive and, alternatively, \non the basis of the Minister’s residual discretion.  \n[30] The CSFTNO supported F.A.’s applications. In its report, the CSFTNO \nexplained that the child’s admission would help “cur[b] losses to t he community, where \nparents are free to enrol their children in majority -language schools. There is also the \nloss of rights holder status when parents choose schools outside the CSFTNO”, and \nadmission would enable the child to continue living in French as well (A.R., vol.  V, at \np. 194). In addition, the CSFTNO noted that admitting A. “would be a way of \nrecognizing and supporting diversity in the school system” in the Northwest Territories \n(p. 196).  \n[31] On April 18, 2019, the Minister refused to admit A. in the “Reacquisition” \nstream of the 2016 Directive because there was nothing to show that one of A.’s parents \n2023 SCC 31 (CanLII)\n\n--- Page 28 ---\n \n or grandparents would have been a rights holder but for a lack of opportunity to attend \na French first language education program.  \n[32] In a letter dated Jun e 20, 2019, F.A. asked the Minister to reconsider her \ndecision and exercise her residual discretion to admit her child to École Allain St -Cyr. \nIn that letter, F.A. reiterated the close professional and personal ties between her family \nand Yellowknife’s Fra ncophone community.  \n[33] On July 26, 2019, the Minister informed F.A. that she would reconsider \nthe application for A.’s admission in light of the decision rendered by the Supreme \nCourt of the Northwest Territories in A.B.’s case.  \n[34] On August 30, 2019, following that reconsideration, the Minister denied \nthe application for admission, essentially for the same reasons as in A.B.’s case. The \nMinister found that, if she admitted A., she would have to admit every child of \nnon-rights holder parents if the child spoke Fr ench and the parents were involved in \nFrancophone community life. This would impose too heavy a financial burden on the \ngovernment and create intolerable budgetary unpredictability.  \n(3) T.B. (Father of Child V.)  \n[35] On February 13, 2019, T.B. applied for the admis sion of his child, V., to \nÉcole Allain St -Cyr in the “New immigrant” stream of the 2016 Directive. The \nCSFTNO supported the application. On April 10, 2019, the Minister denied the \n2023 SCC 31 (CanLII)\n\n--- Page 29 ---\n \n application for admission because V. had been born in Canada and therefore c ould not \nbe admitted in the stream in question. In its report, the CSFTNO recommended \nadmission, in part because it would have a positive impact on the vitality of the school \nand of the Francophone community of the Northwest Territories.  \n[36] Following the dec ision of the Supreme Court of the Northwest Territories \nin A.B.’s case, the Minister reconsidered V.’s",
    "token_count": 1000,
    "start_token": 9900,
    "end_token": 10900,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 12,
    "source_file": "2023scc31.txt",
    "text": " ---\n \n application for admission because V. had been born in Canada and therefore c ould not \nbe admitted in the stream in question. In its report, the CSFTNO recommended \nadmission, in part because it would have a positive impact on the vitality of the school \nand of the Francophone community of the Northwest Territories.  \n[36] Following the dec ision of the Supreme Court of the Northwest Territories \nin A.B.’s case, the Minister reconsidered V.’s file. For that purpose, T.B. sent the \nMinister a letter explaining the ties between his family and the Francophone \ncommunity of the Northwest Territories . T.B. noted that some members of his spouse’s \nfamily spoke French. He mentioned that he and his spouse were members of the \nAssociation franco -culturelle de Yellowknife, had Francophone friends and had several \nbooks in French at home. Finally, T.B. stated that he and his spouse had tried in vain \nto register V. at Garderie Plein Soleil.  \n[37] On August 30, 2019, the Minister denied the application for admission. \nOnce again, the Minister expressed the opinion that, if she admitted V. to École Allain \nSt-Cyr on the b asis that an education in French would support his development and \nenable him to connect with his cultural heritage, she would have to authorize the \nadmission of too many children in similar circumstances, which would lead to \nbudgetary unpredictability for  the government.  \n(4) E.S. (Mother of Child E.)  \n2023 SCC 31 (CanLII)\n\n--- Page 30 ---\n \n [38] E.S. applied for the admission of her child, E., to École Boréale in the \n“New immigrant” stream. The CSFTNO supported the application for admission, \nbecause the child’s admission would have a positive impact on th e vitality of the school \nand of the Francophone community and would not require any additional resources. \nAdmitting E. would also recognize and support diversity in the school system in the \nNorthwest Territories. In a letter dated April 10, 2019, the Minis ter denied the \napplication for admission because the child in question had been born in Canada.  \n[39] On August 30, 2019, after reconsidering her decision in light of the \njudgment rendered by the Supreme Court of the Northwest Territories in A.B.’s case, \nthe Min ister upheld the denial of the application for admission for the same reasons as \nin the cases of the other appellant parents.  \n(5) J.J. (Father of Children T. and N.)  \n[40] On August 2, 2019, J.J. applied for the admission of his children, T. and \nN., to École Allain St-Cyr in the “New immigrant” stream and, alternatively, on the \nbasis of the Minister’s residual discretion.  \n[41] At the time, J.J. and his spouse were in the process of becoming permanent \nresidents. J.J. is a geotechnical engineer. His spouse is a teacher but was not working \nat the time the applications for admission were made. Her parents had lived in France \nfor several years. T. and N. were both at the top of their class. They were in a late \nimmersion program at an English school. They had also been learning French in \n2023 SCC 31 (CanLII)\n\n--- Page 31 ---\n \n tutoring sessions three times a week since October 2018, and they had taken part in \nsummer French classes offered in Vichy, France.  \n[42] The CSFTNO supported the applications for admission, because the \nadmission of T. and N. would contribute to the vi tality of École Allain St -Cyr and of \nthe Francophone community and would allow the children to continue living their \nFrancophone identity. The CSFTNO noted the family’s commitment to learning \nFrench. Admitting students who already knew French would help to  maintain École \nAllain St -Cyr as a French educational environment and would not represent an \nadditional burden.  \n[43] In a decision dated August 30, 2019, the Minister denied the applications \nfor admission on the basis that they were motivated by a desire to sup port the children’s \ndevelopment and facilitate their continued learning of French. In the Minister’s \nopinion, these elements were not sufficiently distinctive. Admitting T. and N. would \ntherefore mean that many other children would have to be admitted, whi ch could create \nbudgetary unpredictability for the government.  \nIII. Judicial History  \nA. Supreme Court of the Northwest Territories, 2019",
    "token_count": 1000,
    "start_token": 10800,
    "end_token": 11800,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 13,
    "source_file": "2023scc31.txt",
    "text": " applications \nfor admission on the basis that they were motivated by a desire to sup port the children’s \ndevelopment and facilitate their continued learning of French. In the Minister’s \nopinion, these elements were not sufficiently distinctive. Admitting T. and N. would \ntherefore mean that many other children would have to be admitted, whi ch could create \nbudgetary unpredictability for the government.  \nIII. Judicial History  \nA. Supreme Court of the Northwest Territories, 2019 NWTSC 25 (Rouleau  J.) \n[44] As mentioned above, A.B. and the CSFTNO applied for judicial review of \nthe decisions rendered by the Mini ster on, respectively, May 28 and August 29, 2018. \n2023 SCC 31 (CanLII)\n\n--- Page 32 ---\n \n Rouleau  J. set aside the initial decision of May 28, 2018, as well as the decision of \nAugust  29, 2018, denying the request for reconsideration. He referred the application \nfor W.’s admission back to the Mi nister for reconsideration.  \n[45] By refusing to admit W. because his situation did not fit into one of the \nstreams of the 2016 Directive, the Minister had fettered her discretion. The Minister \nhad residual discretion outside the 2016 Directive. In exercising he r discretion, the \nMinister had to strike a balance between the discretionary authority conferred on her in \nthis area and the “broad” objectives of s.  23 of the Charter . In such cases, the Minister \ncould take budgetary considerations and the best interests of the child into account, but \nshe also had to consider the purpose of s.  23 and the rights of the linguistic minority. \nThis last point meant that, at a minimum, the Minister had to consider the impact of a \nchild’s admission on the development and vitality  of the Francophone community of \nthe Northwest Territories.  \nB. Supreme Court of the Northwest Territories, 2020 NWTSC 28 (Rouleau  J.) \n[46] Rouleau  J. heard the application for judicial review of the decision made \nby the Minister on August 30, 2019, concerning the application for W.’s admission \nfurther to his 2019 judgment. In addition, Rouleau  J. had before him the decisions, also \ndated August 30, 2019, upholding the denial of admission to A., V., T., N. and E.  \n[47] Rouleau  J. found that the impugned decisions had to be  reviewed on the \nreasonableness standard and held that all of the decisions were unreasonable.  \n2023 SCC 31 (CanLII)\n\n--- Page 33 ---\n \n [48] The impugned decisions engaged s.  23 of the Charter , as there was a link \nbetween the handling of applications for the admission of children of non -rights holder \nparents and the vitality and development of schools and of the Francophone community \nof the Northwest Territories. In Rouleau  J.’s view, the decisions related indirectly to \nthe rights of rights holder parents under s.  23 and the values underp inning those rights. \nThe reasons for the impugned decisions showed that the Minister had failed to \nproportionately balance the protections guaranteed by s.  23 with the government’s \ninterests, contrary to what was required by the framework established by th is Court in \nDoré v. Barreau du Québec , 2012 SCC 12, [2012] 1 S.C.R. 395. Those reasons showed \nthat the Minister had not taken into account the benefits that the children’s admission \nwould have for the Francophone community of the Northwest Territories and that she \nhad not given the necessary weight to the CSFTNO’s recommendations. Those errors \nwere compounded by other errors made by the Minister in assessing the state of the \nFrench -language school system, the costs that would result from the admissions and \nthe manner in which the admission of the children in question would affect the \nconsistency and fairness of the admissions process in the future.  \n[49] Rouleau  J. therefore set aside the decisions and referred the applications \nfor admission back to the Minister f or reconsideration.  \nC. Court of Appeal for the Northwest Territories, 2021 NWTCA 8, 463 D.L.R. (4th) \n277 (Slatter, Rowbotham and Crighton JJ.A.)  \n2023 SCC 31 (CanLII)\n\n--- Page 34 ---\n \n [50] The Court of Appeal heard the appeals from the judgments rendered by \nRouleau ",
    "token_count": 1000,
    "start_token": 11700,
    "end_token": 12700,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 14,
    "source_file": "2023scc31.txt",
    "text": " and referred the applications \nfor admission back to the Minister f or reconsideration.  \nC. Court of Appeal for the Northwest Territories, 2021 NWTCA 8, 463 D.L.R. (4th) \n277 (Slatter, Rowbotham and Crighton JJ.A.)  \n2023 SCC 31 (CanLII)\n\n--- Page 34 ---\n \n [50] The Court of Appeal heard the appeals from the judgments rendered by \nRouleau  J. in 2019 and 2020 on judicial revie w. \n[51] The Court of Appeal panel was unanimous about the standard of review \nthat applied in reviewing the Minister’s decisions, namely reasonableness. However, \nthe panel disagreed on the application of this standard to the impugned decisions.  \n(1) Majority Reasons (Slatter and Crighton  JJ.A.)  \n[52] Slatter and Crighton  JJ.A. found that Rouleau  J. had erred in proceeding as \nif the protections afforded by s.  23 of the  Charter  were engaged. In fact, none of the \nrejected applications for admission concerned children of rights  holder parents. The \ncollective aspect of s.  23 provided no basis for extending the scope of this provision \nbeyond the categories of persons specifically identified in it. Consequently, the \nMinister did not have to proportionately balance the government’s interests with the \nprotections of s.  23 of the Charter . The Minister had no legal or constitutional \nobligation to admit a child of a non -rights holder parent.  \n[53] Moreover, the Minister could require exceptional circumstances in order \nto exercise her residual discretion and grant the applications for admission. Similarly, \nshe was entitled to be concerned about consistency in decision -making and fairness in \nthe admissions process for children of non -rights holder parents. The Government of \nthe Northwest Territor ies controlled admission to the schools of the Francophone \n2023 SCC 31 (CanLII)\n\n--- Page 35 ---\n \n minority in the Northwest Territories, and there was no indication that the Minister had \nconsidered irrelevant factors or failed to consider relevant ones.  \n[54] The majority therefore allowed the appeal s, set aside the orders being \nappealed and restored the Minister’s decisions.  \n(2) Concurring Reasons (Rowbotham  J.A.)  \n[55] Rowbotham  J.A. was of the view that Rouleau  J. had not erred in finding \nthat the decisions rendered by the Minister in 2018 with respect to W.  were \nunreasonable. The Minister was required to consider s.  23 of the Charter and its \npurpose in order to promote the flourishing and development of the Francophone \ncommunity of the Northwest Territories. Rowbotham  J.A. would accordingly have \ndismissed th e appeal from the judgment rendered in 2019 on judicial review.  \n[56] However, the decisions rendered by the Minister in 2019 concerning W. \nand the other children were reasonable. The Minister had addressed the relevant factors \nin reasons that were coherent, int elligible and transparent. She had justified her \ndecisions. The reasonableness standard did not allow the reviewing judge to substitute \nhis assessment of those factors for that of the Minister.  \n[57] Like her colleagues, Rowbotham  J.A. would therefore have allow ed the \nappeal from the judgment rendered by Rouleau  J. in 2020 on judicial review.  \n2023 SCC 31 (CanLII)\n\n--- Page 36 ---\n \n IV. Issues  \n[58] This appeal raises the following issues:  \n(1) Did the Minister have to consider the purpose of s.  23 of the Charter  \nin exercising her discretion with respect to the admiss ion of children of \nnon-rights holder parents to French first language education programs?  \n(2) Are the Minister’s decisions reasonable?  \n(3) Was the appellants’ right to use French before the Court of Appeal for \nthe Northwest Territories under s.  19 of the Charter  or s. 9(1) of the \nOLA  infringed?  \n(4) In the alternative, was the appellants’ right to be heard infringed before \nthe Court of Appeal for the Northwest Territories?  \nV. Analysis  \n[59] In oral argument before this Court, counsel for the appellants, before \nturning to the approach established in Doré , first submitted that the Minister’s decisions \nwere contrary to the requirements of s.  23 of the Charter  as set out in this Court’s \njurisprud ence. It is through the lens of Doré , which governs the judicial review of \nadministrative",
    "token_count": 1000,
    "start_token": 12600,
    "end_token": 13600,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 15,
    "source_file": "2023scc31.txt",
    "text": " \nthe Court of Appeal for the Northwest Territories?  \nV. Analysis  \n[59] In oral argument before this Court, counsel for the appellants, before \nturning to the approach established in Doré , first submitted that the Minister’s decisions \nwere contrary to the requirements of s.  23 of the Charter  as set out in this Court’s \njurisprud ence. It is through the lens of Doré , which governs the judicial review of \nadministrative decisions that engage the Charter , that the Minister’s decisions must be \nconsidered . This case is a straightforward application of that precedent.  \n2023 SCC 31 (CanLII)\n\n--- Page 37 ---\n \n A. Doré Framework  \n[60] In Doré , this Court, per Abella  J., established an approach for reviewing \ndiscretionary administrative decisions that limit Charter  protections. Abella J. found \nthat reviewing courts must show deference to decisions of this nature (para.  54). In this \nregard, the parties agree that the standard of review applicable in reviewing the \nMinister’s decisions is reasonableness. I see no reason to depart from this standard of \nreview in this case ( Canada (Minister of Citizenship and Immigration) v. Vavilov , 2019 \nSCC 65,  [2019] 4 S.C.R. 653, at paras.  16-17). \n[61] Under the Doré  approach, a reviewing court must begin by determining \nwhether the administrative decision at issue “engages the Charter  by limiting Charter  \nprotections — both rights and values” ( Law Society of British  Columbia v. Trinity \nWestern University , 2018 SCC 32, [2018] 2 S.C.R. 293, at para.  58; Loyola High \nSchool v. Quebec (Attorney General) , 2015 SCC 12, [2015] 1 S.C.R. 613, at para.  39; \nsee also G.  Régimbald, Canadian Administrative Law  (3rd ed. 2021), at p.  99).  \n[62] Here is where the essence of the parties’ disagreement lies: the appellants \nsubmit that the impugned decisions engage the values underlying s.  23 of the Charter , \nwhereas the respondent takes the opposite view. The respondent maintains that the \nprote ctions afforded by s.  23 are not engaged because the appellant parents are not \nrights holders under this provision; as non -rights holders, they are unable to show that \nthe right guaranteed by s.  23 was infringed by the Minister’s decisions. In other words,  \nthe respondent argues that the Doré  framework applies only in cases where an \n2023 SCC 31 (CanLII)\n\n--- Page 38 ---\n \n administrative decision directly  infringes a right  (R.F., at para.  57). According to the \nrespondent, Charter values serve only to interpret the scope of the rights that reflect \nthem ( Loyola , at paras.  4 and 36).  \n[63] I note that it is not in dispute that no infringement of s.  23 can be \nestablished with respect to the appellant parents, as non -rights holders. The CSFTNO \ndoes, of course, represent the interests of rights holders and play s a fundamental role \nin managing and controlling minority language schools and in expressing their special \nneeds ( Conseil scolaire francophone de la Colombie -Britannique , at para.  86; \nArsenault -Cameron , at para.  44; Mahe , at pp.  373-80). However, it is not  necessary to \ndetermine whether the CSFTNO, as a representative of rights holders, might itself \nenjoy the benefit of the s.  23 rights for the purposes of this case.  \n[64] Indeed, it has consistently been held that the Doré  framework applies not \nonly where an adm inistrative decision directly  infringes Charter  rights but also in cases \nwhere it simply engages a value underlying one or more Charter  rights, without \nlimiting these rights ( Doré , at paras.  35 et  seq.; Loyola , at para.  4; Trinity Western \nUniversity , at pa ra. 57). \n[65] This is the case because administrative decision makers have an obligation \nto consider the values relevant to the exercise of their discretion, in addition to \nrespecting Charter  rights. There can be no doubt about this, because “[t]he Constitution  \n— both written and unwritten — dictates the limits of all state action",
    "token_count": 1000,
    "start_token": 13500,
    "end_token": 14500,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 16,
    "source_file": "2023scc31.txt",
    "text": " , at paras.  35 et  seq.; Loyola , at para.  4; Trinity Western \nUniversity , at pa ra. 57). \n[65] This is the case because administrative decision makers have an obligation \nto consider the values relevant to the exercise of their discretion, in addition to \nrespecting Charter  rights. There can be no doubt about this, because “[t]he Constitution  \n— both written and unwritten — dictates the limits of all state action” ( Vavilov , at \npara.  56). As L’Heureux -Dubé  J. clearly stated in Baker  v. Canada (Minister of \n2023 SCC 31 (CanLII)\n\n--- Page 39 ---\n \n Citizenship and Immigration) , [1999] 2 S.C.R. 817, a discretionary decision, to be \nreasonab le, must be made in accordance with the “fundamental values of Canadian \nsociety” as reflected in the Charter  (para.  56). Relying on this statement, Abella  J. held \nin Doré  that discretionary decisions must “ always ” take Charter  values into \nconsideration (pa ra. 35 (emphasis in original)).  \n[66] An administrative decision maker must consider the relevant  values \nembodied in the Charter , which act as constraints on the exercise of the powers \ndelegated to the decision maker. I refer in this regard to the considerations  identified \nby this Court in Vavilov : “. . . a decision, to be reasonable, must be justified in relation \nto the constellation of law and facts that are relevant to the decision  . . .” (para.  105). \nIn practice, it will often be evident that a value must be considered, whether because of \nthe nature of the governing statutory scheme (at para.  108), because the parties raised \nthe value before the administrative decision maker (at paras.  127-28), or because of the \nlink between the value and the matter under cons ideration (P.  Daly, “The Doré Duty: \nFundamental Rights in Public Administration” (2023), 101 Can. Bar Rev. 297, at \np. 309). For example, it is obvious that the development of policies and the making of \ndecisions that are likely to have an impact on a minor ity language educational \nenvironment require consideration of the values underlying s.  23 of the Charter  \n(p. 309). A decision cannot be unreasonable because the decision maker failed to \nconsider a Charter  value that was not relevant for the purposes of its decision. \nHowever, if the decision maker takes a relevant value into account in its decision while \n2023 SCC 31 (CanLII)\n\n--- Page 40 ---\n \n opting to prioritize another objective, it must be concluded that the decision engages \nthe Charter . \n[67] Once  the reviewing court has determined that the impugned administrative \ndecision infringes Charter  rights or limits the values underlying them, the court must, \nunder the approach laid down in Doré , determine whether the decision is reasonable \nthrough an analy sis of its proportionality. This involves assessing whether the exercise \nof discretion reflects a “proportionate balancing” of Charter  rights and the values \nunderlying them, on the one hand, with the statutory objectives in respect of which the \ndiscretion was granted, on the other (para.  57; Loyola , at paras.  37 and 39; Trinity \nWestern University , at para.  58). \n[68] The focus of judicial review is “on the decision actually made by the \ndecision maker, including both the decision maker’s reasoning process and the \noutcome” ( Vavilov , at para.  83). As is the case for any other decision, the context \nconstrains “what will be reasonable for an administrative decision maker to decide” \nwhen it exercises its discretion in a manner that limits Charter  protections (para.  89; \nLoyola , at para.  41; Trinity Western University , at para.  81). To be reasonable, a \ndecision must reflect the fact that the decision maker considered the Charter  values \nthat were relevant to the exercise of its discretion (E. Fox-Decent and A.  Pless, “The \nCharter and Administrative Law: Substantive Review”, in C. M. Flood and P.  Daly, \neds., Administrative Law in Context  (4th ed. 2022) , 399, at p.  410). The decision must \nalso show that the decision maker “meaningfully” ( Vavilov , at para.  128) addressed the",
    "token_count": 1000,
    "start_token": 14400,
    "end_token": 15400,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 17,
    "source_file": "2023scc31.txt",
    "text": " exercise of its discretion (E. Fox-Decent and A.  Pless, “The \nCharter and Administrative Law: Substantive Review”, in C. M. Flood and P.  Daly, \neds., Administrative Law in Context  (4th ed. 2022) , 399, at p.  410). The decision must \nalso show that the decision maker “meaningfully” ( Vavilov , at para.  128) addressed the \n2023 SCC 31 (CanLII)\n\n--- Page 41 ---\n \n Charter  protections to “reflect” the impact that its decision may have on the concerned \ngroup or individual (para.  133).  \n[69] This means that when the decision maker gives precedence to the \nlegislature’s intention over Charter  protections in order to achieve the statutory \nobjectives, it must do so in a manner that is “proportionate to the resulting limitation \non the Charter  right” ( Trinity Western University , at para.  82). A decision that has a \n“disproportionate impact” on Charter  protections can in no way show th at the decision \nmaker meaningfully considered these protections or that its reasoning reflects the \nsignificant impact that the decision may have (para.  80). Such a decision is therefore \nunreasonable.  \n[70] In the context of discretionary decisions that engage Charter  protections, \nthe standard of reasonableness must allow for a “ robust  . . . analysis” ( Loyola , at para.  3 \n(emphasis in original)) that works the same “justificatory muscles” as the test set out \nin R. v.  Oakes , [1986] 1 S.C.R. 103  (Doré , at para.  5; Loyola, at para.  40; Trinity \nWestern University , at paras.  79-82). The approach must take into account the role of \nthe courts as guardians of the Constitution and must reflect the particular importance \nof justification in decisions that engage Charter  protec tions ( Vavilov , at para.  133). \nWhen a decision engages Charter  values, “reasonableness and proportionality become \nsynonymous” ( Trinity Western University , at para.  80). \n[71] As a general rule, a reviewing court must not, in assessing the \nreasonableness of a dec ision, reweigh the factors underlying the decision or conduct a \n2023 SCC 31 (CanLII)\n\n--- Page 42 ---\n \n de novo  analysis of the issues raised. If the decision maker took into account all the \nconsiderations that were relevant in the context, the reviewing court must uphold its \ndecision ( Vavilov , at para.  83; Suresh v. Canada (Minister of Citizenship and \nImmigration) , 2002 SCC 1, [2002] 1 S.C.R. 3 , at para.  38; Ahani v. Canada (Minister \nof Citizenship and Immigration) , 2002 SCC 2, [2002] 1 S.C.R. 72 , at para.  16; Dr. Q v. \nCollege of Physicians and Surgeons of British Columbia , 2003 SCC 19, [2003] 1 \nS.C.R. 226, at para.  42; Lake v. Canada (Minister of Justice) , 2008 SCC 23, [2008] 1 \nS.C.R. 761, at para.  39; Canada (Citizenship and Immigration) v. Khosa , 2009 SCC \n12, [2009] 1 S.C.R. 339 , at para.  64; Agraira v. Canada (Public Safety and Emergency \nPreparedness) , 2013 SCC 36, [2013] 2 S.C.R. 559 , at para.  91; Canada Post Corp. v. \nCanadian Union of Postal Workers , 2019 SCC 67, [2019] 4 S.C.R. 900 , at para.  40). \n[72] On the other hand, the Doré  approach require s reviewing courts to inquire \ninto the weight accorded by the decision maker to the relevant considerations in order \nto assess whether a proportionate balancing was conducted by the decision maker \n(Fox -Decent and Pless, at pp.  406-7). In making this assess ment, the reviewing court \nmust “consider whether there were other reasonable possibilities that would give effect \nto Charter  protections more fully in light of the objectives”, while asking “whether the \ndecision falls within a range of reasonable",
    "token_count": 1000,
    "start_token": 15300,
    "end_token": 16300,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 18,
    "source_file": "2023scc31.txt",
    "text": " to inquire \ninto the weight accorded by the decision maker to the relevant considerations in order \nto assess whether a proportionate balancing was conducted by the decision maker \n(Fox -Decent and Pless, at pp.  406-7). In making this assess ment, the reviewing court \nmust “consider whether there were other reasonable possibilities that would give effect \nto Charter  protections more fully in light of the objectives”, while asking “whether the \ndecision falls within a range of reasonable outcomes”  (Trinity Western University , at \npara.  81). In cases where the reviewing court finds that “there was an option or avenue \nreasonably  open to the decision -maker that would reduce the impact on the protected \nright while still permitting him or her to sufficie ntly further the relevant .  . . objectives”, \n2023 SCC 31 (CanLII)\n\n--- Page 43 ---\n \n the administrative decision will be unreasonable (para.  81 (emphasis in original)). This \nis a necessary consequence of the robust analysis required by Doré . \n[73] It follows from the foregoing that, under the Doré  approach, a reviewing \ncourt must first determine whether the discretionary decision limits Charter  \nprotections. If this is the case, the reviewing court must then examine the decision \nmaker’s reasoning process to assess whether, given the relevant factual and  legal \nconstraints, the decision reflects a proportionate balancing of Charter  rights or the \nvalues underlying them. If not, the decision is unreasonable.  \n[74] While no infringement of the right guaranteed by s.  23 of the Charter  can \nbe established with respect  to the appellant parents in this case, the Doré  framework is \nstill applicable in reviewing the Minister’s decisions if the relevant values underlying \nthis right were limited by those decisions. I therefore turn now to the preliminary \nquestion of whether t he Minister’s decisions engage the protections afforded by s.  23. \nB. The Decisions Engage the Protections of Section 23  \n(1) The Values Underlying Section 23 Are Relevant to the Exercise of the \nMinister’s Discretion  \n[75] Charter  values are those that “underpin each rig ht and give it meaning” \n(Loyola , at para.  36). Charter  values are inseparable from Charter  rights, which \n“reflect” them (para.  4). The choice made by the framers to entrench certain rights in \n2023 SCC 31 (CanLII)\n\n--- Page 44 ---\n \n the text of the supreme law of Canada means that the purpose of these rights is \nimportant for Canadian society as a whole and must be reflected in the decision -making \nprocess of the various branches of government.  \n[76] This Court has recognized in its decisions that Charter  values have various \nfunctions, depending on the co ntext in which they come into play. For example, these \nvalues can be used in the development of common law rules ( RWDSU v. Dolphin \nDelivery Ltd. , [1986] 2 S.C.R. 573 , at pp.  602-3; R. v. Salituro , [1991] 3 S.C.R. 654 , at \np. 675; Hill v. Church of Scientolo gy of Toronto , [1995] 2 S.C.R. 1130, at paras.  85 \net seq.; M. (A.) v. Ryan , [1997] 1 S.C.R. 157, at paras.  22-23 and 30). In statutory \ninterpretation, Charter  values are an important tool, because courts must, in \ncircumstances of ambiguity, prefer an inter pretation that is respectful of these values \n(Bell ExpressVu Limited Partnership v. Rex , 2002 SCC 42, [2002] 2 S.C.R. 559 , at \npara.  62). \n[77] In addition, as I explained above, administrative decision makers must \nalways consider the values relevant to the exercise of their discretion. The manner in \nwhich Charter  values are dealt with is thus adapted to the specific context of \nadministrative law (L. Sossin and M.  Friedman, “Charter Values and Administrative \nJustice” (2014), 67 S.C.L.R.  (2d) 391, at p.  408). In this sense, these values engage the \nDoré  framework, even in the absence of any infringement of a right. Where a Charter  \nright is infringed,  the values “help determine the extent of any .  . . infringement” of that \nright “and, correlatively, when limitations on that right are proportionate",
    "token_count": 1000,
    "start_token": 16200,
    "end_token": 17200,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 19,
    "source_file": "2023scc31.txt",
    "text": " and Administrative \nJustice” (2014), 67 S.C.L.R.  (2d) 391, at p.  408). In this sense, these values engage the \nDoré  framework, even in the absence of any infringement of a right. Where a Charter  \nright is infringed,  the values “help determine the extent of any .  . . infringement” of that \nright “and, correlatively, when limitations on that right are proportionate in light of the \n2023 SCC 31 (CanLII)\n\n--- Page 45 ---\n \n applicable statutory objectives” ( Trinity Western University , at para.  57, quoting \nLoyola , at para.  36). \n[78] Here, there is a clear link between s.  23 of the Charter and the Minister’s \ndecisions, because the decisions were likely to have an impact on a minority language \neducational environment. Moreover, on judicial review of the two decisions made  by \nthe Minister in 2018, the chambers judge ordered the Minister to take into account the \npurpose of s.  23 when reconsidering A.B.’s application for admission. The Minister \nherself acknowledged, in the decisions she made following the 2019 judgment, that she \nhad to consider the purpose of s.  23, particularly its remedial nature, in exercising her \ndiscretion (A.R., vol.  IV, at p.  151). To identify the values that governed the Minister’s \ndiscretion, I must therefore begin by determining the purpose of s.  23 and the relevant \nvalues underlying it, and I must then assess whether the admission of children of \nnon-rights holder parents could have an impact on those values.  \n[79] Section 23(3)(a) of the Charter guarantees certain categories of citizens the \nright to instru ction in the minority official language where “the number of children of \ncitizens who have such a right is sufficient”. This Court has interpreted this \nconstitutional provision as having three purposes: the right is “at once preventive, \nremedial and unifyi ng” in nature ( Conseil  scolaire francophone de la \nColombie -Britannique , at para.  15). As the Court stated about the provision in Conseil  \nscolaire francophone de la Colombie -Britannique , “[i]t is intended not only to prevent \n2023 SCC 31 (CanLII)\n\n--- Page 46 ---\n \n the erosion of official language  communities, but also to redress past injustices and \npromote the development of those communities” (para.  15). \n[80] In practical terms, this means that the preservation and development of \nminority language communities are among the values underlying s.  23. Pro tection of \nthe right to instruction in the minority official language, explicitly entrenched in the \nConstitution, is a reflection of these values, insofar as education is a means  of realizing \nthe societal ideal that they embody. These values require preser ving and developing the \nvitality not only of the minority language, but also of the minority culture. In Mahe , \nDickson  C.J. rightly noted the “vital role of education in preserving and encouraging \nlinguistic and cultural vitality” in the minority language community (p.  350). Since \nMahe , this Court has repeatedly reiterated that education is an essential means of \nensuring the preservation and development of minority language communities \n(Reference re Public Schools Act (Man.), s.  79(3), (4) and (7) , [1993] 1  S.C.R. 839 , at \npp. 849-50; Arsenault -Cameron , at para.  26; Doucet -Boudreau , at para.  26; Solski , at \npara.  3; Gosselin (Tutor of) v. Quebec (Attorney General) , 2005 SCC 15, [2005] 1 \nS.C.R. 238, at para.  28; Nguyen , at para.  26). Schools also play this role  as a “setting \nfor socialization where students can converse with one another and develop their \npotential in their own language and, in using it, familiarize themselves with their \nculture” ( Conseil scolaire francophone de la Colombie -Britannique , at para.  1). \n[81] The admission of children of parents who are not rights holders under s.  23 \nof the Charter can have an impact on the preservation and development of minority \n2023 SCC 31 (CanLII",
    "token_count": 1000,
    "start_token": 17100,
    "end_token": 18100,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 20,
    "source_file": "2023scc31.txt",
    "text": " where students can converse with one another and develop their \npotential in their own language and, in using it, familiarize themselves with their \nculture” ( Conseil scolaire francophone de la Colombie -Britannique , at para.  1). \n[81] The admission of children of parents who are not rights holders under s.  23 \nof the Charter can have an impact on the preservation and development of minority \n2023 SCC 31 (CanLII)\n\n--- Page 47 ---\n \n language communities. In  Gosselin , this Court pointed out that minority language \nschools must not become “centres of assimilation” by allowing the presence of children \nfrom the majority language community to end up swamping the children from the \nminority language community (para.  31). A few years later, in  Yukon Francophone \nSchool Board, Education Area #23 v.  Yukon ( Attorney General ), 2015 SCC 25, [2015] \n2 S.C.R. 282 , this Court noted that, although the Yukon Francophone School Board \nhad no authority to set admission criteria for children of non -rights holders because \nsuch authority had not been delegated to it, “nothing stops the Board from arguing that \nthe Yukon’s approach to admissions prevents the realization of s.  23’s purpose” \n(para.  74). \n[82] It goes without saying that population growth in the minority language \ncommunity helps to ensure its development and prevent its decline, including by \nreducing the likelihood of assimilation and cultural erosion ( Conseil scolaire \nfrancophone de la Colombie -Britannique , at para.  156). Population growth in the \nminority language community also contributes to  fulfilling the promise of s.  23, which \nis to give effect to “the equal partnership of Canada’s two official language groups in \nthe context of education” ( Rose -des-vents , at para.  27). \n[83] Thus, the decisions rendered by provincial and territorial governments \nregarding the admission of children of non -rights holder parents to minority language \nschools, even when they do not directly infringe the right guaranteed by s.  23, can \nnevertheless have a significant impact on the preservation and development of minority  \n2023 SCC 31 (CanLII)\n\n--- Page 48 ---\n \n language communities. It follows that these values are always relevant when the \ngovernment exercises such a discretion and that they must therefore be taken into \naccount. For the purposes of this appeal, this means that the Minister was required to \nconsid er the values of preservation and development of minority language communities \nin exercising her discretion to decide whether to admit children of non -rights holder \nparents to the schools of the Francophone minority in the Northwest Territories.  \n(2) The Minist er’s Decisions Have the Effect of Limiting the Values \nUnderlying Section 23  \n[84] It is not in dispute that the appellant parents have no constitutional right to \nhave their children receive instruction in French. That being said, viewing the \nprotections of s.  23 of the Charter  as being engaged only in cases where an \ninfringement of this section has been shown is contrary to the approach set out in Doré . \nAs I explained above, the Doré  framework applies when limitations are imposed on \nCharter  values. I add that tak ing such a strict view would also be contrary to the \nremedial purpose of s.  23, which is aimed at “promoting the development of official \nlanguage minority communities and changing the status quo” ( Conseil scolaire \nfrancophone de la Colombie -Britannique , at  paras.  3 and 16; see also \nDoucet -Boudreau , at para.  29), as well as contrary to its preventive purpose.  \n[85] A contextual approach must be adopted to determine whether the values of \npreservation and development of minority language communities were limited by the \nMinister’s decisions against admitting the children of the appellant parents to the \n2023 SCC 31 (CanLII)\n\n--- Page 49 ---\n \n schools of the Francophone minority in the Northwest Territories. Because of their \ncollective dimension, the protections conferred by s.  23 of the Charter  must be asses sed \nin light of the unique language dynamics of a province or territory ( Reference re Public \nSchools Act (Man.) , at p. 851; Solski , at paras.  34 and 44). This requires an analysis of \nthe relationship between the minority and majority language groups in ord er to \nunderstand “the historical and social context of the situation to be redressed” \n",
    "token_count": 1000,
    "start_token": 18000,
    "end_token": 19000,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 21,
    "source_file": "2023scc31.txt",
    "text": ", the protections conferred by s.  23 of the Charter  must be asses sed \nin light of the unique language dynamics of a province or territory ( Reference re Public \nSchools Act (Man.) , at p. 851; Solski , at paras.  34 and 44). This requires an analysis of \nthe relationship between the minority and majority language groups in ord er to \nunderstand “the historical and social context of the situation to be redressed” \n(Arsenault -Cameron , at para.  27). \n[86] The evidence shows that, within the specific language dynamics of the \nNorthwest Territories at the time, the preservation and developmen t of the Francophone \ncommunity were supported through, among other things, the admission of a certain \nnumber of children of non -rights holder parents. Such admissions contributed to the \ngrowth of the Francophone community of the Northwest Territories and p romoted its \ndevelopment, in such a way as to reduce the likelihood of assimilation and prevent \ncultural erosion. It must therefore be concluded that, at the time the Minister made her \ndecisions, there was a link between the admission of children of non -rights holder \nparents to French -language schools in the Northwest Territories and the preservation \nand development of the Francophone community there.  \n[87] In fact, at the time the impugned decisions were made, the Minister \nacknowledged that the assimilation rate  and exogamous marriages were challenges to \nbe overcome for the transmission of the French language within the Francophone \ncommunity of the Northwest Territories. As the 2016 Directive recognized, the \n2023 SCC 31 (CanLII)\n\n--- Page 50 ---\n \n admission of a certain number of children of non -rights  holder parents to French first \nlanguage schools in the Northwest Territories supported the growth of the rights \nholders population, which was an “inherent part” of the revitalization of the French \nlanguage.  \n[88] The Report  reviewing the 2008 Directive was to t he same effect. After \nnoting that natural growth of the rights holder population and the migration of rights \nholders “may not be sufficient to maintain a level of population sufficient for \nsupporting French first language schools, particularly in Hay River ” (p. 20), this report \nrecommended the admission of certain children of non -rights holder parents, \nparticularly to allow for the sustainment and growth of the Francophone community of \nthe Northwest Territories (p.  21). \n[89] Depending on the circumstances, the a dmission of children of non -rights \nholder parents may have a positive or a negative impact on the minority language \ncommunity. This means that the government’s refusal to admit a child of non -rights \nholder parents will not have the effect of limiting the p reservation and development of \nminority language communities in every case. On the contrary, in some cases, the \nvalues underlying s.  23 of the Charter will militate against the admission of children \nof non -rights holder parents. As I mentioned above, minor ity language schools may \nbecome centres of assimilation if the admission of children of non -rights holder parents \nundermines the linguistic and cultural vitality of the linguistic minority in the schools. \nHere, however, several factors showed that the chil dren’s admission would not have \n2023 SCC 31 (CanLII)\n\n--- Page 51 ---\n \n such consequences, including the CSFTNO’s support for their admission and the \nindividual characteristics of each application.  \n[90] I reiterate that in the cases before us, the appellant parents had to undergo  \nand have their child ren undergo  an assessment by officials at the school where \nenrolment was sought. Their files were then sent to the CSFTNO, which, after \nreviewing them, determined that the children’s admission would be beneficial for the \nvitality of the educational environ ment in question and of the Francophone community \nin general.  \n[91] The admission of the children of the appellant parents would therefore have \nhad a positive impact on the preservation and development of the Francophone \ncommunity of the Northwest Territories. I n this context, refusing to admit those \nchildren by prioritizing the government’s interests had the effect of limiting the values \nof preservation and development of minority language communities, which underlie \ns. 23. The Minister therefore had to proporti onately balance these values with the \ngovernment’s interests.  \nC. The Minister Did Not Proportionately Balance the Values Underlying Section  23 \nWith the Government’s Interests  \n[92] The balancing exercise called for by Doré  requires an administrative \ndecision maker to “giv[e] effect, as fully as possible to the Charter protections at stake \n",
    "token_count": 1000,
    "start_token": 18900,
    "end_token": 19900,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 22,
    "source_file": "2023scc31.txt",
    "text": " preservation and development of minority language communities, which underlie \ns. 23. The Minister therefore had to proporti onately balance these values with the \ngovernment’s interests.  \nC. The Minister Did Not Proportionately Balance the Values Underlying Section  23 \nWith the Government’s Interests  \n[92] The balancing exercise called for by Doré  requires an administrative \ndecision maker to “giv[e] effect, as fully as possible to the Charter protections at stake \ngiven the particular statutory mandate” ( Loyola , at para.  39). Here, this exercise \n2023 SCC 31 (CanLII)\n\n--- Page 52 ---\n \n required, at a minimum, that the Minister truly take into account the constitutional \nvalues of pr eservation and development of official language minority communities, in \nother words, that she meaningfully address the considerations arising therefrom \n(Vavilov , at para.  128). The reasons for the Minister’s decisions do not show that she \ndid so. I conclu de that those decisions are unreasonable . \n[93] The two decisions rendered concerning W. in 2018 did not refer to s.  23 of \nthe Charter  or the values underlying it. Yet there is no doubt that the Minister had to \nconsider the preservation and development of the Francophone community of the \nNorthwest Territories in exercising her residual discretion. Failure to take the relevant \nvalues into  account necessarily leads to a disproportionate balancing. Moreover, I agree \nwith Rouleau  J. that the Minister fettered the exercise of her residual discretion by \nrefusing to admit W. solely on the basis of his ineligibility in one of the three streams \nof the 2016 Directive. The streams of the 2016 Directive could not bind the Minister to \nthe point of preventing her from exercising her discretion in every case. The chambers \njudge was therefore correct in finding that those decisions were unreasonable.  \n[94] The reasons for the decisions rendered following the 2019 judgment do not \nshow that the Minister truly considered s.  23 by meaningfully addressing this provision \nso as to reflect the significant impact that the decisions might have on the Francophone \ncommunity  of the Northwest Territories. The Minister did mention the provision, but, \nwith respect, she did not give the proper weight to the relevant values.  \n2023 SCC 31 (CanLII)\n\n--- Page 53 ---\n \n [95] In those decisions, the Minister indicated that she had to admit the children \nin question only if their adm ission was  “required” to protect the Francophone \ncommunity of the Northwest Territories and to meet its needs. She added that, given \nthe government’s scarce resources, the 2016 Directive “proportionally balance[d] the \nneeds of the linguistic minority with the necessity for the Government to control and \npredict its investments in minority education”, which was why it was important that \nshe exercise her residual discretion in a fair and consistent manner (A.R., vol.  IV, at \np. 157; A.R., vol.  V, at p.  119; A.R ., vol.  VI, at pp.  47 and 122; A.R., vol.  VII, at p.  24). \nIn her opinion, considerations related to the cost of services were “very important” in \nthe exercise of that discretion. However, since there was, in her view, no threat to the \ncontinued viability o f the French first language education programs at École Boréale \nand École Allain St -Cyr, she found that  “[a] refusal of admission .  . ., outside the 2016 \nDirective, therefore does not breach the object and purpose of s.  23 of the Charter ” \n(A.R., vol.  IV, a t p. 155; A.R., vol.  V, at p.  116; A.R., vol.  VI, at pp.  45 and 120; A.R., \nvol. VII, at p.  22). \n[96] However, the existence of the 2016 Directive did not in itself discharge the \nMinister’s obligations under Doré . In stating the contrary, the majority of the Cou rt of \nAppeal was reasoning from the false premise that, insofar as the 2016 Directive took \ninto account the considerations arising from s.  23, it served to relieve the Minister of \nher obligation to consider the relevant constitutional values. With respect,  I cannot \naccept that reasoning. Although the general purposes of the 2016 Directive were in line \nwith the values embodied in s.  23 of the Charter , it should not be presumed that each \n2023 SCC ",
    "token_count": 1000,
    "start_token": 19800,
    "end_token": 20800,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 23,
    "source_file": "2023scc31.txt",
    "text": "Appeal was reasoning from the false premise that, insofar as the 2016 Directive took \ninto account the considerations arising from s.  23, it served to relieve the Minister of \nher obligation to consider the relevant constitutional values. With respect,  I cannot \naccept that reasoning. Although the general purposes of the 2016 Directive were in line \nwith the values embodied in s.  23 of the Charter , it should not be presumed that each \n2023 SCC 31 (CanLII)\n\n--- Page 54 ---\n \n decision made under that directive — including by virtue of the residual  discretion \nderived from it — was the result of a proportionate balancing of the relevant values and \nthe government’s interests in a given case.  \n[97] Furthermore, in this case, Doré  required the Minister to consider how the \nadmission of the children for whom th e applications for admission had been made \nwould promote the development of the Francophone community of the Northwest \nTerritories. The aim of s.  23 of the Charter  is more ambitious than simply preserving \nthe Francophone community of the Northwest Territor ies; the ultimate purpose of the \nprovision is to promote the development of that community ( Reference re Public \nSchools Act (Man.) , at p.  849; Conseil scolaire francophone de la \nColombie -Britannique , at para.  15) in order to fulfil s.  23’s promise to give effect to \nthe equal partnership of the country’s two official language groups in the context of \neducation. In short, considering s.  23 only when it has been shown that the community \nis threatened is inconsistent with such a purpose.  \n[98] Several factors showed,  however, that the children’s admission was \nbeneficial for the development of the Francophone community of the Northwest \nTerritories. First, the fact that the Minister did not duly consider the CSFTNO’s support \nfor the applications for admission made by th e appellant parents is of particular \nimportance. This Court has recognized the expertise of bodies like school boards in \nassessing the educational needs of the linguistic minority ( Conseil scolaire \nfrancophone de la Colombie -Britannique , at para.  86). \n2023 SCC 31 (CanLII)\n\n--- Page 55 ---\n \n [99] Seco nd, the Minister also did not duly consider the individual \ncharacteristics of the various applications in relation to the benefits that could result \nfrom a decision to grant them. The level of French knowledge of A.B.’s child and F.A.’s \nchild, the ties of the families of A.B., F.A. and J.J. to the Francophone community of \nthe Northwest Territories, and the Franco -Vietnamese identity of T.B.’s family are \ncharacteristics the Minister had to assess carefully. By disregarding these factors, the \nMinister mistake nly reduced the appellant parents’ motivation for applying for their \nchildren’s admission to a mere desire to provide the children with a linguistic \nadvantage.  \n[100]  At the time of the applications for admission, each child concerned had a \nsound knowledge of Fre nch, had significant ties to the Francophone community of \nYellowknife or Hay River through their parents, and had the support and commitment \nof their parents in learning that language. When the application for W.’s admission was \nmade, W.  was able to have a  conversation in French without any difficulty or need for \nsupport, using a varied vocabulary. School officials at École Allain St -Cyr anticipated \nthat W.’s admission would not require any additional francization resources. Similarly, \nthe CSFTNO noted that  the admission of F.A.’s child and T.B.’s child to École Allain \nSt-Cyr “would help maintain the French environment at school” and would also \n“promot[e] the transmission of the French language in order to curb assimilation in the \nFrench -speaking community” (A.R., vol.  V, at p.  195; A.R., vol.  VI, at p.  76). \nLikewise, the admission of E.S.’s child to École Boréale was viewed as a step that \nwould promote the vitality of the school and of the Francophone community and that \n2023 SCC 31 (CanLII)\n\n--- Page 56 ---\n \n would slow down assimilation, without requiring any additional francization resources. \nLastly, when the applications for the admission of J.J.’s children, T. and N., were made, \nthe children already knew French; their admission to École Allain St -Cyr would \ntherefore not have imposed any addit",
    "token_count": 1000,
    "start_token": 20700,
    "end_token": 21700,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 24,
    "source_file": "2023scc31.txt",
    "text": " that \nwould promote the vitality of the school and of the Francophone community and that \n2023 SCC 31 (CanLII)\n\n--- Page 56 ---\n \n would slow down assimilation, without requiring any additional francization resources. \nLastly, when the applications for the admission of J.J.’s children, T. and N., were made, \nthe children already knew French; their admission to École Allain St -Cyr would \ntherefore not have imposed any additio nal burden for French -language instruction and \nwould have had a “positive impact on the vitality of the school and the French -speaking \ncommunity” (A.R., vol.  VII, at p.  44; see also p.  45).  \n[101]  The decisions rendered by the Minister following the 2019 judgmen t thus \nhad a significant impact on the values enshrined in s.  23 of the Charter , since the \nadmission of the children of the appellant parents would have had considerable benefits \nfor the preservation and development of the language and culture of the minor ity \nlanguage community.  \n[102]  It follows from the Doré  requirements that those decisions were \nunreasonable. The Minister attached too much importance to her duty to make \nconsistent decisions and, in doing so, gave disproportionate weight to the cost of the \nconte mplated services in the exercise of her discretion. The Minister was clearly \nentitled to take costs into account in her decision. “Obviously, however, given the \nremedial nature of s.  23, pedagogical requirements will have more weight than cost” \n(Conseil sc olaire francophone de la Colombie -Britannique , at para.  52; see also Mahe , \nat pp.  384-85; Rose -des-vents , at para.  30). The Minister has not shown that, in her \ndecisions, she meaningfully addressed the values of preservation and development of \n2023 SCC 31 (CanLII)\n\n--- Page 57 ---\n \n the Francoph one community of the Northwest Territories so as to reflect the significant \nimpact that the decisions might have on it.  \n[103]  I pause here to make two important clarifications. Stating that the Minister \ndid not proportionately balance the values underlying s.  23 of the Charter  with the \ngovernment’s interests in this case does not amount to imposing an obligation on \ndecision makers in her position to admit all children of non -rights holder parents. A \nrefusal does not always mean that there was a disproportionate b alancing of the relevant \nvalues and the government’s interests. Nor does this amount to endorsing freedom of \nchoice of the language of instruction, a model expressly rejected by the framers under  \ns. 23 (Solski , at para.  8; Nguyen , at paras.  35-36). On the contrary, the freedom of \nchoice model would imply the systematic admission of children of non -rights holder \nparents without a proportionate balancing of Charter  values. In each case, the decision \nmaker must consider the relevant values in light of the part icular circumstances of the \napplication in order to decide whether to admit children of non -rights holder parents.  \nD. It Is Neither Necessary nor Appropriate for This Court To Rule on the Allegation \nThat the Right To Use French or the Right To Be Heard Was In fringed  \n[104]  The appellants have raised a new ground of appeal in this Court. They \nargue that their right to use French in the courts as guaranteed by s.  19(1) of the Charter \nand s.  9(1) of the OLA  includes the right to be understood directly in that language \nwithout the assistance of an interpreter. Because interpretation services were required \nfor the hearing before the Court of Appeal for the Northwest Territories, the appellants \n2023 SCC 31 (CanLII)\n\n--- Page 58 ---\n \n take the view that their right under s.  19(1) of the Charter  and s.  9(1) of the OLA  was \ninfringed.  \n[105]  Section 19(1) of the Charter guarantees to every person that “[e]ither \nEnglish or French may be used .  . . in, or in any pleading in or process issuing from, \nany court established by Parliament”. The wording of s.  9(1) of the OLA is almost \nidentical.  That provision states that “[e]ither English or French may be used by” any \nperson “in, or in any pleading in or process issuing from, any court established by the \nLegislature”.  \n",
    "token_count": 1000,
    "start_token": 21600,
    "end_token": 22600,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 25,
    "source_file": "2023scc31.txt",
    "text": " that “[e]ither \nEnglish or French may be used .  . . in, or in any pleading in or process issuing from, \nany court established by Parliament”. The wording of s.  9(1) of the OLA is almost \nidentical.  That provision states that “[e]ither English or French may be used by” any \nperson “in, or in any pleading in or process issuing from, any court established by the \nLegislature”.  \n[106]  By way of relief, the appellants seek a number of declaratory  conclusions. \nFirst, they would like this Court to declare [ TRANSLATION ] “that the courts of the \nTerritories are established by Parliament within the meaning of s.  19(1) of the Charter ” \n(A.F., at para.  116).  They also seek a declaration that s.  19(1) of th e Charter  and s.  9(1) \nof the OLA [TRANSLATION ] “protect the right to be understood directly by the court, \nand that these rights were infringed” (para.  116). Second, the appellants ask this Court \nto declare that s.  9(1) of the OLA  is of no force or effect t o the extent of its inconsistency \nwith s.  19(1) of the Charter  or, in the alternative, that s.  19(1) of the Charter  and s.  9(1) \nof the OLA  protect the right to be understood by the court and that this right was \ninfringed in this case. Lastly, if the Court denies their other conclusions, the appellants \nseek at least a declaration that their right to be heard flowing from natural justice was \ninfringed.  \n2023 SCC 31 (CanLII)\n\n--- Page 59 ---\n \n [107]  To make the principal orders sought by the appellants, this Court has to \nresolve some complex constitutional issues. First, the Court must determine whether \nthe Court of Appeal for the Northwest Territories is a court established by Parliament \nwithin the meaning of s.  19(1) of the Charter , an exercise that requires consideration \nof the constitutional status of the Northwest Territories. Second, ruling in favour of the \nappellants also requires overturning Société des Acadiens du Nouveau -Brunswick I nc. \nv. Association of Parents for Fairness in Education , [1986] 1 S.C.R. 549, in which a \nmajority of this Court, per Beetz  J., found that the right to use either of the country’s \ntwo official languages in any court referred to in s.  19 of the Charter does not include \nthe right to be understood, as this right derives rather from the principles of natural \njustice and the right to a fair trial.  \n[108]  In the case at bar, I am of the view that it would not be appropriate for this \nCourt to decide the issue raised by th e appellants. Judicial restraint generally requires \nthat this Court not decide constitutional issues that are not necessary to the resolution \nof the parties’ dispute (see R. v. McGregor , 2023 SCC 4, at para.  24, and the cases \ncited). This rule may be depar ted from in exceptional circumstances (para.  24, quoting \nAttorney General (Que.) v. Cumming , [1978] 2 S.C.R. 605 , at p.  611). However, there \nare no such circumstances in this case.  \n[109]  From the time it arose until the time it came before this Court, the partie s’ \ndispute related not to s.  19(1) of the Charter or s. 9(1) of the OLA  but rather to the \ndecisions rendered by the Minister concerning the applications for admission submitted \n2023 SCC 31 (CanLII)\n\n--- Page 60 ---\n \n by the appellant parents. The appellants did not even raise this issue in the c ourse of \nthe hearing before the Court of Appeal for the Northwest Territories, despite having \nbeen informed months ahead of time that the members of the panel were not all \nbilingual.  \n[110]  In finding that the Minister’s decisions are unreasonable and in setting \naside the Court of Appeal’s judgment and the orders it made, this Court is ruling in \nfavour of the appellants and bringing an end to the dispute between the parties. It is \ntherefore unnecessary to address the issue of how s.  19(1) of the Charter and s.  9(1) of \nthe OLA ",
    "token_count": 1000,
    "start_token": 22500,
    "end_token": 23500,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 26,
    "source_file": "2023scc31.txt",
    "text": " panel were not all \nbilingual.  \n[110]  In finding that the Minister’s decisions are unreasonable and in setting \naside the Court of Appeal’s judgment and the orders it made, this Court is ruling in \nfavour of the appellants and bringing an end to the dispute between the parties. It is \ntherefore unnecessary to address the issue of how s.  19(1) of the Charter and s.  9(1) of \nthe OLA  should be interpreted in order to resolve the dispute. This issue has, for all \npractical purposes, become moot.  \n[111]  The appellants contend that the new constitutional issue remains relevant \neven if this Court sets aside the Court of Appeal’s judgm ent. In their opinion, the Court \nshould address it anyway because language rights are substantive rights and not purely \nprocedural ones. There is no doubt that language rights are not purely procedural. \nIndeed, the Court has recognized this, first in R. v. Beaulac , [1999] 1 S.C.R. 768  (at \npara.  28), and, more recently, in Mazraani v. Industrial Alliance Insurance and \nFinancial Services Inc. , 2018 SCC 50, [2018] 3 S.C.R. 261 (at para.  20), and Bessette  \nv. British Columbia (Attorney General) , 2019 SCC 31, [20 19] 2 S.C.R. 535 (at \npara.  38). With respect, however, such an argument reflects circular reasoning. The \nCourt’s reasons for considering an issue cannot be predicated on a presumed outcome. \n2023 SCC 31 (CanLII)\n\n--- Page 61 ---\n \n If the Court accepted this argument, it would have to address most  constitutional issues \nthat have no impact on the case.  \n[112]  For these reasons, it is preferable to leave the interpretation of s.  19(1) of \nthe Charter and s. 9(1) of the OLA , as well as any reconsideration of Société des \nAcadiens , for another day.  \n[113]  It is also u nnecessary to decide whether the quality of the interpretation \nservices in the Court of Appeal resulted in an infringement of the appellants’ right to \nbe heard. Since I would set aside the Court of Appeal’s judgment for other reasons, \nthere is no need to c onsider this ground of appeal.  \nVI. Disposition  \n[114]  For the reasons given above, I would allow the appeal and set aside the \norders made by the Court of Appeal for the Northwest Territories, with costs \nthroughout. Given that the children of the appellant parents hav e since been admitted \nto a school of the Francophone minority in the Northwest Territories or have moved \noutside that region, there is no need to restore the orders made by the Supreme Court \nof the Northwest Territories setting aside the Minister’s decisio ns and referring the \napplications for admission back to her.  \n Appeal  allowed with costs  throughout . \n2023 SCC 31 (CanLII)\n\n--- Page 62 ---\n \n  Solicitors for the appellant s: Juristes Power, Vancouver.  \n Solicitor s for the respondent : Gowling WLG (Canada), Vancouver ; \nMinister of Education, Culture and Employment of the Northwest Territories, \nYellowknife . \n Solicitor for the intervener the Attorney General of Canada : Department \nof Justice Canada — National Litigation Sector , Montréal.  \n Solicitors for the intervener the  Attorney General of Quebec : Bernard, Roy \n(Justice -Québec), Montréal; Direction du droit constitutionnel et autochtone , \nMontréal.  \n Solicitor  for the intervener the Attorney General of Manitoba : Department \nof Justice — Legal Services Branch, Constitutional Law, Winnipeg.  \n Solicitor s for the intervener the Attorney General of the Yukon Territory : \nGowling WLG (Canada), Vancouver.  \n Solicitor  for the intervener  the Canadian Francophonie Research Chair on \nLanguage Rights : University of Ottawa — Faculty of Law, Co mmon Law , Ottawa.  \n2023 SCC 31 (CanLII)\n\n--- Page 63 ---\n \n  Solicitor  for the intervener the Commissioner of Official Languages of \nCanada : Office of the Commissioner of Official Languages of Canada  — Legal Affairs \nBranch , Gatineau.  \n Solicitors  for the intervener  Fédération nationale des conseils scolaires \nfrancophones : Miller Thomson, Regina.  \n Solicitors for the intervener Commission nationale des parents \nfrancophones : Conway Baxter Wilson, Ottawa.  \n Solicitors  for the intervener Société de l ’",
    "token_count": 1000,
    "start_token": 23400,
    "end_token": 24400,
    "total_tokens_in_source": 24460
  },
  {
    "chunk_id": 27,
    "source_file": "2023scc31.txt",
    "text": " for the intervener the Commissioner of Official Languages of \nCanada : Office of the Commissioner of Official Languages of Canada  — Legal Affairs \nBranch , Gatineau.  \n Solicitors  for the intervener  Fédération nationale des conseils scolaires \nfrancophones : Miller Thomson, Regina.  \n Solicitors for the intervener Commission nationale des parents \nfrancophones : Conway Baxter Wilson, Ottawa.  \n Solicitors  for the intervener Société de l ’Acadie du Nouveau -Brunswick : \nPink Larkin, Fredericton.  \n Solicitor  for the intervener the Yukon Francophone School Board : \nUniversity of Ottawa — Faculty of Law, Common Law , Ottawa.  \n2023 SCC 31 (CanLII)\n\n",
    "token_count": 160,
    "start_token": 24300,
    "end_token": 24460,
    "total_tokens_in_source": 24460
  }
]