[
  {
    "chunk_id": 0,
    "source_file": "2023scc29.txt",
    "text": "--- Page 1 ---\n \n  \nSUPREME COURT OF CANADA  \n \nCITATION : Sharp v. Autorité des \nmarchés financiers, 2023 SCC 29    \nAPPEAL HEARD : January 18, 2023  \nJUDGMENT RENDERED : \nNovember 17, 2023  \nDOCKET : 39920  \n \nBETWEEN : \n \nFrederick Langford Sharp  \nAppellant  \n \nand \n \nAutorité des marchés financiers  \nRespondent  \n \n- and – \n \nAttorney General of Quebec, Shawn Van Damme, Vincenzo Antonio \nCarnovale, Pasquale Antonio Rocca and Ontario Securities Commission  \nInterveners  \n \nAND BETWEEN : \n \nShawn Van Damme, Vincenzo Antonio Carnovale and Pasquale Antonio \nRocca  \nAppellants  \n \nand \n \nAutorité des marchés financiers  \nRespondent  \n \n- and - \n2023 SCC 29 (CanLII)\n\n--- Page 2 ---\n \n  \nAttorney General of Quebec, Frederick Langford Sharp and Ontario \nSecurities Commission  \nInterveners  \n \nOFFICIAL ENGLISH TRANSLATION : Reasons of Côté J.  \n \nCORAM : Wagner C.J. and Karakatsanis, Côté, Brown,* Rowe, Martin, Kasirer, \nJamal and O’Bonsawin JJ.  \n \nJOINT REASONS \nFOR JUDGMENT :  \n(paras. 1 to 138)  Wagner C.J. and Jamal J. (Karakatsanis, Rowe, Martin, \nKasirer and O’Bonsawin JJ. concurring)  \n  \nDISSENTING \nREASONS :  \n(paras. 139 to 212) Côté J.  \n \n \nNOTE: This document is subject to editorial revision before its reproduction in final \nform in the Canada Supreme Court Reports . \n \n \n* Brown  J. did not participate in the final disposition of the judgment.  \n \n \n   \n \n  \n2023 SCC 29 (CanLII)\n\n--- Page 3 ---\n \n Frederick Langford Sharp  Appellant  \nv. \nAutorité des marchés financiers  Respondent  \nand \nAttorney General of Quebec,  \nShawn Van Damme,  \nVincenzo Antonio Carnovale,  \nPasquale Antonio Rocca and \nOntario Securities Commission  Interveners  \n- and - \nShawn Van Damme,  \nVincenzo Antonio Carnovale and  \nPasquale Antonio Rocca  Appellants  \nv. \nAutorité des marchés financiers  Respondent  \nand \nAttorney General of Quebec,  \nFrederick Langford Sharp and  \nOntario Securities Commission  Interveners  \n2023 SCC 29 (CanLII)\n\n--- Page 4 ---\n \n Indexed as: Sharp  v. Autor ité des marchés financiers  \n2023  SCC 29 \nFile No.: 39920.  \n2023: January 18 ; 2023: November 17 . \nPresent: Wagner C.J. and Karakatsanis, Côté, Brown, Rowe, Martin, Kasirer, Jamal \nand O ’Bonsawin JJ.  \nON APPEAL  FROM  THE  COUR T OF APPEAL FOR QUEB EC \n Constitutional law — Extraterritoriality — Jurisdiction — Constitutional \napplicability of Quebec regulatory scheme to out -of-province residents — Quebec \nadministrative tribunal  claiming jurisdiction over out -of-province defendants in \nsecurities enforcement proceeding — Whether tribunal properly assumed jurisdiction \n— Civil Code of Québec, preliminary provision — Act respecting the Autorité des \nmarchés financiers, CQLR , c. A-33.2, s. 93 — Securities Act, CQLR , c. V-1.1. \n Four British Columbia residents (the “defendants”) are alleged by the \nadministrative agency that regulates Quebec’s financial sector, the Autorité des \nmarchés financiers (“AMF”), to have en gaged in a transnational  “pump -and-dump” \n                                                 \n Brown J. did not participate in the final disposition of the judgment.  \n2023 SCC 29 (CanLII)\n\n--- Page 5 ---\n \n securities manipulation scheme. The defendants allegedly  acted in concert to \n(1) acquire the shares of a shell company , (2) give it a legitimate face, (3)  promote its  \nbusiness, (4)  sell their shares for a profit, and (5)  distribute this pr ofit among \nthemselves. The AMF also alleged that the scheme had several ties to Quebec sufficient \nto apply Quebec’s securities regulatory",
    "token_count": 1000,
    "start_token": 0,
    "end_token": 1000,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 1,
    "source_file": "2023scc29.txt",
    "text": "CanLII)\n\n--- Page 5 ---\n \n securities manipulation scheme. The defendants allegedly  acted in concert to \n(1) acquire the shares of a shell company , (2) give it a legitimate face, (3)  promote its  \nbusiness, (4)  sell their shares for a profit, and (5)  distribute this pr ofit among \nthemselves. The AMF also alleged that the scheme had several ties to Quebec sufficient \nto apply Quebec’s securities regulatory scheme to the defendants: the shell company \nwas a reporting issuer in Quebec with a Montréal business address; its dir ector was a \nQuebec resident when the scheme was implemented; its promotional activities were \naccessible to Quebec residents; and, ultimately, Quebec investors lost money.  \n The AMF brought an originating pleading before Quebec’s Financial \nMarkets Administra tive Tribunal (“FMAT”) alleging that the defendants contravened \nthe Quebec  Securities Act . It asked the FMAT to make various orders against the \ndefendants. The defendants filed motions for a declinatory exception challenging the \nFMAT’ s jurisdiction over th em as out -of-province defendants. The FMAT dismissed \nthe defendants’ motions. It ruled that it had jurisdiction over them un der s.  93 of the \nAct respecting the Autorité des marchés financiers , which grants the FMAT jurisdiction \nto make determinations under  the Securities Act , in light of the Court’s decision in \nUnifund Assurance Co. v. Insurance Corp. of British Columbia , 2003 SCC 40, [2003] \n2 S.C.R. 63, which held that a provincial regulatory scheme con stitutionally applies to \nan out -of-province defendant when there is a “sufficient connection” or a “real and \nsubstantial connection” between the province and the defendan t. \n2023 SCC 29 (CanLII)\n\n--- Page 6 ---\n \n  The Superior Court of Quebec dismissed the defendants’ applications for \njudicial review and held that the FMAT properly assumed jurisdic tion. The court stated \nthat the FMAT correctly recognized the limits of its extraterritorial reach by applying \nthe “real and substantial connection” test set out in Club Resorts Ltd. v. Van Breda , \n2012 SCC 17, [2012] 1 S.C.R. 572, and that the FMAT correct ly applied the Unifund \ntest for the constitutional applicability of provincial legislation. The majority of the \nCourt of Appeal of Quebec dismissed the defendants’ appeals. It concluded that the \nreal and substantial connection test in Unifund addresses the  constitutional applicability \nof the Quebec securities scheme to non -residents who allegedly engaged in a securities \nmanipulation scheme with connections to Quebec, and that the FMAT correctly \nconcluded there is a real and substantial connection between Qu ebec and the defendants \nand properly assumed jurisdiction. The majority also ruled that although the Civil Code \nof Québec (“C.C.Q .”) acts as suppletive law for many matters, including certain aspects \nof public law, the private international law rules in Bo ok Ten of the C.C.Q.  do not apply \nwhen no private rights are at issue. The concurring judge would have held that the \nFMAT has jurisdiction over the out -of-province defendants under the rule s of private \ninternational law in Title Three of Book Ten of the C.C.Q. , either by analogy  under \nart. 3148 para.  1(3) C.C.Q. , or, a lternatively, under art.  3136 C.C.Q.  \n Held (Côté J. dissenting) : The appeal should be dismissed.  \n Per Wagner C.J. and Karakatsanis, Rowe, Martin, Kasirer, Jamal  and \nO’Bonsawin JJ.: The FMAT ha s jurisdiction over the defendants under the Quebec \n2023 SCC 29 (CanLII)\n\n--- Page 7 ---\n \n securities scheme, which constitutionally applies to them. The FMAT has jurisdiction \nto make determinations under the Securities Act , including when there is a “r eal and \nsubstantial” connection, also desc ribed as a “sufficient connecti on”, between Quebec \nand out -of-province defendants. The allegations that the defendants used Quebec as the \nface of their securities manipulation and injured Quebec investors establish such a \nconnection to give the FMAT jurisd iction over the defendants. The Quebec legislature \nhas exercised its prescriptive legislative jurisdiction — its power to enact bin ding rules \napplicable to out -of-province parties with a real and substantial connection to Quebec. \nThose rules are engaged in  the circumstances of the instant case. As a result",
    "token_count": 1000,
    "start_token": 900,
    "end_token": 1900,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 2,
    "source_file": "2023scc29.txt",
    "text": "and out -of-province defendants. The allegations that the defendants used Quebec as the \nface of their securities manipulation and injured Quebec investors establish such a \nconnection to give the FMAT jurisd iction over the defendants. The Quebec legislature \nhas exercised its prescriptive legislative jurisdiction — its power to enact bin ding rules \napplicable to out -of-province parties with a real and substantial connection to Quebec. \nThose rules are engaged in  the circumstances of the instant case. As a result, the FMAT \nalso has adjudicatory jurisdiction, or the authority to hear this matter involving the \ndefendants.  \n Under Quebec civil law, all interpretive exercises of laws governing \npersons, relations betwee n persons, and property must begin with the C.C.Q. , although \nspecial legislation can derogate from the C.C.Q.  when the legislature expresses its \nintention to do so. As its preliminary provision announces, the C.C.Q. lays down the \njus commune , or the law of  general application, of Quebec in all matters within the \nletter, spirit, or object of its provisions. I t has a suppletive role and can fill gaps in \nspecial statutes to the extent that legislation is silent on a given matter, thus preventing \na legal vacuum . The proper interpretive methodology in determining the relationship \nbetween the C.C.Q. and special statutes governing persons, relations between persons, \nand property is to start with the jus commune  in the C.C.Q. , and then to ask whether \nthe special sta tute complements or derogates from the jus commune . \n2023 SCC 29 (CanLII)\n\n--- Page 8 ---\n \n  The C.C.Q.  does not simply lay down rules of private law on a narrow \ncompass. The preliminary provision of the C.C.Q.  provides that the C.C.Q . lays down \nthe jus commune , and the C.C.Q.  contains rules of public law and is an important source \nof administrative law in Quebec.  As a result, the proper way to determine whether the \nC.C.Q. applies does not involve characterizing the right at issue as either a private law \nor public law matter. Book Ten of the C.C.Q., which codifies the rules of private \ninternational law in Quebec, therefore applies as the jus commune  beyond matters of \nprivate law to all matters within the letter, spirit, or object of the C.C.Q. ’s provisions, \nand it applies to administrative tribuna ls like the FMAT regardless of whether private \nrights are at issue, unless otherwise provided by law. Furthermore, Title Three of Book \nTen applies not just in cases of conflict of jurisdiction; it applies more broadly to \ndetermine the “International Jurisd iction of Québec Authorities” . \n The application of the interpretive methodology regarding the relationship \nbetween the C.C.Q. and special statutes in the instant case leads to the conclusion that \nthe C.C.Q.  does not grant the FMAT jurisdiction over the def endants.  The FMAT’s \njurisdiction does not arise from  art. 3148 para 1(3) or from art.  3136 C.C.Q . Article  \n3148 para.  1(3) C.C.Q . does not apply directly because the proceeding before the \nFMAT does not involve a personal action of a patrimonial nature, whic h implies the \nassertion of rights that by their very essence have a monetary value and are \ntransmissible as property. Rather, the AMF has brought an action before the FMAT in \nthe public interest, rather than in a strictly personal capacity. Its action aims  to prevent \nfuture harm to the Quebec securities market and is neither restorative nor punitive.  It \n2023 SCC 29 (CanLII)\n\n--- Page 9 ---\n \n does not involve a person taking legal action against another based on personal rights \nthat are transmissible as property. In addition, a rt. 3148 para.  1(3) C.C.Q.  cannot be \napplied by analogy because there is no tenable analogy between a personal action of a \npatrimonial nature, which seeks the enforcement of a debt under private law, and a \nregulatory prosecution by the state, which seeks public interest remedies rather than \nsimply private reparation. Such proceedings are of a fundament ally different legal \ncharacter . As for a rt. 3136 C.C.Q. , it does not provide a basis for the FMAT’s \njurisdiction for two reasons. First, the AMF did not seek to rely on it — the Court has \npreviously confirmed that it may be applied only if one of the parties raises it. Second, \nfor it to apply, a Quebec authority must otherwise have no jurisdiction to hear a",
    "token_count": 1000,
    "start_token": 1800,
    "end_token": 2800,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 3,
    "source_file": "2023scc29.txt",
    "text": " private reparation. Such proceedings are of a fundament ally different legal \ncharacter . As for a rt. 3136 C.C.Q. , it does not provide a basis for the FMAT’s \njurisdiction for two reasons. First, the AMF did not seek to rely on it — the Court has \npreviously confirmed that it may be applied only if one of the parties raises it. Second, \nfor it to apply, a Quebec authority must otherwise have no jurisdiction to hear a dispute. \nThe FMAT, however, does have jurisdiction under the special jurisdictional rules of \nthe Quebec securities scheme.  \n The FMAT has jurisdiction under two special statutes: the Quebec \nSecurities Act  and the Act respecting the Autorité des marchés financiers , now known \nas the Act respecting the regulation of the financi al sector . Section 93 of the Act \nrespecting the Autorité des marchés financiers  provides that the FMAT’s function is to \nmake determinations regarding matters brought under the Act respecting the Autorité \ndes marchés financiers  and other Acts listed in the provision, including the Securities \nAct. It thus grants the FMAT jurisdiction over the adjudication of matters brought under \nthe Securities Act . Section 94 grants the FMAT jurisdiction to take any measure to \nensure compliance with any of the Acts referred to in s.  93. Sections 265, 273.1 , and \n273.3 of the Securities Act  empower the FMAT to act in a broad range of \n2023 SCC 29 (CanLII)\n\n--- Page 10 ---\n \n circumstances. These provisions must be read in conjunction with the Act respecting \nthe Autorité des marchés financiers , which explicitly provides  for the FMAT’s \njurisdiction to make determinations over matters brought under the two Acts.  \n Neither the Securities Act  nor the Act respecting the Autorité des marchés \nfinanciers  expressly provide for the FMAT to asse rt jurisdiction over out -of-province \nparties, or otherwise limits the territorial reach of the Quebec securities scheme over \ninterprovincial or international transactions. To evaluate whether these statutes may be \napplied in such circumstances, the Quebec securities scheme must be interpreted to \ndetermine its territorial reach. This involves consideration of the Court’s decision in \nUnifund , which holds that the permissible territorial application of provincial \nlegislation is determined by assessing the sufficiency of the connection among the \nenacting jurisdiction, the subject matter of the legislation, and the individual or entity \nsought to be regulated, subject to the principles of order and fairness. The “real and \nsubstantial connection” test in Unifund  is the accepted test for discerning the \npresumptively intended reach of federal legislation as well as the constitutionally \npermissible application of provincial legislation. It is concerned with the constitutional \napplicability of legislation and not with its constitutional validity. Moreover, it \nfunctions as a principle of statutory interpretation: it limits, or reads down, the territorial \nreach of otherwise broadly framed provincial legislation, consistent with the territorial \nrestrictions on prov incial legislative power in ss.  91 and 92 of th e Constitution Act, \n1867 , by insisting on a “sufficient connection” betw een the legislation and the \nout-of-province defendant. It also relates to prescriptive legislative jurisdic tion, rather \n2023 SCC 29 (CanLII)\n\n--- Page 11 ---\n \n than adjudicatory jurisdiction. Furthermore, it is distinct from  the “real and substantial \nconnection” tests that the Court has developed elsewhere in the domain of conflicts of \nlaws. The “real and substantial connection” test is a family of tests and requires \ndifferent considerations in each of the varying contexts in  which its formula is \nemployed. For example, the “real and substantial connection” test set out in Van Breda \napplies in the context of tort claims at common law and does not apply in Quebec.  \n Interpreted in light of the Unifund  test, the Quebec securities scheme \nprovides for jurisdiction over out -of-province parties with a “sufficient connection” or \n“real and substantial connection” with Quebec. The “sufficient connection” analysis \nmust recognize the transnational nature of modern securities regulation and the public \ninterest in addressing international market manipulation. Securities regulation raises \nunique considerations that highlight the need for transnational enforcement. In the \ninstant case, there is a sufficient connec tion between Quebec and the out -of-province \ndefendants. The defendants allegedly used Quebec as the face of  their alleged \npump -and-dump scheme. They participated in marketing or financing efforts and partly \ntargeted Quebec residents. The shell company through which the defendants operate d \ntheir scheme was a reporting issuer in Quebec,",
    "token_count": 1000,
    "start_token": 2700,
    "end_token": 3700,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 4,
    "source_file": "2023scc29.txt",
    "text": " international market manipulation. Securities regulation raises \nunique considerations that highlight the need for transnational enforcement. In the \ninstant case, there is a sufficient connec tion between Quebec and the out -of-province \ndefendants. The defendants allegedly used Quebec as the face of  their alleged \npump -and-dump scheme. They participated in marketing or financing efforts and partly \ntargeted Quebec residents. The shell company through which the defendants operate d \ntheir scheme was a reporting issuer in Quebec, and its director was a Quebec resident. \nIt would defeat the purpose of the cross -border nature of modern securities regulation \nto allow the defendants to escape the reach of Quebec’s regulatory oversight. Ap plying \nthe Quebec regulatory regime is fair to the defendants: their entrance into Quebec’s \nmarket was not accidental or irrelevant, but rather was an integral part of their securities \nmanipulation operation. Moreover, applying the Quebec regulatory scheme  does not \n2023 SCC 29 (CanLII)\n\n--- Page 12 ---\n \n offend the principle of order or the related concept of interprovincial comity. Because \ncontemporary securities manipulation and fraud are often transnational and extend \nacross provincial and national borders, courts and tribunals must take a fle xible and \npurposive approach when applying the principles of order and fairness in the securities \ncontext.  \n Per Côté  J. (dissenting): The appeals should be allowed. A t this stage of \nthe proceedings, this case raises no issue regarding the constitutional applicability of \nthe Securities Act  but rather concerns the FMAT’s adjudicative jurisdiction. The limits \nof that jurisdiction must be analyzed in light of the rules of private international law set \nout in Title Three of Book Ten of the C.C.Q.  The application of those provisions in this \ncase leads to the conclusion that the FMAT does not have adjudicative jurisdiction over \nthe defendants and therefore cannot hear the matt er. \n The majority’s approach conflates the concepts of adjudicative jurisdiction \nof a court or tribunal and constitutional applicability of legislation, as it deals \ninterchangeably with the constitutional applicability of the Securities Act  under the \nUnifu nd framework and the FMAT’s jurisdiction under the rules of private \ninternational law. Both concepts involve the existence of a real and substantial \nconnection.  In the constitutional context, the real and substantial connection test affirms \nthe constitutio nally imposed territorial limits that underlie the requirement of \nlegitimacy in the exercise of the state’s power of adjudication . Thus, the applicability \nof provincial legislation to a defendant domiciled outside the province in question \n2023 SCC 29 (CanLII)\n\n--- Page 13 ---\n \n depends on there being a sufficient connection between the enacting jurisdiction and \nthe out -of-province individual or entity. Although this test relates more specifically to \nthe connection between a province and an action, the purpose of the Unifund  analysis \nis essentiall y to determine whether there is a viable cause of action on the merits . \nConversely, from a private international law perspective, the real and substantial \nconnection test relates to the exercise of the state’s power of adjudication. The rules of \nprivate in ternational law in force in a province are what confer adjudicative jurisdiction \non a decision maker. In Quebec, these rules are set out in Book Ten of the  C.C.Q.  To \nbe able to assume jurisdiction over a dispute, a provincial court or tribunal must have \nadjudicative jurisdiction under provincial legislation, which must itself have been \nvalidly enacted by the province in the exercise of its legislative jurisdiction. The \njurisdiction of courts and tribunals of the Canadian provinces, the appropriateness of \nexercising that jurisdiction and the law that should apply to a dispute are all different \nconcepts.  \n The adjudicative jurisdiction of a court or tribunal has two components: \njurisdiction ratione materiae  (subject -matter jurisdiction) and jurisdiction ratione  \npersonae  (territorial jurisdiction). The subject -matter jurisdiction of a court or tribunal \nis that given to it to hear a case by reason of its subject matter , whereas territorial \njurisdiction is assessed on the basis of a geographical connection . To have  jurisdiction \nto hear a dispute, a court or tribunal must have the necessary subject -matter jurisdiction \nand territorial jurisdiction . In this case, the objection raised by the defendants in their \nmotions for declinatory exception relates not to the FMAT’s  lack of subject -matter \n2023 SCC 29 (CanLII)\n\n--- Page 14 ---\n \n jurisdiction but rather to its  lack of territorial jurisdiction over them . The appeals \ntherefore relate not to the extraterritorial applicability of the Securities Act  but rather to",
    "token_count": 1000,
    "start_token": 3600,
    "end_token": 4600,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 5,
    "source_file": "2023scc29.txt",
    "text": " must have the necessary subject -matter jurisdiction \nand territorial jurisdiction . In this case, the objection raised by the defendants in their \nmotions for declinatory exception relates not to the FMAT’s  lack of subject -matter \n2023 SCC 29 (CanLII)\n\n--- Page 14 ---\n \n jurisdiction but rather to its  lack of territorial jurisdiction over them . The appeals \ntherefore relate not to the extraterritorial applicability of the Securities Act  but rather to \nthe FMAT’s territorial jurisdiction under private international law . \n The rules of private international law set out in the C.C.Q.  apply to all \nproceedings that may be heard by Quebec authorities pursuant to the jurisdiction \nconferred on the province by the Constitution. Accordingly, the rules in Title Th ree of \nBook Ten of the C.C.Q.  must be considered in this case unless a special law \ncomplements, makes exceptions to or derogates from them . Article 3076 C.C.Q.  in fact \nprovides that Book Ten applies subject to those rules of law in force in Quebec which \nare applicable by reason of their particular object. Those rules might include the \nSecurities Act  and the Act respecting the Autorité des marchés financiers , but  these \nstatutes do not themselves make exceptions to, derogate from or complement the \nC.C.Q. ’s rules of private international law when it comes to the administrative \nproceedings brought by the AMF. It is clear from reading the provisions of these \nstatutes that the legislature intended them to be supplemented by the C.C.Q. ’s \nprovisions on the international jurisdiction  of Quebec authorities. Section 93 of the Act \nrespecting the Autorité des marchés financiers  establishes the FMAT’s subject -matter \njurisdictio n in administrative proceedings instituted by the AMF under the Securities \nAct; it does not give the FMAT territorial jurisdiction . As for s.  94 of the  Act respecting \nthe Autorité des marchés financiers , it is not concerned in any way with territorial \njurisdiction but relates rather to the measures that the FMAT may take once it is \nestablished that it has jurisdiction ratione personae  to deal with a matter. This is also \n2023 SCC 29 (CanLII)\n\n--- Page 15 ---\n \n the case of ss.  265, 273.1 , and 273.3 of the Securities Act . The FMAT can take the \nmeasu res contemplated in those provisions only where it has jurisdiction under the \nrules of private international law set out in the C.C.Q.  \n The issue of the FMAT’s adjudicative jurisdiction must therefore be \ndecided by applying the rules on international juris diction set out in Title Three of Book \nTen of the C.C.Q. , that is, arts.  3134 to 3154. The C.C.Q.  contains a well -developed set \nof rules and principles of private international law and codifies the “sufficient \nconnection” test . However, no provision of the  C.C.Q.  can ground the FMAT’s \njurisdiction in the proceedings brought by the AMF . There is agreement with the \nmajority that no analogy can be drawn between a personal action of a patrimonial \nnature and the proceedings brought by the AMF . Article 3148 para.  1(3) C.C.Q.  \ntherefore cannot confer jurisdiction on the FMAT . As for art.  3136  C.C.Q. , it \nrecognizes the “forum of necessity” doctrine, which can serve a s an exceptional basis \nfor the jurisdiction of Quebec authorities . However,  it can be applied only if one of the \nparties raises it, which the AMF did not do in this case . The AMF  did not demonstrate \nthat proceedings abroad had proved impossible or that it could not reasonably require \nthe institution of proceedings abroad. Nor did it explain why it had not applied to the \nauthorities having jurisdiction, in accordance with the provi sions of the Securities Act  \nconcerning interjurisdictional cooperation. As a result, the AMF cannot rely on \nart. 3136.  \n2023 SCC 29 (CanLII)\n\n--- Page 16 ---\n \n  Where the C.C.Q.  does not establish the territorial jurisdiction of a court \nor tribunal and the legislature has not otherwise conferred territorial jurisdiction on it \nthrough special legislation, that must be the end of the analysis.  Unifund  cannot serve \nas a safety net, because it concerns an entirely different situation: it applies once it is \nestablished that a court or tribunal has juri sdiction to deal with a matter. It cannot give \nthe FM",
    "token_count": 1000,
    "start_token": 4500,
    "end_token": 5500,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 6,
    "source_file": "2023scc29.txt",
    "text": " 16 ---\n \n  Where the C.C.Q.  does not establish the territorial jurisdiction of a court \nor tribunal and the legislature has not otherwise conferred territorial jurisdiction on it \nthrough special legislation, that must be the end of the analysis.  Unifund  cannot serve \nas a safety net, because it concerns an entirely different situation: it applies once it is \nestablished that a court or tribunal has juri sdiction to deal with a matter. It cannot give \nthe FMAT territorial jurisdiction over the defendants, who are domiciled outside \nQuebec, in a manner that derogates from the well -developed set of rules in the C.C.Q.  \nThe Unifund  test is therefore of no assist ance to the AMF and cannot ground the \nFMAT’s adjudicative jurisdiction over the defendants in this case . \nCases Cited  \nBy Wagner C.J. and Jamal J.  \n Overruled: Donaldson v. Autorité des marchés financiers , 2020 QCCA \n401; applied:  Unifund Assurance Co. v. Insu rance Corp. of British Columbia , 2003 \nSCC 40, [2003] 2 S.C.R. 63; Canada (Minister of Citizenship and Immigration) v. \nVavilov , 2019 SCC 65, [2019] 4 S.C.R. 653; considered:  Club Resorts Ltd. v. Van \nBreda , 2012 SCC 17, [2012] 1 S.C.R. 572;  referred to:  Spar  Aerospace Ltd. v. \nAmerican Mobile Satellite Corp. , 2002 SCC 78, [2002] 4 S.C.R. 205; Air Canada v. \nMcDonnell Douglas Corp. , [1989] 1 S.C.R. 1554; McCabe v. British Columbia \n(Securities Commission) , 2016 BCCA 7, 394 D.L.R. (4th) 197; Canada Post Corp. v. \nCanadian Union of Postal Workers , 2019 SCC 67, [2019] 4 S.C.R. 900; Society of \nComposers, Authors and Music Publishers of Canada v. Entertainment Software \n2023 SCC 29 (CanLII)\n\n--- Page 17 ---\n \n Association , 2022 SCC 30; Fédération des producteurs acéricoles du Québec v. \nRegroupement pour la commercialisation des produits de l’érable inc. , 2006 SCC 50, \n[2006] 2 S.C.R. 591; Gilles E. Néron Communication Marketing Inc. v. Chambre des \nnotaires du Québec , 2004 SCC 53, [2004] 3 S.C.R. 95; Finney v. Barreau du Québec , \n2004 SCC 36, [2004] 2 S.C.R. 17 ; Prud’homme  v. Prud’homme , 2002 SCC 85, [2002] \n4 S.C.R. 663; Doré v. Verdun (City) , [1997] 2 S.C.R. 862; Montréal (City) v. Octane \nStratégie inc. , 2019 SCC 57, [2019] 4 S.C.R. 138; Peoples Department Stores Inc. \n(Trustee of) v. Wise , 2004 SCC 68, [2004] 3  S.C.R. 461; Lefebvre (Trustee of) , 2004 \nSCC 63, [2004] 3 S.C.R. 326; Quebec (Commission des normes du travail) v. Asphalte \nDesjardins inc. , 2014 SCC 51, [2014] 2 S.C.R. 514 ; Béliveau St -Jacques v. Fédération \ndes employées et employés de services publics i nc., [1996] 2 S.C.R. 345; Quebec \n(Public Curator) v. Syndicat nation al des employés de l’hôpital St -Ferdinand , [1996] \n3 S.C.R. 211; Compagnie d’immeubles Yale ltée v. Kirkland (Ville de) , [1996] R.J.Q. \n502; Dionne v. Commission scolaire des Patriotes , 2014  SCC 33, [2014] 1 S.C.R. 765; \nLalonde v. Sun Life Assurance Co. of Canada , [1992] 3 S.C.R. 261;  City",
    "token_count": 1000,
    "start_token": 5400,
    "end_token": 6400,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 7,
    "source_file": "2023scc29.txt",
    "text": ".R. 211; Compagnie d’immeubles Yale ltée v. Kirkland (Ville de) , [1996] R.J.Q. \n502; Dionne v. Commission scolaire des Patriotes , 2014  SCC 33, [2014] 1 S.C.R. 765; \nLalonde v. Sun Life Assurance Co. of Canada , [1992] 3 S.C.R. 261;  City of Ottawa v. \nTown of Eastview , [1941] S.C.R. 448;  Gignac v. Gauvin , 2009 QCCS 524, 73 C.C.P.B. \n47; Dell Computer Corp. v. Union des consommateurs , 2007 SCC  34, [2007] 2 S.C.R. \n801; Barer v. Knight Brothers LLC , 2019 SCC 13, [2019] 1 S.C.R. 573; Ormuco inc. \nv. Ernst & Young , 2022 QCCA 405 ; Mines d’or Visible inc. v. Zara Resources Inc. , \n2013 QCBDR 95 ; Financière Manuvie v. Proteau , 2013 QCBDR 137 ; Newfoundland \nand Labrador (Attorney General) v. Uashaunnuat (Innu of Uashat and of \nMani -Utenam) , 2020 SCC 4, [2020] 1 S.C.R. 15; St. Lawrence Cement Inc. v. Barrette , \n2008 SCC 64, [2008] 3 S.C.R. 392; Kosoian v. Société de transport de Montréal , 2019 \n2023 SCC 29 (CanLII)\n\n--- Page 18 ---\n \n SCC 5 9, [2019] 4 S.C.R. 335 ; Autorité des marchés financiers v. Dominion Investments \n(Nassau) Ltd. (Dominion Investments Ltd.) , 2008 QCBDRVM 4 ; GreCon Dimter inc. \nv. J.R. Normand inc. , 2005 SCC 46, [2005] 2 S.C.R. 401; Lamborghini (Canada) inc. \nv. Automobili La mborghini S.P.A. , [1997] R.J.Q. 58 ; Anvil Mining Ltd. v. Association \ncanadienne contre l’impunité , 2012 QCCA 117 ; Otsuka Pharmaceutical Company \nLimited v. Pohoresky , 2022 QCCA 1230 ; Droit de la famille — 1830 , 2018 QCCA 24 ; \nDroit de la famille  — 143017 , 2014 QCCA 2188; Ontario College of Pharmacists v. \n1724665 Ontario Inc. , 2013 ONCA 381, 363 D.L.R. (4th) 724; Berger v. Saskatchewan \n(Financial and Consumer Affairs Authority) , 2019 SKCA 89; Torudag v. British \nColumbia  (Securities Commission) , 2011 BCCA 4 58, 343 D.L.R. (4th) 743; Society of \nComposers, Authors and Music Publishers of Canada v. Canadian Assn. of Internet \nProviders , 2004 SCC 45, [2004] 2 S.C.R. 427; British Columbia v. Imperial Tobacco \nCanada Ltd. , 2005 SCC 49, [2005] 2 S.C.R. 473; R. v. Hape , 2007 SCC 26, [2007] 2 \nS.C.R. 292; British Columbia v. Imperial Tobacco Canada Ltd. , 2004 BCCA 269, 239 \nD.L.R. (4th) 412, aff’d 2005 SCC 49, [2005] 2 S.C.R. 473; Morguard Investments Ltd. \nv. De Savoye , [1990] 3 S.C.R. 1077; Beals v. Saldanha , 2003 SCC 72,  [2003] 3 S.C.R. \n416; Libman v. The Queen , [1985] 2 S.C.R. 178; Hunt v. T&N plc , [1993] 4 S.C.R. \n289; Global Securities Corp. v. British Columbia (Securities Commission) , 2000 SCC \n21, [2000] 1 S.C.R. 494.  \nBy Côté J.",
    "token_count": 1000,
    "start_token": 6300,
    "end_token": 7300,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 8,
    "source_file": "2023scc29.txt",
    "text": " SCC 72,  [2003] 3 S.C.R. \n416; Libman v. The Queen , [1985] 2 S.C.R. 178; Hunt v. T&N plc , [1993] 4 S.C.R. \n289; Global Securities Corp. v. British Columbia (Securities Commission) , 2000 SCC \n21, [2000] 1 S.C.R. 494.  \nBy Côté J.  (dissenting)  \n Unifund Assurance Co. v. I nsurance Corp. of British Columbia , 2003 SCC \n2023 SCC 29 (CanLII)\n\n--- Page 19 ---\n \n 40, [2003] 2 S.C.R. 63;  Newfoundland and Labrador (Attorney General) v. \nUashaunn uat (Innu of Uashat and of Mani -Utenam) , 2020 SCC 4, [2020] 1 S.C.R. 15;  \nTransax Technologies inc. v. Red Baron Corp. Ltd , 2016 QCCA 1432; Spar Aerospace \nLtd. v. American Mobile Satellite Corp. , 2002 SCC 78, [2002] 4 S.C.R. 205; Air \nCanada v. McDonnell Douglas Corp. , [1989] 1 S.C.R. 1554; Rosdev Investments Inc. \nv. Allstate Insurance Co. of Canada , [1994] R.J.Q. 2966;  Club R esorts Ltd. v. Van \nBreda , 2012 SCC 17, [2012] 1 S.C.R. 572 ; Lamborghini (Canada) inc. v . Automobili \nLamborghini S.P.A. , [1997] R.J.Q. 58 ; Morguard Investments Ltd. v. De Savoye , \n[1990] 3 S.C.R. 1077; Hunt v. T&N plc , [1993] 4 S.C.R. 289 ; Tolofson v. Jensen , [1994] \n3 S.C.R. 1022;  United States of America v. Harden , [1963] S.C.R. 366 ; Canada Post \nCorp. v. Lépine , 2009 SCC 16, [2009] 1 S.C.R. 549;  Barer v. Knight Brothers LLC , \n2019 SCC 13 , [2019] 1 S.C.R. 573 ; Compagnie d’immeubles Yale ltée v. Kirkland \n(Ville  de), [1996] R.J.Q. 502; Perron -Malenfant v. Malenfant (Trustee of) , [1999] 3 \nS.C.R. 375 ; Lapointe R osenstein Marchand Melançon LLP  v. Cassels Brock & \nBlackwell LLP , 2016 SCC 30, [2016] 1 S.C.R. 851;  Autorité des marchés financiers v. \nFournier , 2012 QCCA 1 179; Donaldson v. Autorité des marchés financiers , 2020 \nQCCA 401;  Fédération des producteurs acéricoles du Québec v. Regroupement pour \nla commercialisation des produits de l’érable inc. , 2006 SCC 50, [2006] 2 S.C.R. 591; \nYared v. Karam , 2019 SCC 62, [2019]  4 S.C.R. 498;  Otsuka Pharmaceutical Company \nLimited v. Pohoresky , 2022 QCCA 1230;  GreCon Dimter inc. v. J.R. Normand inc. , \n2005 SCC 46, [2005] 2 S.C.R. 401 . \nStatutes and Regulations Cite d \n2023 SCC 29 (CanLII)\n\n--- Page 20 ---\n \n Act mainly to improve the regulation of the financial sector, the protection of deposits \nof money and the operation of financial institutions , S.Q. 2018, c. 23, Part IV.  \nAct respecting administrative justice , CQLR, c.  J-3, s. 9. \nAct respecting French, the official and common language of Québec , S.Q. 2022, c.  14. \nAct respecting the Autorité des marchés financiers , CQLR, c.  A-33.2, ss. 93 [am. 2018, \nc. 23, s.  628], 94 [re",
    "token_count": 1000,
    "start_token": 7200,
    "end_token": 8200,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 9,
    "source_file": "2023scc29.txt",
    "text": "  \nAct respecting administrative justice , CQLR, c.  J-3, s. 9. \nAct respecting French, the official and common language of Québec , S.Q. 2022, c.  14. \nAct respecting the Autorité des marchés financiers , CQLR, c.  A-33.2, ss. 93 [am. 2018, \nc. 23, s.  628], 94 [repl. 2018, c.  23, s.  629].  \nAct respecting the regulation of the financial sector , CQLR , c. E-6.1, ss. 93, 94 . \nCharter of human rights and freedoms , CQLR , c. C-12. \nCharter of the French language , CQLR, c.  C-11. \nCivil Code of Québec , preliminary provision, arts. 300, Book Five, 1376, Book Ten, \n3076, Title Three, 3134 to 3154, 3155(6), 3162 , 3164 . \nCode of Civil Procedure , CQLR , c. C-25.01.  \nCode of Penal Procedure , CQLR, c.  C-25.1, art.  142. \nConstitution Act, 1867 , ss. 91, 92 . \nInterpretation Act , CQLR, c.  I-16, ss.  12, 13.  \nRegulation 51 -105 respecting Issuers Quoted in the U.S. Over -the-Counter Markets , \nCQLR, c.  V-1.1, r.  24.1, s.  3. \nRules of the Supreme Court of Canada , SOR/2002 -156, r.  33(2). \nSecurities Act , CQLR , c. V-1.1, ss. 68, Title VII, 195.2, 199.1 , 202, 210,  Title VIII , \n213.1 et seq., 233.2 , 235, 236.1, Title IX, 265, 273.1, 273.3 , Title X, Chapter II , \n307, 307.1 . \nAuthors Cited  \nBaudouin, Jean -Louis, et Pierre -Gabriel Jobin. Les obligations , 7e éd., par \nPierre -Gabriel Jobin et Nathalie Vézina. Cowansville, Que.: Yvon Blais, 2013.  \nBisson, Alain‐François. “La Disposition préliminaire du Code civil du Québec ” (1999), \n44 McGill L.J. 539. \n2023 SCC 29 (CanLII)\n\n--- Page 21 ---\n \n Blom, Joost. “Constitutionalizing Canadian private international law — 25 years since \nMorguard ” (2017), 13 J. Priv. Int’l L.  259. \nBlom, Joost. “Regulation of Contracts in Canadian Private International Law” (2014), \n31 Ariz. J. Int’l & Comp. L.  21. \nBlom , Joost, and Elizabeth Edinger. “The Chimera of the Real and Substantial \nConnection Test” (2005), 38 U.B.C. L. Rev.  373. \nBrierley, John E.  C. “Quebec’s ‘Common Laws’ ( Droits Communs ): How Many Are \nThere?”, in Ernest Caparros et al., eds., Mélanges Louis -Philippe Pigeon . \nMontréal: Wilson & Lafleur, 1989, 109.  \nBrierley, John E.  C., and Roderick A. Macdonald, eds. Quebec Civil Law: An \nIntroduction to Quebec Private Law . Toronto: Emond Montgomery, 1993.  \nBrisson, Jean -Maurice. “Le Code civil, droit commun? ”, dans  Le nouveau Code civil: \ninterprétation et applic ation — Les journées Maximilien -Caron 1992 . Montréal: \nThémis, 1993, 292.  \nBrun, Henri, Guy  Tremblay et Eugénie Brouillet. Droit constitutionnel , 6e éd. \nCowansville, Que.: Yvon Blais, 2014.  \nCornu, Gérard. Droit  civil: Introduction au droit , 13e éd. Paris: Montchrestien, 200",
    "token_count": 1000,
    "start_token": 8100,
    "end_token": 9100,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 10,
    "source_file": "2023scc29.txt",
    "text": "ien -Caron 1992 . Montréal: \nThémis, 1993, 292.  \nBrun, Henri, Guy  Tremblay et Eugénie Brouillet. Droit constitutionnel , 6e éd. \nCowansville, Que.: Yvon Blais, 2014.  \nCornu, Gérard. Droit  civil: Introduction au droit , 13e éd. Paris: Montchrestien, 2007.  \nCôté , Pierre -André, et M athieu Devinat.  Interprétation des lois , 5e éd. Montréal: \nThémis, 2021.  \nDuclos, Cinthia. La protection des épargnants dans l'industrie des services \nd’investissement:  une analyse de l’influence des défaillances organisationnelles \nsous l’angle du Swiss Cheese Model . Montréal: Yvon Blais, 2021.  \nDuclos, Cinthia, avec  la collaboration de Raymonde Crête et Audrey Létourneau. “Les \nautorités d’encadrement”, dans Raymond  Crête  et autres, dir.,  Courtiers et \nconseillers financiers: Encadrement des services de placement . Cowansville, \nQue.: Yvon Blais, 2011, 117.  \nEdinger, Elizabeth, and Vaughan Black. “A New Approach to Extraterritoriality: \nUnifund Assurance Co. v. I.C.B.C. ” (2004) , 40 Can. Bus. L.J.  161. \nEmanuelli, Claude. Droit international privé québécois , 3e éd. Montréal: Wilson & \nLafleur, 2011.  \nEmanuelli, Claude. Étude comparative sur le droit international privé au Canada . \nMontréal: Wilson & Lafleur, 2019.  \nFerland, Patrick, et Guillaume Laganière. “Le droit international privé”, dans \nCollection de droit de l’ École du Barreau du Québec 2023 -2024, vol.  7, Contrats, \n2023 SCC 29 (CanLII)\n\n--- Page 22 ---\n \n sûretés, publicité des droits et droit international privé . Montréal: Yvon Blais, \n2023, 271 . \nGarant, Patrice, avec  la collaboration de Philippe Garant et Jérôme Garant. Droit \nadministratif , 7e éd. Montréal: Yvon Blais, 2017.  \nGlenn, H.  Patrick. “Droit international privé ”, dans La réforme du Code civil , t. 3, \nPriorités et hypothèques, preuve et prescription, publicité des droits, droit \ninternational privé, dispositions transitoires . Textes réunis par le Barreau du \nQuébec et la Chambre  des notaires du Québec. Sainte -Foy, Que.: Presses de \nl’Université Laval, 1993, 669.  \nGlenn, H.  Patrick.  “La Disposition préliminaire du Code civil du Québec , le droit \ncommun et les principes généraux du droit” (2005), 46 C. de D.  339. \nGoldstein, Gérald. Droit international privé , vol.  2, Compétence internationale des \nautorités québécoises et effets  des décisions étrangères (Art.  3134 à 316 8 C.c.Q.) , \ndans Commentaires sur le Code civil du Québec (DCQ). Cowansville, Que.: \nYvon Blais, 2012.  \nGoldstein, Gérald, et Ethel Groffier. Droit international privé , t. I, Théorie générale . \nCowansville, Que.: Yvon Blais, 1998.  \nGuillemard, Sylvette. “Règles  générales de compétence des tribunaux québécois ”, dans \nJurisClasseur Québec — Collection Droit civil — Droit international privé , par \nPierre -Claude Lafond, dir. Montréal: LexisNexis, 2012, fascicule 8 (mis à jour 24 \njuin 2021).  \nGuillemard, Sylvette, et Va n Anh Ly. Éléments de droit international privé québécois . \nMontréal :",
    "token_count": 1000,
    "start_token": 9000,
    "end_token": 10000,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 11,
    "source_file": "2023scc29.txt",
    "text": "cois ”, dans \nJurisClasseur Québec — Collection Droit civil — Droit international privé , par \nPierre -Claude Lafond, dir. Montréal: LexisNexis, 2012, fascicule 8 (mis à jour 24 \njuin 2021).  \nGuillemard, Sylvette, et Va n Anh Ly. Éléments de droit international privé québécois . \nMontréal : Thomson Reuters, 2019.  \nHogg, Peter W., and Wade K.  Wright. Constitutional Law of Canada , 5th ed. Supp. \nToronto: Thomson Reuters, 2023 (updated 2023 , release 1 ). \nHume, Nathan. “Four Flaws: Reflections on the Canadian Approach to Private \nInternational Law” (2006), 44 Can. Y.B. Int’l L.  161. \nKain, Brandon, and Byron Shaw. “Mapping the Serbonian Bog: The Territorial Limits \nof Secondary Market Securities Act Claims Und er the Canadian Constitution — \nPart 1” (2012), 53 Can. Bus. L.J.  63. \nLemieux, Charlotte. “Éléments d’interprétation en droit civil” (1994), 24 R.D.U.S.  221. \nLemieux, Denis. “The Role of the Civil Code of Québec  in Administrative Law” \n(2005), 18 C.J.A.L.P.  143. \n2023 SCC 29 (CanLII)\n\n--- Page 23 ---\n \n Macdonald, Roderick A. “Encoding Canadian  Civil Law”, in Mélanges Paul -André \nCrépeau . Cowansville, Que.:Yvon Blais, 1997, 579.  \nMayrand, Albert. Dictionnaire de maximes et locutions latines utilisées en droit , 4e éd. \nCowansville, Que.: Yvon Blais, 200 7, “specialia generalibus derogant ”. \nMcEvoy, John  P. “Forum of necessity in Quebec Private International Law: C.c.Q. \nart. 3136” (2005), 35 R.G.D.  61. \nQuebec. Ministère de la Justice. Commentaires du ministre de la Justice , t. I, Le Code \ncivil du Québec — Un mouvement de société . Québec: Publications du Québec, \n1993.  \nQuebec. Ministère de la Justice. Commentaires du ministre de la Justice , t. II, Le Code \ncivil du Québec — Un mouvement de société . Québec: Publications du Québec, \n1993.  \nRousseau, Stéphane. “L’a pplication de la législation sur les valeurs mobilières au \nQuébec: une étude du rôle du Tribunal administratif des marchés financiers” \n(2017), 76 R. du B. 1. \nSaumier, Geneviève. “The Recognition of Foreign Judgments in Quebec — The Mirror \nCrack’d?” (2002),  81 Can. Bar Rev.  677. \nSullivan, Ruth. The Construction of Statutes , 7th ed. Toronto: LexisNexis, 2022.  \nWalker, Janet. Canadian Conflict of Laws , 7th  ed. Toronto: LexisNexis, 2023  \n(loose -leaf updated September 2023, release 101 ). \nWalsh, Catherine. “The International Jurisdiction of Québec Authorities in Personal \nActions: An Overview” (2012), 71 R. du B.  249. \n APPEAL S from a judgment of the Quebec Cour t of Appeal ( Marcotte, \nMainville and Moore JJ.A.), 2021 QCCA 1364 , 90 Admin. L.R. (6th) 25, [2021] \nAZ-51794411, [2021] Q.J. No.  10996 (QL), 2021 CarswellQue 14741 (WL), affirming \na decision of Collier  J., 2019 QCCS 94, [201 9] AZ -51562732, [2019] Q.J. No.  175 \n(QL), 2019 CarswellQue 257 (WL) , dismi ssing applications for judicial review of a \ndecision of the Financial Markets Administrative Tribunal, 2017 QCTMF 114, 2017 \n2023 SCC 29 (CanLII)\n\n--- Page 24 ---\n \n LNQCTMF 114 (QL), 201",
    "token_count": 1000,
    "start_token": 9900,
    "end_token": 10900,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 12,
    "source_file": "2023scc29.txt",
    "text": " 94, [201 9] AZ -51562732, [2019] Q.J. No.  175 \n(QL), 2019 CarswellQue 257 (WL) , dismi ssing applications for judicial review of a \ndecision of the Financial Markets Administrative Tribunal, 2017 QCTMF 114, 2017 \n2023 SCC 29 (CanLII)\n\n--- Page 24 ---\n \n LNQCTMF 114 (QL), 2017 CarswellQue 21707 (WL) . Appeal s dismissed , Côté J. \ndissenting . \n Sean Griffin  and Daniel Baum , for  the appellant /intervener  Frederick \nLangford Sharp . \n Patrick Ferland  and Sébastien C. Caron , for the appellants /interveners  \nShawn Van Damme, Vincenzo Antonio Carnovale and Pasquale Antonio Rocca . \n Stéphanie Jolin  and Jean -Nicolas Boutin Wilkins , for the re spondent.  \n Stéphanie Quirion -Cantin  and Stéphane Rochette , for the intervener the \nAttorney General of Quebec.  \n Katrina Gustafson  and Alexandra Matushenko , for the intervener  the \nOntario Securities Commission.  \nThe judgment of Wagner C.J. and Karakatsanis, Rowe, Martin, Kasirer, \nJamal and O’Bonsawin JJ. was delivered by  \n THE CHIEF JUSTICE AND JAMAL J. —  \nI. Overview  \n2023 SCC 29 (CanLII)\n\n--- Page 25 ---\n \n [1] At issue in these appeals is whether a provincial administrative tribunal has \njurisdiction over out -of-province defendants in a securities enforcement proceeding in \nQuebec. The appeals also raise the relationship between the Civil Code of Québec  \n(“C.C.Q. ”) and special statutes under Quebec law.  \n[2] The Financial Markets Administrative Tribunal (“FMAT”), a Quebec \nadministrative tribunal, claims jurisdiction over the appellants, four British Columbia \nresidents who are alleged to have contravened the Quebec Securi ties Act , CQLR, \nc. V-1.1, by engaging in a transnational “pump -and-dump” securities manipulation \nscheme with links to Quebec. In a pump -and-dump scheme, promoters boost the price \nof a stock by releasing false or misleading statements and then profit by sel ling their \nholdings in that stock at inflated prices. The scheme is alleged to have injured investors, \nincluding investors in Quebec.  \n[3] The appellants challenged the FMAT’s jurisdiction over them as out -of-\nprovince defendants. However, the FMAT ruled that it  has jurisdiction over the out -of-\nprovince appellants under s.  93 of the Act respecting the Autorité des marchés \nfinanciers , CQLR, c.  A-33.2,1 which grants the FMAT jurisdiction to make \ndeterminations under the Securities Act . The FMAT interpreted and appl ied this \njurisdictional provision in light of this Court’s decision in Unifund Assurance Co. v. \nInsurance Corp. of British Columbia , 2003 SCC 40, [2003] 2 S.C.R. 63, which held \n                                                 \n1 Amended and renamed the Act respecting the regulation of the financial sector , CQLR, c.  E-6.1 (An \nAct mainly to improve the regulation of the financial sector, the protection of deposits of money and \nthe operation o f financial institutions , S.Q. 2018, c.  23, Part IV) in 2018.  \n2023 SCC 29 (CanLII)\n\n--- Page 26 ---\n \n that a provincial regulatory scheme constitutionally applies to an out -of-provi nce \ndefendant when there is a “real and substantial connection”, also described as a \n“sufficient connection”, between the province and the defendant ( Unifund , at \nparas.  55-56). The FMAT highlighted several factors that, in its view, created such a \nconnecti on between Quebec and the appellants’ alleged contraventions.  \n[4] The Superior Court of Quebec dismissed applications for judicial review \nfrom the FMAT’s decision. On appeal, the Court of Appeal of Quebec affirmed the \nFMAT’s jurisdiction, but the court divided  on the appropriate legal basis for doing so. \nSpeaking for the majority, Marcotte J.A. ruled that the FMAT correctly found a real \nand substantial connection between Quebec and the appellants under the test in \nUnifund . In separate reasons concurring in the result, Mainville J.A",
    "token_count": 1000,
    "start_token": 10800,
    "end_token": 11800,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 13,
    "source_file": "2023scc29.txt",
    "text": " Superior Court of Quebec dismissed applications for judicial review \nfrom the FMAT’s decision. On appeal, the Court of Appeal of Quebec affirmed the \nFMAT’s jurisdiction, but the court divided  on the appropriate legal basis for doing so. \nSpeaking for the majority, Marcotte J.A. ruled that the FMAT correctly found a real \nand substantial connection between Quebec and the appellants under the test in \nUnifund . In separate reasons concurring in the result, Mainville J.A. would have \ngrounded the FMAT’s jurisdiction under Title Three of Book Ten of the C.C.Q. , which \nestablishes rules for the “International Jurisdiction of Québec Authorities”, in particular \nunder art.  3148 para.  1(3) C.C.Q.  — which give s Quebec jurisdiction over personal \nactions of a patrimonial nature in which a fault was committed in Quebec, an injurious \nact or omission occurred in Quebec, or injury was suffered in Quebec — or \nart. 3136  C.C.Q.  — which allows a Quebec authority to hear a dispute even though it \nhas no other basis for jurisdiction if the dispute has a sufficient connection with Quebec \nand taking proceedings abroad is impossible or cannot reasonably be required.  \n2023 SCC 29 (CanLII)\n\n--- Page 27 ---\n \n [5] For the reasons that follow, we conclude that the FMAT has jur isdiction \nover the appellants under the Securities Act  and the Act respecting the Autorité des \nmarchés financiers . \n[6] The C.C.Q. is the starting point in any interpretive exercise involving the \nC.C.Q.  and special laws. The preliminary provision of the C.C.Q.  provides that the \nC.C.Q.  is the jus commune and the foundation of all other laws in Quebec, and that \nother laws may complement or make exceptions to the C.C.Q.  \n[7] In this case, the character of the proceedings and the conclusions sought \nbefore the FMAT could suggest, at first blush, a regulatory matter that does not concern \nthe C.C.Q.  The dispute involves a public regulator seeking prohibitions and \nadministrative penalties under a legislative scheme designed to protect the public \ninterest in the securities mar kets. One might indeed expect jurisdiction over this \nregulatory scheme to stand outside the scope of Quebec’s law of general application \nestablished by the C.C.Q. , which mainly governs “persons, relations between persons, \nand property” (preliminary provisi on). But securities law, as enacted by the Quebec \nSecurities Act , is of a hybrid character. On the one hand, the Securities Act  has \nenforcement and administrative law rules in place to protect the public interest that give \nthe legislation a fundamentally r egulatory orientation. On the other hand, the Securities \nAct also has a title bearing on civil actions (Title VIII). While the FMAT’s jurisdiction \nbears principally on the regulatory orientation of the Securities Act , its authority \nestablished by the Act r especting the Autorité des marchés financiers  extends to the \n2023 SCC 29 (CanLII)\n\n--- Page 28 ---\n \n title on civil actions in the Securities Act , except where excluded by law. Given this \nhybrid character of securities regulation, the better view is that Book Ten of the C.C.Q. , \nas part of Quebec’s jus commune , is the appropriate starting point for analyzing the \n“International Jurisdiction of Québec Authorities” in this field, including the FMAT.  \n[8] This calls for a review of the general and special rules in the C.C.Q.  to \ndetermine  whether the FMAT has jurisdiction over the out -of-province defendants in \nthis case. We conclude that the C.C.Q. ’s rules on private international law are \napplicable. However, here they provide no basis for jurisdiction over the out -of-\nprovince defendants, whether under art.  3134 C.C.Q. , which sets out the residual rule \nbased on domicile in Quebec, art.  3148 C.C.Q. , which specifies the cases in which \nQuebec authorities have jurisdiction over personal actions of a patrimonial nature, or \nart. 3136 C.C.Q. , whic h allows a Quebec authority to hear a dispute despite having no \njurisdiction provided the dispute has a sufficient connection with Quebec and taking \nproceedings abroad is impossible or cannot reasonably be required.  \n[9] Even so, we conclude that the FMAT has j urisdiction over the appellants \nunder Quebec securities legislation. The Act respecting the Autorité des marchés \nfinanciers  provides the FMAT with jurisdiction to make determinations under the \nSecurities Act , including when there is",
    "token_count": 1000,
    "start_token": 11700,
    "end_token": 12700,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 14,
    "source_file": "2023scc29.txt",
    "text": " allows a Quebec authority to hear a dispute despite having no \njurisdiction provided the dispute has a sufficient connection with Quebec and taking \nproceedings abroad is impossible or cannot reasonably be required.  \n[9] Even so, we conclude that the FMAT has j urisdiction over the appellants \nunder Quebec securities legislation. The Act respecting the Autorité des marchés \nfinanciers  provides the FMAT with jurisdiction to make determinations under the \nSecurities Act , including when there is a “real and substantial  connection” between \nQuebec and out -of-province defendants. In our view, the allegations that the appellants \nused Quebec as the “face” of their securities manipulation and injured Quebec investors \nestablish such a connection to give the FMAT jurisdiction o ver the appellants.  \n2023 SCC 29 (CanLII)\n\n--- Page 29 ---\n \n [10] Put another way, the Quebec securities legislation constitutionally applies \nto the appellants. The Quebec legislature has exercised its prescriptive legislative \njurisdiction — its power to enact binding rules applicable to out -of-provi nce parties \nwith a real and substantial connection to Quebec. Those rules are engaged in the \ncircumstances of this case. As a result, the FMAT also has adjudicatory jurisdiction , \nor the authority to hear this matter involving the appellants.  \n[11] We would thus  affirm the FMAT’s jurisdiction and dismiss the appeals.  \nII. Background  \n[12] The respondent Autorité des marchés financiers (“AMF”) is an \nadministrative agency that regulates Quebec’s financial sector. It brought an \noriginating pleading before the FMAT alleging tha t the appellants, who are four British \nColumbia residents, contravened the Quebec Securities Act  by participating in a \ntransnational pump -and-dump scheme with links to Quebec that injured investors.  \n[13] The AMF alleged that the appellants committed contraventi ons of \nQuebec’s Securities Act  by improperly or fraudulently influencing the market price or \nthe value of securities (s.  195.2), and by knowingly participating in securities \ntransactions that created an artificial security price (s.  199.1). The AMF asked t he \nFMAT to order the appellants to cease engaging in securities transactions (s.  265) and \nto prohibit them from acting as directors or officers of an issuer, dealer, adviser, or \n2023 SCC 29 (CanLII)\n\n--- Page 30 ---\n \n investment fund manager for five years (s.  273.3). The AMF also asked the FMAT  to \nimpose administrative penalties on the appellants (s.  273.1).  \n[14] The FMAT’s function includes making determinations regarding matters \nrelating to the Act respecting the Autorité des marchés financiers  as well as under a \nrange of Quebec legislation, includ ing the Securities Act . The FMAT [ TRANSLATION ] \n“is an independent administrative tribunal specializing in securities that performs \ndecision -making functions” (S.  Rousseau, “L’application de la législation sur les \nvaleurs mobilières au Québec: une étude du rôle du Tribunal administratif des marchés \nfinanciers” (2017), 76 R. du B.  1, at p.  14). The FMAT exercises its discretion “in the \npublic interest” ( Act respecting the Autorité des marchés financiers , s. 93). \n[15] The appellants filed motions for a declinatory exception challenging the \nFMAT’s jurisdiction over them as out -of-province defendants. On such a motion, the \ndecision maker does not consider the merits of the case, but assumes the facts alleged \nto be true and asks whether these facts would bring the matt er within its jurisdictional \ncompetence. The decision maker also refrains from evaluating the parties’ evidence, \nunless the facts alleged are specifically contested ( Spar Aerospace Ltd. v. American \nMobile Satellite Corp. , 2002 SCC 78, [2002] 4 S.C.R. 205, at paras.  31-32; Air Canada \nv. McDonnell Douglas Corp. , [1989] 1 S.C.R. 1554, at p.  1558). In this case, the facts \nalleged are uncontested, and thus are assumed to be true for the purposes of the \njurisdictional challenges.  \n2023 SCC 29 (CanLII)\n\n--- Page 31 ---\n \n [16] None of the appellants specifical ly alleges that they were improperly \nserved. The FMAT held a special hearing, which the appellants did not attend, at",
    "token_count": 1000,
    "start_token": 12600,
    "end_token": 13600,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 15,
    "source_file": "2023scc29.txt",
    "text": ". 1554, at p.  1558). In this case, the facts \nalleged are uncontested, and thus are assumed to be true for the purposes of the \njurisdictional challenges.  \n2023 SCC 29 (CanLII)\n\n--- Page 31 ---\n \n [16] None of the appellants specifical ly alleges that they were improperly \nserved. The FMAT held a special hearing, which the appellants did not attend, at which \nit authorized the AMF to serve the appellants Frederick Langford Sharp, Vincenzo \nAntonio Carnovale, and Pasquale Antonio Rocca with the AMF’s originating pleading \nand notice of hearing by publication of a press release on the AMF’s website.  \n[17] The AMF alleged that the appellants’ securities manipulation scheme had \nseveral links to Quebec. The appellants’ alleged activities revolved around  the \npromotion of a shell company named Solo International, Inc., which was incorporated \nin Nevada in the United States in April 2010 to offer interior design services, and whose \nshares traded in the over -the-counter (“OTC”) market in New York. In October 2011, \nMichel Plante, a Quebec resident, acquired three million shares in Solo and became its \nmajority shareholder, taking control of both Solo and its Quebec subsidiary. Because \nSolo was traded on the OTC market and was directed or administered in or from \nQuebec after July 31, 2012, Solo was a reporting issuer and subject to continuous \ndisclosure and other obligations under the Quebec Securities Act  (s. 68; Regulation 51 -\n105 respecting Issuers Quoted in the U.S. Over -the-Counter Markets , CQLR, c. V -1.1, \nr. 24.1, s.  3). It is also alleged to have had a place of business in Montréal.  \n[18] Although Plante had no experience in the mining industry, in late 2011 \nSolo bought mining claims in Quebec through its subsidiary, with financing from \noffshore entities linked to  the appellants. Most of Solo’s original shares were \ntransferred to offshore entities linked to the appellants.  \n2023 SCC 29 (CanLII)\n\n--- Page 32 ---\n \n [19] The AMF alleged that Solo engaged in two pump -and-dump operations. In \nthe first “pump” operation, which occurred in January and February 2012, S olo \npublished six press releases, some of which were issued in Montréal, advertising Solo’s \nmining exploration activities in Quebec. The appellant Shawn Van Damme helped \nwrite these press releases and partly financed the publicity campaign through one of \nhis offshore entities. These promotional efforts led Solo’s stock price to increase, even \nthough Solo had not advanced its mining activities. The appellants, acting through their \noffshore entities, then sold, or “dumped”, over 2.7 million Solo shares for a profit of \nabout $400,000.  \n[20] In the second “pump” operation, which occurred on November 14, 2012, \neight promoters marketed Solo’s shares, even though Solo remained essentially \ninoperative. The appellants Van Damme, Carnovale, and Rocca financed this \npromotion al effort through their offshore entities. The appellants, again acting through \ntheir offshore entities, then sold, or “dumped”, over 43 million Solo shares for a profit \nof more than $2.2  million.  \n[21] According to the AMF, the appellants’ pump -and-dump scheme proceeded \nin five steps. The appellants acted in concert to (1) acquire the shares of Solo, (2) give \nSolo a legitimate “face”, (3) promote Solo’s business, (4) sell their shares for a profit, \nand (5) distribute this profit among themselves. The AMF alleged  that each appellant \nwas involved in one or more of these steps and that the scheme had several ties to \nQuebec sufficient to apply Quebec’s securities regulatory scheme to them: Solo was a \n2023 SCC 29 (CanLII)\n\n--- Page 33 ---\n \n reporting issuer in Quebec with a Montréal business address; Plante , who directed Solo, \nwas a Quebec resident when the scheme was implemented; Solo’s promotional \nactivities were accessible to Quebec residents; and, ultimately, 15 Quebec investors \nlost a total of $5,000.  \nIII. Decisions Below  \nA. Financial Markets Administrative Tribunal, 2017 QCTMF 114 (Jean -Pierre \nCristel)  \n[22] The FMAT ruled that it had jurisdiction over the appellants under s",
    "token_count": 1000,
    "start_token": 13500,
    "end_token": 14500,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 16,
    "source_file": "2023scc29.txt",
    "text": " business address; Plante , who directed Solo, \nwas a Quebec resident when the scheme was implemented; Solo’s promotional \nactivities were accessible to Quebec residents; and, ultimately, 15 Quebec investors \nlost a total of $5,000.  \nIII. Decisions Below  \nA. Financial Markets Administrative Tribunal, 2017 QCTMF 114 (Jean -Pierre \nCristel)  \n[22] The FMAT ruled that it had jurisdiction over the appellants under s.  93 of \nthe Act respecting the Autorité des marchés financiers , which grants the FMAT \njurisdiction to make determinations under the Quebec Securities Act . The FMAT cited \nand applied the British Columbia Court of Appeal’s decision in  McCabe v. British \nColumbia (Securities Commission) , 2016 BCCA 7 , 394 D.L.R. (4th) 197 , at \nparas.  34-37 and 47, on the “sufficient connection” required to apply pr ovincial \nsecurities legislation in an enforcement proceeding with transnational elements, which \nin turn had cited and applied this Court’s decision in Unifund . There was a real and \nsubstantial connection between the appellants’ alleged securities contraven tions and \nQuebec because the appellants participated and profited from a pump -and-dump \nscheme with several links to Quebec: (1) Solo was a reporting issuer in Quebec with a \nbusiness office in Montréal, (2) Solo’s president, Plante, was a Quebec resident, a nd \n(3) Solo’s misleading press releases and online promotions were provided to Quebec \ninvestors, some of whom were defrauded. The FMAT said that even though the \n2023 SCC 29 (CanLII)\n\n--- Page 34 ---\n \n appellants were out -of-province residents and allegedly participated in the scheme \nthrough offs hore entities, it could not ignore the contemporary reality of global and \ninterconnected markets. This reality enhances the opportunities for market \nmanipulation linked to more than one jurisdiction, and challenges regulators in \ndetecting and investigating  securities offences.  \n[23] The FMAT also dismissed the appellants’ argument that Quebec is forum \nnon conveniens under art.  3135 C.C.Q.  It found insufficient evidence to conclude that \nanother forum would be better placed to decide the matter and determined that it would \nnot be in the public interest to decline jurisdiction. The FMAT thus dismissed the \nappellants’ motions for a declinatory exception.  \nB. Superior Court of Quebec, 2019 QCCS 94 (Collier J.)  \n[24] The Superior Court of Quebec dismissed the appellants’ applicat ions for \njudicial review and held that the FMAT properly assumed jurisdiction. The court ruled \nthat since the FMAT’s decision was both reasonable and correct, it did not need to \ndetermine the applicable standard of review (para.  30 (CanLII)).  \n[25] The court sta ted (at para.  36) that the FMAT correctly recognized the limits \nof its extraterritorial reach by applying the “real and substantial connection” test, which \nthe court noted was addressed in Club Resorts Ltd. v. Van Breda , 2012 SCC 17, [2012] \n1 S.C.R. 572. T he court also ruled that the FMAT correctly applied the Unifund  test for \nthe constitutional applicability of provincial legislation (paras.  39-43). The FMAT \n2023 SCC 29 (CanLII)\n\n--- Page 35 ---\n \n recognized the limits of its territorial reach and was correct in finding a real and \nsubstantial co nnection between Quebec and the facts alleged against the appellants.  \n[26] The court also stated that the private international law rules in the C.C.Q. \nreinforced its conclusion (para.  44). The publication of misleading press releases could \nconstitute a fault i n Quebec that injured Quebec investors. Under art.  3148 para.  1(3) \nC.C.Q. , the fault or injury would provide Quebec authorities with jurisdiction in matters \nof a personal and patrimonial nature. While the court was of the view that the matter \nlay within th e “public regulatory sphere” (para. 44), the alleged fault and injury in \nQuebec, including harm to the Quebec securities market by undermining investor \nconfidence, supported the real and substantial connection between Quebec and the \nappellants.  \nC. Court of Ap peal of Quebec, 2021 QCCA 1364, 90 Admin. L.R. (6th) 25  (Marcotte \n",
    "token_count": 1000,
    "start_token": 14400,
    "end_token": 15400,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 17,
    "source_file": "2023scc29.txt",
    "text": " court was of the view that the matter \nlay within th e “public regulatory sphere” (para. 44), the alleged fault and injury in \nQuebec, including harm to the Quebec securities market by undermining investor \nconfidence, supported the real and substantial connection between Quebec and the \nappellants.  \nC. Court of Ap peal of Quebec, 2021 QCCA 1364, 90 Admin. L.R. (6th) 25  (Marcotte \nand Moore JJ.A. , Mainville J.A. Concurring)  \n(1) Majority  \n[27] Writing for the majority of the Court of Appeal of Quebec, Marcotte  J.A. \ndismissed the appeal and affirmed the FMAT’s jurisdiction over t he appellants. The \nmajority identified the standard of review as correctness (paras.  45-47). The question \nof whether the FMAT has jurisdiction over the appellants raises a constitutional issue. \nThe test in Unifund  addresses the constitutional applicability  of the Quebec securities \nscheme to non -residents who allegedly engaged in a securities manipulation scheme \n2023 SCC 29 (CanLII)\n\n--- Page 36 ---\n \n with connections to Quebec. The majority added that insofar as the appellants assert \nfor the first time on appeal that the FMAT failed to consider t he private international \nlaw rules of the C.C.Q. , the applicability of those rules raises an issue of central \nimportance to the legal system, and is therefore also reviewable for correctness \n(para.  48). \n[28] The majority noted that although none of the applicab le provisions of the \nQuebec securities scheme expressly places limits upon territorial reach, all are \npresumed to apply within the province (para.  56). In the majority’s view, there is no \nextraterritorial jurisdiction of the FMAT at issue (para.  57). The o nly issue is whether \nthe FMAT has territorial jurisdiction over the out -of-province appellants for alleged \nconduct sufficiently connected to Quebec (paras.  87-88). \n[29] The majority rejected the appellants’ argument that the private \ninternational law rules in B ook Ten of the C.C.Q.  exhaustively determine whether a \nQuebec authority such as the FMAT has jurisdiction over out -of-province parties \n(paras.  65-92). The majority ruled that although the C.C.Q.  acts as suppletive law for \nmany matters, including certain as pects of public law, the private international law \nrules in Book Ten of the C.C.Q.  do not apply when no private rights are at issue \n(para.  70). Book Ten of the C.C.Q.  does not determine jurisdiction in matters of public \nor criminal law where the primary ba sis of jurisdiction is neither personal nor real but \nterritorial, such as in this case (para.  71). The majority saw no conflict of jurisdiction \nor any conflict of laws that would require the application of private international law \n2023 SCC 29 (CanLII)\n\n--- Page 37 ---\n \n rules to this case (para s. 63 and 78). Instead, the FMAT simply seeks to exercise its \njurisdiction to make determinations under the Securities Act , pursuant to the Act \nrespecting the Autorité des marchés financiers  (para.  78). \n[30] The majority ruled (at paras.  94-117) that the FMAT c orrectly concluded \nthere is a real and substantial connection between Quebec and the appellants under the \nsufficient connection test in Unifund . The appellants used Quebec as the “face” of their \npump -and-dump scheme, a large part of which occurred in Quebe c through misleading \npress releases allowing them to manipulate the stock price of a Quebec -based \ncorporation holding mining claims in the province (paras.  113-14). Given these \nallegations and in view of the modern reality of global and interconnected secu rities \nmarkets, the greater opportunities for market manipulation in such a context, and the \npublic interest, the FMAT properly assumed jurisdiction (paras.  115-16). \n(2) Concurrence  \n[31] Mainville J.A. concurred with the majority in the result, but he disagreed \nwith the majority’s conclusion that the private international law rules in Title Three of \nBook Ten of the C.C.Q.  for the international jurisdiction of Quebec authorities are \nneither relevant nor applicable (para.  120). Those rules apply to “Québec Authorities ”, \nwhich include administrative tribunals such as the FMAT, and apply whether or not \n",
    "token_count": 1000,
    "start_token": 15300,
    "end_token": 16300,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 18,
    "source_file": "2023scc29.txt",
    "text": ") Concurrence  \n[31] Mainville J.A. concurred with the majority in the result, but he disagreed \nwith the majority’s conclusion that the private international law rules in Title Three of \nBook Ten of the C.C.Q.  for the international jurisdiction of Quebec authorities are \nneither relevant nor applicable (para.  120). Those rules apply to “Québec Authorities ”, \nwhich include administrative tribunals such as the FMAT, and apply whether or not \nthere is a conflict of jurisdiction (paras.  135-37). \n2023 SCC 29 (CanLII)\n\n--- Page 38 ---\n \n [32] Mainville J.A. stated that Unifund  highlighted that the “sufficient \nconnection” test for the constitutional applicabil ity of a provincial law is not necessarily \nsubsumed in the common law “real and substantial connection” test for the court of a \nprovince to take jurisdiction over a dispute, which is a rule of private international law \n(para.  125). He noted that this case raises both (1) the question of the constitutional \napplicability of the Securities Act , and (2) whether the FMAT has jurisdiction over the \nout-of-province appellants under the rules of private international law, which is \naddressed mainly, if not exclusivel y, by Title Three of Book Ten of the C.C.Q.  \n(para.  126).  \n[33] In Mainville J.A.’s view, the FMAT has jurisdiction over the appellants \nunder art.  3148 para.  1(3) C.C.Q. , which provides that Quebec authorities have \njurisdiction in personal actions of a patrimonia l nature when a fault was committed in \nQuebec, an injurious act or omission occurred in Quebec, or injury was suffered in \nQuebec (para.  144). He determined that this provision applies by analogy because this \naction  resembles a personal action of a patrimon ial nature. The fault requirement would \nbe met by the allegation that misleading press releases were published in Quebec and \nthe injury requirement would be met by the allegations that investors incurred harm in \nQuebec.  \n[34] Alternatively, Mainville J.A. would have affirmed the FMAT’s jurisdiction \nover the appellants under art.  3136 C.C.Q. , which provides that even though a Quebec \nauthority has no jurisdiction to hear a dispute, it may nevertheless hear it provided the \n2023 SCC 29 (CanLII)\n\n--- Page 39 ---\n \n dispute has a sufficient connection with Qu ebec and if proceedings abroad prove \nimpossible or cannot be reasonably required (paras.  152-56). In Mainville J.A.’s view, \nthis case meets the sufficient connection requirement of both art.  3136 C.C.Q.  and the \nConstitution because of the connections betwe en the pump -and-dump scheme and \nQuebec (para.  156). The second condition of art.  3136 C.C.Q.  is also met, because there \nwas no evidence that authorities of another state could make a decision in this case \n(paras.  157-59). \nIV. Issues  \n[35] The main issues in these ap peals are (1) the standard of review of the \nFMAT’s decision that it has jurisdiction over the appellants and (2) whether the FMAT \nproperly assumed jurisdiction.  \nV. Analysis  \nA. The Standard of Review  \n[36] The parties agree that under the framework established by this Court in \nCanada (Minister of Citizenship and Immigration) v. Vavilov , 2019 SCC 65, [2019] 4 \nS.C.R. 653, the standard of review of the FMAT’s decision is correctness.  \n[37] Although presumptively the standard of review when a court reviews the \nmerits of an administrative decision is reasonableness, this presumption is rebutted \n2023 SCC 29 (CanLII)\n\n--- Page 40 ---\n \n when the legislature explicitly prescribes the applicable standard of review or when the \nrule of law requires that the standard  of correctness be applied ( Vavilov , at paras.  16-17; \nCanada Post Corp. v. Canadian Union of Postal Workers , 2019 SCC 67, [2019] 4 \nS.C.R. 900, at para.  27). The rule of law is implicated in cases involving constitutional \nquestions, general questions of law  of central importance to the legal system as a whole, \nand questions related to the jurisdictional boundaries between two or more \nadministrative bodies ( Vavilov , at para.  17). The standard",
    "token_count": 1000,
    "start_token": 16200,
    "end_token": 17200,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 19,
    "source_file": "2023scc29.txt",
    "text": " Post Corp. v. Canadian Union of Postal Workers , 2019 SCC 67, [2019] 4 \nS.C.R. 900, at para.  27). The rule of law is implicated in cases involving constitutional \nquestions, general questions of law  of central importance to the legal system as a whole, \nand questions related to the jurisdictional boundaries between two or more \nadministrative bodies ( Vavilov , at para.  17). The standard of correctness also applies \n“when courts and administrative bodies have concurrent first instance jurisdiction over \na legal issue in a statute” ( Society of Composers, Authors and Music Publishers of \nCanada v. Entertainment Software Association , 2022 SCC 30, at para.  28). \n[38] Here, the FMAT’s jurisdiction over the out -of-provi nce appellants raises a \nconstitutional issue regarding the territorial reach of provincial legislation. The FMAT \naddressed its jurisdiction by examining whether the securities scheme constitutionally \napplies to the appellants under the test in Unifund , whi ch asks whether there is a \n“sufficient connection” between Quebec and the appellants to support the application \nof Quebec’s securities regulatory scheme (paras.  55-56). This constitutional question \nis reviewable for correctness under the Vavilov  framework.2 \n[39] Even assuming, as the appellants contend, that the question of the FMAT’s \njurisdiction over out -of-province parties is to be resolved by applying Title Three of \n                                                 \n2 The appellants did not file a notice of constitutional question in this Court under the Rules of the \nSupreme Court of Canada , SOR/2002 -156, r. 33(2), presumably because their position is that the \nC.C.Q.  governs whether the FMAT has jurisdiction over them, and thus they did not ask for the \nQuebec securities scheme  to be found constitutionally inapplicable.  \n2023 SCC 29 (CanLII)\n\n--- Page 41 ---\n \n Book Ten of the C.C.Q.  — an argument raised for the first time before the Quebec \nCourt of App eal — that question is still reviewable for correctness because it raises a \ngeneral question of law of central importance to the legal system as a whole. Whether \nthe C.C.Q.  grants the FMAT jurisdiction over out -of-province parties in the \ncircumstances invo lves the methodology for determining the relationship between the \nC.C.Q.  as the jus commune , or general law, and special statutes in Quebec. This is a \ngeneral question of law that requires a uniform and consistent answer because it has \nimplications for man y other statutes ( Vavilov , at paras.  59-62). We address that issue \nnext.  \nB. The Relationship Between the C.C.Q. and Special Statutes  \n[40] The majority and concurring reasons in the Quebec Court of Appeal reflect \ndifferent methodologies for determining when the C.C.Q. establishes the international \njurisdiction of an administrative tribunal over out -of-province defendants. More \ngenerally, they articulate different conceptions of the relationship between the C.C.Q. , \nas the jus commune , and special statutes targeting p articular subjects relating to private \ninternational law. The majority reasoned that the question before the court concerns the \nconstitutional applicability of the Quebec securities scheme to out -of-province parties, \nrather than private international law, and thus the FMAT’s jurisdiction should be \ndetermined by applying the real and substantial connection test in Unifund (paras.  63 \nand 90-91). The majority also concluded that the private international law rules of Title \nThree of Book Ten of the C.C.Q.  do no t apply to determine the FMAT’s jurisdiction \n2023 SCC 29 (CanLII)\n\n--- Page 42 ---\n \n because (1) no private rights are at issue before the FMAT (paras.  70-71), and (2) there \nis no conflict of jurisdiction or any conflict of law that calls for applying private \ninternational law rules (para.  78). By contrast, the concurrence concluded that (1) the \nrules in Title Three of Book Ten of the C.C.Q.  apply to all “Québec Authorities”, \nincluding administrative tribunals such as the FMAT in respect of actions pertaining to \nQuebec’s constitutional jurisdicti on over property and civil rights (paras.  135-36), (2) \nwhether or not there is a conflict of jurisdiction (para.  137), and (3) whether or not an \naction pertains to matters in the C.C.Q. (para.  142",
    "token_count": 1000,
    "start_token": 17100,
    "end_token": 18100,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 20,
    "source_file": "2023scc29.txt",
    "text": " C.C.Q.  apply to all “Québec Authorities”, \nincluding administrative tribunals such as the FMAT in respect of actions pertaining to \nQuebec’s constitutional jurisdicti on over property and civil rights (paras.  135-36), (2) \nwhether or not there is a conflict of jurisdiction (para.  137), and (3) whether or not an \naction pertains to matters in the C.C.Q. (para.  142).  \n[41] This section addresses this methodological debate by cons idering the \nrelationship between the C.C.Q.  and special statutes. As will be elaborated, the C.C.Q. , \nas stated in the preliminary provision, “lays down the jus commune ”, or law of general \napplication, “in all matters within the letter, spirit or object of its provisions” which \nmainly govern “persons, relations between persons, and property”. For these matters, \nthe C.C.Q.  is the “foundation of all other laws”. Accordingly, for such matters, \ninterpretive exercises must begin with the C.C.Q. , although special legislation can \nderogate from the C.C.Q.  when the legislature expresses its intention to do so and, of \ncourse, some of the law of general application may be found outside the C.C.Q.  in \ngeneral principles of law. Contrary to the conclusion of the majority o f the Court of \nAppeal, provisions of Title Three of Book Ten of the C.C.Q.  can, in principle, apply to \nan administrative tribunal like the FMAT, even if no private right is in issue and even \nif no conflict of jurisdiction arises, as long as these parameter s of the jus commune  \nalluded to in the preliminary provision are met. However, as we elaborate in later \n2023 SCC 29 (CanLII)\n\n--- Page 43 ---\n \n sections, while the C.C.Q.  does not grant the FMAT jurisdiction over the out -of-\nprovince appellants in this case, the jurisdictional provisions of the s pecial securities \nscheme, properly interpreted in light of Unifund , do grant jurisdiction because the \nappellants, and their alleged contraventions, have a sufficient connection to Quebec.  \n(1) The Preliminary Provision of the C.C.Q.  \n[42] The starting point for under standing the relationship between the C.C.Q.  \nand special statutes is the preliminary provision of the C.C.Q. :  \nThe Civil Code of Québec, in harmony with .  . . the Charter of human \nrights and freedoms .  . . and the general principles of law, governs persons , \nrelations between persons, and property.  \n \nThe Civil Code comprises a body of rules which, in all matters within the \nletter, spirit or object of its provisions, lays down the jus commune , \nexpressly or by implication. In these matters, the Code is the foun dation of \nall other laws, although other laws may complement the Code or make \nexceptions to it.3 \n[43] Several aspects of the preliminary provision elucidate the relationship \nbetween the C.C.Q.  and special statutes.  \n(a) The C.C.Q. Lays Down the Jus Commune  \n                                                 \n3 The preliminary provision of the C.C.Q. was amended on June 1, 2022 by the Act respecting French, \nthe official and common language of Québec , S.Q. 2022, c. 14, to add a reference to the Charter of the \nFrench language , CQLR , c. C-11. The preliminary provision is cited here as it read at the time the \nFMAT decision was rendered.  \n2023 SCC 29 (CanLII)\n\n--- Page 44 ---\n \n [44] First, the preliminary provision announces that the C.C.Q.  “lays down the \njus commune ”, or the law of general application, of Quebec “in all matters within the \nletter, spirit or object of its provisions”, which mainly govern “persons, relations \nbetween per sons, and property” (see also Fédération des producteurs acéricoles du \nQuébec v. Regroupement pour la commercialisation des produits de l’érable inc. , 2006 \nSCC 50, [2006] 2 S.C.R. 591, at para.  10; Gilles E. Néron Communication Marketing \nInc. v. Chambre de s notaires du Québec , 2004 SCC 53, [2004] 3 S.C.R. 95, at para.  56; \nFinney v. Barreau du Québec , 2004 SCC 36, [2004] 2 S.C.R. 17, at",
    "token_count": 1000,
    "start_token": 18000,
    "end_token": 19000,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 21,
    "source_file": "2023scc29.txt",
    "text": " [2006] 2 S.C.R. 591, at para.  10; Gilles E. Néron Communication Marketing \nInc. v. Chambre de s notaires du Québec , 2004 SCC 53, [2004] 3 S.C.R. 95, at para.  56; \nFinney v. Barreau du Québec , 2004 SCC 36, [2004] 2 S.C.R. 17, at para.  26; see also \nJ.-M. Brisson, “Le Code civil, droit commun?”, in Le nouveau Code civil: \ninterprétation et application — Les journées Maximilien -Caron 1992  (1993), 292, at \npp. 308-15). Thus, the C.C.Q.  does not simply lay down rules of private law on a \nnarrow compass ( Prud’homme  v. Prud’homme , 2002 SCC 85, [2002] 4 S.C.R. 663 , at \npara.  28).  \n(b) The C.C.Q. Has a Suppletive Role  \n[45] Second, as the jus commune , the C.C.Q.  “is the foundation of all other laws, \nalthough other laws may complement the [ C.C.Q. ] or make exceptions to it”. The \nC.C.Q.  has a suppletive role and can fill gaps in special statutes to the extent that \nlegislation i s silent on a given matter, thus preventing a legal vacuum ( Fédération des \nproducteurs , at paras.  10 and 29; see also Doré v. Verdun (City) , [1997] 2 S.C.R. 862, \nat para.  18; Montréal (City) v. Octane Stratégie inc. , 2019 SCC 57, [2019] 4 S.C.R. \n138, at pa ra. 36; A. -F. Bisson, “La Disposition préliminaire du Code civil du Québec ” \n2023 SCC 29 (CanLII)\n\n--- Page 45 ---\n \n (1999), 44 McGill L.J.  539, at p.  558; H. P. Glenn, “La Disposition préliminaire du \nCode civil du Québec , le droit commun et les principes généraux du droit” (2005), 46 \nC. de D. 339, at p.  349). The suppletive nature of the C.C.Q. flows from its \nfoundational character, as confirmed by the preliminary provision. As elucidated by the \nMinistère de la Justice, Commentaires du ministre de la Justice , vol. I, Le Code civil \ndu Québec  — Un mouvement de société  (1993), at p.  1, one objective of the second \nparagraph of the preliminary provision [TRANSLATION ] “is to promote a dynamic \ninterpretation of the Civil Code and encourage the use of its provisions to interpret and \napply other legislation and fill any gaps in that legislation, where it relates to matters \nor makes use of concepts or institutions that come under the Civil Code. ” \n[46] For example, the C.C.Q.  plays a suppletive role in the domains of corporate \nlaw ( Peoples Department Sto res Inc. (Trustee of) v. Wise , 2004 SCC 68, [2004] 3 \nS.C.R. 461, at paras. 29 and 54), insolvency law ( Lefebvre (Trustee of) , 2004 SCC 63, \n[2004] 3 S.C.R. 326, at para.  16), and employment law ( Quebec (Commission des \nnormes du travail) v. Asphalte Desjardi ns inc. , 2014 SCC 51, [2014] 2 S.C.R. 514, at \nparas.  28-32), among other areas. Such suppletive rules apply absent a legislative \nintention to exclude them (J.  E. C. Brierley, “Quebec’s ‘Common Laws’ ( Droits \nCommuns ): How Many Are There?”, in E. Caparros et  al., eds., Mélanges \nLouis -Philippe Pigeon  (1989), 109, at p.  126; R. A. Macdonald, “Encoding Canadian  \nCivil Law”, in Mélanges Paul -André Crépeau  (1997), 579, at pp.  595-96 and 599).  \n(c)",
    "token_count": 1000,
    "start_token": 18900,
    "end_token": 19900,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 22,
    "source_file": "2023scc29.txt",
    "text": " Droits \nCommuns ): How Many Are There?”, in E. Caparros et  al., eds., Mélanges \nLouis -Philippe Pigeon  (1989), 109, at p.  126; R. A. Macdonald, “Encoding Canadian  \nCivil Law”, in Mélanges Paul -André Crépeau  (1997), 579, at pp.  595-96 and 599).  \n(c) All Interpretive Exercises of Laws Governing Persons, Relations Between \nPersons, and Property Must Begin With the C.C.Q.  \n2023 SCC 29 (CanLII)\n\n--- Page 46 ---\n \n [47] Third, as the jus commune  and the foundation of all other Quebec laws, the \nC.C.Q.  is the primary source of Quebec civil law and serves as the starting point in any \ninterpretive exercise involving a special st atute  in matters within the letter, spirit, or \nobject of the C.C.Q. ’s provisions . The preliminary provision of the C.C.Q.  established \n“the new position assigned to the Civil Code  in the hierarchy of the sources of law in \nmatters within the legislative jurisdiction of the Quebec National Assembly” ( Finney , \nat para.  26; see also D. Lemieux, “The Role of the Civil Code of Québec  in \nAdministrative Law” (2005), 18 C.J.A.L.P.  143, at p.  147; Commentaires du ministre \nde la Justice , vol. I, at p.  1 ([TRANSLATION ] “its privileged position in our legislative \nsystem as a whole ”)). \n[48] Writing on the Civil Code of Lower Canada , Professors John E.  C. Brierley \nand Roderick A. Macdonald have observed  that, “[f]rom the dual perspective of the \nactual operation of the Code as a living structure of written legal rules and of its own \nunderlying logic, the Code is intellectually pre -eminent” ( Quebec Civil Law: An \nIntroduction to Quebec Private Law (1993), a t pp. 134-35). They add that “[b]y virtue \nof its vocation to state the general law, [the Code] claims the centre ground of the Civil \nlaw. By virtue of its being written, it provides a textual referent by which or through \nwhich all other sources of law are understood to pass” (p.  135). Given this primacy, \n“other sources (including other legislative sources such as statutes) are viewed as \nvehicles of interpretation, and all interpretive exercises must necessarily begin with the \nCode” (p.  135).  \n2023 SCC 29 (CanLII)\n\n--- Page 47 ---\n \n [49] This Court has  regularly applied this methodology. For example, in Finney , \nthis Court explained that “examination of the liability of governments begins with the \napplication of the rules of liability established by the Civil Code of Québec ” (para.  27). \nIn Gilles E. Néro n Communication Marketing , this Court indicated that under the \nQuebec law of civil liability for defamation, “[t]he starting point is not the common \nlaw but the Civil Code of Québec , which is the basic general law in Quebec, as provided \nfor in the prelimin ary provision of the Civil Code ” (para.  56). Similarly, \nProfessor  Macdonald has explained that “a civil code ordains the modes of legal \nanalysis and interpretation” (p.  599). For his part, Professor  Brierley has observed that \n“[t]he Civil Code is .  . . droit commun  in relation to other enactment[s] because it is the \nfundamental reference point from which such other legislation proceeds” (p.  123).  \n(d) The Preliminary Provision of the C.C.Q. Has Normative Force  \n[50] Fourth, given that the preliminary provision establishes the hierarchy of \nsources in Quebec civil law and the C.C.Q.  has a suppletive role, the preliminary \nprovision has normative force of law ( Prud’homme , at para.  30, citing Doré ). It is not \na mere preamb le; rather, it has the force of law of an enactment and establishes the \nC.C.Q. ’s foundational role in Quebec civil law (Bisson, at p.  552; Lemieux (2005), at \np. 147).  \n(2) Special Laws May Complement or Derogate From the C.C.Q.  \n2023 SCC 29 (CanLII)\n\n--- Page 48 ---\n \n [51]",
    "token_count": 1000,
    "start_token": 19800,
    "end_token": 20800,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 23,
    "source_file": "2023scc29.txt",
    "text": " It is not \na mere preamb le; rather, it has the force of law of an enactment and establishes the \nC.C.Q. ’s foundational role in Quebec civil law (Bisson, at p.  552; Lemieux (2005), at \np. 147).  \n(2) Special Laws May Complement or Derogate From the C.C.Q.  \n2023 SCC 29 (CanLII)\n\n--- Page 48 ---\n \n [51] The preliminary provision of the C.C.Q.  states that other laws “may \ncomplement the [ C.C.Q. ] or make exceptions to it”. It is sometimes difficult to \ndistinguish between special laws that complement  the C.C.Q.  and those that derogate  \nfrom or make exceptions to it (C. Lemieux, “Éléments d’in terprétation en droit civil” \n(1994), 24 R.D.U.S.  221, at p.  234).  \n[52] As Professors Pierre -André Côté and Mathieu Devinat have noted, this \nCourt has recognized many examples in which the C.C.Q.  complements  the legal \nregimes established by special statutes, su ch as by providing rules on prescription \n(Doré , at paras.  18 and 20); civil liability based on a breach of the Quebec Charter of \nhuman rights and freedoms , CQLR, c. C -12 (Béliveau St -Jacques v. Fédération des \nemployées et employés de services publics inc. , [1996] 2 S.C.R. 345, at pp.  403-6); and \nevidence ( Quebec (Public Curator) v. Syndicat national des employés de l’hôpital St -\nFerdinand , [1996] 3 S.C.R. 211, at pp.  228-29) (see P. -A. Côté and M.  Devinat, \nInterprétation des lois  (5th ed. 2021), at p.  388, f n. 256). In such cases, the C.C.Q.  \n[TRANSLATION ] “is not only a conceptual reservoir for special statutes, but also their \nnormative complement ” (Côté and Devinat, at p.  388).  \n[53] In addition, a special statute may derogate  from the C.C.Q. , either \nexpressly or by implication (see Octane , at para.  39; Brierley, at p.  125). The C.C.Q.  \nwill apply as suppletive law unless special legislation clearly derogates from it \n(Lemieux (2005), at p.  148). This reflects [TRANSLATION ] “a general principle of \npredominance of spe cial legislation ” (Côté and Devinat, at p.  410); that is, specialia \n2023 SCC 29 (CanLII)\n\n--- Page 49 ---\n \n generalibus derogant , which means that special legislation derogates from contrary \ngeneral legislation (A. Mayrand, Dictionnaire de maximes et locutions latines utilisées \nen droit  (4th ed.  2007), at p.  572; see also Doré , at para.  41). As Professor H. Patrick \nGlenn noted, [TRANSLATION ] “[l]ike all suppletive general law, [the C.C.Q. ] therefore \nyields to sources that are more specific, more imperative, which is also contemplated \nby the [Preliminary]  Provision ” (p. 349).  \n[54] For example, a special statute may derogate from the C.C.Q.  if the \nlegislature provides sufficiently detailed and specific statutory language suggesting that \nit did not intend the general provisions of the C.C.Q. to overr ide the special statute \n(Compagnie d’immeubles Yale ltée v. Kirkland (Ville de) , [1996] R.J.Q. 502 (C.Q.), at \np. 507; Dionne v. Commission scolaire des Patriotes , 2014 SCC 33, [2014] 1 S.C.R. \n765, at para.  37). Similarly, if the special statute provides a complete rule on a matter, \nand is neither silent nor insufficient on an essential element, the special statute applies \ninstead of the general law in the C.C.Q. , unless the legislature provides otherwise \n(Lalonde v. Sun Life Assurance Co. of Canada , [1992] 3 S.C",
    "token_count": 1000,
    "start_token": 20700,
    "end_token": 21700,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 24,
    "source_file": "2023scc29.txt",
    "text": " Patriotes , 2014 SCC 33, [2014] 1 S.C.R. \n765, at para.  37). Similarly, if the special statute provides a complete rule on a matter, \nand is neither silent nor insufficient on an essential element, the special statute applies \ninstead of the general law in the C.C.Q. , unless the legislature provides otherwise \n(Lalonde v. Sun Life Assurance Co. of Canada , [1992] 3 S.C.R. 261, at pp. 278 -79, \nciting City of Ottawa v. Town of Eastview , [1941] S.C.R. 448, at p. 462; see also Gignac \nv. Gauvin , 2009 QCCS 524, 73 C.C.P.B. 47, at para.  54). \n(3) The Court of Appeal Erred in Its Methodology for Determining When the \nC.C.Q.  Appli es \n[55] The proper interpretive methodology in determining the relationship \nbetween the C.C.Q.  and a special statute is to start with the jus commune  in the C.C.Q. , \n2023 SCC 29 (CanLII)\n\n--- Page 50 ---\n \n and then to ask whether the special statute complements or derogates from the jus \ncommune (see g enerally Doré, at paras.  15-21; see also paras.  40-41; Brierley, at \np. 125-26). Often, the answer to this question will be obvious and will not require an \nextensive interpretation exercise. In this case, the majority erred with respect to each \nof the two reasons it gave for concluding that the C.C.Q.  does not apply in the \ncircumstances, even though, as will be explained, the court was correct that the FMAT \nhas jurisdiction over the out -of-province appellants u nder the special statutes.  \n(a) Book Ten of the C.C.Q. Can Apply to Administrative Tribunals Even if \nPrivate Rights Are Not at Issue  \n[56] First, the majority concluded that although the private international law \nrules of Title Three of Book Ten of the C.C.Q.  apply t o all Quebec authorities, \nincluding judicial and administrative tribunals, they do not determine the FMAT’s \njurisdiction because no “private rights” (para.  70) are at issue in a proceeding before \nthe FMAT.  While the majority rightly recognized that the C.C.Q. acts as suppletive law \nin a wide range of circumstances, “including certain aspects of public law”  (para.  70), \nthey narrowed the compass of the jus commune  by implying that private rights must be \nin issue. The majority’s methodology erroneously suggest ed that whether Book Ten of \nthe C.C.Q.  applies depends on characterizing the issue before the court, seemingly \nlimiting its scope to matters of private law. However, the jus commune , including Book \nTen, is not limited to matters of private rights, but rath er extends to “all matters within \nthe letter, spirit or object” of the C.C.Q. ’s provisions.  \n2023 SCC 29 (CanLII)\n\n--- Page 51 ---\n \n [57] In reaching its conclusion, the majority noted that the respondent had cited \nthe Quebec Court of Appeal’s decision in Donaldson v. Autorité des marchés \nfinanciers , 2020 QCCA 401, in support of its position that the C.C.Q. does not apply \nto proceedings before the FMAT. In Donaldson , the Court of Appeal held that the  \nthree -year prescription period under art.  2925 C.C.Q. did not apply to administrative \nproceedings broug ht by the AMF before the FMAT to impose an administrative \nmonetary penalty under s.  273.1 of the Securities Act  for contravention of the Act or a \nregulation made under its authority. One reason the court in Donaldson ruled that the \nC.C.Q. did not apply is because the C.C.Q. establishes the jus commune over only those \nmatters falling under private law (paras.  43-44 (CanLII)). The court in Donaldson \ndistinguished between private law matters, which fall under the purview of the C.C.Q. , \nand public law matters, which do not. With respect, insofar as this approach creates a \ndivide between public and private law not reflected in the letter, spirit, or object of the \nC.C.Q. , it is incorrect in law.  \n[58] Although the first paragraph of the preliminary provision states that ",
    "token_count": 1000,
    "start_token": 21600,
    "end_token": 22600,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 25,
    "source_file": "2023scc29.txt",
    "text": "43-44 (CanLII)). The court in Donaldson \ndistinguished between private law matters, which fall under the purview of the C.C.Q. , \nand public law matters, which do not. With respect, insofar as this approach creates a \ndivide between public and private law not reflected in the letter, spirit, or object of the \nC.C.Q. , it is incorrect in law.  \n[58] Although the first paragraph of the preliminary provision states that  the \nC.C.Q. , in harmony with the Charter of human rights and freedoms , and the general \nprinciples of law, “governs persons, relations between persons, and property”, this \nparagraph does not limit the C.C.Q. ’s application to stating rules of private law, ev en \nthough the C.C.Q.  contains many such rules. The second paragraph of the preliminary \nprovision also provides that the C.C.Q.  “lays down the jus commune ”, or law of general \napplication , “in all  matters within the letter, spirit or object of its provisions”. \nMoreover,  the C.C.Q. contains rules of public law and is an important source of \n2023 SCC 29 (CanLII)\n\n--- Page 52 ---\n \n administrative law in Quebec (P . Garant,  with P. Garant and J. Garant,  Droit \nadministratif  (7th ed.  2017) , at p. 10). \n[59] For example, art. 1376 C.C.Q.  provides that t he rules in Book Five, \nObligations, “apply to the State and its bodies, and to all other legal persons established \nin the public interest, subject to any other rules of law which may be applicable to \nthem”. Article 1376 C.C.Q.  “is a public law rule” ( Prud’ homme , at para.  27; see also \nOctane , at para.  36; Finney , at paras. 26 -27; Glenn, at pp.  350-51). In addition, art. 300 \nC.C.Q.  provides that legal persons established in the public interest, although primarily \ngoverned by special Acts by which they are con stituted and by those which are \napplicable to them, are also governed by the C.C.Q.  “where the provisions of such Acts \nrequire to be complemented, particularly with regard to their status as legal persons, \ntheir property or their relations with other perso ns”. Article 300 C.C.Q.  is also a public \nlaw rule (see Doré , at paras.  15-17 and  20-21; see also Finney , at para.  26; Octane , at \npara.  36; Glenn, at pp. 350 -51). And because the C.C.Q.  is the jus commune  and the \nfoundation of all other laws, [TRANSLATION ] “the Civil Code is also applicable to the \nstate or its components where a rule of public law has so determined ” (Brisson, at \np. 313). Thus, “the Civil Code  itself partakes of public law” (Lemieux (2005), at p.  144; \nsee also pp.  149-55), and “serves to grou nd much public and administrative law” \n(Macdonald, at p.  592).  \n[60] As a result, the proper way to determine whether the C.C.Q.  applies does \nnot involve characterizing the right at issue as either a private law or public law matter. \n2023 SCC 29 (CanLII)\n\n--- Page 53 ---\n \n The C.C.Q.  is not limited to  stating rules or rights of private law. As this Court has \nexplained, “[i]t is important to recall .  . . that the new Code does not simply lay down \na body of private law rules .  . . . As stated in its preliminary provision, it is the jus \ncommune of Quebec”  (Prud’homme , at para. 28 (emphasis in original); see also Finney , \nat para. 26; Fédération des producteurs , at para. 10). As this Court has also noted, a \ndraft version of the preliminary provision had provided that the C.C.Q.  laid down the \n“private law”, b ut in response to debate in the legal literature, “the expression ‘private \nlaw’ was replaced by the more inclusive expression ‘ jus commune ’” (Prud’homme , at \npara. 29). The backdrop for this change, the Court found, “leaves",
    "token_count": 1000,
    "start_token": 22500,
    "end_token": 23500,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 26,
    "source_file": "2023scc29.txt",
    "text": "ération des producteurs , at para. 10). As this Court has also noted, a \ndraft version of the preliminary provision had provided that the C.C.Q.  laid down the \n“private law”, b ut in response to debate in the legal literature, “the expression ‘private \nlaw’ was replaced by the more inclusive expression ‘ jus commune ’” (Prud’homme , at \npara. 29). The backdrop for this change, the Court found, “leaves no doubt as to the \nvery conscious  decision made by the legislature to give the Civil Code the broadest \npossible operational scope” (para. 29; Bisson, at pp. 551 -53). In sum, to quote Professor \nAlain -François Bisson: [TRANSLATION ] “. . . the Civil Code is not a code of private law; \nit is a  code of jus commune , which does not have private law as its exclusive subject \nmatter ” (p. 563).  \n[61] Book Ten of the C.C.Q. , which codifies the rules of private international \nlaw in Quebec, likewise applies as the jus commune  beyond matters of private law, \nstrictly defined. The rules of private international law are concerned with “the \njurisdiction of courts of the Canadian provinces, with whether that jurisdiction should \nbe exercised, with what law should apply to a dispute, and with whether a court should \nrecognize and enforce a judgment rendered by a court of another province or country” \n(Van Breda , at para.  21; see also C.  Emanuelli, Étude comparative sur le droit \ninternational privé au Canada  (2019), at p.  2; G. Goldstein and E. Groffier, Droit \n2023 SCC 29 (CanLII)\n\n--- Page 54 ---\n \n internati onal privé , vol. I, Théorie générale  (1998) , at pp.  4-5). These matters extend \nbeyond the narrow scope of private law and also apply, as part of the jus commune  of \nQuebec, in public and administrative law contexts.  \n[62] The jurisdictional rules invoked by the appellants here are contained in \nTitle Three of Book Ten of the C.C.Q. , “International Jurisdiction of Québec \nAuthorities”, and unless otherwise provided by law apply to administrative tribunals. \nTo be sure, the FMAT is an administrative tribunal with adju dicative functions \n“charged with settling disputes between a citizen and an administrative authority” \nunder s. 9 of the Act respecting administrative justice , CQLR, c. J -3. Quebec authorities \nwithin the meaning of Title Three of Book Ten of the C.C.Q. were  intended to include \n[TRANSLATION ] “judicial, administrative and even ecclesiastical bodies, for example \n. . .[,] if [they are] considered as such by Quebec law ” (Commentaires du ministre de \nla Justice , vol. II, at p.  1998). Quebec authorities have since been found to include, for \nexample, arbitrators, where there is a relevant foreign element justifying resort to the \nC.C.Q. ’s rules of private international law (see Dell Computer Corp. v. Union des \nconsommateurs , 2007 SCC 34, [2007] 2 S.C.R. 801, at para.  53); Quebec courts ( Barer \nv. Knight Brothers LLC , 2019 SCC 13, [2019] 1 S.C.R. 573, at paras.  111-12; Ormuco \ninc. v. Ernst & Young , 2022 QCCA 405, at paras.  8-9 (CanLII)); and administrative \ntribunals ( Ormuco inc. , at paras.  8-9; J. P. McEvoy, “Forum of necessity in Quebec \nPrivate International Law: C.c.Q. art.  3136” (2005), 35 R.G.D.  61, at p.  66, fn.  8; \nS. Guillemard and V.  A. Ly, Éléments de droit international privé québécois  (2019), at \np. 75). \n2023 SCC 29 (CanLII)\n\n--- Page 55 ---\n \n [63] In short, the C.C.Q.  is an im portant source of administrative law in Quebec \nand, unless otherwise provided by law, Title Three of Book Ten applies to \nadministrative tribunals like the FMAT regardless of whether private rights are at issue, \n",
    "token_count": 1000,
    "start_token": 23400,
    "end_token": 24400,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 27,
    "source_file": "2023scc29.txt",
    "text": " Éléments de droit international privé québécois  (2019), at \np. 75). \n2023 SCC 29 (CanLII)\n\n--- Page 55 ---\n \n [63] In short, the C.C.Q.  is an im portant source of administrative law in Quebec \nand, unless otherwise provided by law, Title Three of Book Ten applies to \nadministrative tribunals like the FMAT regardless of whether private rights are at issue, \nas long as the matters dealt with by the admi nistrative tribunals are “within the letter, \nspirit or object of [the C.C.Q. ’s] provisions”. Otherwise, the scheme establishing the \ntribunal’s jurisdiction does not fall within the purview of the law of general application \nestablished by the C.C.Q.  This is  because the object of the regulatory scheme is not \ncaptured by the jus commune . \n[64] Had the majority of the Quebec Court of Appeal considered these \nprinciples, it would not have concluded that Title Three of Book Ten of the C.C.Q.  \ndoes not apply. Indeed, the scheme establishing the FMAT’s jurisdiction makes it fall \nwithin the purview of the law of general application established by the C.C.Q.  \n[65] The FMAT adjudicates securities law matters, a hybrid field involving \nstandards established to regulate markets in the public interest, as well as rules designed \nto resolve disputes between parties. On the one hand, Title VII of the Securities Act  \nsets out various prohibitions and penalties and Title IX vests the FMAT with powers \nto make other regulatory orders. On the oth er hand, Title VIII deals with civil actions, \nincluding certain actions brought by market participants for rescission, revision of \nprices, and damages, and also extends to actions in damages relating to the acquisition \nand dispositions of securities (ss. 2 13.1 et seq.). Under s.  93 of the Act respecting the \nAutorité des marchés financiers , the FMAT has jurisdiction to exercise all the functions \n2023 SCC 29 (CanLII)\n\n--- Page 56 ---\n \n and powers assigned to it under the Securities Act , including under the Title VIII on \ncivil actions (e.g., see s. 233.2 of the Securities Act , which sets out the power to provide \na remedy to an interested person in respect of distribution of certain documents, applied \nin Mines d’or Visible inc. v. Zara Resources Inc. , 2013 QCBDR 95). As a result, the \nFMAT can make ord ers that have important consequences on the private rights of \nactors concerned. The securities scheme establishing the FMAT thus vests it with the \npowers to adjudicate matters within “the letter, spirit or object of [the C.C.Q. ’s] \nprovisions”.   \n[66] Moreover, s. 93 of the Act respecting the Autorité des marchés financiers  \nprovides that “any interested person” can seize the FMAT of a matter involving the \nSecurities Act  and other aspects of its jurisdiction. This prompted Professor Stéphane \nRousseau to observe th at [TRANSLATION ] “the powers [of the FMAT] also apply to \ndisputes that do not concern the AMF and involve only market participants ” (p. 18). \nAlthough p ersons without an interest cannot substitute themselves for the AMF, the \nstatute gives those whose privat e rights are affected in the securities market the power \nto seize the FMAT of a matter (see Financière Manuvie v. Proteau , 2013 QCBDR 137, \nat paras. 26, 34, and 38 -39 (CanLII)).  \n[67] Given this hybridity, the international jurisdiction of the Quebec authority \nestablished to decide matters relating to securities law can be seen to involve, in some \nmeasure, the governing of matters relating to “persons, relations between persons, and \nproperty”, as set out in the preliminary provision.  \n2023 SCC 29 (CanLII)\n\n--- Page 57 ---\n \n [68] Indeed, provisions of the Securities Act  itself refer to the C.C.Q. (e.g., \nss. 235 and 273.3), demonstrating the C.C.Q. ’s suppletive role to the provisions of the \nSecurities Act . The C.C.Q. ’s suppletive role can also be gleaned from s. 236.1 of the \nSecurities Act . This provision derogates from the rules for the international jurisdiction \nof Quebec authorities set out in Book Ten of the C.C.Q. , by establishing a special \njurisdictional rule for civil actions relating",
    "token_count": 1000,
    "start_token": 24300,
    "end_token": 25300,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 28,
    "source_file": "2023scc29.txt",
    "text": " 235 and 273.3), demonstrating the C.C.Q. ’s suppletive role to the provisions of the \nSecurities Act . The C.C.Q. ’s suppletive role can also be gleaned from s. 236.1 of the \nSecurities Act . This provision derogates from the rules for the international jurisdiction \nof Quebec authorities set out in Book Ten of the C.C.Q. , by establishing a special \njurisdictional rule for civil actions relating to the distribution of a security, a take -over \nbid, an issuer bid, or actions under Title VIII of the Securities Act . It states that such \nactions may be brought before the court of the plaintiff’s residence and that any \ncontrary stipulation as to the jurisdiction of the courts is without effect.  \n[69] Section 236.1 of the Securities Act  illustrates two aspects of the relationship \nbetween the C.C.Q.  and the Quebec securities legislation. First, it suggests that the rules \nin Book Ten of the C.C.Q.  otherwise serve a suppletive role to the Securities Act . \nSecond, t his provision also confirms that not all of the rules bearing on the international \njurisdiction of Quebec authorities are to be found in the C.C.Q.  \n[70] In light of the foregoing, the international jurisdiction of the FMAT should \nbe considered, first, in light of the rules set forth in Title Three of Book Ten of the \nC.C.Q.  \n(b) Title Three of Book Ten of the C.C.Q. Applies Broadly Even in Absence of \na Conflict of Jurisdiction or a Conflict of Laws  \n2023 SCC 29 (CanLII)\n\n--- Page 58 ---\n \n [71] Second, the majority of the Quebec Court of Appeal can be read as havi ng \nsuggested that the private international law rules of Title Three of Book Ten of the \nC.C.Q.  do not apply to the FMAT because there is no conflict of jurisdiction or any \nconflict of laws that calls for the application of private international law rules \n(para.  78). We respectfully disagree with that premise. Title Three of Book Ten applies \nnot just in cases of conflict of jurisdiction; it applies more broadly to determine the \n“International Jurisdiction of Québec Authorities”, meaning whether Quebec \nauthor ities can assume jurisdiction over disputes containing a foreign element (see \nDell, at paras.  22-23; Guillemard and Ly, at pp.  19 and 77; C. Emanuelli, Droit \ninternational privé québécois  (3rd ed. 2011), at No. 148). As explained in the \nCommentaires du min istre de la Justice , vol.  II, at p.  1998:  \n[TRANSLATION ] . . . the traditional expression  conflict of jurisdiction  was \nnot used, because the purpose here is solely to determine the cases in which \nQuebec authorities will have jurisdiction to hear a dispute with a foreign \nelement, not the cases in which foreign authorities will have jurisdiction. \n[Emphasis in original.]  \n[72] In fairness to the majority, when they said that there was no conflict o f \njurisdiction that would call for the application of private international law rules, it was \nin support of the view that the FMAT simply sought to apply a Quebec statute to make \ndeterminations under s.  93 of the Act respecting the Autorité des marchés fin anciers , \nrather than to resolve an issue of competing jurisdictions. It is, however, imprecise to \nsay that Book Ten of the C.C.Q. does not apply on the basis that the matter before the \ncourt raises no question of conflict of jurisdiction or conflict of law s. \n2023 SCC 29 (CanLII)\n\n--- Page 59 ---\n \n C. The C.C.Q.’s General Rules for the International Jurisdiction of Quebec \nAuthorities  \n(1) Introduction  \n[73] We now proceed to apply the interpretive methodology outlined above \nregarding the relationship between the C.C.Q.  and special statutes. In this section, we \nbegin with the C.C.Q.  as the jus commune . We outline the C.C.Q. ’s general rules for \nthe international jurisdiction of Quebec authorities and interpret arts. 3148 para.  1(3) \nand 3136 C.C.Q. , which Mainville J.A. relied on in determining that the FMAT has \njurisdiction over the appellants. We conclude that neither provision, nor any other \nspecial provision, nor the residual jurisdiction rule of the C.C.Q. provides the FMAT \nwith jurisdiction over the appellants. In the following sections, we then review the \nspecial rules for the FMAT",
    "token_count": 1000,
    "start_token": 25200,
    "end_token": 26200,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 29,
    "source_file": "2023scc29.txt",
    "text": " and interpret arts. 3148 para.  1(3) \nand 3136 C.C.Q. , which Mainville J.A. relied on in determining that the FMAT has \njurisdiction over the appellants. We conclude that neither provision, nor any other \nspecial provision, nor the residual jurisdiction rule of the C.C.Q. provides the FMAT \nwith jurisdiction over the appellants. In the following sections, we then review the \nspecial rules for the FMAT’s jurisdiction under the Quebec securities scheme, and \nexplain how the territorial reach of those provisions is determined in accordance with \nthis Court’s decision in Unifund . We interpret the relevant special jurisdictional rules \nof the Quebec securities scheme in light of Unifund , and explain why that scheme \nprovides the FMAT with jurisdiction over the out -of-province appellants in this case.  \n(2) The C.C.Q.  Does Not Give the FMAT Jurisdiction Over the Appellants  \n[74] As previously discussed , Book Ten of the C.C.Q.  sets out the rules of \nprivate international law in Quebec and “contains a well -developed set of rules and \nprinciples in this area” ( Van Breda , at para.  21). The rules of private international law \n2023 SCC 29 (CanLII)\n\n--- Page 60 ---\n \n in Quebec include the rules for the  international jurisdiction of Quebec authorities \ncodified in Title Three of Book Ten of the C.C.Q.  Book Ten limits “the jurisdiction of \nQuebec authorities to matters closely linked to the province” ( Newfoundland and \nLabrador (Attorney General) v. Uashaunn uat (Innu of Uashat and of Mani -Utenam) , \n2020 SCC 4, [2020] 1 S.C.R. 15 , at para.  16). These rules “must be read as a coherent \nwhole and in light of the principles of comity, order and fairness” ( Spar Aerospace , at \npara.  55; see also Van Breda , at para.  21; Uashaunnuat , at para.  17). \n[75] Title Three of Book Ten of the C.C.Q.  begins with general rules. The first \nprovision, art. 3134 C.C.Q. , states that “[i]n the absence of any special provision, \nQuébec authorities have jurisdiction when the defendant is domicile d in Québec”. This \nis a suppletive or residual jurisdictional rule for international jurisdiction based on \ndomicile, which applies in the absence of an applicable special provision in Chapter  II \nof Title Three of Book Ten ( Uashaunnuat , at para.  18). Since the appellants are not \ndomiciled in Quebec, unless a special provision in Chapter II of Title Three of Book \nTen gives the FMAT jurisdiction over the appellants, there will be no basis for the \nFMAT to assert jurisdiction under the general rules of private i nternational law set out \nin Book Ten of the C.C.Q.  \n[76] An examination of the jurisdictional rules set out in Book Ten and more \nspecifically arts.  3148 para.  1(3) and 3136 C.C.Q. , relied on by Mainville J.A., leads to \nthe conclusion that no provision gives the FMAT jurisdiction over the appellants. We \naddress each rule discussed by Mainville J.A. in turn.  \n2023 SCC 29 (CanLII)\n\n--- Page 61 ---\n \n (a) Article 3148 Para.  1(3) C.C.Q.  \n[77] Article 3148 para. 1(3) C.C.Q.  states:  \n3148.  In personal actions of a patrimonial nature, Québec authorities have \njurisdiction in the following cases:  \n \n. . . \n \n(3) a fault was committed in Québec, injury was suffered in Québec, an \ninjurious act or omission occurred in Québec or one of the obligations \narising from a contract was to be performed in Québec;  \n[78] Mainville J.A. accepted tha t the present matter before the FMAT is not a \npersonal action of a patrimonial nature in the usual sense, but found that it is very close \nto being so, and therefore applied art. 3148 para. 1(3) C.C.Q.  by analogy (para.  144). \nWe respectfully disagree with t his conclusion.  \n[79] To begin with, art. 3148 para. 1(3) C.C.Q.  does not apply directly because \nthe proceeding before the FMAT does",
    "token_count": 1000,
    "start_token": 26100,
    "end_token": 27100,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 30,
    "source_file": "2023scc29.txt",
    "text": " action of a patrimonial nature in the usual sense, but found that it is very close \nto being so, and therefore applied art. 3148 para. 1(3) C.C.Q.  by analogy (para.  144). \nWe respectfully disagree with t his conclusion.  \n[79] To begin with, art. 3148 para. 1(3) C.C.Q.  does not apply directly because \nthe proceeding before the FMAT does not involve a personal action of a patrimonial \nnature. A personal action of a patrimonial nature implies the assertion of rights that “in \ntheir very essence have a monetary value” and are transmissible as property (Brierley \nand Macdonald, at p.  156; see also J. -L. Baudouin and P. -G. Jobin, Les obligations  \n(7th ed. 2013), by P. -G. Jobin and N.  Vézina, at No.  3). It often involves a contractual \nor extra -contractual claim  by a creditor against a debtor seeking the enforcement of the \nperformance of an obligation  (see G.  Saumier, “The Recognition of Foreign Judgments \nin Quebec — The Mirror Crack’d?” (2002), 81 Can. Bar Rev.  677, at p.  690; C. Walsh, \n2023 SCC 29 (CanLII)\n\n--- Page 62 ---\n \n “The International Jurisdiction of Québec Authorities in Personal Actions: An \nOverview” (2012), 71 R. du B.  249, at p.  254). While the proceeding may have a \npatrimonial impact on the defendants in that, should the AMF prove successful in \nsecuri ng the prohibition orders and the fines sought, it will have an impact on their \npatrimonies, the proceeding will not result in a transfer, from one patrimony to another, \nto redress for example a private law wrong by compensating a loss sustained or a profi t \ndeprived. Moreover, the proceeding is not a personal action but one initiated by the \nsecurities market regulator acting in the public interest rather than in a strictly personal \ncapacity . It does not involve a person taking legal action against another b ased on \npersonal rights that are transmissible as property, as art.  3148 C.C.Q.  requires.  \n[80] However, Mainville J.A. did not propose to apply art. 3148 C.C.Q.  directly, \nbut rather by analogy. In the civil law, reasoning by analogy is not only commonplace, \nbut scholars have suggested it is particularly suited to the interpretation of the C.C.Q. , \nwhich is cast in broad language and not typically designed to apply  as a [TRANSLATION ] \n“law of exception” , unlike a common law statute (see Côté and Devinat, at pp.  370-71; \nsee also Bisson, at p. 557). This Court has noted that analogy is “one of the tools that \ncan be used to ensure that the Civil Code of Québec  functions  properly” ( Fédération \ndes producteurs , at para. 29). Importantly, reasoning by analogy, as Mainville J.A. \nnoted, was used by this Court in respect of some of the very provisions in Book Ten \nthat are engaged by these appeals ( Uashaunnuat , at paras.  53 and  60). \n2023 SCC 29 (CanLII)\n\n--- Page 63 ---\n \n [81] Moreover, as both Collier  J. in the Superior Court and Mainville J.A. \nunderscored, the AMF’s allegations as to the misleading character of the press releases \nissued in Quebec are similar, in respect of the conduct in question, to an allegation of \nfault in the private law of civil liability. The AMF’s originating pleading filed before \nthe FMAT alleges injury sustained by Quebec investors that is said to be caused by the \nQuebec -based conduct of the defendants. In this sense, one might say the defendants \nare a lleged to have engaged in conduct that is analogous to conduct that could sustain \nan action in civil liability in the law of obligations. While the contravention of a statute \ndoes not in itself constitute a civil fault, the violation of a statutory standar d can amount \nto civil wrong when it amounts to “a violation of the standard of conduct of a reasonable \nperson under the general rules of civil liability” ( St. Lawrence Cement Inc. v. Barrette , \n2008 SCC 64, [2008] 3 S.C.R. 392,",
    "token_count": 1000,
    "start_token": 27000,
    "end_token": 28000,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 31,
    "source_file": "2023scc29.txt",
    "text": "an action in civil liability in the law of obligations. While the contravention of a statute \ndoes not in itself constitute a civil fault, the violation of a statutory standar d can amount \nto civil wrong when it amounts to “a violation of the standard of conduct of a reasonable \nperson under the general rules of civil liability” ( St. Lawrence Cement Inc. v. Barrette , \n2008 SCC 64, [2008] 3 S.C.R. 392, at para. 34; see also Kosoian  v. Société de transport \nde Montréal , 2019 SCC 59, [2019] 4 S.C.R. 335, at para. 48).  \n[82] In our view, however, reasoning by analogy cannot ground jurisdiction \nhere. Civil law scholars have explained that this mode of interpretation for a civil code \nreflects [TRANSLATION ] “the analogical extension of a rule through the use of an \n‘a pari’ argument”  (G. Cornu, Droit civil: Introduction au droit  (13th ed. 2007), at \np. 213). It is premised on the notion that the C.C.Q.  can be extended from a \ncircumstance in which i t plainly applies to the same type of situation, but about which \nthe C.C.Q.  is silent ( see pp. 213 -14; Côté and Devinat, at pp.  370-71).  \n2023 SCC 29 (CanLII)\n\n--- Page 64 ---\n \n [83] This is not a circumstance allowing for a pari reasoning. \nArticle  3148  para.  1(3) C.C.Q.  cannot be applied by analogy in this case because to \nextend the administrative provisions involved here to the law of civil liability would be \nto change the nature and object of the proceedings to something that is fundamentally \ndifferent from, rather tha n analogous to, personal actions of a patrimonial nature \ncontemplated by art. 3148 C.C.Q.   \n[84] The fundamental character of a personal action of patrimonial nature is the \nprivate enforcement of a debt (see Brierley and Macdonald, at p.  166; Jobin and Vézina, \nat Nos.  3 and 6 ). In contrast, the AMF has brought an action before the FMAT for \norders, including administrative prohibitions and penalties, under Titles VII and IX of \nthe Securities Act , in the public interest, acting in its [ TRANSLATION ] “role of \nsupervi sing the financial markets, protecting investors and the public, and regulating \nsecurities trading” ( Rousseau, at p.  13). This focus on the public interest \n[TRANSLATION ] “transcends the individual interests of certain investors ” (p. 30, citing \nAutorité des  marchés financiers v. Dominion Investments (Nassau) Ltd. (Dominion \nInvestments Ltd.) , 2008 QCBDRVM 4, at p.  25 (CanLII)). It aims to prevent future \nharm to the Quebec securities market and is neither restorative nor punitive (pp.  31-32 \nand 38 -39). Here, t here is no tenable analogy between a personal action of a patrimonial \nnature, which seeks the enforcement of a debt under private law, and a regulatory \nprosecution by the state, which seeks public interest remedies rather than simply private \nreparation.  Such proceedings are of a fundamentally different legal character. To apply \n2023 SCC 29 (CanLII)\n\n--- Page 65 ---\n \n art. 3148 para.  1(3) C.C.Q.  to a regulatory prosecution by the state would stretch the \nprovision well beyond its letter, spirit, and object.  \n[85] As a result, art.  3148 para.  1(3) C.C.Q.  does not give the FMAT \njurisdiction over the appellants by reason of the misleading press releases or the \nresulting injury being connected to Quebec. Moreover, the fact that the defendant Solo, \nan out -of-province corporation, had an establishment in Quebe c at the relevant time \ndoes not ground jurisdiction on the basis of art. 3148 C.C.Q.  either. Although \nart. 3148  para.  1(2) C.C.Q.  provides that Quebec authorities have jurisdiction when the \ndefendant is a legal person that is not domiciled in Quebec but ha s an establishment in \nQuebec and the dispute relates to activities in Quebec, this rule still requires the nature \n",
    "token_count": 1000,
    "start_token": 27900,
    "end_token": 28900,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 32,
    "source_file": "2023scc29.txt",
    "text": " had an establishment in Quebe c at the relevant time \ndoes not ground jurisdiction on the basis of art. 3148 C.C.Q.  either. Although \nart. 3148  para.  1(2) C.C.Q.  provides that Quebec authorities have jurisdiction when the \ndefendant is a legal person that is not domiciled in Quebec but ha s an establishment in \nQuebec and the dispute relates to activities in Quebec, this rule still requires the nature \nof the action to be personal and of a patrimonial nature, which is not the case here.  \n(b) Article 3136 C.C.Q.  \n[86] Article 3136 C.C.Q.  states:  \n3136.  Even though a Québec authority has no jurisdiction to hear a dispute, \nit may nevertheless hear it provided the dispute has a sufficient connection \nwith Québec, if proceedings abroad prove impossible or the institution of \nproceedings abroad cannot reasonably  be required.  \n[87] Neither the FMAT nor the Superior Court of Quebec applied art.  3136 \nC.C.Q.  Indeed, the AMF did not invoke this provision before the FMAT. Despite this, \n2023 SCC 29 (CanLII)\n\n--- Page 66 ---\n \n Mainville  J.A. relied on this provision in his concurring opinion and concluded that it \ngives the FMAT jurisdiction over the appellants.  \n[88] Article 3136 C.C.Q.  is part of a body of suppletive rules that gives a \nQuebec authority flexibility in determining whether it has jurisdiction ( GreCon Dimter \ninc. v. J.R. Normand inc. , 2005 SCC 46, [2005] 2 S. C.R. 401, at para.  33). Article  3136 \nC.C.Q.  was described by LeBel J.A., as he then was, as a forum of necessity provision \nthat [TRANSLATION ] “is intended to resolve certain access to justice problems for a \nlitigant who is in Quebec when the foreign forum that would normally have jurisdiction \nis inaccessible to the litigant for exceptional reasons, such as legal impossibility or \npractical impossibility that is nearly absolute ” (Lamborghini (Canada) inc. v. \nAutomobili Lamborghini S.P.A. , [1997] R.J.Q. 58 (C. A.), at p.  68; see also Anvil \nMining Ltd. v. Association canadienne contre l’impunité , 2012 QCCA 117, at \nparas.  97-98 (CanLII); Otsuka Pharmaceutical Company Limited v. Pohoresky , 2022 \nQCCA 1230, at para.  7 (CanLII); G.  Goldstein, Droit international privé , vol. 2, \nCompétence internationale des autorités québécoises et effets des décisions étrangères \n(Art. 3134 à 3168 C.c.Q.) (2012), at p.  55; and Commentaires du ministre de la Justice , \nvol. II, at p.  2000).  \n[89] Article 3136 C.C.Q.  states three preconditions for the provision to apply: \nthe Quebec authority must have no jurisdiction; proceedings abroad cannot possibly be \ninstituted or cannot reasonably be required; and the dispute must have a sufficient \nconnection to Quebec (see Droi t de la famille — 1830 , 2018 QCCA 24, at para.  24 \n2023 SCC 29 (CanLII)\n\n--- Page 67 ---\n \n (CanLII)). Because art.  3136 C.C.Q.  applies only when a Quebec authority otherwise \nlacks jurisdiction, the provision [TRANSLATION ] “rather represents a narrow exception \nto the normal rules of jurisdiction” (Lamborghini , at p.  68; see also Anvil Mining , at \nparas.  97-98; Emanuelli (2011), at No.  168). To apply art. 3136 C.C.Q. , a Quebec \nauthority must first find that it does not have jurisdiction by other means (Goldstein, at \np. 56; McEvoy, at p.  100). If the Quebec authority has jurisdiction by other means, \nart. 3136 C.C.Q.  cannot apply.  \n[90] In our view, art. 3136 C.C.Q.  does not provide a basis for the FMAT’s \njurisdiction in this case, for two reasons. First, the AMF did not seek to rely",
    "token_count": 1000,
    "start_token": 28800,
    "end_token": 29800,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 33,
    "source_file": "2023scc29.txt",
    "text": " have jurisdiction by other means (Goldstein, at \np. 56; McEvoy, at p.  100). If the Quebec authority has jurisdiction by other means, \nart. 3136 C.C.Q.  cannot apply.  \n[90] In our view, art. 3136 C.C.Q.  does not provide a basis for the FMAT’s \njurisdiction in this case, for two reasons. First, the AMF did not seek to rely on art.  3136 \nC.C.Q.  as a basis for the FMAT’s jurisdiction. This Court has confirmed that both \nart. 3135 C.C.Q ., which deals with forum non conveniens , and art. 3136 C.C.Q. , “may \nbe applied only if one of the parties raises them, as the court cannot apply them of its \nown motion” ( GreCon , at para.  33). Otherwise stated, [ TRANSLATION ] “only an express \nrequest” can allow a “judge to confer on the Quebec authorities a jurisdiction that they \ndo not possess on the basis of article 3136 C.C.Q. ” (Droit de la famille  — 143017 , 2014 \nQCCA 218 8, at para.  55 (CanLII)). It was therefore an error to rely on art. 3136 C.C.Q. \nas a basis for the FMAT’s jurisdiction when the AMF did not invoke this provision.  \n[91] Second, even if a party had properly raised art. 3136 C.C.Q. , the provision \ndoes not apply on  its face. For art. 3136 C.C.Q.  to apply, a Quebec authority must have \nno jurisdiction to hear a dispute, as shown by its wording: “Even though a Québec \nauthority has no jurisdiction to hear a dispute .  . . .” Here, as we address below, the \n2023 SCC 29 (CanLII)\n\n--- Page 68 ---\n \n FMAT does have jurisdiction to hear the dispute — including jurisdiction over the \nappellants — under the special jurisdictional rules of the Quebec securities scheme \ncontained in the Securities Act and the Act respecting the Autorité des marchés \nfinanciers . As a result, art. 3136 C.C.Q.  does not provide a basis for the FMAT’s \njurisdiction in this case.  \nD. The Quebec Securities Scheme’s Special Rules for the FMAT’s Jurisdiction  \n[92] Although the C.C.Q. does not grant the FMAT jurisdiction in these \ncircumstances, it remains to con sider whether the FMAT has jurisdiction under the \nspecial jurisdictional rules under Quebec’s securities scheme. This Court has stated that \n“[t]he various rules governing the private international law order of Quebec are found \nprimarily in Book Ten of the C.C.Q. ” (Spar  Aerospace , at para.  22). However, this does \nnot preclude the application of other jurisdictional rules set out in special statutes (see \nP. Ferland and G. Laganière, “Le droit international privé”, in Collection de droit  de \nl’École du Barreau du Québec 2023 -2024, vol. 7, Contrats, sûretés, publicité des droits \net droit international privé  (2023), 271, at p.  303, fn. 247).  \n[93] The FMAT has jurisdiction under two special statutes: the Quebec \nSecurities Act  and the Act respecting  the Autorité des marchés financiers , now known \nas the Act respecting the regulation of the financial sector , CQLR, c. E -6.1.  \n[94] Section  93 of the Act respecting the Autorité des marchés financiers  \nprovides that the FMAT’s function is to make determinations regarding matters brought \n2023 SCC 29 (CanLII)\n\n--- Page 69 ---\n \n under the Act respecting the Autorité des marchés financiers  and other Acts listed in \nthe provision, including the Securities Act . Section  93 thus grants the FMAT \njurisdiction over the adjudication of matters brought under the Securities Act : \n93. On the request of the Authority or of any interested person, the Tribunal \nshall exercise the functions and powers assigned to it under this Act , the \nAct respecting the distribution of financial products and services (chapter \nD-9.2), the Mo ney-Services Businesses Act (chapter E -12.000001), the \nDerivatives Act (chapter I -14.01) and the Securities Act (chapter V -1.1). \n \nThe Tribunal shall exercise its discretion in the public interest.",
    "token_count": 1000,
    "start_token": 29700,
    "end_token": 30700,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 34,
    "source_file": "2023scc29.txt",
    "text": " of the Authority or of any interested person, the Tribunal \nshall exercise the functions and powers assigned to it under this Act , the \nAct respecting the distribution of financial products and services (chapter \nD-9.2), the Mo ney-Services Businesses Act (chapter E -12.000001), the \nDerivatives Act (chapter I -14.01) and the Securities Act (chapter V -1.1). \n \nThe Tribunal shall exercise its discretion in the public interest.  \n \nThe Tribunal may not, when assessing the facts or the law for the \npurposes of those Acts, substitute its assessment of the public interest for \nthat made by the Authority in making a decision.4 \n \n \n                                                 \n4 Secti on 93 was amended in 2018 and now reads:   \n \n93. The function of the Tribunal is to make determinations with respect to matters \nbrought under this Act and the Acts listed in Schedule I. Except where otherwise \nprovided by law, the Tribunal shall exercise its jurisdiction to the exclusion of any other \ntribunal or adjudicative body.  \n \n The Tribunal shall exercise its discretion in the public interest.  \n \n In reviewing a decision rendered by the Authority under the Securities Act (chapter \nV-1.1) or the Derivatives A ct (chapter I -14.01), the Tribunal may not, when assessing \nthe facts or the law for the purposes of those Acts, substitute its assessment of the public \ninterest for that made by the Authority in making a decision.  \n \n In this Title, unless the context indicates otherwise, “matters” also includes any \napplication, complaint, contestation or motion, as well as any action falling within the \njurisdiction of the Tribunal.  \n \n The former version of s. 93, in force at the time when the AMF instituted proceedings before \nthe FMAT, continues to apply to these proceedings under the applicable transitional rules because the \nprovision is substantive (it relates to the FMAT’s jurisdiction) and not procedural (see Interpretation \nAct, CQLR, c. I -16, ss. 12 and 13; Dell Com puter , at para. 160, per Bastarache and LeBel JJ., \ndissenting ; Côté and Devinat, at p. 219; R. Sullivan , The Construction of Statutes  (7th ed. 2022), at \npp. 788-89). \n \n2023 SCC 29 (CanLII)\n\n--- Page 70 ---\n \n [95] Section 94 grants the FMAT jurisdiction to take any measure to ensure \ncompliance with any of the Acts referred to in s.  93, which include the Act respecting \nthe Autorité des marchés financiers  and the Securities Act : \n94. At the request of the Authority, the Tribunal may take any measure \nconducive to ensuring compliance with an undertaking given under this \nAct, the Act resp ecting the distribution of financial products and services \n(chapter D -9.2), the Money -Services Businesses Act (chapter E -\n12.000001), the Derivatives Act (chapter I -14.01) or the Securities Act \n(chapter V -1.1) or compliance with those Acts.5 \n[96] The AMF has all eged before the FMAT that the appellants violated the \nSecurities Act  by improperly or fraudulently influencing the market price or the value \nof securities (s.  195.2) and by knowingly participating in securities transactions that \ncreated an artificial secur ity price (s.  199.1). In addition to setting forth the FMAT’s \njurisdiction through the Act respecting the Autorité des marchés financiers , the \nlegislature addressed the FMAT’s jurisdiction through various provisions in the \nSecurities Act  itself. The three relevant jurisdictional provisions are ss.  265, 273.1, \nand 273.3.  \n[97] Section 265 of the Securities Act empowers the FMAT to order a person to \ncease any activity in respect of securities transactions:  \n                                                 \n5 The wording of s. 94 was modified in 2018 and now reads:   \n  \n94. At the request of the Authority, the Tribunal may take any measure conducive to \nensuring compliance with an undertaking given to the Authority under any of the Acts \nlisted in the first paragraph of section 93 or compliance with those Acts.  \n2023 SCC 29 (CanLII)\n\n--- Page 71 ---\n \n 265. The Financial Markets Administrative Tribunal may orde r a person to \ncease any activity in respect of a transaction in securities.  \n \nThe Financial Markets Administrative Tribunal may, furthermore, order \nany person or category of persons to cease",
    "token_count": 1000,
    "start_token": 30600,
    "end_token": 31600,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 35,
    "source_file": "2023scc29.txt",
    "text": " conducive to \nensuring compliance with an undertaking given to the Authority under any of the Acts \nlisted in the first paragraph of section 93 or compliance with those Acts.  \n2023 SCC 29 (CanLII)\n\n--- Page 71 ---\n \n 265. The Financial Markets Administrative Tribunal may orde r a person to \ncease any activity in respect of a transaction in securities.  \n \nThe Financial Markets Administrative Tribunal may, furthermore, order \nany person or category of persons to cease any activity in respect of a \ntransaction in a particular security.  \n[98] Section  273.1 of the Securities Act allows the FMAT to impose an \nadministrative penalty on an offender:  \n273.1.  Where the Financial Markets Administrative Tribunal becomes \naware of facts establishing that a person has, by an act or omission, \ncontravened, or aided in the contravention of, a provision under this Act or \na regulation made under its authority, the Tribu nal may impose an \nadministrative penalty on the offender and have it collected by the \nAuthority.  \n \nThe amount of the penalty may in no case exceed $2,000,000 for each \ncontravention.  \n[99] Finally, s.  273.3 of the Securities Act provides that the FMAT can prohibit  \na person from acting as a director or officer of an issuer, dealer, adviser, or investment \nfund manager:  \n273.3. The Financial Markets Administrative Tribunal may prohibit a \nperson from acting as a director or officer of an issuer, dealer, adviser or \ninves tment fund manager on the grounds set out in article 329 of the Civil \nCode, or where a penalty has been imposed on the person under this Act, \nthe Act respecting the distribution of financial products and services \n(chapter D -9.2) or the Derivatives Act (cha pter I -14.01).  \n \nThe prohibition imposed by the Financial Markets Administrative \nTribunal may not exceed five years.  \n \n2023 SCC 29 (CanLII)\n\n--- Page 72 ---\n \n The Financial Markets Administrative Tribunal may, at the request of \nthe person concerned, lift the prohibition on such conditions as it co nsiders \nappropriate.  \n[100]  These three Securities Act provisions empower the FMAT to act in a broad \nrange of circumstances. In particular, s.  265, which allows the FMAT to order a person \nto “cease any activity in respect of a transaction in securities”, grants t he FMAT a large \nmeasure of discretion when exercising its jurisdiction. It is important, however, to read \nthese provisions in conjunction with the Act respecting the Autorité des marchés \nfinanciers , which explicitly provides for the FMAT’s jurisdiction to make \ndeterminations over matters brought under the two Acts. Reading the Acts together \nunderscores that the FMAT must exercise its discretion under ss.  265, 273.1, and 273.3 \nof the Securities Act  “in the public interest” ( Act respecting the Autorité des ma rchés \nfinanciers , s. 93). \n[101]  We recognize that s. 93 of the Act respecting the Autorité des marchés \nfinanciers provides subject -matter jurisdiction to the FMAT over matters arising under \nthe statutes listed in s. 93 (Rousseau, at pp.  16-17; see also C. Duclos , in collaboration \nwith R. Crête and A. Létourneau, “Les autorités d’encadrement”, in R. Crête et al., eds., \nCourtiers et conseillers financiers: Encadrement des services de placement  (2011), \n117, at pp. 150 -51; C. Duclos, La protection des épargnants dans  l’industrie des \nservices d’investissement: une analyse de l’influence des défaillances \norganisationnelles sous l’angle du Swiss Cheese Model (2021), at p.  427). But with \n2023 SCC 29 (CanLII)\n\n--- Page 73 ---\n \n respect for other views, as we will explain, the relevance of this provision is not \nconfined to subject -matter jurisdiction.  \n[102]  Although both Acts read together, and particularly s.  93 of the Act \nrespecting the Autorité des marchés financiers , grant the FMAT jurisdiction to make \ndeterminations under the Securities Act , neither statute express ly provides for the \nFMAT to assert jurisdiction over out -of-province parties, or otherwise limits the \nterritorial reach of the Quebec securities scheme over interprovincial or international \ntransactions. To evaluate whether these statutes may be applied in  such",
    "token_count": 1000,
    "start_token": 31500,
    "end_token": 32500,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 36,
    "source_file": "2023scc29.txt",
    "text": "]  Although both Acts read together, and particularly s.  93 of the Act \nrespecting the Autorité des marchés financiers , grant the FMAT jurisdiction to make \ndeterminations under the Securities Act , neither statute express ly provides for the \nFMAT to assert jurisdiction over out -of-province parties, or otherwise limits the \nterritorial reach of the Quebec securities scheme over interprovincial or international \ntransactions. To evaluate whether these statutes may be applied in  such circumstances, \nthe Quebec securities scheme must be interpreted to determine its territorial reach. That \nissue involves consideration of this Court’s decision in Unifund , which holds that the \npermissible territorial application of provincial legislat ion is determined by assessing \nthe sufficiency of the connection among the enacting jurisdiction, the subject matter of \nthe legislation, and the individual or entity sought to be regulated.  We address that issue \nnext.  \nE. The Territorial Reach of Provincial Le gislation Is Interpreted in Accordance \nWith This Court’s Decision in Unifund  \n(1) This Court’s Decision in Unifund  \n[103]  In Unifund , this Court addressed when a provincial regulatory scheme \napplies to an out -of-province defendant. The specific issue in Unifund  was wh ether a \nreimbursement provision of Ontario’s Insurance Act , R.S.O. 1990, c.  I.8, applied to an \n2023 SCC 29 (CanLII)\n\n--- Page 74 ---\n \n out-of-province insurer. An Ontario insurer had paid statutory no -fault benefits to its \nclients when they were injured in a car accident in British Columbia. The  Ontario \ninsurer then claimed reimbursement of these amounts from the B.C. -based insurer of \nthe driver who had caused the accident. The Ontario insurer invoked s.  275 of the \nOntario Insurance Act , which imposed an indemnification obligation on the responsi ble \ninsurer in certain cases. However, Binnie J. ruled that s.  275 of the Insurance Act  did \nnot apply in the circumstances.  \n[104]  Binnie J. considered whether the connection between Ontario and matters \noccurring outside the province was sufficient to support the  constitutional application \nof Ontario’s regulatory regime to the out -of-province insurer (para.  22). He observed \nthat “a province has no legislative competence to legislate extraterritorially” (para.  50). \nThis territorial restriction is “fundamental to ou r system of federalism” (para.  51), and \nflows both from the opening words of s.  92 of the Constitution Act, 1867 , which limits \nthe territorial reach of each provincial legislature to enacting legislation “ [i]n each \nProvince ”, and from s.  92(13), which give s a provincial legislature legislative authority \nto make laws in relation to property and civil rights only “ in the Province ” (para.  51 \n(emphasis in original)). However, Binnie J. accepted that a provincial legislative \nscheme can constitutionally apply to an out -of-province defendant without offending \nthe restriction on extraterritorial legislation, provided that there is a “real and \nsubstantial connection” or “sufficient connection” — terms he used interchangeably — \nbetween the legislative scheme and the o ut-of-province defendant. He formulated the \n2023 SCC 29 (CanLII)\n\n--- Page 75 ---\n \n following test for when provincial legislation applies to an out -of-province individual \nor entity:  \nConsideration of constitutional applicability  can conveniently be \norganized around the following propositions:  \n \n1. The territorial limits on the scope of provincial legislative authority \nprevent the application of the law of a province to matters not \nsufficiently connected to it;  \n \n2. What constitutes a “sufficient” connection depends on the \nrelationship among the en acting jurisdiction, the subject matter of the \nlegislation and the individual or entity sought to be regulated by it;  \n \n3. The applicability of an otherwise competent provincial legislation to \nout-of-province defendants is conditioned by the requirements of  order \nand fairness that underlie our federal arrangements;  \n \n4. The principles of order and fairness, being purposive, are applied \nflexibly according to the subject matter of the legislation. [Emphasis in \noriginal; para.  56.] \n[105]  Over the last two decades, cou rts have regularly applied the Unifund test \nwhen determining whether a provincial regulatory scheme constitutionally applies to \nout-of-province defendants.  \n[106]  In Ontario College of Pharmacists v. 1724665 Ontario Inc. , 2013 ONCA \n381,",
    "token_count": 1000,
    "start_token": 32400,
    "end_token": 33400,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 37,
    "source_file": "2023scc29.txt",
    "text": " purposive, are applied \nflexibly according to the subject matter of the legislation. [Emphasis in \noriginal; para.  56.] \n[105]  Over the last two decades, cou rts have regularly applied the Unifund test \nwhen determining whether a provincial regulatory scheme constitutionally applies to \nout-of-province defendants.  \n[106]  In Ontario College of Pharmacists v. 1724665 Ontario Inc. , 2013 ONCA \n381, 363 D.L.R. (4th) 724, the Ontario Court of Appeal applied the Unifund test and \nheld that the College of Pharmacists had jurisdiction over out -of-province parties who \nallegedly breached statutory provisions regulating the sale of prescripti on drugs in \nOntario (paras.  74-75).  \n2023 SCC 29 (CanLII)\n\n--- Page 76 ---\n \n [107]  In the securities context, the Saskatchewan Court of Appeal in Berger v. \nSaskatchewan (Financial and Consumer Affairs Authority) , 2019 SKCA 89, ruled that \nthe Financial and Consumer Affairs Authority of Saskatchewan sho uld have applied \nthe Unifund test to determine whether The Securities Act, 1988 , S.S.  1988 -89, \nc. S-42.2, applied to a resident of Costa Rica (paras.  64-66 (CanLII)). The court held \nthat “a province cannot use its legislative authority to empower an admini strative \ntribunal to apply laws extraprovincially”, and it noted that “the question will always be \nwhether the connection between the matter before a tribunal and the province in \nquestion is sufficient to give the tribunal jurisdiction” (para.  60).  \n[108]  Simila rly, the British Columbia Court of Appeal has applied the Unifund \ntest to determine whether that province’s Securities Commission had jurisdiction over \nout-of-province defendants who allegedly breached the Securities Act , R.S.B.C. 1996, \nc. 418 ( McCabe , at para.  34; see also Torudag v. British Columbia  (Securities \nCommission) , 2011 BCCA 458, 343 D.L.R. (4th) 743, at paras.  16-29). \n[109]  This Court has also applied the “sufficient connection” test when \ndetermining whether federal regulatory legislation applies to m atters involving \ninternational elements. In Society of Composers, Authors and Music Publishers of \nCanada v. Canadian Assn. of Internet Providers , 2004 SCC 45, [2004] 2 S.C.R. 427, \nthe Court cited Unifund and ruled that the applicability of the Copyright Ac t, R.S.C. \n1985, c. C -42, to communications with international participants depends on whether \n2023 SCC 29 (CanLII)\n\n--- Page 77 ---\n \n there is a “sufficient connection between this country and the communication in \nquestion for Canada to apply its law” (para.  57). \n[110]  As a result, the “real and subst antial connection” test in Unifund  is now the \n“accepted test for discerning the presumptively intended reach of federal legislation as \nwell as the constitutionally permissible application of provincial legislation” \n(R. Sullivan, The Construction of Statute s (7th ed. 2022),  at p. 806).  \n[111]  Four aspects of the Unifund  test warrant particular emphasis.  \n(a) The Unifund Test Concerns Constitutional Applicability, Not \nConstitutional Validity  \n[112]  First, the Unifund “sufficient connection” test is not concerned with the \nconsti tutional validity  of legislation but with its constitutional applicability . Unifund  \ndoes not address the situation in which the constitutional validity of provincial \nlegislation is challenged because the legislation violates the territorial limitations on \nprovincial legislative competence — that is, when the law is said to be ultra vires  or to \nfall outside the jurisdiction of the enacting provincial legislature ( British Columbia v. \nImperial Tobacco Canada Ltd. , 2005 SCC 49, [2005] 2 S.C.R. 473; J.  Blom, \n“Constitutionalizing Canadian private international law — 25 years since Morguard ” \n(2017), 13 J. Priv. Int’l L.  259, at p. 288; J. Walker, Canadian Conflict of Laws  (7th ed. \n(loose -leaf)), at §  1.02). There was no constitutional challenge",
    "token_count": 1000,
    "start_token": 33300,
    "end_token": 34300,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 38,
    "source_file": "2023scc29.txt",
    "text": " SCC 49, [2005] 2 S.C.R. 473; J.  Blom, \n“Constitutionalizing Canadian private international law — 25 years since Morguard ” \n(2017), 13 J. Priv. Int’l L.  259, at p. 288; J. Walker, Canadian Conflict of Laws  (7th ed. \n(loose -leaf)), at §  1.02). There was no constitutional challenge to the validity of t he \nOntario Insurance Act  in Unifund , nor is there any such challenge to the Quebec \n2023 SCC 29 (CanLII)\n\n--- Page 78 ---\n \n securities scheme in this case. Rather, the issue is whether the relevant provincial \nlegislation is constitutionally applicable  to the out -of-province defendants ( Unifund , at \nparas.  55-56). As Professors Elizabeth Edinger and Vaughan Black have explained, the \nquestion of constitutional applicability “usually concerns interjurisdictional immunity, \nbut may entail questions about the territorial reach of provincial legislation i n particular \napplications” (“A New Approach to Extraterritoriality: Unifund Assurance Co. v. \nI.C.B.C. ” (2004), 40 Can. Bus. L.J.  161, at p.  173; see also p. 177).  \n(b) The Unifund Test Functions as a Principle of Statutory Interpretation  \n[113]  Second, like the doctr ine of interjurisdictional immunity in constitutional \nlaw, the Unifund  test functions as a principle of statutory interpretation. As noted by \nProfessors Peter W. Hogg and Wade K. Wright, under the doctrine of interjurisdictional \nimmunity, a broadly framed provincial or federal law that is valid in most of its \napplications “should be interpreted  so as not to apply to the matter that is outside the \njurisdiction of the enacting body” ( Constitutional Law of Canada  (5th ed. Supp.) , at \n§ 15:16 (emphasis added)). The enacting legislative body “is presumed to have meant \nto enact provisions which do not transgress the limits of its constitutional powers; \ngeneral language which appears to transgress the limits must therefore be ‘read down’ \nso that it is confined withi n the limits” (§  15:15; see also H.  Brun, G.  Tremblay and \nE. Brouillet, Droit constitutionnel  (6th ed. 2014), at para.  VI-2.56). “Reading down is \nsimply a canon of construction (or interpretation)” (Hogg and Wright, at §  15:15).  \n2023 SCC 29 (CanLII)\n\n--- Page 79 ---\n \n [114]  Similarly, the Unifund  “sufficient connection” test limits, or reads down, \nthe territorial reach of otherwise broadly framed provincial legislation, consistent with \nthe territorial restrictions on provincial legislative power in ss.  91 and  92 of the \nConstitution Act, 1867 . It does s o by insisting on a “sufficient connection” between the \nlegislation and the out -of-province defendant (Sullivan, at pp. 821 -23). As Professor \nJoost Blom has explained, the Unifund  test “functions as a kind of unilateral, negative \nchoice of law principle, because it defines the permissible territorial ambit of the \nprovincial rule” ((2017), at p. 288; see also J.  Blom, “Regulation of Contracts in \nCanadian Private International Law” ( 2014), 31 Ariz. J. Int’l & Comp. L.  21, at p.  31; \nEdinger and Black, at pp.  181-82; N. Hume, “Four Flaws: Reflections on the Canadian \nApproach to Private International Law” (2006), 44 Can. Y.B. Int’l L.  161, at p.  234). In \nshort, the Unifund  test allows a statute to be interpreted to apply to an out -of-province \ndefendant in certain circumstances without having an extraterritorial effect.  \n(c) The Unifund Test Relates to Prescriptive Legislative Jurisdiction  \n[115]  Third, the Unifund “sufficient connection” test relates  to prescriptive  \nlegislative  jurisdiction , rather than adjudicatory  jurisdiction , although the latter may \nflow from the former. Prescriptive legislative jurisdiction is “the power to make rules, \nissue commands or grant authorizations that are",
    "token_count": 1000,
    "start_token": 34200,
    "end_token": 35200,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 39,
    "source_file": "2023scc29.txt",
    "text": " \ndefendant in certain circumstances without having an extraterritorial effect.  \n(c) The Unifund Test Relates to Prescriptive Legislative Jurisdiction  \n[115]  Third, the Unifund “sufficient connection” test relates  to prescriptive  \nlegislative  jurisdiction , rather than adjudicatory  jurisdiction , although the latter may \nflow from the former. Prescriptive legislative jurisdiction is “the power to make rules, \nissue commands or grant authorizations that are binding upon persons and entities” ( R. \nv. Hape , 2007 SCC 26, [2007] 2 S.C.R. 292, at para.  58; see also Edinger and Black, at \npp. 165 -66; British Columbia v. Imperial Tobacco Canada Ltd. , 2004 BCCA 269, 239 \nD.L.R. (4th) 412, at para.  23, aff’d 2005 SCC 49, [2005] 2 S.C .R. 473; and B.  Kain and \n2023 SCC 29 (CanLII)\n\n--- Page 80 ---\n \n B. Shaw, “Mapping the Serbonian Bog: The Territorial Limits of Secondary Market \nSecurities Act Claims Under the Canadian Constitution — Part 1” (2012), 53 Can. Bus. \nL.J. 63, at pp.  74-75). Adjudicatory jurisdiction, also known as j udicial jurisdiction, is \nthe power of a court or tribunal to “resolve disputes or interpret the law through \ndecisions that carry binding force” ( Hape , at para.  58), and includes the power to take \njurisdiction over a matter that may have extraterritorial co nnections ( Hape , at para.  59; \nImperial Tobacco (BCCA), at para.  23; Edinger and Black, at p.  165).  \n[116]  In Unifund , Binnie J. distinguished between prescriptive legislative \njurisdiction and adjudicatory jurisdiction, both of which are governed by different \nversions of the “real and substantial connection” test. As Binnie J. noted, “a ‘real and \nsubstantial connection’ sufficient to permit the court of a province to take jurisdiction \nover a dispute may not be sufficient for the law of a province to regulate the o utcome” \n(para.  58). He later added that “[a] relationship that is inadequate to support the \napplication of regulatory legislation may nevertheless provide a sufficient ‘real and \nsubstantial connection’ to permit the courts of the forum to take jurisdiction  over a \ndispute. This happens regularly. The courts, having taken jurisdiction, then apply the \nlaw of the other province applying rules of conflict resolution governing choice of law \nissues” (para.  80). In Unifund , Binnie J. concluded that the reimbursemen t obligation \nin s. 275 of the Ontario Insurance Act  did not apply to the B.C. -based insurer \n(prescriptive legislative jurisdiction), and thus the Ontario courts also had no \njurisdiction to appoint an arbitrator under the Ontario Insurance Act  (adjudicatory  or \njudicial jurisdiction) (para.  44). \n2023 SCC 29 (CanLII)\n\n--- Page 81 ---\n \n (d) The Unifund Test Is Part of a Family of “Real and Substantial Connection” \nTests  \n[117]  Fourth, the test in Unifund  is distinct from the “real and substantial \nconnection” tests that this Court has developed elsewhere in the d omain of conflicts of \nlaws. The courts below and the parties before this Court disagree about which version \nof the real and substantial connection test applies in this case. The Quebec Superior \nCourt determined that the FMAT had correctly applied the real and substantial \nconnection test in Van Breda , but the court also looked to Unifund for what might \nconstitute a “sufficient connection” (para.  39). The appellants argue that the \nC.C.Q.  supplies the rules for the international jurisdiction of Quebec authorit ies, but \nnote that if the “real and substantial connection” test applies, then this Court’s \nformulation of that test in Van Breda  should apply. The respondent argues that the “real \nand substantial connection” test in Unifund  applies.  \n[118]  The “real and substant ial connection” test has been described both as a \nsingle test that applies in a variety of different contexts ( Van Breda , at paras.  23-31), \nand as a collection of different tests with a common family resemblance (",
    "token_count": 1000,
    "start_token": 35100,
    "end_token": 36100,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 40,
    "source_file": "2023scc29.txt",
    "text": " then this Court’s \nformulation of that test in Van Breda  should apply. The respondent argues that the “real \nand substantial connection” test in Unifund  applies.  \n[118]  The “real and substant ial connection” test has been described both as a \nsingle test that applies in a variety of different contexts ( Van Breda , at paras.  23-31), \nand as a collection of different tests with a common family resemblance (J.  Blom and \nE. Edinger, “The Chimera of the  Real and Substantial Connection Test” (2005), 38 \nU.B.C. L. Rev.  373, at pp.  373-74). Although both views have merit, we refer to the \n“real and substantial connection” test as a family of tests to emphasize that the same \nformula of words — that is, “real a nd substantial connection” — involves different \nconsiderations in each of the varying contexts in which the formula is employed.  \n2023 SCC 29 (CanLII)\n\n--- Page 82 ---\n \n [119]  For example, in Morguard Investments Ltd. v. De Savoye , [1990] 3 S.C.R. \n1077, this Court ruled that a court in one province should recognize and enforce a \njudgment of the court of another province if there is a “real and substantial connection” \nbetween that other court and the subject matter of the litigation  (pp. 1107 -8). In Beals \nv. Saldanha , 2003 SCC 72, [2003] 3 S.C.R. 416 , the Court extended the principles in \nMorguard  to foreign judgments and ruled that Canadian courts should recognize and \nenforce a judgment of a court outside Canada when there is a “real  and substantial \nconnection” between the cause of action and the foreign court (paras.  32 and 37).  \n[120]  In Van Breda , this Court developed a “real and substantial connection” test \nin the context of deciding whether a court can assume jurisdiction over a tort c laim \nbrought by Canadian residents who were injured abroad. The Court identified \npresumptive connecting factors that prima facie  entitle a court to assume jurisdiction \nover a tort dispute and explained how such a presumption of jurisdiction is subject to \nrebuttal. The Court also clarified that this version of the “real and substantial \nconnection” test is a common law test. In Quebec, “the Civil Code of Québec contains \na list of factors that must be considered in order to determine whether a Quebec \nauthority  has jurisdiction over a delictual or quasi -delictual action (art. 3148)” \n(para.  77; see also Spar Aerospace , at paras.  55-56). \n[121]  This Court also developed a version of the real and substantial connection \ntest in Libman v. The Queen , [1985] 2 S.C.R. 178,  to determine whether a transnational \ncrime, which took place partly in Canada, could be prosecuted in Canada. The Court \n2023 SCC 29 (CanLII)\n\n--- Page 83 ---\n \n held that such a crime can be prosecuted in Canada when there is a “real and substantial \nlink” between the offence and this country (pp.  212-13). \n[122]  As a final example, this Court has developed a “real and substantial \nconnection” test in the context of determining whether provincial legislation is \nconstitutionally applicable to out -of-province defendants or circumstances (see Blom \n(2017), at pp.  288-89). In Hunt v. T&N plc , [1993] 4 S.C.R. 289, the Court decided that \na Quebec “blocking” statute prohibiting the transfer of documents to other jurisdictions \nwas constitutionally inapplicable to other provinces. The Court confirmed that “courts \nare re quired, by constitutional restraints, to assume jurisdiction only where there are \nreal and substantial connections to that place”, and held that “the presence of such \nblocking statutes is an anachronism .  . . inimical to [interprovincial] litigation if app lied \non the interprovincial level” (p. 328). In Unifund , this Court built on Hunt  and ruled \nthat provincial regulatory legislation is constitutionally applicable to out -of-province \ndefendants when there is a “sufficient connection” between the province and  the out -\nof-province defendants, subject to the principles of order and fairness (para.  56). \n[123]  The appellants’ argument and the Superior",
    "token_count": 1000,
    "start_token": 36000,
    "end_token": 37000,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 41,
    "source_file": "2023scc29.txt",
    "text": "] litigation if app lied \non the interprovincial level” (p. 328). In Unifund , this Court built on Hunt  and ruled \nthat provincial regulatory legislation is constitutionally applicable to out -of-province \ndefendants when there is a “sufficient connection” between the province and  the out -\nof-province defendants, subject to the principles of order and fairness (para.  56). \n[123]  The appellants’ argument and the Superior Court’s conclusion that the Van \nBreda  “real and substantial connection” test should apply here are misplaced. Van \nBreda set out the real and substantial connection test in the context of tort claims at \ncommon law and does not apply in Quebec. The counterpart to the Van Breda test for \npersonal actions of a patrimonial nature in Quebec is contained in art. 3148 C.C.Q.  \n(Van Br eda, at para.  77). In any event, in the present case, the Court is asked to \n2023 SCC 29 (CanLII)\n\n--- Page 84 ---\n \n determine whether Quebec’s securities regulatory scheme constitutionally applies to \nthe out -of-province appellants as a matter of prescriptive legislative jurisdiction. \nConsequentl y, the Unifund  test applies.  \n(2) Interpreting the Special Jurisdictional Rules of the Quebec Securities \nScheme in Light of Unifund  \n[124]  The Quebec securities scheme, interpreted in light of the Unifund  test, \nprovides for jurisdiction over out -of-province parties wi th a “sufficient connection” or \n“real and substantial connection” with Quebec. On their face, the special jurisdictional \nprovisions in the Act respecting the Autorité des marchés financiers  and the Securities \nAct are not limited in their territorial reach.  Constitutionally, they apply only to matters \nwithin Quebec’s territorial jurisdiction. Unifund provides the appropriate test for \nevaluating the territorial applicability of these statutes to a particular set of \ncircumstances. It functions, as a canon of c onstruction, to limit the application of \nQuebec’s securities scheme to those persons and matters with a “sufficient connection” \nor “real and substantial connection” to the province. These provisions thus give the \nFMAT plenary international jurisdiction to make determinations and issue orders \nagainst persons under the Securities Act  when there is a sufficient connection with \nQuebec.  \n[125]  The Quebec securities scheme may be said to both complement and \nderogate  from the rules for the international jurisdiction of Q uebec authorities in Title \nThree of Book Ten of the C.C.Q.  The Quebec securities scheme may be said to \n2023 SCC 29 (CanLII)\n\n--- Page 85 ---\n \n complement  the C.C.Q.  because the special statutes’ jurisdictional rules for the FMAT \nwork alongside the general jurisdictional rules in the jus commune . But the Quebec \nsecurities scheme may also be said to derogate  from the C.C.Q.  because, in this case, \nas demonstrated below, the application of the special jurisdictional rules provides the \nFMAT with jurisdiction over the out -of-province appellants, even t hough the C.C.Q. ’s \ngeneral rules do not.  \nF. The Quebec Securities Scheme Applies to the Out -of-Province Appellants  \n[126]  Finally, it must be determined whether the FMAT’s exercise of jurisdiction \nover the out -of-province appellants would be contrary to the constit utional limitations \nset out in Unifund , which asks whether there is a sufficient connection between Quebec \nand the facts alleged against the appellants based on the following four principles:  \n1. The territorial limits on the scope of provincial legislative  authority \nprevent the application of the law of a province to matters not sufficiently \nconnected to it;  \n2. What constitutes a “sufficient” connection depends on the relationship \namong the enacting jurisdiction, the subject matter of the legislation and \nthe individual or entity sought to be regulated by it;  \n3. The applicability of an otherwise competent provincial legislation to out -\nof-province defendants is conditioned by the requirements of order and \nfairness that underlie our federal arrangements;  \n4. The principles of order and fairness, being purposive, are applied \nflexibly according to the subject matter of the legislation. [para. 56]  \n(1) There Is a Sufficient Connection Between Quebec and the Appellants  \n2023 SCC 29 (CanLII)\n\n--- Page 86 ---\n \n [127]  The first two principles in Unifund  are related. Th e first principle requires \na sufficient connection, while the second principle identifies factors that",
    "token_count": 1000,
    "start_token": 36900,
    "end_token": 37900,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 42,
    "source_file": "2023scc29.txt",
    "text": "4. The principles of order and fairness, being purposive, are applied \nflexibly according to the subject matter of the legislation. [para. 56]  \n(1) There Is a Sufficient Connection Between Quebec and the Appellants  \n2023 SCC 29 (CanLII)\n\n--- Page 86 ---\n \n [127]  The first two principles in Unifund  are related. Th e first principle requires \na sufficient connection, while the second principle identifies factors that might furnish \nthat connection (Sullivan, at p.  822). This involves a contextual inquiry. As Binnie  J. \nnoted in Unifund , “different degrees of connection to the enacting province may be \nrequired according to the subject matter of the dispute” (para.  65). In each case, a court \nor tribunal must examine the relationship among the enacting jurisdiction, the subject \nmatter of the law, and the person sought to be  regulated by it, to decide whether that \nrelationship is sufficient to support the applicability of the legislation to the out -of-\nprovince person (para.  65). \n[128]  The “sufficient connection” analysis must recognize the transnational \nnature of modern securities regulation and the public interest in addressing international \nmarket manipulation. Securities regulation raises unique considerations that highlight \nthe need for transnational enforcement. As this Court noted in Global Securities Corp. \nv. British Columbia  (Securities Commission) , 2000 SCC 21, [2000] 1 S.C.R. 494, the \n“securities market has been an international one for years” and the “Internet has greatly \nincreased the ability of securities traders to extend across borders” (para.  28). To \neffectively regul ate the securities market, “regulators must equally be able to respond, \nand surmount borders where legally possible” (para.  28).  \n[129]  Applying the first two Unifund  principles, there is a sufficient connection \nbetween Quebec and the out -of-province appellants,  all of whom allegedly participated \nin a fraudulent securities manipulation scheme with important ties to Quebec. The \n2023 SCC 29 (CanLII)\n\n--- Page 87 ---\n \n appellants allegedly used Quebec as the “face” of their alleged pump -and-dump scheme \nby promoting Solo’s mining activities in Quebec. They  participated in marketing or \nfinancing efforts and partly targeted Quebec residents. Solo, the company through \nwhich the appellants operated their scheme, was a reporting issuer in Quebec, and \nSolo’s director was a Quebec resident. There was thus a clear connection between Solo \nand the appellants, on the one hand, and the province of Quebec on the other. In the \ncircumstances, it would defeat the purpose of the cross -border nature of modern \nsecurities regulation to allow the appellants to escape the reach o f Quebec’s regulatory \noversight.  \n[130]  The appellant Sharp argues that the FMAT and courts below failed to \nanalyze the AMF’s specific allegations against him, which relate only to the purchase \nand sale of securities outside of Quebec. We do not accept this submi ssion. The AMF \nalleges that he participated in one or more stages of the appellants’ securities \nmanipulation scheme, that he was closely implicated by buying or selling securities, \nand that the scheme had important links to Quebec. Under Unifund , that conn ection \nsuffices to apply Quebec’s securities regulatory scheme to him.  \n(2) The Requirements of Order and Fairness Are Satisfied  \n[131]  The third and fourth Unifund principles are also related and “incorporate \nthe notions of interprovincial comity and fairness to the  defendant” (Sullivan, at \np. 822). The third principle requires a court or tribunal to consider the principles of \norder and fairness, which function “as a mechanism to regulate extraterritoriality \n2023 SCC 29 (CanLII)\n\n--- Page 88 ---\n \n concerns” ( Unifund , at para.  73) by ensuring the “security of transactions with justice” \n(para.  68, citing Morguard , at p.  1097). “Order” refers to the idea that courts and \ntribunals must respect the principle of interprovincial comity and only assume \njurisdiction where constitutionally appropriate ( Unifund , at pa ra. 71; Morguard , at \np. 1102). “Fairness” refers to fairness to the out -of-province defendant ( Unifund , at \npara.  72; Morguard , at p.  1103). Finally, the fourth Unifund",
    "token_count": 1000,
    "start_token": 37800,
    "end_token": 38800,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 43,
    "source_file": "2023scc29.txt",
    "text": " refers to the idea that courts and \ntribunals must respect the principle of interprovincial comity and only assume \njurisdiction where constitutionally appropriate ( Unifund , at pa ra. 71; Morguard , at \np. 1102). “Fairness” refers to fairness to the out -of-province defendant ( Unifund , at \npara.  72; Morguard , at p.  1103). Finally, the fourth Unifund  principle requires a court \nor tribunal to apply the principles of order and fairness pur posively and flexibly given \nthe subject matter of the legislation and the type of jurisdiction being asserted ( Unifund , \nat para.  80). \n[132]  In our view, it is consistent with the principles of order and fairness and \nwould not raise any extraterritoriality concer ns to apply Quebec’s securities regulatory \nscheme to the appellants.  \n[133]  Applying the Quebec regulatory regime is fair to the appellants. The \nappellants chose to enter Quebec’s securities marketplace (see Unifund , at para.  77), \nand they promoted the Quebec mi ning prospects of Solo, a reporting issuer in Quebec. \nBecause the appellants made Quebec the face of their securities manipulation \noperation, their entrance into Quebec’s market was not accidental or irrelevant, but \nrather was an integral part of the schem e. \n[134]  In addition, applying Quebec’s securities regulatory scheme to the \nappellants does not offend the principle of order or the related concept of \ninterprovincial comity. Given the cross -border nature of securities manipulation and \n2023 SCC 29 (CanLII)\n\n--- Page 89 ---\n \n securities fraud, regulators from multiple jurisdictions may exercise jurisdiction over \nthe same scheme. As noted by the intervener the Ontario Securities Commission, this \nis “a feature, not a flaw” of modern securities regulation (I.F., at para.  15). “It promotes \nthe seaml ess coverage of regulatory protection and the imposition of public interest \nremedies across the territories affected by a single, unlawful scheme” (para.  15). We \nalso agree with the AMF: [TRANSLATION ] “. . . nothing precludes such a multiplicity of \nproceed ings because each of the proceedings constitutes a legitimate exercise of the \njurisdiction of the state concerned.  . . . [T]he application of the sufficient connection \ntest is not a zero -sum game ” (R.F., at paras.  81 and 87).  \n[135]  Because contemporary securiti es manipulation and fraud are often \ntransnational and extend across provincial and national borde rs, courts and tribunals \nmust take a flexible and purposive approach when applying the principles of order and \nfairness in the securities context. In our view,  it is consistent with the principles of order \nand fairness for the FMAT to have jurisdiction over the appellants.  \n(3) The FMAT’s Adjudicatory Jurisdiction Flows From the Province’s \nPrescriptive Legislative Jurisdiction  \n[136]  In closing, it bears noting that while p rescriptive legislative jurisdiction and \nadjudicatory jurisdiction are distinct concepts ( Unifund , at para.  58), in this case the \nFMAT’s adjudicatory jurisdiction flows from the province’s prescriptive legislative \njurisdiction. Section  93 of the Act respec ting the Autorité des marchés financiers  \nstipulates that the FMAT shall exercise jurisdiction under the Securities Act . Since the \n2023 SCC 29 (CanLII)\n\n--- Page 90 ---\n \n Quebec legislature has decided that the FMAT shall adjudicate alleged breaches of the \nSecurities Act  and the appellants’ alleg ed conduct has a real and substantial connection \nwith Quebec, the FMAT necessarily has jurisdiction over the appellants in respect of \ntheir alleged contraventions. The special legislation, properly interpreted, thus provides \nfor the FMAT’s adjudicatory jur isdiction.  \nVI. Conclusion  \n[137]  The jurisdictional rules of the Quebec securities scheme  are \nconstitutionally applicable to the out -of-province appellants. These provisions grant the \nFMAT jurisdiction over the appellants’ alleged contraventions of the Securities Ac t. \nBased on the facts alleged by the AMF, there is a sufficient connection between Quebec \nand the appellants to justify applying Quebec’s security regulatory scheme to them. As \na result, the FMAT correctly concluded that it has jurisdiction over the appell ants. \n[138]  We would dismiss the appeals with costs.  \nEnglish version of the reasons delivered by  \n CÔTÉ J. —  \nI. Overview  \n[139",
    "token_count": 1000,
    "start_token": 38700,
    "end_token": 39700,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 44,
    "source_file": "2023scc29.txt",
    "text": " alleged contraventions of the Securities Ac t. \nBased on the facts alleged by the AMF, there is a sufficient connection between Quebec \nand the appellants to justify applying Quebec’s security regulatory scheme to them. As \na result, the FMAT correctly concluded that it has jurisdiction over the appell ants. \n[138]  We would dismiss the appeals with costs.  \nEnglish version of the reasons delivered by  \n CÔTÉ J. —  \nI. Overview  \n[139]  These appeals raise the question of whether the Financial Markets \nAdministrative Tribunal (“FMAT”) has jurisdiction over the appellants, who are  \n2023 SCC 29 (CanLII)\n\n--- Page 91 ---\n \n domiciled outside Quebec, specifically in the province of British Columbia, either \nunder the rules in Title Three of Book Ten of the Civil Code of Québec  (“C.C.Q. ”) \nwhich relate to the international jurisdiction of Quebec authorities, or on the basis of \nthe “real and substantial connection” test set out in Unifund Assurance Co. v. Insurance \nCorp. of British Columbia , 2003 SCC 40, [2003] 2 S.C.R. 63, at paras.  55-56. \n[140]  According to my colleagues, this case raises an issue regarding the \nconstitutional applicability of the Securities Act , CQLR, c.  V-1.1 (“SA”), which means \nthat the FMAT’s jurisdiction must be assessed on the basis of the sufficient connection \ntest from Unifund . I disagree with that position. In my view, at this stage of the \nproceedings, the case raises no issue regarding the constitutional applicability of the SA \nbut rather concerns the FMAT’s adjudicative jurisdiction. Consequently, the limits of \nthe FMA T’s jurisdiction must instead be analyzed in light of the rules of private \ninternational law set out in Title Three of Book Ten of the C.C.Q.  \n[141]  Applying those provisions to this case, I conclude that the appeals should \nbe allowed on the basis that the FMAT d oes not have adjudicative jurisdiction over the \nappellants and therefore cannot hear the matter brought before this Court.  \n[142]  I agree with my colleagues that correctness is the applicable standard of \nreview; the only issue is thus whether the FMAT has adjudic ative jurisdiction over the \nappellants, who are domiciled outside Quebec.  \n2023 SCC 29 (CanLII)\n\n--- Page 92 ---\n \n [143]  My analysis proceeds as follows. First, I summarize the facts and the \nprocedural context of this dispute. Next, I explain the distinction between the \nconstitutional applicability of legislation and the adjudicative jurisdiction of a court or \nadministrative tribunal. Based on this analysis, I show that this dispute relates to the \nFMAT’s adjudicative jurisdiction, more particularly its territorial component \n(jurisdiction ratione persona e), and consequently that the C.C.Q. ’s rules on the \ninternational jurisdiction of Quebec authorities are applicable. Because there is no \nprovision in the SA, the Act respecting the Autorité des marchés financiers , CQLR, \nc. A-33.2 (“ AAMF ”), or the C.C.Q.6 that gives the FMAT adjudicative jurisdiction over \nthe appellants in the specific proceedings brought against them by the Autorité des \nmarchés financiers (“AMF” or “Authority”), I conclude that the appellants’ declinatory \nexceptions should have been allowed . \nII. Facts and Procedural Context  \n[144]  On the whole, I agree with my colleagues’ overview of the facts and \nsummary of the decisions below. However, I wish to clarify certain points regarding \nthe procedural context of this dispute.  \n[145]  In 2017, the AMF filed an application with the FMAT against a number of \ndefendants, some of whom — the appellants — are residents of British Columbia. In \nthe application, the AMF alleged that the defendants had taken part in what is \n                                                 \n6 The relevant provisions are reproduced in an appendix to these reasons . \n2023 SCC 29 (CanLII)\n\n--- Page 93 ---\n \n commonly called a “ pump and dump scheme” or, in o ther words, that they had \ninfluenced or manipulated the  market price or value of a security by unfair, improper \nor fraudulent means and participated in transactions in securities that created an \nartificial price for a security, in contravention of the SA. The AMF therefore asked the \nFMAT to order the defendants to cease any activity in respect of a transaction in \nsecurities , to prohibit them from acting as directors or officers of an",
    "token_count": 1000,
    "start_token": 39600,
    "end_token": 40600,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 45,
    "source_file": "2023scc29.txt",
    "text": " and dump scheme” or, in o ther words, that they had \ninfluenced or manipulated the  market price or value of a security by unfair, improper \nor fraudulent means and participated in transactions in securities that created an \nartificial price for a security, in contravention of the SA. The AMF therefore asked the \nFMAT to order the defendants to cease any activity in respect of a transaction in \nsecurities , to prohibit them from acting as directors or officers of an issuer, dealer, \nadviser or investment fund manager for five years, and to impose administrative \npenalties on them, in accordance with ss.  195.2, 199.1 para.  1(1), 265, 273.1 and 273.3 \nSA. \n[146]  In response to the AMF’s application, the appellants filed preliminary \nexceptions in the form of declinatory exceptions, in which they argued that the FMAT \nlacked adjudicative jurisdiction over them. The FMAT dismissed the preliminary \nexceptions and found that it had jurisdiction to hear the matter. The Quebec Superior \nCourt dismissed the applications for judicial review of that decision filed b y the \nappellants, whose subsequent appeals to the Quebec Court of Appeal were \nunsuccessful.  \n[147]  The appellants’ declinatory exceptions are based on the FMAT’s lack of \nadjudicative jurisdiction over them. As this Court explained in Newfoundland and \nLabrador (At torney General) v. Uashaunnuat (Innu of Uashat and of Mani -Utenam) , \n2020 SCC 4, [2020] 1 S.C.R. 15, “[s]uch a declinatory exception must be disposed of \non a preliminary basis” (para.  85, citing A.  Rochon, with the collaboration of \n2023 SCC 29 (CanLII)\n\n--- Page 94 ---\n \n F. Le Colleter, Guide des  requêtes devant le juge unique de la Cour d’appel: Procédure \net pratique  (2013), at p.  77, and Transax Technologies inc. v. Red Baron Corp. Ltd, \n2016 QCCA 1432, at para.  6 (CanLII)). Thus, at this preliminary stage of the \nproceedings, a court or tribunal “is not to consider the merits of the case, but rather, is \nto take as averred the facts that are alleged by the plaintiff to bring it within the \njurisdictional competence of the Quebec courts” ( Spar Aerospace Ltd. v. American \nMobile Satellite Corp. , 2002 S CC 78, [2002] 4 S.C.R. 205 , at para.  31, citing Air \nCanada v. McDonnell Douglas Corp. , [1989] 1 S.C.R. 1554 , at p.  1558, and Rosdev \nInvestments Inc. v. Allstate Insurance Co. of Canada , [1994] R.J.Q. 2966  (Sup. Ct.), at \np. 2968) . It is also important to no te that when the international jurisdiction of a Quebec \ncourt or tribunal is challenged, the party arguing that the court or tribunal has \njurisdiction bears the burden of demonstrating this. And where an action involves more \nthan one defendant, as here, ju risdiction over each of them must be established.  \n[148]  In light of the procedural context of this dispute, the issue is therefore not \nwhether the SA applies in this case to the merits of the matter but rather whether the \nFMAT has jurisdiction in the proceedings  brought against the appellants. For the \nreasons I explain more fully below, these appeals must be decided by applying the rules \non the international jurisdiction of Quebec authorities found in Title Three of Book Ten \nof the C.C.Q.  \nIII. Analysis  \n2023 SCC 29 (CanLII)\n\n--- Page 95 ---\n \n [149]  To begin my ana lysis, I think it is appropriate to specify the points on which \nI agree with my colleagues.  \n[150]  I have already stated above that I agree with the application of the \ncorrectness standard of review. Moreover, it is self -evident that because the C.C.Q.  sets \nout t he jus commune  of Quebec, it does not simply lay down a body of private law \nrules. As its preliminary provision states, the C.C.Q . “is the foundation of all other \nlaws, although other laws may complement the Code or make exceptions to it”. I \ntherefore agre e with my colleagues, and with Mainville  J.A",
    "token_count": 1000,
    "start_token": 40500,
    "end_token": 41500,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 46,
    "source_file": "2023scc29.txt",
    "text": " \ncorrectness standard of review. Moreover, it is self -evident that because the C.C.Q.  sets \nout t he jus commune  of Quebec, it does not simply lay down a body of private law \nrules. As its preliminary provision states, the C.C.Q . “is the foundation of all other \nlaws, although other laws may complement the Code or make exceptions to it”. I \ntherefore agre e with my colleagues, and with Mainville  J.A., that the rules in Title \nThree of Book Ten of the C.C.Q.  apply to determine the international jurisdiction of \nQuebec authorities, even the jurisdiction of an administrative tribunal, and that a \nconflict of juri sdiction or a conflict of laws is not necessary.  \n[151]  Like my colleagues, and for the reasons I explain below, I am of the view \nthat arts.  3134, 3136 and 3148 C.C.Q.  do not give the FMAT any jurisdiction over the \nappellants.  \n[152]  I also agree with my colleagues that  special laws may make exceptions to \nor derogate from the rules in the C.C.Q.  My colleagues are of the view, as am I, that \nneither the SA nor the AAMF , individually or read together, expressly  derogates from \nthe rules in Title Three of Book Ten of the C.C.Q. so as to give the FMAT jurisdiction \nover the appellants, who are domiciled outside Quebec (“neither statute expressly \nprovides for the FMAT to assert jurisdiction over out -of-province parties, or otherwise \n2023 SCC 29 (CanLII)\n\n--- Page 96 ---\n \n limits the territorial reach of the Quebec secu rities scheme over interprovincial or \ninternational transactions” (para.  102)).  \n[153]  Where I disagree completely with my colleagues is on their conclusion that \nthere is a kind of implicit derogation, which they reach by interpreting the Quebec \nsecurities scheme  in light of Unifund . My colleagues state that “ while the C.C.Q.  does \nnot grant the FMAT jurisdiction over the out -of-province appellants in this case, the \njurisdictional provisions of the special securities scheme, properly interpreted in light \nof Unifund , do grant jurisdiction because the appellants, and their alleged \ncontraventions, have a sufficient connection to Quebec ” (para.  41). \n[154]  I cannot accept that reasoning, because the C.C.Q.  “contains a \nwell-developed set of rules and principles [of private inte rnational law]” ( Club Resorts \nLtd. v. Van Breda , 2012 SCC 17, [2012] 1 S.C.R. 572, at para.  21). In fact, the C.C.Q. \ncodifies the “sufficient connection” test (“sufficient connection” and “real and \nsubstantial connection” are synonymous). The rules on the international jurisdiction of \nQuebec authorities (arts.  3134 to 3154 C.C.Q. ) [TRANSLATION ] “are substantive rules \nfor determining whether Quebec courts or tribunals have jurisdiction to hear a dispute \n. . . . [These] rules .  . . are intended to ensure that  there are connections between Quebec \nand the dispute submitted that are considered sufficient” (P.  Ferland and G.  Laganière, \n“Le droit international privé”, in Collection de droit de l’École du Barreau du Québec \n2023 -2024, vol.  7, Contrats, sûretés, publi cité des droits et droit international privé  \n(2023), 271, at p.  303). If no special law makes exceptions to or derogates from the set \n2023 SCC 29 (CanLII)\n\n--- Page 97 ---\n \n of rules in Book Ten of the C.C.Q. , the FMAT has no jurisdiction over the appellants, \nwho are domiciled outside Quebec.  \n[155]  After finding that neither Book Ten of the C.C.Q.  nor the Quebec securities \nscheme expressly confers territorial jurisdiction on the FMAT, my colleagues continue \ntheir analysis by interpreting the securities scheme in light of Unifund . I disagree with \nthat a pproach. Unifund  cannot serve as a safety net where the C.C.Q.  does not establish \nthe territorial jurisdiction of a court or tribunal and the legislature has not otherwise \nconferred territorial jurisdiction on it through special legislation. In short, when  there \nis no jurisdiction, that must be the end of the analysis. This means that recourse should \nnot be had to Unif",
    "token_count": 1000,
    "start_token": 41400,
    "end_token": 42400,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 47,
    "source_file": "2023scc29.txt",
    "text": " by interpreting the securities scheme in light of Unifund . I disagree with \nthat a pproach. Unifund  cannot serve as a safety net where the C.C.Q.  does not establish \nthe territorial jurisdiction of a court or tribunal and the legislature has not otherwise \nconferred territorial jurisdiction on it through special legislation. In short, when  there \nis no jurisdiction, that must be the end of the analysis. This means that recourse should \nnot be had to Unifund , which concerns an entirely different situation. Unifund  applies \nonce it is established that a court or tribunal has jurisdiction to deal  with a matter. For \nexample, if the AMF had invoked art.  3136 C.C.Q.  and thereby established the \njurisdiction of the FMAT as a [ TRANSLATION ] “forum of necessity” ( Lamborghini \n(Canada) Inc. v. Automobili Lamborghini S.P.A. , [1997] R.J.Q. 58 (C.A.), at p.  68, \nquoting H. P. Glenn, “Droit international privé”, in La réforme du Code civil , vol.  3, \nPriorités et hypothèques, preuve et prescription, publicité des droits, droit \ninternational privé, dispositions transitoires  (1993), 669, at p.  745), Unifund  could be \nrelied on to determine the applicability of the SA and the AAMF  to the appellants, who \nare domiciled outside Quebec.  \n[156]  Unifund  cannot give the provisions of the SA and the AAMF  an effect they \ndo not have on their own; in other words, it cannot give the FMAT territorial \n2023 SCC 29 (CanLII)\n\n--- Page 98 ---\n \n jurisdiction over the appellants, who are domiciled outside Quebec, in a manner that \nderogates from the well -developed set of rules in the C.C.Q.  I therefore do not agree \nwith my colleagues that Unifund  supports the conclusion that the FMAT has  \njurisdiction to decide this matter. I explain my thinking in detail in the reasons that \nfollow.  \nA. Distinction Between the Constitutional Applicability of Legislation and the \nAdjudicative Jurisdiction of a Court or Tribunal  \n[157]  With respect, my colleagues’ appro ach conflates the concepts of \nadjudicative jurisdiction of a court or tribunal and constitutional applicability of \nlegislation, as they deal interchangeably with the constitutional applicability of the SA \nunder the Unifund framework and the FMAT’s jurisdic tion under the rules of private \ninternational law. Just like the majority of the Court of Appeal, my colleagues shift \nfrom a private international law analysis into an analysis of the SA’s constitutional \napplicability to foreign residents, thereby modifyin g the true question put before and \nanswered by the FMAT.  \n[158]  It will therefore be helpful to briefly explain the difference between the \nconstitutional applicability of legislation and the adjudicative jurisdiction of a court or \ntribunal. Both concepts involve the existence of a real and substantial connection.  In \nthe constitutional context, the real and substantial connection test affirms “the \nconstitutionally imposed territorial limits that underlie the requirement of legitimacy in \nthe exercise of the state’s power of adjudication ” (Van Breda , at para.  32). In Unifund , \n2023 SCC 29 (CanLII)\n\n--- Page 99 ---\n \n where it had to determine whether an Ontario company had a viable cause of action \nagainst a British Columbia insurance company under the Insurance Act , R.S.O. 1990, \nc. I.8, this Court summarized this test from its constitutional standpoint as follows:  \n Consideration of constitutional applicability can conveniently be \norganized around the following propositions:  \n1. The territorial limits on the scope of provincial legislative authority \nprevent the application of the law of a province to matters not \nsufficiently connected to it;  \n2. What constitutes a “sufficient” connection depends on the \nrelationship among the enacting jurisdiction, the subject matter of the \nlegislation and the individual or entity sought to be regulated by it;  \n3. The applicability of an otherwise competent provincial legislation to \nout-of-province defendants is conditioned by the requirements of order \nand fairness that underlie our federal arrangements;  \n4. The principles of order and fairness, being purposive, are applied \nflexibly according to the subject matter of the legislation. [Emphasis \ndeleted; para.  56.] \n[159]  Thus, the applicability of provincial legislation to a defendant domiciled \noutside the province",
    "token_count": 1000,
    "start_token": 42300,
    "end_token": 43300,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 48,
    "source_file": "2023scc29.txt",
    "text": " it;  \n3. The applicability of an otherwise competent provincial legislation to \nout-of-province defendants is conditioned by the requirements of order \nand fairness that underlie our federal arrangements;  \n4. The principles of order and fairness, being purposive, are applied \nflexibly according to the subject matter of the legislation. [Emphasis \ndeleted; para.  56.] \n[159]  Thus, the applicability of provincial legislation to a defendant domiciled \noutside the province in question depends on the re being a sufficient connection \n“between the enacting jurisdiction and the out -of-province individual or entity” \n(Unifund , at para.  65). Although this test relates more specifically to the connection \nbetween a province and an action, the purpose of the Unifund  analysis is essentially to \ndetermine whether there is a viable cause of action on the merits (see para.  14). \n[160]  Conversely, from a private international law perspective, the real and \nsubstantial connection test relates to “the exercise of the state’s po wer of adjudication”  \n2023 SCC 29 (CanLII)\n\n--- Page 100 ---\n \n (Van Breda , at para.  32). The rules of private international law in force in a province \nare what confer adjudicative jurisdiction on a decision maker. In the common law \nprovinces, the real and substantial connection test is an organizi ng principle for the \nrules of private international law. In Quebec, these rules are set out in Book Ten of the  \nC.C.Q.  I could not articulate these principles any better than LeBel  J. did on behalf of \na unanimous Court:  \n Conflicts rules must fit within Cana da’s constitutional structure. Given \nthe nature of private international law, its application inevitably raises \nconstitutional issues. This branch of the law is concerned with the \njurisdiction of courts of the Canadian provinces, with whether that \njurisdic tion should be exercised, with what law should apply to a dispute, \nand with whether a court should recognize and enforce a judgment \nrendered by a court of another province or country. The rules of private \ninternational law can be found, in the common law p rovinces, in the \ncommon law and in statute law and, in Quebec, in the Civil Code of \nQuébec , S.Q. 1991, c.  64, which contains a well -developed set of rules \nand principles in this area  (see Civil Code of Québec , Book Ten, \narts. 3076 to 3168).  The interplay b etween provincial jurisdiction and \nexternal legal situations takes place within a constitutional framework \nwhich limits the external reach of provincial laws and of a province’s \ncourts. The Constitution assigns powers to the provinces. But these powers \nare subject to the restriction that they be exercised within the province in \nquestion (see P.  W. Hogg, Constitutional Law of Canada  (5th ed. 2007), \nvol. 1, at pp.  364-65 and 376 -77; H.  Brun, G.  Tremblay and E.  Brouillet, \nDroit constitutionnel  (5th ed. 2008), at p.  569; British Columbia v. \nImperial Tobacco Canada Ltd. , 2005 SCC 49, [2005] 2 S.C.R. 473, at \nparas.  26-28, per Major  J.), and they must be exercised in a manner \nconsistent with the territorial restrictions created by the Constitution (see \nCastillo v. Castillo , 2005 SCC 83, [2005] 3 S.C.R. 870, at para.  5, per \nMajor  J.; Unifund Assurance Co. v. Insurance Corp. of British Columbia , \n2003 SCC 40, [2003] 2 S.C.R. 63, at para.  51, per Binnie  J.). [Emphasis \nadded.]  \n (Van Breda , at para.  21) \n2023 SCC 29 (CanLII)\n\n--- Page 101 ---\n \n [161]  Accordingly, to be  able to assume jurisdiction over a dispute, a provincial \ncourt or tribunal must have adjudicative jurisdiction under provincial legislation, which \nmust itself have been validly enacted by the province in the exercise of its legislative \njurisdiction. As ca n be seen from the excerpt quoted in the previous paragraph, the \njurisdiction of courts and tribunals  of the Canadian provinces, the appropriateness of \nexercising that jurisdiction  and the law that should apply  to a dispute are all different \nconcepts.  \n[",
    "token_count": 1000,
    "start_token": 43200,
    "end_token": 44200,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 49,
    "source_file": "2023scc29.txt",
    "text": ", a provincial \ncourt or tribunal must have adjudicative jurisdiction under provincial legislation, which \nmust itself have been validly enacted by the province in the exercise of its legislative \njurisdiction. As ca n be seen from the excerpt quoted in the previous paragraph, the \njurisdiction of courts and tribunals  of the Canadian provinces, the appropriateness of \nexercising that jurisdiction  and the law that should apply  to a dispute are all different \nconcepts.  \n[162]  The adjudicative jurisdiction of a court or tribunal has two components: \njurisdiction ratione materiae  (subject -matter jurisdiction) and jurisdiction ratione \npersonae  (territorial jurisdiction). The subject -matter jurisdiction of a court or tribunal \n[TRANSLATION ] “is that given to [it] to hear a case by reason of its subject matter” \n(G. Goldstein and E.  Groffier, Droit international privé , vol.  I, Théorie générale  \n(1998), at p.  299). As Brown and Rowe  JJ. (dissenting, but not on this point) clearly \nstated in Uashaunnuat  (at para.  105):  \n The Quebec Superior Court’s inherent jurisdiction  is therefore an aspect \nof its subject -matter jurisdiction (or jurisdiction ratione materiae ), not an \naspect of its territorial jurisdiction (or jurisdiction ratione perso nae vel \nloci): \n . . . subject matter competence refers to the ability of the court to hear \nthe type of dispute in question, considering issues such as whether its \njurisdiction was limited by statute. It deals with criteria that are not \nconnected to the ter ritorial reach of the court’s authority and rarely raise \nissues of private international law . [Emphasis added; footnote omitted.]  \n (Pitel and Rafferty, at pp.  58-59) [Emphasis in original.]  \n2023 SCC 29 (CanLII)\n\n--- Page 102 ---\n \n As for territorial jurisdiction, it is assessed on the basis of a geographical connection, \nwhich may arise [ TRANSLATION ] “either from the situation of the litigant (usually the \ndefendant) or from the location of the item in dispute or the place where the dispute \narose” (Goldstein and Groffier, at p.  299). To have jurisdi ction to hear a dispute, a court \nor tribunal must therefore have the necessary subject -matter jurisdiction and territorial \njurisdiction ( Glenn, at p.  743). \n[163]  The rules on the territorial jurisdiction of Quebec courts and tribunals are \ndivided between the Code of Civil Procedure , CQLR, c.  C-25.01 (“ C.C.P. ”), and the \nC.C.Q. , depending on whether a dispute falls under domestic law or private \ninternational law (S. Guillemard, “Règles générales de compétence des tribunaux \nquébécois”, in JurisClasseur Québec — Collection Droit civil — Droit international \nprivé  (loose -leaf), fasc.  8, at No.  1). It is important to note here that  \n [TRANSLATION ] the rules on the international jurisdiction of Quebec \nauthorities should not be confused with the rules laid down by the Code of \nCivil Procedure regarding the territorial jurisdiction of courts under \ndomestic law (arts.  41 to 48 C.C.P.). Although these two types of rules \noften echo one another, the rules on international jurisdiction are \nsubstantive rules for determining whether Quebec courts or tribunals have \njurisdiction to hear a dispute, whereas the rules on domestic jurisdiction \nare procedural rules for determining the district in which proceedings may \nbe instituted. Extreme caution should therefore be exercised before \nattemp ting to apply the rules in the Code of Civil Procedure to fill a gap in \nBook Ten of the Civil Code of Québec, an approach that hearkens back to \nthe time when no effort to codify Quebec private international law had yet \nbeen made. [Footnote omitted.]  \n (Ferl and and Laganière, at p.  303) \n2023 SCC 29 (CanLII)\n\n--- Page 103 ---\n \n [164]  As I explain below, the appellants’ objection in this case clearly does not \nrelate to the FMAT’s lack of subject -matter jurisdiction. Rather, it is an objection to \nthe FMAT’s territorial jurisdiction. And it is also important to note that private \ninternational law is concerned mainly with territorial jurisdiction : \n Private international law, on the other hand, is concerned with territorial \njurisdiction: J. -G. Castel",
    "token_count": 1000,
    "start_token": 44100,
    "end_token": 45100,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 50,
    "source_file": "2023scc29.txt",
    "text": "--- Page 103 ---\n \n [164]  As I explain below, the appellants’ objection in this case clearly does not \nrelate to the FMAT’s lack of subject -matter jurisdiction. Rather, it is an objection to \nthe FMAT’s territorial jurisdiction. And it is also important to note that private \ninternational law is concerned mainly with territorial jurisdiction : \n Private international law, on the other hand, is concerned with territorial \njurisdiction: J. -G. Castel, Droit international privé québécois  (1980), at \np. 660. The rules of subject -matter jurisdiction play a limited role in private \ninternational law. By definition, however, the rules of territorial \njurisdiction impose territorial limits on the authority of provincial superior \ncourts to exercis e their subject -matter jurisdiction, including their inherent \npowers. In Quebec, for example, although “procedural law recognizes the \ncourts’ inherent powers to deal with situations not provided for in the law \nor the rules of practice”, the fact remains th at “civil procedure is subject to \nthe general principles found in the Civil Code of Québec ”, including the \nrules of private international law set out in Book Ten: Lac d’Amiante , at \nparas.  37 and 40; arts.  25 and 49 C.C.P . \n (Uashaunnuat , at para.  106, per B rown and Rowe  JJ., dissenting, but not \non this point)  \nB. This Dispute Concerns the FMAT’s Territorial Jurisdiction  \n[165]  These appeals, as they were argued, relate to the FMAT’s territorial \njurisdiction, not to the scope of Quebec’s legislative jurisdiction over se curities. At this \nstage of the proceedings, that is, the stage of the preliminary exceptions raised by the \nappellants in the form of declinatory exceptions, the only question before the FMAT \nwas as follows: Could the FMAT hear the dispute involving the app ellants?  \n[166]  Although there appears to have been some confusion in the courts and \ntribunal below, it is clear from a review of the record that the appellants’ motions for \n2023 SCC 29 (CanLII)\n\n--- Page 104 ---\n \n declinatory exception were based on the FMAT’s lack of territorial jurisdiction over \nthem . And the appeals before this Court are from judicial reviews of a decision \ndismissing those motions for declinatory exception brought by the appellants. What \ncan be said of those motions?  \n[167]  I begin by examining the declinatory exception of the appellants Sh awn \nVan Damme, Vincenzo Antonio Carnovale and Pasquale Antonio Rocca. In their \nmotion, they argue that the FMAT “does not have jurisdiction to hear and rule upon the \ncharges brought against Petitioners” (A.R., at pp.  109-10). They contend, more \nparticularl y, that there is no real and substantial connection between the proceedings \nbrought by the AMF and the province of Quebec (p.  110), on the basis of the following \nallegations: (i)  the defendants are not domiciled in Quebec (p.  110); (ii)  the AMF’s \noriginati ng application does not allege that the acts complained of were committed in \nQuebec or even that any fault was committed in Quebec (p.  110).  \n[168]  At first glance, it might be thought that these arguments relate to the \nconstitutional applicability of the SA. How ever, the last paragraph of the motion shows \nbeyond the shadow of a doubt that the declinatory exception is based on the FMAT’s \nlack of adjudicative jurisdiction over the appellants:  \n The present motion is made under strict reserve of Petitioners’ rights, \nincluding their right to claim that Quebec law (including the provisions of \nthe Quebec Securities Act ) does not apply to their alleged actions, that the \nacts allegedly committed by Petitioners do not constitute violations of \nsection  195.2, section 199.1 or  of any other provision of the Securities Act , \nand that Plaintiff Autorité des marchés financiers does not have jurisdiction \nto bring the present proceedings against Petitioners.  \n2023 SCC 29 (CanLII)\n\n--- Page 105 ---\n \n  (A.R., at p.  111) \n[169]  It can be seen from the above that the appellants Van  Damm e, Carnovale \nand Rocca reserved the right to contest the constitutional applicability of the SA on the \nbasis of the test set",
    "token_count": 1000,
    "start_token": 45000,
    "end_token": 46000,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 51,
    "source_file": "2023scc29.txt",
    "text": " Autorité des marchés financiers does not have jurisdiction \nto bring the present proceedings against Petitioners.  \n2023 SCC 29 (CanLII)\n\n--- Page 105 ---\n \n  (A.R., at p.  111) \n[169]  It can be seen from the above that the appellants Van  Damm e, Carnovale \nand Rocca reserved the right to contest the constitutional applicability of the SA on the \nbasis of the test set out in Unifund . This statement confirms that their motion for \ndeclinatory exception dealt first and foremost with the FMAT’s territ orial jurisdiction.  \n[170]  The arguments made by the appellant Frederick Langford Sharp in the \nSuperior Court also concerned the FMAT’s territorial jurisdiction, notwithstanding his \nstatement that “the Impugned Decision constitutes an unconstitutional assertion o f \nextra -provincial jurisdiction that should be set aside” (A.R., at p.  160). In my view, the \nreference to the alleged extraterritorial reach of the FMAT’s decision must be \nunderstood in light of the imperatives — which are now constitutional — recognized \nin Morguard Investments Ltd. v. De Savoye , [1990] 3 S.C.R. 1077, at pp.  1100 -1101, \nHunt v. T&N plc , [1993] 4 S.C.R. 289, at pp.  315-17, and Tolofson v. Jensen , [1994] 3 \nS.C.R. 1022, at p.  1066. According to this jurisprudence, there are “constitutionally \nimposed territorial limits that underlie the requirement of legitimacy in the exercise of \nthe state’s power of adjudication”. Considered from this perspective, the adjudicative \njurisdiction of courts and tribunals raises a constitutional law issue, in the sa me way as \nthe extraterritorial applicability of provincial legislation. However, this does not have \nthe effect of “turn[ing] every private international law issue into a constitutional one” \n(Van Breda , at para.  67). \n2023 SCC 29 (CanLII)\n\n--- Page 106 ---\n \n [171]  The appellants’ argument in this case is  that no provision of the SA, the \nAAMF  or the C.C.Q. gives the FMAT jurisdiction over them. From this standpoint, the \nappeals relate not to the extraterritorial applicability of the SA but rather to the FMAT’s \nterritorial jurisdiction under private interna tional law.  \n[172]  I would add that the way the case was argued in the Quebec Superior Court \nconfirms this approach. Before that court, the appellants Van  Damme, Carnovale and \nRocca again made the argument they had originally made, namely that the FMAT had \nno jur isdiction to hear the proceedings brought by the AMF. More particularly, they \nsubmitted that the FMAT had erred in basing its jurisdiction on ss.  93 and 94 AAMF  \nrather than on the C.C.Q. ’s rules concerning the international jurisdiction of Quebec \nauthoriti es. It is clear that the rules in the C.C.Q.  that apply in matters of private \ninternational law relate to the adjudicative jurisdiction of Quebec courts and tribunals, \nnot to the legitimate exercise of the state’s legislative power. In contrast, ss.  93 and  94 \nAAMF  relate to subject -matter jurisdiction to decide the AMF’s complaint on the \nmerits, and here, as I said above, the FMAT’s subject -matter jurisdiction is not in issue.  \n[173]  I acknowledge that the real and substantial connection test has several \ncomponent s, which may be confusing. It would probably have been preferable for the \nappellants to explain further that no provision of the C.C.Q.  could confer jurisdiction \non the FMAT in this case. In my view, however, this in no way changes the essence of \nthe decli natory exceptions raised, which clearly relate to the FMAT’s lack of territorial \njurisdiction over the appellants. The proof of this is that neither Michel Plante, who, \n2023 SCC 29 (CanLII)\n\n--- Page 107 ---\n \n according to the application, is domiciled in Quebec, nor Solo, which, according to the  \napplication, was a reporting issuer in Quebec and operated in Montréal, brought  a \nmotion for declinatory exception.  \n[174]  In short, the appellants’ motions — declinatory exceptions based on",
    "token_count": 1000,
    "start_token": 45900,
    "end_token": 46900,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 52,
    "source_file": "2023scc29.txt",
    "text": " over the appellants. The proof of this is that neither Michel Plante, who, \n2023 SCC 29 (CanLII)\n\n--- Page 107 ---\n \n according to the application, is domiciled in Quebec, nor Solo, which, according to the  \napplication, was a reporting issuer in Quebec and operated in Montréal, brought  a \nmotion for declinatory exception.  \n[174]  In short, the appellants’ motions — declinatory exceptions based on the \nFMAT’s lack of adjudicative jurisdiction — must be decided by apply ing the rules on \nthe international jurisdiction of Quebec authorities set out in the C.C.Q.  Unifund  is not \napplicable here. As mentioned above, this Court had to determine in that case whether \nOntario’s Insurance Act  gave Unifund a viable cause of action against the appellant, \nwhich was domiciled outside the province (see paras.  9, 14, 22, 27, 48 and 58 -81). \nHere, however, the issue is not whether the AMF has a viable statutory remedy against \nthe appellants under the SA. Rather, the debate concerns the FMAT’s territorial \njurisdiction over them.  \n[175]  I pause here to point out that if the C.C.Q. ’s rules of private international \nlaw did not apply, this dispute would have to be decided under the analytical framework \nset out in Van Breda  and not the one laid down in Unifund , since the FMAT’s territorial \njurisdiction is the only issue here. This is so because what must be determined at the \ndeclinatory exception stage is not whether the SA applies to the facts alleged but rather \nwhether the FMAT has territorial jurisdiction in the proceedings brought by the AMF.  \nC. The C.C.Q.’s Rules on the International Jurisdiction of Quebec Authorities Apply \nto Administrative Proceedings Before the FMAT  \n2023 SCC 29 (CanLII)\n\n--- Page 108 ---\n \n [176]  The rules of private international law set out  in the C.C.Q.  apply to all \nproceedings that may be heard by Quebec authorities pursuant to the jurisdiction \nconferred on the province by the Constitution. Accordingly, the rules in Title Three of \nBook Ten of the C.C.Q.  must be considered here unless a spe cial law complements, \nmakes exceptions to or derogates from them . \n[177]  The AMF submits that Book Ten of the C.C.Q.  is not applicable because \nthe FMAT’s jurisdiction is a matter of public law. More specifically, it argues that \n[TRANSLATION ] “the absence of any s pecific reference in the [ C.C.Q. ] to the \nadministrative proceedings that may be brought before the FMAT  . . . clearly indicates \nthat the legislature deliberately planned not to include them. An analysis of the \nprovisions of Book Ten of the [ C.C.Q. ] . . . demonstrates that the legislature intends the \nrules of private international law to apply only to matters of a strictly private nature” \n(R.F., at para.  52). The majority of the Court of Appeal was persuaded by this \nargument. With respect, and like my collea gues, I cannot accept it, since this position \ncreates a dichotomy between public law and private law for which there is no support \nin Book Ten of the C.C.Q.  \n[178]  It is common ground that the C.C.Q.  lays down the jus commune  in \nQuebec. Its preliminary provision used to read as follows:7 \n                                                 \n7 The preliminary provision was amended in 2022, but  I refer to the version that was in force at the \ntime the proceedings before the FMAT were instituted . \n2023 SCC 29 (CanLII)\n\n--- Page 109 ---\n \n  The Civil Code of Québec, in harmony with the Charter of human rights \nand freedoms (chapter C -12) and the general principles of law, governs \npersons, relations between persons, and property.  \n The Civil Code comprises a body of ru les which, in all matters within \nthe letter, spirit or object of its provisions, lays down the jus commune, \nexpressly or by implication. In these matters, the Code is the foundation of \nall other laws, although other laws may complement the Code or make \nexceptions to it.  \n[179]  The point of disagreement with the majority of the Court of Appeal relates \nto the scope of Book Ten in matters of public law. Nothing in the language of Title \nThree of Book Ten of the C.C.Q.  supports the distinction between private law and \npublic law proposed by the AMF and accepted by the majority of the Court of Appeal",
    "token_count": 1000,
    "start_token": 46800,
    "end_token": 47800,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 53,
    "source_file": "2023scc29.txt",
    "text": ", the Code is the foundation of \nall other laws, although other laws may complement the Code or make \nexceptions to it.  \n[179]  The point of disagreement with the majority of the Court of Appeal relates \nto the scope of Book Ten in matters of public law. Nothing in the language of Title \nThree of Book Ten of the C.C.Q.  supports the distinction between private law and \npublic law proposed by the AMF and accepted by the majority of the Court of Appeal. \nMy colleagues are of the opinion that Book Ten of the C.C.Q.  is the appropriate starting \npoint for analyzing the international jurisdiction of Quebec authorities, but they \nemphasize a distinction that, with respect, is in my view completely irrelevant. They \nrefer to the SA as having a “hybrid character” because it has a fundamentally regulatory \norientation but also has a title dealing with civil actions (paras.  7 and 67).  However, \nboth the regulatory law aspect and the civil law aspect are included in the jus commune , \nwhich means that focusing on this “hybrid charac ter” sheds no light on the question \nbefore us.  \n[180]  The AMF’s argument and my colleagues’ emphasis on “the hybridity” of \nthe SA also conflict with the commentary of Quebec’s Minister of Justice stating that \nthe purpose of the rules in Book Ten of the C.C.Q.  is to establish the international \njurisdiction of Quebec authorities:  \n2023 SCC 29 (CanLII)\n\n--- Page 110 ---\n \n  [TRANSLATION ] Since there were no rules  for determining whether \nQuebec authorities had jurisdiction over disputes with a foreign element, \nthe courts had extended the domestic law rules of jurisdiction provided for \nin the Code of Civil Procedure to such situations.  \n The general objective of Title Three is to remedy this deficiency  by \nestablishing specific rules for determining the international jurisdiction of \nQuebec authorities — courts, ad ministrative tribunals and various \nadministrative authorities . It is divided into two chapters, one containing \ngeneral provisions and the other containing specific provisions for personal \nmatters of an extrapatrimonial or patrimonial nature and for real an d mixed \nmatters. The rules are generally meant  to give Quebec authorities \njurisdiction only where disputes are closely connected with them , out of \nconcern for international comity.  \n The term authority  was chosen rather than  court  in order to encompass \njudicial, administrative and even ecclesiastical bodies, for example. \nHowever, an authority is an authority only if it is considered as such by \nQuebec law. In addition, the traditional expression  conflict of jurisdiction  \nwas not used, because the purpose here is solely to determine the cases in \nwhich Quebec authorities will have jurisdiction to hear a dispute with a \nforeign element, not the cases in which foreign authorities will have \njurisdiction. [Underlining added.]  \n (Ministère de la Justice, Commentaires du  ministre de la Justice , vol.  II, \nLe Code civil du Québec — Un mouvement de société  (1993), at p.  1998)  \n[181]  The statements made by the Minister of Justice make it clear that Title \nThree of Book Ten of the C.C.Q.  is the sole starting point for determining the \ninternational jurisdiction of Quebec authorities, regardless of whether they apply a \npurely regulatory scheme or a scheme with regulatory and civil aspects. I repeat that \n[TRANSLATION ] “the rules on internati onal jurisdiction are substantive rules for \ndetermining whether Quebec courts or tribunals have jurisdiction to hear a dispute” \n(Ferland and Laganière, at p.  303). Whether or not the Quebec court or tribunal has \n“hybrid” jurisdiction changes absolutely not hing.  \n2023 SCC 29 (CanLII)\n\n--- Page 111 ---\n \n [182]  Moreover, I would note that the very wording of Book Ten indicates that \nit applies to certain public law matters. One such matter is the enforcement of \nobligations arising from the taxation laws of a foreign state (arts.  3155(6) and 3162 \nC.C.Q. ). The  traditional position is that obligations of this kind are not enforceable in \nCanada, including in Quebec. For example, in United States of America v. Harden , \n[1963] S.C.R. 366, this Court refused to enforce a tax debt arising from a decision \nrendered by a n American court. This same principle is codified in art.  3155(6) C.C.Q.  \nHowever, under art.  3162 C.C.Q. , the rules of private international law allow the \nrecognition of obligations",
    "token_count": 1000,
    "start_token": 47700,
    "end_token": 48700,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 54,
    "source_file": "2023scc29.txt",
    "text": " \nCanada, including in Quebec. For example, in United States of America v. Harden , \n[1963] S.C.R. 366, this Court refused to enforce a tax debt arising from a decision \nrendered by a n American court. This same principle is codified in art.  3155(6) C.C.Q.  \nHowever, under art.  3162 C.C.Q. , the rules of private international law allow the \nrecognition of obligations resulting from foreign taxation laws if there is a reciprocity \nmechanism b etween Quebec and the foreign state. Of course, this presupposes the \nexistence of a foreign court with jurisdiction to decide the dispute, in accordance with \nTitle Three of Book Ten of the C.C.Q. , as provided for in art.  3164 C.C.Q.  Therefore, \nand contrary  to what the AMF argues, the foregoing clearly shows that the legislature \nintended Title Three of Book Ten of the C.C.Q.  to apply to jurisdictional issues of \npublic law.  \n[183]  It would be incongruous to find that the provisions of Title Three can \nground the juri sdiction of a foreign authority dealing with a public law issue, but not \nthe jurisdiction of a Quebec authority dealing with such an issue. Moreover, Quebec \nprivate international law generally recognizes the mirror principle, according to which \n“[t]he fore ign authority is deemed to have jurisdiction if the Quebec court would, by \napplying its own rules, have accepted jurisdiction in the same situation” ( Canada Post \nCorp. v. Lépine , 2009 SCC 16, [2009] 1 S.C.R. 549, at para.  25, citing Goldstein and \n2023 SCC 29 (CanLII)\n\n--- Page 112 ---\n \n Groffier,  at p.  416).  In the above example, this principle makes the jurisdiction of \nQuebec authorities subject to the provisions of Title Three, notwithstanding the public \nnature of tax law.  \n[184]  Unlike the common law provinces, Quebec has codified the rules of private  \ninternational law, which are set out in Book Ten of the C.C.Q.  In that book, the Quebec \nlegislature has established a comprehensive system of rules and principles “to codify \nthe entire  field of private international law” ( Van Breda , at para.  42 (emphasis added); \nsee also Uashaunnuat , at para.  102, citing Van Breda , at para.  21, Barer v. Knight \nBrothers LL C, 2019 SCC 13, [2019] 1 S.C.R. 573, at paras.  131-32, per Brown  J., and \nG. Saumier, “The Recognition of Foreign Judgments in Quebec — The Mirror \nCrack’d? ” (2002), 81 Can. Bar Rev. 677, at p.  693). Because of this codification, \n“courts must interpret those rules by first examining the specific wording of the \nprovisions of the C.C.Q.  and then inquiring whether or not their interpretation is \nconsistent with t he principles which underlie the rules” ( Spar Aerospace Ltd. , at \npara.  23). \n[185]  As its name indicates, Title Three of Book Ten of the C.C.Q.  deals with the \ninternational jurisdiction of Quebec authorities. The rules in Title Three “rely on \nspecific facts linki ng the subject matter of the litigation to the jurisdiction [in order to \njustify the application] of the conflicts rules” designed to ensure that there is a “lin[k] \n[between] the subject matter of the litigation [and] the jurisdiction” ( Van Breda , at \npara.  76). Upon examining Title Three, it becomes apparent that the requirement of a \n2023 SCC 29 (CanLII)\n\n--- Page 113 ---\n \n real and substantial connection “is reflected in the overall scheme established by Book \nTen” ( Spar Aerospace Ltd. , at para.  63). Indeed, Book Ten helps to “safeguard against \nthe improper assumption of jurisdiction” ( Spar Aerospace Ltd. , at para.  57). Given the \ncodification of these rules, there is no reason to resort to the real and substantial \nconnection test from Van Breda . \n[186]  Articles 3134 to 3154 C.C.Q.  are meant [TRANSLATION ] “to be exhaustive \nin setting out the international jurisdiction of Quebec authorities” ( Lamborghini , at \np. 68, quoting Commentaires du ministre de la Justice , at p",
    "token_count": 1000,
    "start_token": 48600,
    "end_token": 49600,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 55,
    "source_file": "2023scc29.txt",
    "text": " , at para.  57). Given the \ncodification of these rules, there is no reason to resort to the real and substantial \nconnection test from Van Breda . \n[186]  Articles 3134 to 3154 C.C.Q.  are meant [TRANSLATION ] “to be exhaustive \nin setting out the international jurisdiction of Quebec authorities” ( Lamborghini , at \np. 68, quoting Commentaires du ministre de la Justice , at p.  2000). Exceptionally, \nart. 3076 C.C.Q.  provides that Book Ten applies “subject to those rul es of law in force \nin Québec which are applicable by reason of their particular object”. In this case, those \nrules might include the SA and the AAMF . But as I explain below, and contrary to what \nmy colleagues argue, the SA and the AAMF  do not themselves ma ke exceptions to, \nderogate from or complement the C.C.Q. ’s rules of private international law when it \ncomes to the administrative proceedings brought by the AMF.  \n[187]  It is clear from reading the provisions of the SA and the AAMF  that the \nlegislature intended t hem to be supplemented by the C.C.Q. ’s provisions on the \ninternational jurisdiction of Quebec authorities. Let me explain. First, in civil matters, \nthe Quebec legislature enacted the rule in s.  236.1 SA. This provision gives precedence \nto the SA in matters  pertaining to the distribution of securities to Quebec residents and \nstates that, in contrast to the usual rule, “any action under the ordinary rules of law in \n2023 SCC 29 (CanLII)\n\n--- Page 114 ---\n \n respect of facts related to the distribution of a security” may be brought “before the \ncourt of  the plaintiff’s residence”.  \n[188]  Similarly, in penal matters, art.  142 of the Code of Penal Procedure , \nCQLR, c.  C-25.1, provides, for the purposes of ss.  202 and 210 SA, that all penal \nproceedings must be instituted either in the judicial district where the de fendant resides \n(or is in detention, where such is the case) or in the district where the defendant \n“committed the offence”.  \n[189]  In administrative matters, on the other hand, the Quebec legislature did not \nenact specific provisions concerning the FMAT’s intern ational jurisdiction in addition \nto the rules in the C.C.Q.  The provisions of the SA in question here are ss.  265, 273.1 \nand 273.3. They allow the FMAT to order a person to cease any activity in respect of a \ntransaction in securities (s.  265), to impose an  administrative penalty on the person and \nhave it collected by the AMF (s.  273.1), and to prohibit a person from acting as a \ndirector or officer of an issuer, dealer, adviser or investment fund manager (s.  273.3):  \n 265. The Financial Markets Administrative  Tribunal may order a person to \ncease any activity in respect of a transaction in securities.  \n . . . \n 273.1.  Where the Financial Markets Administrative Tribunal becomes \naware of facts establishing that a person has, by an act or omission, \ncontravened, or a ided in the contravention of, a provision under this Act or \na regulation made under its authority, the Tribunal may impose an \nadministrative penalty on the offender and have it collected by the \nAuthority.  \n . . . \n2023 SCC 29 (CanLII)\n\n--- Page 115 ---\n \n  273.3.  The Financial Markets Administrative  Tribunal may prohibit a \nperson from acting as a director or officer of an issuer, dealer, adviser or \ninvestment fund manager on the grounds set out in article 329 of the Civil \nCode, or where a penalty has been imposed on the person under this Act, \nthe Act  respecting the distribution of financial products and services \n(chapter D -9.2) or the Derivatives Act (chapter I -14.01).  \n[190]  According to my colleagues, none of these provisions “limits the territorial \nreach of the Quebec securities scheme over interprovincial or international transactions. \nTo evaluate whether these statutes may be applied in such circumstances, the Quebec \nsecur ities scheme must be interpreted to determine its territorial reach ” (para.  102). \nHowever, these statements need to be qualified; while ss.  265, 273.1 and 273.3 SA do \nnot specify their territorial reach, this does not mean that it can be",
    "token_count": 1000,
    "start_token": 49500,
    "end_token": 50500,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 56,
    "source_file": "2023scc29.txt",
    "text": " provisions “limits the territorial \nreach of the Quebec securities scheme over interprovincial or international transactions. \nTo evaluate whether these statutes may be applied in such circumstances, the Quebec \nsecur ities scheme must be interpreted to determine its territorial reach ” (para.  102). \nHowever, these statements need to be qualified; while ss.  265, 273.1 and 273.3 SA do \nnot specify their territorial reach, this does not mean that it can be unlimited. Such an  \ninterpretation would be contrary to the principle of territoriality, whereby a provincial \nlegislature is presumed to intend its laws to apply to [ TRANSLATION ] “persons, property, \njuridical acts and events within the territorial boundaries of its jurisdict ion” (P.-A. Côté \nand M.  Devinat, Interprétation des lois  (5th ed. 2021), at para.  779), not to all persons \nregardless of their place of domicile or residence.  \n[191]  My colleagues therefore fall back on s.  93 AAMF  to make up for the \nlegislature’s silence regardin g the territorial reach of the Quebec securities scheme. But \nas they recognize at para.  101, s.  93 AAMF  establishes the FMAT’s subject -matter \njurisdiction in administrative proceedings instituted by the AMF under the SA. At the \ntime the AMF brought its pro ceedings before the FMAT, the AAMF  was in force. In \n2018, it was amended and renamed the Act respecting the regulation of the financial \n2023 SCC 29 (CanLII)\n\n--- Page 116 ---\n \n sector , CQLR, c.  E-6.1. I agree with my colleagues that the former version of s.  93 \ncontinues to apply in this case unde r the applicable transitional rules (fn.  4). \n[192]  The applicable version of s.  93 AAMF  is as follows:  \n 93. On the request of the Authority or of any interested person, the Tribunal \nshall exercise the functions and powers assigned to it under this Act, the \nAct respecting the distribution of financial products and services (chapter \nD-9.2), the Money -Services Businesses Act (chapter E -12.000001), the \nDerivatives Act (chapter I -14.01) and the Securities Act (chapter V -1.1). \n The Tribunal shall exercise its discreti on in the public interest.  \n The Tribunal may not, when assessing the facts or the law for the \npurposes of those Acts, substitute its assessment of the public interest for \nthat made by the Authority in making a decision.  \n[193]  And s.  93 as it reads in the Act res pecting the regulation of the financial \nsector , which came into force following the 2018 amendments, is as follows:  \n 93. The function of the Tribunal is to make determinations with respect to \nmatters brought under this Act and the Acts listed in Schedule  I. Except \nwhere otherwise provided by law, the Tribunal shall exercise its \njurisdiction to the exclusion of any other tribunal or adjudicative body . \n The Tribunal shall exercise its discretion in the public interest.  \n In reviewing a decision rendered by the  Authority under the Securities \nAct (chapter V -1.1) or the Derivatives Act (chapter I -14.01), the Tribunal \nmay not, when assessing the facts or the law for the purposes of those Acts, \nsubstitute its assessment of the public interest for that made by the \nAuthority in making a decision.  \n In this Title, unless the context indicates otherwise, “matters” also \nincludes any application, complaint, contestation or motion, as well as any \naction falling within the jurisdiction of the Tribunal.  \n2023 SCC 29 (CanLII)\n\n--- Page 117 ---\n \n [194]  In my colleagues’ view, s.  93 AAMF  — which provides for the FMAT’s \nsubject -matter jurisdiction — is sufficient to ground the FMAT’s international \njurisdiction in the proceedings brought by the AMF, subject only to Unifund . \nAccording to them, this section t hus derogates from the well -developed set of rules in \nthe C.C.Q.  With respect, I disagree with such an interpretation of s.  93 AAMF . \n[195]  My colleagues’ argument rests on a premise that essentially relates to a \nquestion of subject -matter jurisdiction (jurisdict ion ratione materiae ), which has \nnothing to do with the FMAT’s territorial jurisdiction (jurisdiction ration",
    "token_count": 1000,
    "start_token": 50400,
    "end_token": 51400,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 57,
    "source_file": "2023scc29.txt",
    "text": " . \nAccording to them, this section t hus derogates from the well -developed set of rules in \nthe C.C.Q.  With respect, I disagree with such an interpretation of s.  93 AAMF . \n[195]  My colleagues’ argument rests on a premise that essentially relates to a \nquestion of subject -matter jurisdiction (jurisdict ion ratione materiae ), which has \nnothing to do with the FMAT’s territorial jurisdiction (jurisdiction ratione personae ). \nAs noted above, the subject -matter jurisdiction of a court or tribunal and its territorial \njurisdiction are distinct. While subject -matter jurisdiction concerns the subject or \nnature of the dispute, territorial jurisdiction is assessed on the basis of the connection \nthat serves to link a dispute to a jurisdiction. Although the proceedings brought by the \nAMF are within the FMAT’s subject -matter jurisdiction, it does not follow that the \nFMAT has extraterritorial jurisdiction over the appellants. The subject -matter \njurisdiction conferred on the FMAT by s.  93 AAMF  simply means that, within \nQuebec’s adjudicative and administrative system, it is  this tribunal that has jurisdiction \nand not some other tribunal or body. As a result, I cannot accept my colleagues’ \nargument that s.  93 AAMF  — which confers subject -matter jurisdiction — gives the \nFMAT territorial jurisdiction.  \n[196]  My colleagues also rely on  s. 94 AAMF , which allows the FMAT to \nexercise the subject -matter jurisdiction conferred on it by s.  93 by taking any measure \n2023 SCC 29 (CanLII)\n\n--- Page 118 ---\n \n conducive to ensuring compliance with any of the statutes listed in s.  93. The version \nof s.  94 that was in force at the time the proceedings were instituted, and that is \napplicable in this case, is as follows:  \n 94. At the request of the Authority, the Tribunal may take any measure \nconducive to ensuring compliance with an undertaking given under this \nAct, the Act respecting the distr ibution of financial products and services \n(chapter D -9.2), the Money -Services Businesses Act (chapter \nE-12.000001), the Derivatives Act (chapter I -14.01) or the Securities Act \n(chapter V -1.1) or compliance with those Acts.  \nThis section is not concerned in  any way with territorial jurisdiction but relates rather \nto the measures that the FMAT may take once it is established that it has jurisdiction \nratione personae  to deal with a matter. This is also the case of ss.  265, 273.1 and 273.3 \nSA, which authorize t he FMAT to impose prohibitions and administrative penalties. As \nmy colleagues note, these provisions empower the FMAT to act in a broad range of \ncircumstances, but this is true only where the FMAT has jurisdiction over the persons \ninvolved in the dispute b efore it. The mere existence of these sections cannot establish \nthe FMAT’s jurisdiction over persons domiciled outside Quebec. Consequently, the \nFMAT can take the measures contemplated in s.  94 AAMF , or in ss.  265, 273.1 and \n273.3 SA, only where it has jur isdiction under the rules of private international law set \nout in the C.C.Q.  \n[197]  As my colleagues in fact seem to recognize, when the legislature intends \nto make exceptions to or derogate from the rules in the C.C.Q. , it does so clearly, using \n“detailed and sp ecific” language (para.  54, citing Compagnie d’immeubles Yale ltée v. \n2023 SCC 29 (CanLII)\n\n--- Page 119 ---\n \n Kirkland (Ville de) , [1996] R.J.Q. 502 (C.Q.), at p.  507; see also Perron -Malenfant v. \nMalenfant (Trustee of) , [1999] 3 S.C.R. 375, at para.  42). This principle is reflected, \nfor example , in s.  236.1 SA, which derogates expressly from the rules of private \ninternational law in the C.C.Q.  by stating that “[i]n matters pertaining to the distribution \nof a security, the laws of Québec are applicable where the subscriber or purchaser \nresides in  Québec, regardless of the place of the contract”. My colleagues say that \ns. 236.1 “confirms that not all of the rules bearing on the international jurisdiction of",
    "token_count": 1000,
    "start_token": 51300,
    "end_token": 52300,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 58,
    "source_file": "2023scc29.txt",
    "text": " example , in s.  236.1 SA, which derogates expressly from the rules of private \ninternational law in the C.C.Q.  by stating that “[i]n matters pertaining to the distribution \nof a security, the laws of Québec are applicable where the subscriber or purchaser \nresides in  Québec, regardless of the place of the contract”. My colleagues say that \ns. 236.1 “confirms that not all of the rules bearing on the international jurisdiction of \nQuebec authorities are to be found in the C.C.Q. ” (para.  69). This is true, but only \ninsofar  as the legislation expressly derogates from the C.C.Q. , like in s.  236.1. The \nderogating effect of s.  236.1 cannot be extended to another part of the SA or to the SA \nas a whole. If the legislature had wanted to make exceptions to or derogate from the \nC.C.Q. in other respects, it would have expressed a clear intention to do so.  But unlike \nin the case of s.  236.1 SA, I do not see in ss.  93 and 94 AAMF , or in ss.  265, 273.1 and \n273.3 SA, any expression of the legislature’s intention to make exceptions to or \nderogate from the rules in the C.C.Q.  Absent a clear intention to the contrary, I am of \nthe opinion that the C.C.Q. ’s rules of private international law, that is, arts.  3134 to \n3154, are what govern the FMAT’s international jurisdiction.  \n[198]  Finally, my colleagues’ interpretation of ss.  93 and 94 AAMF  and ss.  265, \n273.1 and 273.3 SA is refuted by the specific context of the legislative scheme in issue \nin this case. Their approach completel y ignores the provisions of Chapter II of Title  X \nof the SA concerning interjurisdictional cooperation . That chapter sets out various rules \n— including with respect to cooperation between regulators at the national and \n2023 SCC 29 (CanLII)\n\n--- Page 120 ---\n \n international levels — that allow the  AMF and the FMAT to perform their respective \nfunctions and exercise their respective authority despite the globalization of markets. \nThese rules provide, for example, that the AMF may “delegate a Québec authority to \nan extra -provincial securities commissi on and accept to exercise an extra -provincial \nauthority” (ss.  307 and 307.1). What would be the point of this interprovincial \ncooperation scheme if the legislature truly intended to confer potentially unlimited \ninternational jurisdiction on the FMAT? To as k the question is to answer it. The \nlegislature does not legislate in vain and, with respect, I cannot agree with my \ncolleagues’ conclusion, which in my view disregards the fact that legislation must be \ninterpreted coherently and contributes to creating un certainty and unpredictability with \nrespect to international jurisdiction.  \n[199]  In sum, neither the SA nor the AAMF  makes exceptions to or derogates, \neither expressly or by implication, from the C.C.Q. ’s rules when it comes to the \nFMAT’s jurisdiction in adminis trative matters. Because the SA and the AAMF  are silent \nin this regard, it is necessary in this case to refer to the C.C.Q. ’s provisions on the \nextraterritorial jurisdiction of Quebec authorities, that is, arts.  3134 to 3154 C.C.Q. , \nwhich are exhaustive in  defining the situations in which Quebec authorities have \njurisdiction.  \nD. No Provision of the C.C.Q. Gives the FMAT Jurisdiction Over the Appellants  \n[200]  Title Three of Book Ten of the C.C.Q.  sets out general rules and specific \nrules to ground the international jurisdiction of Quebec authorities. These rules lay \n2023 SCC 29 (CanLII)\n\n--- Page 121 ---\n \n down conditions that must necessarily be met in order for a Quebec authority to deal \nwith a dispute. As this Court has repeatedly sta ted, “[a]s a whole, these rules ensure \ncompliance with the basic requirement that there be a real and substantial connection \nbetween the Quebec court and the dispute”  (Lépine , at para.  19, citing Spar Aerospace \nLtd., at paras.  55-56). \n[201]  Title Three of Book T en has two chapters: Chapter I (“General \nProvisions”) and Chapter II (“Special Provisions”). The first provision in",
    "token_count": 1000,
    "start_token": 52200,
    "end_token": 53200,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 59,
    "source_file": "2023scc29.txt",
    "text": " sta ted, “[a]s a whole, these rules ensure \ncompliance with the basic requirement that there be a real and substantial connection \nbetween the Quebec court and the dispute”  (Lépine , at para.  19, citing Spar Aerospace \nLtd., at paras.  55-56). \n[201]  Title Three of Book T en has two chapters: Chapter I (“General \nProvisions”) and Chapter II (“Special Provisions”). The first provision in Chapter  I, \nart. 3134 C.C.Q. , sets out the general rule of jurisdiction: “ In the absence of any special \nprovision, Québec authorities have ju risdiction when the defendant is domiciled in \nQuébec.”  The special provisions to which art.  3134 C.C.Q.  refers are found in \nChapter  II of Title Three.  \n[202]  In this case, the provisions that might ground the FMAT’s jurisdiction are \narts. 3134, 3136 and 3148 C.C.Q. I analyze each of these provisions below based on \ntheir application to the facts of this dispute. In this analysis, I conclude, as my \ncolleagues do, that none of them is capable of giving the FMAT jurisdiction over the \nappellants.  \n Article 3134 C.C.Q.  \n[203]  As mentioned above, art.  3134 C.C.Q.  sets out the general rule that, i n the \nabsence of any special provision, Quebec authorities have jurisdiction when the \ndefendant is domiciled in Quebec. Because the appellants are not domiciled in Quebec, \n2023 SCC 29 (CanLII)\n\n--- Page 122 ---\n \n this provision c annot give the FMAT jurisdiction in the proceedings brought by the \nAMF.  \n(2) Article 3148 Paragraph 1(3) C.C.Q.  \n[204]  Under art.  3148 para.  1(3) C.C.Q. , “Quebec authorities have jurisdiction \nover an action in extra -contractual liability where a fault was committed in  Quebec or \nthe injury was suffered there” ( Lapointe Rosenstein Marchand Melançon LLP v. \nCassels Brock & Blackwell LLP , 2016 SCC 30, [2016] 1 S.C.R. 851, at para.  33). Like \nmy colleagues, and contrary to what was suggested in the concurring reasons given in  \nthe Court of Appeal, I am of the view that no analogy can be drawn between a personal \naction of a patrimonial nature and the proceedings brought by the AMF.  \n[205]  It is important to remember that [ TRANSLATION ] “[t]he AMF is the \nspecialized body to which the Que bec legislator has entrusted the application of the SA \nand the AAMF, in the public interest” ( Autorité des marchés financiers v. Fournier , \n2012 QCCA 1179 , at para.  28 (CanLII)). When it applies to the FMAT for an \nadministrative penalty under s.  273.1 SA, the AMF is thus acting [ TRANSLATION ] “in \nthe context of its mission to protect the financial market and to maintain investors’ \nconfidence in the system” ( Donaldson v. Autorité des marchés financiers , 2020 QCCA \n401, at para.  25 (CanLII)). Therefore, when it applies to the FMAT for an \nadministrative penalty, the AMF is not bringing a “personal actio[n] of a patrimonial \nnature” (art.  3148 C.C.Q. ). Rather, it is taking administrative action as part of its role \nof supervising the financial market ( Donaldson , at p ara. 42, quoting S.  Rousseau, \n2023 SCC 29 (CanLII)\n\n--- Page 123 ---\n \n “L’application de la législation sur les valeurs mobilières au Québec: une étude du rôle \ndu Tribunal administratif des marchés financiers” (2017), 76 R. du B.  1, at p.  13). \n[206]  As my colleagues recognize at para.  80, reasoning by analogy is a perfectly \nacceptable tool “to ensure that the Civil Code of Québec  functions properly” \n(Fédération des producteurs acéricoles du Québec v. Regroupement pour la \ncommercialisation des produits de l’érable inc. , 2006 SCC 50, [2006] 2 S.C.R. 591 , at \npara.  29), but this",
    "token_count": 1000,
    "start_token": 53100,
    "end_token": 54100,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 60,
    "source_file": "2023scc29.txt",
    "text": " \n[206]  As my colleagues recognize at para.  80, reasoning by analogy is a perfectly \nacceptable tool “to ensure that the Civil Code of Québec  functions properly” \n(Fédération des producteurs acéricoles du Québec v. Regroupement pour la \ncommercialisation des produits de l’érable inc. , 2006 SCC 50, [2006] 2 S.C.R. 591 , at \npara.  29), but this tool must always be used wisely (see Fédération des producteurs \nacéricoles du Québec , at para.  29; see also Yared v. Karam , 2019 SCC 62, [2019] 4 \nS.C.R. 498 , at para.  28). Moreover, while this goes without saying, an analogy must \nrelate to things or concepts that are actually analogous. In this case, a personal action \nof a patrimonial nature is not analogous to an application to the FMAT for an \nadministrative penalty, which means that, and I say this with respect , the reasoning in \nthe concurring reasons given in the Court of Appeal in fact involves modifying \nart. 3148 para.  1(3) C.C.Q.  \n[207]  Having regard to the administrative nature of an application by the AMF \nfor a penalty under s.  273.1 SA, I am of the view that art.  3148 para.  1(3) C.C.Q. cannot \nconfer jurisdiction on the FMAT. In addition, even if an analogy were possible, none \nof the criteria in art.  3148 para.  1(3) C.C.Q.  is met in this case. The AMF is not alleging \nthat the appellants committed faults in Quebec, and it did not bring its proceedings \nagainst them in order to compensate investors who had suffered losses.  \n Article 3136 C.C.Q.  \n2023 SCC 29 (CanLII)\n\n--- Page 124 ---\n \n [208]  Article 3136  C.C.Q.  recognizes the  “forum of necessity” doctrine \n(Lamborghini , at p.  68, quoting H. P. Glenn, “Droit international privé”, in La réforme \ndu Code civil , vol.  3, Priorités et hypothèques, preuve et prescription, publicité des \ndroits, droit international privé, dispositions tr ansitoires  (1993), 669, at p.  745; see \nalso Van Breda , at para.  59), which can serve as an exceptional basis for the jurisdiction \nof Quebec authorities ( Van Breda , at para.  59). The article provides that “ [e]ven though \na Québec authority has no jurisdictio n to hear a dispute, it may nevertheless hear it \nprovided the dispute has a sufficient connection with Québec, if proceedings abroad \nprove impossible or the institution of proceedings abroad cannot reasonably be \nrequired.” This provision [ TRANSLATION ] “set s out an exceptional rule based on the \ndemonstrated impossibility of having access to a foreign court in a dispute that has a \nsufficient connection with Quebec” ( Lamborghini , at p.  69). In this sense, the purpose \nof the provision is to permit a Quebec auth ority to deal with a dispute, even though it \nwould ordinarily have no jurisdiction over the dispute, in order [ TRANSLATION ] “to \nprevent a denial of justice” ( Otsuka Pharmaceutical Company Limited v. Pohoresky , \n2022 QCCA 1230, at para.  7 (CanLII) , quoting G lenn, at p.  745).  \n[209]  My colleagues and I agree that art.  3136 C.C.Q.  can be applied only if one \nof the parties raises it, since a court or tribunal cannot raise it of its own motion ( GreCon \nDimter inc. v. J.R. Normand inc. , 2005 SCC 46, [2005] 2 S.C.R. 401, at para.  33, citing \nSpar Aerospace Ltd. , at para.  69). In this case, the AMF did not raise art.  3136 C.C.Q.  \nas a basis for the FMAT’s jurisdiction. It did not demonstrate that proceedings abroad \nhad proved impossible or that it could not reasonably require the institution of \n2023 SCC 29 (CanLII)\n\n--- Page 125 ---\n \n proceedings abroad. Nor did it explain why it had not applied to the authorities having \njurisdiction, in accordance with the",
    "token_count": 1000,
    "start_token": 54000,
    "end_token": 55000,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 61,
    "source_file": "2023scc29.txt",
    "text": " at para.  69). In this case, the AMF did not raise art.  3136 C.C.Q.  \nas a basis for the FMAT’s jurisdiction. It did not demonstrate that proceedings abroad \nhad proved impossible or that it could not reasonably require the institution of \n2023 SCC 29 (CanLII)\n\n--- Page 125 ---\n \n proceedings abroad. Nor did it explain why it had not applied to the authorities having \njurisdiction, in accordance with the provisions of Chapter II of Title X of the SA \nconcerning interjurisdictiona l cooperation. As a result, the AMF cannot rely on \nart. 3136 C.C.Q.  to establish the FMAT’s jurisdiction over the appellants.  \n[210]  In light of the foregoing, I am of the view that no provision of the C.C.Q.  \ncan ground the FMAT’s jurisdiction in the proceedings brought by the AMF.  \n[211]  I am also of the view, for the reasons explained more fully above, that the \nUnifund  test is of no assistance to the AMF and cannot ground the FMAT’s \nadjudicative jurisdiction over the appellants.  \nIV. Conclusion  \n[212]  For these reasons, I would al low the appeals and set aside the FMAT’s \ndecision on the appellants’ declinatory exceptions, with costs. Because the FMAT has \nno adjudicative jurisdiction to hear the AMF’s proceedings against the appellants, the \nproceedings should be dismissed, and there is no need to refer the matter back to the \nFMA T. \n  \n2023 SCC 29 (CanLII)\n\n--- Page 126 ---\n \n APPENDIX  \nRelevant Statutory Provisions  \nSecurities Act , CQLR, c.  V-1.1 \n195.2 . Influencing or attempting to influence the market price or the value of securities \nby means of unfair, improper or fraudulent practices is an offence.  \n199.1.  A person who directly or indirectly engages or participates in any transaction or \nseries of transactions in securities or any trading method relating to a transaction in \nsecurities, or in any act, practice or course of condu ct is guilty of an offence if the \nperson knows, or ought reasonably to know, that the transaction, series of transactions, \ntrading method, act, practice or course of conduct  \n (1) creates or contributes to a misleading appearance of trading activity in, or an \nartificial price for, a security; or  \n (2) perpetrates a fraud on any person.  \n265. The Financial Markets Administrative Tribunal may order a person to cease any \nactivity in respect of a transaction in securities.  \n The Financial Markets Administrative Tri bunal may, furthermore, order any person \nor category of persons to cease any activity in respect of a transaction in a particular \nsecurity.  \n In the case of failure by a reporting issuer to provide periodic disclosure about its \nbusiness and internal affairs  in accordance with the conditions determined by regulation \nor failure by an issuer or another person to provide any other disclosure prescribed by \nregulation in accordance with the conditions determined by regulation, the power to \norder a person to cease any activity in respect of a transaction in securities shall be \nexercised by the Authority.  \n Despite the first paragraph of section 318 , the Authority may exercise the power \nconferred on it by the third paragraph without allowing the person to present \nobservations or submit documents to complete the person’s record.  \n273.1.  Where the Financial Markets Administrative Tribunal becomes aware of facts \nestablishing that a person has, by an act or omission, contravened, or aided in the \ncontravention of, a provisio n under this Act or a regulation made under its authority, \nthe Tribunal may impose an administrative penalty on the offender and have it collected \nby the Authority.  \n The amount of the penalty may in no case exceed $2,000,000 for each contravention.  \n2023 SCC 29 (CanLII)\n\n--- Page 127 ---\n \n 273.3 . The Financial Markets Administrative Tribunal may prohibit a person from \nacting as a director or officer of an issuer, dealer, adviser or investment fund manager \non the grounds set out in article 329  of the Civil Code , or where a penalty has been \nimposed o n the person under this Act, the Act respecting the distribution of financial \nproducts and services (chapter D -9.2) or the Derivatives Act (chapter I -14.01 ). \n The prohibition imposed by the Financial Markets Administrative Tribunal may not \nexceed five year s. \n The Financial Markets Administrative Tribunal may, at the request of the person \nconcerned, lift the prohibition on such conditions as it considers appropriate.",
    "token_count": 1000,
    "start_token": 54900,
    "end_token": 55900,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 62,
    "source_file": "2023scc29.txt",
    "text": " , or where a penalty has been \nimposed o n the person under this Act, the Act respecting the distribution of financial \nproducts and services (chapter D -9.2) or the Derivatives Act (chapter I -14.01 ). \n The prohibition imposed by the Financial Markets Administrative Tribunal may not \nexceed five year s. \n The Financial Markets Administrative Tribunal may, at the request of the person \nconcerned, lift the prohibition on such conditions as it considers appropriate.  \nAct respecting the Autorité des marchés financiers , CQLR, c.  A-33.2 \n93. On the request of th e Authority or of any interested person, the Tribunal shall \nexercise the functions and powers assigned to it under this Act, the Act respecting the \ndistribution of financial products and services (chapter D -9.2), the Money -Services \nBusinesses Act (chapter E-12.000001), the Derivatives Act (chapter I -14.01) and the \nSecurities Act (chapter V -1.1). \n The Tribunal shall exercise its discretion in the public interest.  \n The Tribunal may not, when assessing the facts or the law for the purposes of those \nActs, substitute its assessment of the public interest for that made by the Authority in \nmaking a decision.  \n94. At the request of the Authority, the Tribunal may take any measure conducive to \nensuring compliance with an undertaking given under this Act, the Act respecting the \ndistribution of financial products and services (chapter D -9.2), the Money -Services \nBusine sses Act (chapter E -12.000001), the Derivatives Act (chapter I -14.01) or the \nSecurities Act (chapter V -1.1) or compliance with those Acts.  \nAct respecting the regulation of the financial sector , CQLR, c.  E-6.1 \n93. The function of the Tribunal is to make det erminations with respect to matters \nbrought under this Act and the Acts listed in Schedule I. Except where otherwise \nprovided by law, the Tribunal shall exercise its jurisdiction to the exclusion of any other \ntribunal or adjudicative body.  \n The Tribunal sh all exercise its discretion in the public interest.  \n In reviewing a decision rendered by the Authority under the Securities Act (chapter \nV-1.1) or the Derivatives Act (chapter I -14.01 ), the Tribunal may not, when assessing \nthe facts or the law for the purp oses of those Acts, substitute its assessment of the public \ninterest for that made by the Authority in making a decision.  \n2023 SCC 29 (CanLII)\n\n--- Page 128 ---\n \n  In this Title, unless the context indicates otherwise, “matters” also includes any \napplication, complaint, contestation or motion, as  well as any action falling within the \njurisdiction of the Tribunal.  \n94. At the request of the Authority, the Tribunal may take any measure conducive to \nensuring compliance with an undertaking given to the Authority under any of the Acts \nlisted in the firs t paragraph of section 93  or compliance with those Acts.  \nCivil Code of Québec  \n3134.  In the absence of any special provision, Québec authorities have jurisdiction \nwhen the defendant is domiciled in Québec.  \n3135 . Even though a Québec authority has jurisdicti on to hear a dispute, it may, \nexceptionally and on an application by a party, decline jurisdiction if it considers that \nthe authorities of another State are in a better position to decide the dispute.  \n3136 . Even though a Québec authority has no jurisdictio n to hear a dispute, it may \nnevertheless hear it provided the dispute has a sufficient connection with Québec, if \nproceedings abroad prove impossible or the institution of proceedings abroad cannot \nreasonably be required.  \n3137 . On the application of a party, a Québec authority may stay its ruling on an action \nbrought before it if another action, between the same parties, based on the same facts \nand having the same subject is pending before a foreign authority, provided that the \nlatter action can result in a decision which may be recognized in Québec, or if such a \ndecision has already been rendered by a foreign authority.  \n3138 . A Québec authority may order provisional or conservatory measures even if it \nhas no jurisdiction over the merits of the dispute.  \n3139 . Where a Québec authority has jurisdiction to rule on the principal demand, it also \nhas jurisdiction to rule on an incidental demand or a cross demand.  \n3140 . In cases of emergency or serious inconvenience, Québec authorities may also \ntake such measure s as they consider necessary for the protection of a person present in \nQuébec or of the person’s property if it is situated",
    "token_count": 1000,
    "start_token": 55800,
    "end_token": 56800,
    "total_tokens_in_source": 57108
  },
  {
    "chunk_id": 63,
    "source_file": "2023scc29.txt",
    "text": " may order provisional or conservatory measures even if it \nhas no jurisdiction over the merits of the dispute.  \n3139 . Where a Québec authority has jurisdiction to rule on the principal demand, it also \nhas jurisdiction to rule on an incidental demand or a cross demand.  \n3140 . In cases of emergency or serious inconvenience, Québec authorities may also \ntake such measure s as they consider necessary for the protection of a person present in \nQuébec or of the person’s property if it is situated there.  \n3148.  In personal actions of a patrimonial nature, Québec authorities have jurisdiction \nin the following cases:  \n (1) the defe ndant has his domicile or his residence in Québec;  \n (2) the defendant is a legal person, is not domiciled in Québec but has an \nestablishment in Québec, and the dispute relates to its activities in Québec;  \n2023 SCC 29 (CanLII)\n\n--- Page 129 ---\n \n  (3) a fault was committed in Québec, injury was su ffered in Québec, an injurious \nact or omission occurred in Québec or one of the obligations arising from a contract \nwas to be performed in Québec;  \n Appeal s dismissed  with costs , CÔTÉ J. dissenting . \n Solicitors  for the appellant /intervener  Frederick Langford Sharp : Langlois \nLawyers , Montréal.  \n Solicitors  for the appellants /intervener s Shawn Van Damme, Vincenzo \nAntonio Carnovale and Pasquale Antonio Rocca : LCM Attorneys inc., Montréal.  \n Solicitor  for the respondent: Autorité des marchés financiers, Mon tréal.  \n Solicitor  for the intervener the Attorney General of Quebec: Attorney \nGeneral of Quebec , Québec.  \n Solicitor  for the intervener the Ontario Securities Commission: Ontario \nSecurities Commission, Toronto.  \n2023 SCC 29 (CanLII)\n\n",
    "token_count": 408,
    "start_token": 56700,
    "end_token": 57108,
    "total_tokens_in_source": 57108
  }
]