[
  {
    "chunk_id": 0,
    "source_file": "2023scc26.txt",
    "text": "--- Page 1 ---\n \n  \nSUPREME COURT OF CANADA  \n \nCITATION : R. v. Bertrand \nMarchand, 2023 SCC  26   \nAPPEALS HEARD : February  15, 16, \n2023  \nJUDGMENT RENDERED : \nNovember  3, 2023  \nDOCKETS : 39935, 40093  \n \nBETWEEN : \n \nHis Majesty The King and Attorney General of Quebec  \nAppellants  \n \nand \n \nMaxime Bertrand Marchand  \nRespondent  \n \n- and - \n \nDirector of Public Prosecutions, Attorney General of Ontario, Attorney \nGeneral of Saskatchewan, Attorney General of Alberta, Nunavik Civil \nLiberties Association, Association québécoise des avocats et avocates de la \ndéfense, Barbra Schlifer Commemorative Clinic and Independent Criminal \nDefence Advocacy Society  \nInterveners  \n \nAND BETWEEN : \n \nHis Majesty The King and Attorney General of Quebec  \nAppel lants  \n \nand \n \nH.V.  \n2023 SCC 26 (CanLII)\n\n--- Page 2 ---\n \n Respondent  \n \n- and - \n \nDirector of Public Prosecutions, Attorney General of Ontario, Attorney \nGeneral of Saskatchewan, Attorney General of Alberta, Association des \navocats de la défense de Montréal and Independent Criminal Defence \nAdvocacy S ociety  \nInterveners  \n \nOFFICIAL ENGLISH TRANSLATION : Reasons of Côté  J. \n \nCORAM : Karakatsanis, Côté, Rowe, Martin, Kasirer, Jamal and O’Bonsawin JJ.  \n \nREASONS FOR \nJUDGMENT :  \n(paras. 1 to 174)  Martin J. (Karakatsanis, Rowe, Kasirer, Jamal and \nO’Bonsawin JJ. concurring)  \n  \nREASONS  \nDISSENTING IN \nPART:  \n(paras. 175 to 232) Côté J.  \n \n \nNOTE: This document is subject to editorial revision before its reproduction in final \nform in the Canada Supreme Court Reports . \n   \n \n  \n2023 SCC 26 (CanLII)\n\n--- Page 3 ---\n \n His Majesty The King and  \nAttorney General of Quebec  Appellants  \nv. \nMaxime Bertrand Marchand  Respondent  \nand \nDirector of Public Prosecutions,  \nAttorney General of Ontario,  \nAttorney General of Saskatchewan,  \nAttorney General of Alberta,  \nNunavik Civil Liberties Association,  \nAssociation québécoise des avocats et avocates de la défense,  \nBarbr a Schlifer Commemorative Clinic and  \nIndependent Criminal Defence Advocacy Society  Interveners  \n- and - \nHis Majesty The King and  \nAttorney General of Quebec  Appellants  \nv. \nH.V.  Respondent  \nand \nDirector of Public Prosecuti ons, \n2023 SCC 26 (CanLII)\n\n--- Page 4 ---\n \n Attorney General of Ontario,  \nAttorney General of Saskatchewan,  \nAttorney General of Alberta,  \nAssociation des avocats de la défense de Montréal and  \nIndependent Criminal Defence Advocacy Society  Interveners  \nIndexed as: R. v. Bertrand Marchand  \n2023  SCC 26 \nFile No s.: 39935 , 40093 . \n2023: February 15 , 16; 2023: November 3 . \nPresent: Karakatsanis, Côté, Rowe, Martin, Kasirer, Jamal and O ’Bonsawin JJ.  \nON APPEAL  FROM  THE  COURT OF APPEAL FOR QU EBEC  \n Constitutional law — Charter of Rights — Cruel and unusual treatment or \npunishment — Sentencing — Mandatory minimum sentence — Child luring — Accused \npersons pleading guilty to child luring — Accused persons challenging \nconstitutionality of mandatory minimum sentences of one year’s imprisonment \nprescribed for chil d luring as indictable offence and of six months’ imprisonment for \nchild luring punishable on summary conviction — Whether mandatory minimum \nsentences constitute cruel and unusual punishment — Canadian Cha rter of Rights and \nFreedoms, s.  12 — Criminal Code,  R.S.C. 1985, c.  C-46, s.  172.1(2)(a), (b).  \n2023 SCC 26 (CanLII)\n\n--- Page 5 ---\n \n  Criminal law — Sentencing — Considerations — Child luring — Accused \nperson pleading guilty to child luring and sexual interference — Sentencing judge \nimposing sentence of five months’ imprisonment for child luri ng to be served \nconcurrently to sentence for sexual",
    "token_count": 1000,
    "start_token": 0,
    "end_token": 1000,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 1,
    "source_file": "2023scc26.txt",
    "text": ".C. 1985, c.  C-46, s.  172.1(2)(a), (b).  \n2023 SCC 26 (CanLII)\n\n--- Page 5 ---\n \n  Criminal law — Sentencing — Considerations — Child luring — Accused \nperson pleading guilty to child luring and sexual interference — Sentencing judge \nimposing sentence of five months’ imprisonment for child luri ng to be served \nconcurrently to sentence for sexual interference — Majority of Court of Appeal \nupholding sentencing judge’s decision — Whether accused person’s sentence for child \nluring was fit.  \n M pleaded guilty to one count of sexual i nterference contrar y to s.  151(a) \nof the Criminal Code  and to one count of luring a child contrary to s.  172.1(1)(b). M \nmet the victim in person when he was 22 and she was 13 years old . He then sent her a \nfriend request on Facebook and,  for the following  two years, they were  in contact on \nsocial media and also met in person, and had illegal sexual intercourse four separate \ntimes.  At sentenci ng, M challenged the one -year mandatory minimum period o f \nincarceration set out in s.  172.1(2)(a) for persons found guilty of the indicta ble offence \nof luring a child, on the basis that i t was inconsistent with s.  12 of the Charter , which \nprotects against cruel and unusual punishment. The sentencing judge sentenced M to \nfive months’ imprisonment on the count of luring, to be serve d concurre ntly to the \nsentence imposed on the count of sexual interference. The judge found the mandatory \nminimum sentence  infringed s.  12 of the Charter  as it would be grossly \ndisproportionate to the fit sentence of five months. The majority of the Court of Appeal \nupheld both the sentence imposed for luring and the conclusion that the mandatory \nminimum sentence was unconstitutional. The Crown appeals the fitness of M’s \nsentence for luring and asks the Court to find the mandatory minimum sentence in \n2023 SCC 26 (CanLII)\n\n--- Page 6 ---\n \n s. 172.1(2)(a) co nstitutional.  \n V pleaded guilty to one count of luring a child contrary to s.  172.1(1)(a) of \nthe Criminal Code . V sent sexual text messages to the victim over a period of 10 days. \nAt sentencing, V challenged  the six -month mandatory minimum sentence set out  in \ns. 172.1(2)( b) for persons found guilty of the offence of luring punishable on summary \nconviction,  on the basis that it violated s.  12 of the Charter . The sentencing judge \nimposed a sentence of two years’ probation and 150 hours of community service af ter \nfinding that the mandatory minimum sentence would be grossly disproportionate to the \nfit sentence.  On appeal, the Superior Court varied the sentence to four months’ \nimprisonment. The court then determined that the mandatory minimum sentence \ninfringed s . 12 since, although it was not grossly disproportionate to V’s fit sentence of \nfour months, it would be when applied to reasonably foreseeable scenarios. The Court \nof Appeal upheld that decision. The fitness of V’s sentence is not challenged before the \nCourt. The Crown asks the Court to find the m andatory minimum sentence in \ns. 172.1(2)(b) constitutional.  \n Held (Côté J. dissenting in part):  The appeal in M’s case should be allowed \nin part. The appeal in  V’s case should be dismissed.  \n Per Karakatsanis, Rowe , Martin , Kasirer, Jamal and O’Bonsawin JJ.: M’s \nsentence for luring a child should be increased from 5 months’ to 12 months’ \nimprisonment, and it should be served consecutively, not concurrently, to his sentence \nfor sexual interference. The mandatory mini mum sentences for luring a child set out in \n2023 SCC 26 (CanLII)\n\n--- Page 7 ---\n \n s. 172.1(2)(a) and (b) of the Criminal Code  are inconsistent with s.  12 of the Charter , \nare not saved by s.  1 and therefore are of no force or effect under s.  52 of the \nConstitution Act, 1982 . \n To protect a range of social interests, namely the vulnerability and \nexploitation of children facilitated by the internet, Parliament enacted the offence of \nluring a child at",
    "token_count": 1000,
    "start_token": 900,
    "end_token": 1900,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 2,
    "source_file": "2023scc26.txt",
    "text": ". 172.1(2)(a) and (b) of the Criminal Code  are inconsistent with s.  12 of the Charter , \nare not saved by s.  1 and therefore are of no force or effect under s.  52 of the \nConstitution Act, 1982 . \n To protect a range of social interests, namely the vulnerability and \nexploitation of children facilitated by the internet, Parliament enacted the offence of \nluring a child at s.  172.1 of the Criminal Code . The offence has three elements : (1) the \naccused mu st communicate intentionally  by telecommunication; (2)  with someone the \naccused knows or believes is  under 18 years of age, and (3)  for the specific purpose of \nfacilitating the commission of a designated secondary offence  listed in s.  172.1 (1) with \nrespect  to the underage person. Parliament’s creation of this inchoate preparatory \noffence that criminalizes communications that precede the perpetration of other \ndesignated secondary offences indicates that luring generates harms that are different \nfrom those se condary offences and i s sufficiently wrongful and harmful to ground \ncriminal liability. Child luring is a hybrid offence that carries a mandatory minimum \nsentence of one year’s imprisonment if the offender is guilty of an indictable offence \n(s. 172.1(2)(a) ) and of six months’ imprisonment  if the offender is guilty of an offence \npunish able on  summary conviction (s.  172.1(2)(b)).  \n Pursuant to s.  718.1 of the Criminal  Code , a sentence must be \nproportionate to the gravity of the offence and the degree of respon sibility of the \noffender. A fit and proportionate sentence must be crafted based on the particular facts \nof the case and in light of existing legislation and case law. Furthermore, in s.  718.01, \n2023 SCC 26 (CanLII)\n\n--- Page 8 ---\n \n Parliament has specifically indicated that in sentencing offe nces involving abuse of \nchildren, including child luring, the objectives of denunciation and deterrence must be \ngiven primary consideration. While a judge can accord significant weight to other \nsentencing objectives, including rehabilitation, the provision  limits judicial discretion \nas a judge cannot give these other objectives precedence or equivalency. In addition to \nthe steps that Parliament has taken to punish the various forms that abuse of children \nmay take, the Court’s decision in R. v. Friesen , 2020  SCC 9, [2020] 1 S.C.R. 424, sets \nout sentencing principles for sexual offences against children to fully reflect and give \neffect to the profound wrongfulness and harmfulness of these crimes. Friesen sends the \nclear message that s entences for these crimes  must account for the far -reaching and \nongoing damage sexual violence causes to children, families and society at large.  \n With respect to the offence of child luring, understanding its wrongfulness \nand distinct harmfulness is integral to properly assessing its gravity and the degree of \nresponsibility of the offender, as well as to avoiding stereotypical reasoning and the \nmisidentification of aggravating and mitigating factors.  Luring is wrongful, as adults \ntake advantage of a child’s weaker position and lack  of experience online where they \nare particularly exposed and helpless, which repudiates the fundamental value of \nprotecting children. Luring invades a child’s personal autonomy, sexual integrity, and \ngravely wounds their dignity.  Even when the only intera ctions with the child occur \nonline, the offender’s conduct is inherently wrong because it still constitutes a form of \nsexual abuse.  \n2023 SCC 26 (CanLII)\n\n--- Page 9 ---\n \n  Furthermore, luring is harmful as it can constitute a form of psychological \nsexual violence, bringing about serious emotion al and psychological harm. It also \ncauses distinct psychological and developmental harms to young victims that differ in \ntwo main ways from harms arising from sexual contact initiated in person. First, o nline \ncommunications allow for abusers to abuse remot ely and for manipulation and control \nover time, which can lead to serious and lasting psychological consequences. Second, \nan offender’s power and effectiveness online lies in the degree to which they can \ncontrol the victim and manipulate them into engaging  with the abuse, which may cause \na victim to feel they actively participated in their own abuse, thereby increasing  \nself-blame and shame. Although identifying the distinct harms of luring is difficult, one \nway for courts t o do so is by  differentiating betw een contact -driven luring, where the",
    "token_count": 1000,
    "start_token": 1800,
    "end_token": 2800,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 3,
    "source_file": "2023scc26.txt",
    "text": " serious and lasting psychological consequences. Second, \nan offender’s power and effectiveness online lies in the degree to which they can \ncontrol the victim and manipulate them into engaging  with the abuse, which may cause \na victim to feel they actively participated in their own abuse, thereby increasing  \nself-blame and shame. Although identifying the distinct harms of luring is difficult, one \nway for courts t o do so is by  differentiating betw een contact -driven luring, where the \noffender’s goal is to facilitate in -person sexual abuse, and luring that leads to sexual \nabuse occurring entirely online. Contact -driven luring is not necessarily more or less \nharmful than luring that leads to sexual ab use that occurs entirely online. The severity \nof the harm caused by the online communication will depend on the individual \noffender, the individual characteristics of the victim, and the unique dynamic between \nthe offender and the victim.  \n Parliament has consistently raised sentences for s exual offences against \nchildren  to reflect a growing awareness of their gravity, and to indicate the serious \nemotional and psychological harms they cause for victims. Given the wrongfulness and \ndistinct harms of luring, this same increasingly punitive trend applies to that offence. \nAppellate intervention in a sentencing judge’s decision will be justified only if a \n2023 SCC 26 (CanLII)\n\n--- Page 10 ---\n \n sentence is demonstrably unfit or if the judge committed an error in principle that \nimpacted the sentence impo sed. In M’s case, the sentencing judge committed errors in \nprinciple that impacted the assigned sentence of five months’ imprisonment ordered to \nbe served concurrently and  that warranted appellate intervention that the majority of \nthe Court of Appeal faile d to undertake. Speci fically, the judge erred by (1)  minimizing \nthe harm caused to the victim by failing to recogn ize the grooming that did occur , which \nshould have served as an aggravating factor on sentencing ; (2)  misconstruing the \noffender’s actions, wh ich caused her to unduly minimize the wrongfulness and harms \nof the luring offence ; and (3)  assigning a concurrent sentence for the luring offence. To \nproperly account for the distinct legal interests that the luring offence protects , that is, \nthe vulnerab ility and exploitation of children facilitated by the internet, the sentences \nshould have been consecutive. Parliament’s legislative initiatives, the distinct harm \ncaused by the online communication, and the aggravating and mitigating factors instead  \njustify a sentence of 1 2 months’ imprisonment for M . \n For a mandatory minimum sentence to be found unconstitutional pursuant \nto s. 12 of the Charter , it must be so excessive as to outrage standards of decency. \nWhether the mandatory minimum sentences  in s.  172.1 (2)(a) and (b) are \nunconstitutional requi res a two -stage inquiry that involves a contextual and \ncomparative analysis. First, a court must set a fit and proportionate sentence for the \nindividual offenders before the court and possibly other reasonably fores eeable \noffenders. Second, a court must determine whether the mandatory minimum requires \nimposing a sentence that is grossly disproportionate to the otherwise fit and \n2023 SCC 26 (CanLII)\n\n--- Page 11 ---\n \n proportionate sentence. This involves consideration of the scope and reach of the \noffence,  the effects of the penalty on the indivi dual or reasonably foreseeable offender, \nand the penalty and its objectives.  \n While a proper understanding of the wrongfulness and harmfulness of \nluring will lead to significant penalties in most circumstances, the constitutional \nanalysis under s.  12 of the Charter  does not merely ask whether the mandatory \nminimum is cruel and unusual in common cases. Punishments can be impu gned where \nthey infringe the s.  12 Charter rights of a reasonably foreseeable offender. Indeed , the \nuse of reasonably foreseeable scenarios is expressly designed to test the lower end of \nthe spectrum of conduct captured by the offence. As such, when parties raise \nhypothetical scenarios as part of the adversarial process, a court should not dismiss a \nconstitutional challenge without considering ( 1) whether the scenario is reasonably \nforeseeable and, if so, ( 2) whether the representative offender ’s scenario  could render \nthe impugned law unconstitutional.  \n In M’s case, the fit sentence of 12 months’ incarceration mirrors the one -\nyear mandatory minimum sentence. As a result, the minimum sentence is not grossly \ndisproportionate in his circumstances.  In V’s case, the six -month mandatory minimum \nterm of imprisonment is not grossly disproportionate to the fit sentence of four months’ \nimpr",
    "token_count": 1000,
    "start_token": 2700,
    "end_token": 3700,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 4,
    "source_file": "2023scc26.txt",
    "text": " so, ( 2) whether the representative offender ’s scenario  could render \nthe impugned law unconstitutional.  \n In M’s case, the fit sentence of 12 months’ incarceration mirrors the one -\nyear mandatory minimum sentence. As a result, the minimum sentence is not grossly \ndisproportionate in his circumstances.  In V’s case, the six -month mandatory minimum \nterm of imprisonment is not grossly disproportionate to the fit sentence of four months’ \nimprisonment.  Reasonably foreseeable scenarios must therefore be considered to \ndetermine whether  the mandatory minimum sentences are unconstitutional. For the \npurposes of the constitutionality analysis for the one -year mandator y minimum \n2023 SCC 26 (CanLII)\n\n--- Page 12 ---\n \n sentence in s.  172.1(2)(a), the first reasonably foreseeable scenario involves a \nrepresentative offender who is a first -year high school teacher in her late 20s with \nbipolar disorder and with no criminal record. One evening, she texts her 15 -year-old \nstudent to inquire about a school assignment. Feeling manic, she directs the \nconversation to sexual matters. The two meet that evening and participate in sexual \ntouching. The offender does not engage inappropriately with the student again and \npleads g uilty and expresses remorse on sentencing . For the purposes of the \nconstitutionality analysis for the six -month mandatory minimum sentence in \ns. 172.1(2)(b), the reasonably foreseea ble scenario involves an 18 -year old \nrepresentative offender who is in a re lationship with a 17-year-old. In one text, the \noffender asks her to send him an explicit photo. She does, and he then forwards that \nphoto to his friend without his girlfriend’s knowledge. This friend, who is also 18, does \nnot transmit this photo, but reta ins it on his mobile phone . \n In addressing the first stage of the s.  12 analysis of setting the fit and \nproportionate sentence for the representative offender, courts must define as specific a \nsentence as possible by considering the sentencing objectives s et out in the Criminal \nCode  and by examining any aggravating and mitigating factors. A fit sentence for the \nluring offence committed by the representative offende r in the first scenario is a 30 -day \nintermittent sentence. Such a sentence recognizes the inhe rent seriousness and potential \nharms associated with the offence and appropriately denounces the o ffender’s  conduct, \nwhile being mindful of her diminished moral blameworthiness and the mitigating \nfactors at play. A fit sentence for the luring offence commi tted by the representative \n2023 SCC 26 (CanLII)\n\n--- Page 13 ---\n \n offender in the second scenario is a six -month conditional discharge, with strict \nprobationary terms. The offender engaged in a serious breach of the victim’s privacy \nand dignity that should be condemned by a criminal sanction. H owever, the significant \nmitigating factors in this scenario, most notably the offender’s youth and lack of a \ncriminal record, warrant a sentence on the low end of the spectrum.  \n At the second stage of the s.  12 analysis,  the scope and reach of the offence \nmust be examined. Courts should assess how broad a range of conduct is captured by \nthe actus reus and mens rea of the offence and consider the included degree of variation \nin the offence’s gravity and the offender’s culpability. The actus reus  of child lur ing \nincludes communication with the victim by use of any telecommunication platform. \nThis demonstrates the massive breadth of the luring offence.  Regarding the mens rea , \nthe specific intent element — that the accused must communicate with the purpose of \nfacilitating a designated offence — is broad. An accused may impulsively \ncommunicate in a sexual manner — and in that moment have the specific intent \nrequired — without having taken time beforehand to plan or prepare to execute a \nsecondary offence. The offen ce therefore  captures a wide range of designated illicit \npurposes with varying degrees of moral culpability. The range of conduct captured by \nthe luring offence is also staggering. The offender need only communicate with an \nunderage person for the purpose of facilitating one of the twenty  designated secondary \noffences which are, amongst themselves, of varying degrees of seriousness and wide \nin scope. These features of the luring offence further threaten the constitutionality of \nits mandatory minimum penalti es. \n2023 SCC 26 (CanLII)\n\n--- Page 14 ---\n \n  Next, in analyzing the effect of the punishment on representative offenders, \ncourts must consider the qualities of the reasonably foreseeable offender, and",
    "token_count": 1000,
    "start_token": 3600,
    "end_token": 4600,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 5,
    "source_file": "2023scc26.txt",
    "text": " person for the purpose of facilitating one of the twenty  designated secondary \noffences which are, amongst themselves, of varying degrees of seriousness and wide \nin scope. These features of the luring offence further threaten the constitutionality of \nits mandatory minimum penalti es. \n2023 SCC 26 (CanLII)\n\n--- Page 14 ---\n \n  Next, in analyzing the effect of the punishment on representative offenders, \ncourts must consider the qualities of the reasonably foreseeable offender, and then \nevaluate what harm may result from the impugned punishment. Evidence that \nimprisonment wou ld have significant deleterious effects on an offender should be \nconsidered at this stage. In the instant scenarios, the mandatory minimum punishment \nis alternatively one year’s or six months’ incarceration. The effect of the one-year \nmandatory minimum on the first rep resentative offender is harsh, as it would replace a \nshort intermittent sentence with a year of incarceration, and the offender’s individual \ncircumstances, namely her mental illness, would likely make her experience of \nincarceration perilously  grave. The second representative offender is a youthful first -\ntime offender who, holding high rehabilitative prospects, should benefit from the \nshortest possible sentence proportionate to the offence. In prison, youthful offenders \nare often bullied, press ured to join adult prison gangs, and are vulnerable to segregation \nplacements. The six-month mandatory minimum is a far cry from the shortest possible \nrehabilitative sentence for this offender. These factors indicate the mandatory \nminimum sentences’ consti tutional infirmity.  \n Finally, turning to the penalty and its objectives , luring is a serious offence \nthat must be punished accordingly. The offence dovetails with s.  718.01 which directs \nthat in imposing sentences for offences involving abuse of children, primary \nconsideration must be given to the objectives of denunciation and deterrence. \nParliament’s decision to increase the maximum penalties over the years for the luring \noffence indicates its view of the gravity of the offence. Parliament enacted s.  172.1 in \n2023 SCC 26 (CanLII)\n\n--- Page 15 ---\n \n response to the growth of the internet as a burgeoning domain for predators to target \nchildren. Child luring not only lays the foundation for dangerous in -person criminal \noffences, it also causes its own distinct harm to child victims. However, the ma ndatory \nminimum sentences go beyond what is necessary to achieve Parliament’s sentencing \nobjectives. The incredible breadth of the luring offence and its harsh effect on \nrepresentative offenders paired with the discordant internal scheme of the penalty \nrenders the mandatory minimum sentences in  s. 172.1(2) constitutionally infirm. The \nmandato ry minimum penalties in both s.  172.1(2)(a) and (b) are therefore grossly \ndisproportionate to the fit sentences for the representative offenders and  hence \nunconstitutional.  \n Per Côté  J. (dissenting in part): The appeals should be allowed. There is \nagreement with the majority concerning the sentence to be imposed on M. However, \nthe minimum terms of imprisonment of six months or one year, depending on w hether \nthe Crown proceeds summarily or by indictment, as provided for in s.  172.1(2)(a) and \n(b) of the Criminal Code , are not contrary to s.  12 of the Charter . The four -month \nsentence imposed on V should therefore be set aside and the mandatory minimum \nsentence of six months’ imprisonment should be imposed on him, with a permanent \nstay of execution.  \n According to Friesen , courts must impose more severe sentences on \noffenders who have committed offences that involve the abuse of children and must \nprioritize denunciation and deterrence, as required by s.  718.01 of the Criminal Code . \n2023 SCC 26 (CanLII)\n\n--- Page 16 ---\n \n The imposition of minimum terms of imprisonment of one year on M and six months \non V is not cruel and unusual. Nor do the two reasonably foreseeable hypothetical \nscenarios identifi ed by the majority show that the minimum sentences provided for in \ns. 172.1(2) are grossly disproportionate.  \n For the offender in the first reasonably foreseeable hypothetical scenario, \na 30-day term of imprisonment to be served intermittently is far too l enient a sentence. \nThe conduct of an offender who takes advantage of her status as a teacher to exploit a \nchild for sexual purposes is highly blameworthy and is likely to have devastating \nconsequences for the child victim. T his harm is all the more serious  given the fact that \nthe commission of the offence involves abuse of a position of",
    "token_count": 1000,
    "start_token": 4500,
    "end_token": 5500,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 6,
    "source_file": "2023scc26.txt",
    "text": " For the offender in the first reasonably foreseeable hypothetical scenario, \na 30-day term of imprisonment to be served intermittently is far too l enient a sentence. \nThe conduct of an offender who takes advantage of her status as a teacher to exploit a \nchild for sexual purposes is highly blameworthy and is likely to have devastating \nconsequences for the child victim. T his harm is all the more serious  given the fact that \nthe commission of the offence involves abuse of a position of trust and authority . \nMoreover, the fact that an act was committed spontaneously does not automatically \nlead to the conclusion that an offender had no subjective intent to ac t and that the \nconduct in question is therefore less blameworthy. The absence of grooming and \npremeditation must have a neutral effect on sentencing. Given the moral \nblameworthiness inherent in an offence like child luring, the abuse of a position of trust  \nand the commission of an underlying offence, and also given the significant age \ndifference between the offender in the first scenario and the complainant as well as the \ncomplainant’s vulnerability, the fit and appropriate sentence is a nine -month term of \nimprisonment. Such a penalty acknowledges the role played by the offender’s mental \nillness, along with her guilty plea and the remorse she expressed . \n2023 SCC 26 (CanLII)\n\n--- Page 17 ---\n \n  The fit and appropriate sentence for the offender in the second reasonably \nforeseeable hypothetical scenario — who was in a romantic relationship with the \nunderage victim and who abused a position of trust in relation to her — is not a \nconditional discharge but rather a six -month term of imprisonment. Denunciation and \ndeterrence must be prioritized in th e context of the commission of an offence involving \nthe abuse of the offender’s intimate partner as well as in cases involving sexual violence \nagainst a minor, two aggravating circumstances that increase the subjective gravity of \nthe offence. Rehabilitatio n of an offender with no record who has just reached \nadulthood is not a paramount factor for serious offences or offences involving violence. \nThe weight to be given to the offender’s young age and to the absence of a criminal \nrecord therefore depends on th e nature of the offence of which the offender is \nconvicted. Taking advantage of the existence of a relationship of trust is likely to \nincrease the harm to the victim and thus the gravity of the offence. It will be more \ndifficult to grant a discharge for of fences committed against a child or an intimate \npartner.  \n Given that the fit and appropriate sentence is equal to or greater than a \nsix-month term of imprisonment in both reasonably foreseeable hypothetical scenarios, \nthe first stage of t he analytical fram ework that must be applied under s.  12 of the \nCharter  decides the constitutionality of s.  172.1(2)(b). The second stage of the \nanalytical framework therefore concerns the constitutionality of the one -year minimum \nterm of imprisonment set out in s.  172.1(2) (a). \n2023 SCC 26 (CanLII)\n\n--- Page 18 ---\n \n  To begin with, while t he offence of child luring is broad in scope , requiring \na high level of mens rea  ensures that the offence captures only conduct that involves a \nhigh degree of moral blameworthiness as well as serious harm or a risk of such harm.  \nEven when the offence of luring is committed in the context of a police sting operation \nthat does not involve children, the offence involves conduct that is undeniably very \nserious, and it must never be seen as a victimless crime. In addition, one must be  careful \nnot to emphasize the fact that it is not necessary for the offender to have committed one \nof the listed underlying offences in order to be convicted of child luring. Sophistication \nand premeditation also reveal nothing about the scope of the offen ce, because they are \nnot essential elements of the offence.  \n Next, the effects of the minimum term of imprisonment on the offenders \nin the reasonably foreseeable hypothetical scenarios are not incompatible with human \ndignity . Nothing in the record makes it  possible to identify the precise harm associated \nwith the additional period of imprisonment of three months in the first case and six \nmonths in the second case if the offence is prosecuted by indictment. Since the period \nis relatively short, its effects a re not incompatible with human dignity. The logical \nconsequence of finding that the individual circumstances of the offender in the first \nscenario would likely make her experience of incarceration perilously grave, and that \nthe minimum sentence is a far cr y from the shortest possible rehabilitative sentence for \nthe offender in the second scenario, is that any minimum term of imprisonment that \n",
    "token_count": 1000,
    "start_token": 5400,
    "end_token": 6400,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 7,
    "source_file": "2023scc26.txt",
    "text": " and six \nmonths in the second case if the offence is prosecuted by indictment. Since the period \nis relatively short, its effects a re not incompatible with human dignity. The logical \nconsequence of finding that the individual circumstances of the offender in the first \nscenario would likely make her experience of incarceration perilously grave, and that \nthe minimum sentence is a far cr y from the shortest possible rehabilitative sentence for \nthe offender in the second scenario, is that any minimum term of imprisonment that \nmay be imposed on an offender who has just reached adulthood or on a person with a \nmental illness will be grossly di sproportionate, regardless of the gravity of the offence \n2023 SCC 26 (CanLII)\n\n--- Page 19 ---\n \n or the circumstances surrounding its commission. This consequence is entirely \ninconsistent with the deference owed to Parliament.  \n Lastly, the minimum term of imprisonment is not grossly disproportio nate \nto what is necessary to achieve Parliament’s objectives . The difference of three or six \nmonths between the fit and appropriate sentence and the sentence provided for in \ns. 172.1(2)(a) is not so great as to show that the punishment chosen by Parliament  \ngrossly exceeds what is necessary to achieve its objectives of deterrence and \ndenunciation of sexual violence against children. The fact that there may be some \ndisproportion the application of which leads to a demonstrably unfit punishment is not \nsufficie nt to declare s.  172.1(2)(a) and (b) unconstitutional. The question is not whether \nParliament chose the least restrictive means to achieve its objectives. Parliament is \nperfectly at liberty to prioritize denunciation and deterrence to the near complete \nexclusion of rehabilitation, provided that it leaves a door open for this latter objective. \nIt has not been shown how, by creating minimum terms of imprisonment in s.  172.1(2), \nParliament has completely excluded this objective.  \n In light of the pronouncements  in Friesen  and the high standard that applies \nin an analysis under s.  12 of the Charter , sentencing an offender to imprisonment for \nsix months or one year for communicating with a minor for the purpose of facilitating \nthe commission of a sexual offence or  other specified offence against the minor is not \none of the instances in which the demanding and rarely attained standard of gross \ndisproportionality is met.  \n2023 SCC 26 (CanLII)\n\n--- Page 20 ---\n \n Cases Cited  \nBy Martin J.  \n Applied:  R. v. Friesen , 2020 SCC 9, [2020] 1 S.C.R. 424;  R. v. Hills , 2023 \nSCC 2; considered:  R. v. Morrison , 2019 SCC 15, [2019] 2 S.C.R. 3; R. v. Rayo , 2018 \nQCCA 824; R. v. Melrose , 2021 ABQB 73, [2021] 8 W.W.R. 467; R. v. Paradee , 2013 \nABCA 41, 542 A.R. 222; R. v. Hood , 2018 NSCA 18 , 45 C.R. (7th) 269; R. v. John , \n2018 ONCA 702, 142 O.R. (3d) 670; referred to:  R. v. Reynard , 2015 BCCA 455, 378 \nB.C.A.C. 293; R. v. Alicandro , 2009 ONCA 133, 95 O.R. (3d) 173; R. v. Legare , 2009 \nSCC 56, [2009] 3 S.C.R. 551; R. v. Levigne , 2010 SCC 25, [2010] 2 S.C.R. 3; R. v. \nCollins , 2013 ONCA 392; R. v. Nasogaluak , 2010 SCC 6, [2010] 1 S.C.R. 206; R. v. \nLacasse , 2015 SCC 64, [2015] 3 S.C.R. 1089; R. v. J.  (T.), 2021 ONCA 392, 156 O.R. \n(3d) 161; R. v. Sharpe , 2001 SCC 2, [2001] 1 S.C.R. 45 ; R. v. Folino  (2005), 77 O.R. \n(3d) 641; R. v",
    "token_count": 1000,
    "start_token": 6300,
    "end_token": 7300,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 8,
    "source_file": "2023scc26.txt",
    "text": ", [2015] 3 S.C.R. 1089; R. v. J.  (T.), 2021 ONCA 392, 156 O.R. \n(3d) 161; R. v. Sharpe , 2001 SCC 2, [2001] 1 S.C.R. 45 ; R. v. Folino  (2005), 77 O.R. \n(3d) 641; R. v. Symes , [2005] O.J. No. 6041 (QL); R. v. Hajar , 2016 ABCA 222, [2016] \n12 W.W.R. 435 ; R. v. Sutherland , 2019 NWTSC 48, [2020] 3 W.W.R. 771; R. v. Wall , \n2023 ABPC 3; R. v. Misay , 2021 ABQB 485, [2022] 1 W.W.R. 145; R. v. R.S.F. , 2021 \nMBQB 261; R. v. Rafiq , 2015 ONCA 768, 342 O.A.C. 193; R. v. McCraw , [1991] 3 \nS.C.R. 72; R. v. J.R. , 2021 ONCJ 14; R. v. Roy , 2020 QCCQ 4546; R. v. M.B. , 2020 \nONSC 7605; R. v. Miller , 2016 SKCA 32, 476 Sask. R. 150; Caron Barrette  v. R., 2018 \nQCCA 516; R. v. Ditoro , 2021 ONCJ 540; R. v. Gould , 2022 ONCJ 187; R. v. Cooper , \n2023 ONSC 875; R. v. Clarke , 2021 NLCA 8; R. v. Aeichele , 2023 BCSC 253; R. v. \nWolff , 2020 BCPC 174; Directeur des poursuites criminelles et pénales v . St-Amour , \n2021 QCCQ 6855; R. v. Rice , 2022 AB KB 773; R. v. Wickramasinghe , 2022 ONCJ \n2023 SCC 26 (CanLII)\n\n--- Page 21 ---\n \n 331; R. v. Rasiah , 2021 ONCJ 584; R. v. Osadchuk , 2020 QCCQ 2166; R. v. Deren , \n2021 ABPC 84; R. v. Sinclair , 2022 MBPC 40; R. v. Pentecost , 2020 NSSC 277; R. v. \nCollier , 2021 ONSC 6827; R. v. Kavanagh , 2023 ONSC 283;  R. v. Moolla , 2021 ONSC \n3702;  R. v. E.F. , 2021 ABQB 272;  R. v. Battieste , 2022 ONCJ 573; R. v. Faille , 2021 \nQCCQ 4945; R. v. Saberi , 2021 ONCJ 345, 493 C.R.R. (2d) 121; R. v. Boucher , 2020 \nABCA 208; R. v. Kalliraq , 2022 NUCA 6; R. v. Razon , 2021 ONCJ 616; R. v. Coban , \n2022 BCSC 1810; R. v. Bains , 2021 ABPC 20 ; Montour v. R. , 2020 QCCA 1648; R. v. \nLaFrance , 2022 ABCA 351; R. v. Jissink , 2021 ABQB 102, 482 C.R.R. (2d) 167; R. v. \nLemay , 2020 ABCA 365, 14 Alta. L.R. (7th) 45; R. v. Aguilar , 202 1 ONCJ 87, aff’d \n2022 ONCA 353;  R. v. M. (C.A.) , [1996] 1 S.C.R. 500; R. v. Hutchings , 2012 NLCA \n2, ",
    "token_count": 1000,
    "start_token": 7200,
    "end_token": 8200,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 9,
    "source_file": "2023scc26.txt",
    "text": "; R. v. \nLemay , 2020 ABCA 365, 14 Alta. L.R. (7th) 45; R. v. Aguilar , 202 1 ONCJ 87, aff’d \n2022 ONCA 353;  R. v. M. (C.A.) , [1996] 1 S.C.R. 500; R. v. Hutchings , 2012 NLCA \n2, 316 Nfld. & P.E.I.R. 211; Desjardins v. R. , 2015 QCCA 1774; R. v. Borde  (2003), \n63 O.R. (3d) 417; R. v. McDonnell , [1997] 1 S.C.R. 948; R. v. Gummer  (1983), 38 C.R. \n(3d) 46; R. v. Gillis , 2009 ONCA 312, 248 O.A.C. 1; R. v. Morton , 2021 ABCA 29; R. \nv. McLean , 2016 SKCA 93, 484 Sask. R. 137; Laguerre v. R ., 2021 QCCA 1537; R. v. \nProulx , 2000 SCC 5, [2000] 1 S.C.R. 61; R. v. R.A.R. , 2000 SCC 8, [2000] 1 S.C.R. \n163; R. v. Anderson , 2014 SCC 41, [2014] 2 S.C.R. 167; R. v. Bissonnette , 2022 SCC \n23; R. v. Nur, 2015 SCC 15, [2015] 1 S.C.R. 773; R. v. Smith , [1987] 1 S.C.R. 1045; \nR. v. Faroughi , 2020 ONSC 780; R. v. Koenig , 2019 BCPC 83;  R. v. Ward , 2019 NSPC \n72; R. v. Fawcett , 2019 BCPC 125; R. v. Lloyd , 2016 SCC 13, [2016] 1 S.C.R. 130; R. \nv. Boudreault , 2018 SCC 58, [2018] 3 S.C.R. 599; R. v. Morrisey , 2000 SCC 39, [2000] \n2 S.C.R. 90; R. v. Wiles , 2005 SCC 84, [2005] 3 S.C.R. 895; Steele v. Mountain \nInstitution , [1990] 2 S.C.R. 1385; R. v. Parranto , 2021 SCC 46; R. v. Ipeelee , 2012 \nSCC 13, [2012] 1 S.C.R. 433; R. v. Laberge  (1995), 165 A.R. 375; R. v. Murphy , 2014 \n2023 SCC 26 (CanLII)\n\n--- Page 22 ---\n \n ABCA 409, 593 A.R. 60 ; R. v. Vienneau , 2015 ONCA 898 ; R. v. Hood , 2016 NSPC \n19, 371 N.S.R. (2d) 324 ; R. v. Hood , 2016 NSPC 78; R. v. Ayorech , 2012 ABCA 82, \n522 A.R. 306; R. v. Tremblay , 2006 ABCA 252, 401 A.R. 9; R. v. Belcourt , 2010 \nABCA 319, 490 A.R. 224; R. v. Resler , 2011 ABCA 167, 505 A.R. 330; R. v. \nLundrigan , 2012 NLCA 43, 324 Nfld. & P.E.I.R. 270; R. v. Ellis , 2013 ONCA 739, \n303 C.C.C. (3d) 228; R. v. Priest  (1996), 30 O.R. (3d) 538; R. v. Tan , 2008 ONCA 574, \n268 O.A.C. 385; R. v. T. (K.), 2008 ONCA 91, 89",
    "token_count": 1000,
    "start_token": 8100,
    "end_token": 9100,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 10,
    "source_file": "2023scc26.txt",
    "text": " & P.E.I.R. 270; R. v. Ellis , 2013 ONCA 739, \n303 C.C.C. (3d) 228; R. v. Priest  (1996), 30 O.R. (3d) 538; R. v. Tan , 2008 ONCA 574, \n268 O.A.C. 385; R. v. T. (K.), 2008 ONCA 91, 89 O.R. (3d) 99 ; R. v. Stein  (1974), 15 \nC.C.C. (2d) 376 ; R. v. S.  (S.), 2014 ONCJ 184, 307 C.R.R. (2d) 147; R. v. Saffari , 2019 \nONCJ 861; R. v. Dickson , 2007 BCCA 561, 228 C.C.C. (3d) 450;  R. v. Shevchenko , \n2018 ABCA 31; R. v. Vivian , 2001 ABQB 468, 289 A.R. 378; R. v. Sulek , 2011 ABPC \n314, 21 M.V.R. (6th) 336; R. v. Legg , 2014 ABPC 238, 26 Alta. L.R. (6th) 181; R. v. \nValiquette (1990), 60 C.C.C. (3d) 325; R. v. Brown , 2015 ONCA 361 , 126 O.R. (3d) \n797; R. v. Laine , 2015 ONCA 519 , 338 O.A.C. 264; R. v. K.R.J. , 2016 SCC 31, [2016] \n1 S.C.R. 906; R. v. Robinson (1974), 19 C.C.C. (2d) 193;  R. v. Hynes  (1991), 89 Nfld. \n& P.E.I.R. 316; R. v. C.D.R. , 2020 ONSC 645; R. v. Ferguson , 2008 SCC 6, [2008] 1 \nS.C.R. 96 . \nBy Côté J. (dissenting  in part ) \n R. v. Friesen , 2020 SCC 9, [2020] 1 S.C.R. 424; R. v. Hajar , 2016 ABCA \n222, [2016] 12 W.W.R. 435 ; R. v. L. (J. -J.) (1998) , 126 C.C.C. (3d) 235; R. v. M.  (C.A.) , \n[1996] 1 S.C.R. 500; R. v. Safarzadeh -Markhali , 2016 SCC  14, [2016] 1 S.C.R.  180; \nR. v. Malmo -Levine , 2003 SCC 74, [2003] 3 S.C.R. 571; R. v. Bissonnette , 2022 SCC \n2023 SCC 26 (CanLII)\n\n--- Page 23 ---\n \n 23;  R. v. Boudreault , 2018 SCC  58, [2018] 3 S.C.R . 599; R. v. Hills , 2023 SCC  2; R. \nv. Lloyd , 2016 SCC 13, [2016] S.C.R. 130; R. v. Nur, 2015 SCC 15, [2015] 1 S.C.R. \n773; R. v. Hood , 2018 NSCA 18, 45 C.R. (7th) 269; R. v. Laberge (1995 ), 165 A.R. \n375; R. v. S.R., 2008 QCCA 2359; R. v. Barrett , 2013 QCCA 1351; R. v. D.B. , 2013 \nQCCA 2199; R. v. S.J.B. , 2018 MBCA 62; R. v. Audet , [1996] 2 S.C.R. 171; R. v. M . \n(M.R.) , [1998] 3 S.C.R. 393; R. v. Jarvis , 2019 SCC 10,",
    "token_count": 1000,
    "start_token": 9000,
    "end_token": 10000,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 11,
    "source_file": "2023scc26.txt",
    "text": "3 QCCA 1351; R. v. D.B. , 2013 \nQCCA 2199; R. v. S.J.B. , 2018 MBCA 62; R. v. Audet , [1996] 2 S.C.R. 171; R. v. M . \n(M.R.) , [1998] 3 S.C.R. 393; R. v. Jarvis , 2019 SCC 10, [2019] 1 S.C.R. 488; Ross v. \nNew Brunswick Scho ol District No.  15, [1996] 1 S.C.R. 825; R. v. Rayo , 2018 QCCA \n824; R. v. Bergeron , 2016 QCCA 339; R. v. Jarvis  (2006) , 211 C.C.C. (3d) 20; Montour \nv. R., 2020 QCCA 1648; R. v. Faille , 2021 QCCQ 4945; R. v. Jissink , 2021 ABQB 102, \n482 C.R.R. (2d) 167; R. v. John , 2018 ONCA 702, 142 O.R. (3d) 670;  Medvedev v. R. , \n2013 QCCA 540; R. v. Laurendeau , 2007 QCCA 1593; R. v. Davidson , 2021 QCCA \n545; R. v. Cunningham , 2023 ONCA 36, 166 O.R. (3d) 147 ; R. v. Stone , [1999] 2 S.C .R. \n290; R. v. Butcher , 2020 NSCA 50, 387  C.C.C. (3d) 417;  R. v. Priest  (1996) , 30 O.R. \n(3d) 538; R. v. Tan , 2008 O NCA 574, 268 O.A.C. 385; R. v. T. (K.), 2008 ONCA 91, \n89 O.R. (3d) 99; R. v. Ahmed , 2017 ONCA 76, 136 O.R. (3d) 403; R. v. Brown , 2015 \nONCA 361, 126 O.R. (3d) 797; R. v.  Khalid , 2010  ONCA 861, 103 O.R. (3d) 600; \nLévesque v. R ., 2021 QCCA 1072;  R. v. Bergeron , 2013 QCCA 7; R. v. Morrison , 2019 \nSCC 15, [2019] 2 S.C.R. 3;  R. v.  Legare , 2009 SCC  56, [2009] 3 S.C.R . 551; R. v. \nAlicandro , 2009 ONCA 133, 246 C.C.C. (3d) 1; R. v. Smith , [1987] 1 S.C.R. 1045 . \nStatutes and Regulations Cite d \nAct to amend the Criminal Code (luring a child) , S.C. 2007, c.  20, s. 1. \n2023 SCC 26 (CanLII)\n\n--- Page 24 ---\n \n Act to amend the Criminal Code (protection of children and other vulnerable persons) \nand the Canada Evidence Act , S.C. 2005, c.  32, s. 24. \nBill C -15, Act to amend the Criminal Code and the Canada Evidence Act , R.S.C. 1985, \nc. 19 (3rd Supp.).  \nCanadian Charter of Rights and Freedoms , ss. 1, 12. \nConstitution Act, 1982 , s. 52. \nCriminal Code , R.S.C. 1985, c.  C-46, ss.  151, 152 , 153(1) , 155, 160(3) , 163.1 , 170, \n171, 172.1 , 173(2) , 271, 272 , 273 , 279.011 , 279.02(2) , 279.03(2) , 280 , 281 , \n286.1(2) , 286.2(2) , 286.3(2)",
    "token_count": 1000,
    "start_token": 9900,
    "end_token": 10900,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 12,
    "source_file": "2023scc26.txt",
    "text": ", 152 , 153(1) , 155, 160(3) , 163.1 , 170, \n171, 172.1 , 173(2) , 271, 272 , 273 , 279.011 , 279.02(2) , 279.03(2) , 280 , 281 , \n286.1(2) , 286.2(2) , 286.3(2) , 718 , 718.01,  718.1 , 718.2 , 718.3(4)(b)(i) , (7), \n730(1) . \nCriminal Law Amendment Act , 2001 , S.C. 2002, c.  13, s. 8. \nInterpretation Act , R.S.C. 1985, c.  I-21, s.  35(1) “telecommunications” . \nSafe Streets and Communities Act , S.C. 2012, c.  1, s. 22. \nTougher Penalties for Child Predators Act , S.C. 2015, c.  23, s. 11. \nAuthors Cited  \nBailey, Jane , and C arissima Mathen. “ Tech nology -Facilitated Violence Against \nWomen & Girls: Assessing the Canadian Criminal Law Response” (2019), 97 \nCan. Bar  Rev. 664. \nCanada. Office of the Correctional Investigator. A Legacy of Missed Opportunities: \nThe Case of Ashley Smith , by Howard Sapers,  November 23, 2011 (online: \nhttps://oci -bec.gc.ca/en/content/speaking -notes -mr-howard -sapers -legacy -\nmissed -opportunities -case-ashley -smith -health -law; archived version : \nhttps://www.scc -csc.ca/cso -dce/2023SCC -CSC 26_1_eng.pdf ). \nCanada. Office of the Correctional Investigator. Annual Report 2021 -2022 . Ottawa, \n2022.  \nCanada. Office of the Correctional Investigator and Office of the Provincial Advocate \nfor Children and Youth. Missed Opportuniti es: The Experience of Young Adults \nIncarcerated in Federal Penitentiaries . Ottawa, 2017.  \nCarlton, Alessandra. “Sextortion: The Hybrid ‘ Cyber -Sex’ Crime” (2020), 21:3 N.C. \nJ.L. & Tech.  177. \n2023 SCC 26 (CanLII)\n\n--- Page 25 ---\n \n Elliott, Ian A.  “A Self -Regulation Model of Sexual Grooming” (2017), 18 Trauma, \nViolence, & Abuse 83. \nGilbert, Paul. “What Is Shame? Some Core Issues and Controversies”, in Paul  Gilbert \nand Bernice  Andrews, eds., Shame: Interpersonal Behavior, Psychopathology \nand Culture . New Yor k: Oxford University Press, 1998, 3 . \nHanson, Elly. “The Impact of Online Sexual Abuse on Children and Young People”, \nin Jon Brown, ed., Online Risk to Children: Impact, Protection and Prevention , \n1st ed. Hoboken, N.J.: Wiley Blackwell, 2017, 97.  \nKaraian, L ara, and Dillon  Brady. “Revisiting the ‘Private Use Exception’ to Canada’s \nChild Pornogr aphy Laws: Teenage Sexting, Sex -Positivity, Pleasure, and Control \nin the Digital Age” (2019), 56 Osgoode Hall L.J.  301. \nKloess, Juliane A., et al. “A Qualitative Analys is of Offenders’ Modus Operandi in \nSexually Exploitative Interactions With Children Online” (2017), 29 Sex. Abuse  \n563. \nPaquette, Sarah, et Francis  Fortin.  “Les traces numériques laissées p ar les \ncyberdélinquants sexuels : identités virtuelles, mensonges et protection de \nl’anonymat” (2021), 74 R.I.C.P.T.S.  387. \nParent, Hugues, et Julie Desrosiers. Traité de droit criminel , t. III, La peine , 3e éd. \nMontréal: Thémis, 2020.  \nRuby,  Clayton C. Sentencing , 10th ed. Toronto: LexisNexis, 2020.  \nSay",
    "token_count": 1000,
    "start_token": 10800,
    "end_token": 11800,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 13,
    "source_file": "2023scc26.txt",
    "text": " protection de \nl’anonymat” (2021), 74 R.I.C.P.T.S.  387. \nParent, Hugues, et Julie Desrosiers. Traité de droit criminel , t. III, La peine , 3e éd. \nMontréal: Thémis, 2020.  \nRuby,  Clayton C. Sentencing , 10th ed. Toronto: LexisNexis, 2020.  \nSay, Gökçe Nur, et al. “Abuse Characteristics and Psychiatric Consequences \nAssociated with Online Sexual Abuse” (2015), 18 Cyberpsychol., Behav., and \nSoc. Netw.  333. \nSteel, Jennifer, et al. “Psychological sequelae of childhood sexual abus e: abuse -related \ncharacteristics, coping strategies, and attributional style” (2004), 28 Child Abuse \n& Negl. 785. \nZaccour, Suzanne, et Michaël Lessard. “La culture du viol dans le discours juridique: \nsoigner ses mots pour combattre les violences sexuelles”  (2021), 33 C.J.W.L.  175. \n APPEAL from a judgment of the Quebec Court of Appeal ( Levesque, \nCotnam and Beaupré  JJ.A. ), 2021 QCCA 1285 , [2021] AZ -51790428, [2021] Q.J. \nNo. 9996 (QL), 2021 CarswellQue 23990 (WL), affirming a declaration of \n2023 SCC 26 (CanLII)\n\n--- Page 26 ---\n \n unconstitutionality of the mandatory minimum sentence in s. 172.1(2)(a) of the \nCriminal Code  and a sentence entered by Bélanger  J.C.Q. , 2020 QCCQ 1135, [2020] \nAZ-51677243, [2020] J.Q. no 1779 (QL), 2020 CarswellQue 2109 (WL). Appeal \nallowed in part, Côté J. dissenting in part . \n APPEAL from a judgment of the Quebec Court of Appeal (Schrager, \nMoore and Kalichman  JJ.A.), 2022 QCCA 16 , [2022] AZ-51821456 , [2022] Q.J. \nNo. 51 (QL), 2022 CarswellQue 2 1032  (WL), affirming a decision of Lachance  J., \n2021 QCCS 837 , [2021] AZ -51747400 , [2021] J.Q. no 2257 (QL), 2021 CarswellQue \n3559 (WL) , which affirmed a declaration of unconstitutionality of the mandatory \nminimum sentence in s.  172.1(2)(b) of the Criminal  Code and varied a sentence entered \nby Garneau J.C.Q . Appeal dismissed, Côté  J. dissenting . \n Lina Thériault , Nicolas Abran and Joanny Houde St -Pierre , for the \nappellant  His Majesty The King  (39935) . \n Éric Bernier  and Lina Thériault , for the appellant  His Majesty The King \n(40093) . \n Alexandre Duval , Michel Déom , Sylvain Leb œuf and Julie Dassylva , for \nthe appellant  the Attorney General of Quebec  (39935) . \n Maxime Seyer -Cloutier , Alexandre Duval , Sylvain Lebœuf  and Julie \nDassylva , for the appellant the Attorney General of Quebec (40093) . \n2023 SCC 26 (CanLII)\n\n--- Page 27 ---\n \n  Samuel Bérubé de Deus , for the respondent  Maxime Bertrand Marchand . \n Vincent R.  Paquet  and Tristan Desjardins , for the respondent  H.V.  \n Julie Laborde and François Lacasse , for the intervener the Director of \nPublic Prosecutions.  \n Vallery Bayly and Jennifer A.  Y. Trehearne , for the intervener the Attorney \nGeneral of Ontario.  \n Grace Hession David  and Katherine Roy , for the intervener the Attorney \nGeneral of Saskatchewan.  \n Andrew Barg , for the intervener the Attorney General of Alberta.  \n Christine Renaud , for the intervener the Nunavik Civil Liberties \nAssociation.  \n Hugo Caissy , for the intervener Association québécoise des avocats et \navocates de la défense.  \n Neha Chugh , for the intervener the Barbra Schlifer",
    "token_count": 1000,
    "start_token": 11700,
    "end_token": 12700,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 14,
    "source_file": "2023scc26.txt",
    "text": "General of Ontario.  \n Grace Hession David  and Katherine Roy , for the intervener the Attorney \nGeneral of Saskatchewan.  \n Andrew Barg , for the intervener the Attorney General of Alberta.  \n Christine Renaud , for the intervener the Nunavik Civil Liberties \nAssociation.  \n Hugo Caissy , for the intervener Association québécoise des avocats et \navocates de la défense.  \n Neha Chugh , for the intervener the Barbra Schlifer Commemorat ive \nClinic.  \n2023 SCC 26 (CanLII)\n\n--- Page 28 ---\n \n  Réginal Victorin and Walid Hijazi , for the intervener Association des \navocats de la défense de Montréal.  \n Caroline L. Senini , for the intervener the Independent Criminal Defence \nAdvocacy Society.  \n The judgment of Karakatsanis, Rowe, Martin, Kasirer, Jamal and \nO’Bonsawin  JJ. was delivered by  \n \n MARTIN J. —  \nI. Overview  \n[1] Modern means of communication, including the internet, permit \nunprecedented and unsupervised access to children1 in many places once thought to be \nsafe havens, such as their homes. Children, who now spend significant amounts of time \nonline, are increasingly susceptible to online exploitation and abuse. The dangers of \nsexualizing children are increasingly well -documented and the harms that result from \ntheir victimization are now more fully understood. As a result, Parliament has taken \nseveral steps to prevent and punish the various forms that abuse of children may take, \nincluding enacting a separate offence of child luring, which is set out at s.  172.1(1) of \nthe Criminal Code , R.S.C. 1 985, c.  C-46. This offence is committed when an adult uses \ntechnology to communicate with a child, or a person believed to be a child, for the \n                                                 \n1 For the purposes of these reasons, the terms “child” and “children” mean persons under the age of 18. \nReferences to “underage person”, “young people”, “teenagers”, “minors ”, and “adolescents” should \nall be understood to refer to persons who are children. Where specific statutory provisions distinguish \nbetween persons under the age of 16 and persons under the age of 18, this is made clear in the reasons.  \n2023 SCC 26 (CanLII)\n\n--- Page 29 ---\n \n purposes of facilitating a designated secondary sexual offence against that child.2 \nLuring is a hybrid offence th at carries two different mandatory minimum periods of \nincarceration depending on whether the Crown elects to proceed summarily or by \nindictment.  \n[2] Two legal issues arise in these companion appeals. First, in Mr.  Bertrand \nMarchand’s matter, the Crown appellan ts have questioned the fitness of Mr.  Bertrand \nMarchand’s sentence for luring. This requires an examination of the sentencing \nprinciples for this separate and specific offence, based on a modern understanding of \nits gravity and associated harms. In R. v. Friesen , 2020 SCC 9,  [2020] 1 S.C.R. 424, \nthis Court articulated the various serious and potentially life -long consequences \nassociated with sexual violence against children. I build on that analysis and explain \nthe distinct harms of the child luring offence  so that its full gravity animates the \ngoverning sentencing principles and informs their constitutional status. In Mr.  Bertrand \nMarchand’s case, after applying the correct sentencing principles, I increase his \nsentence from five months to one year imprison ment, and find that it should be served \nconsecutively, and not concurrently, to the other offence for which he was sentenced. \nIn H.V.’s matter, the fitness of H.V.’s sentence was not challenged before this Court.  \n                                                 \n2  As mentioned in R. v. Friesen , 2020 SCC 9, [2020] 1 S.C.R. 424, in addition to various sexual offences, \nthe child luring provision also applies to the trafficking of a person under the age of 18  years ( Criminal \nCode , s. 279.011), receiving a material benefit from the traf ficking of a person under the age of \n18 years (s.  279.02(2)), and withholding or destroying documents for the purpose of committing or \nfacilitating the trafficking of a person under the age of 18 years (s.  279.03(2)).  \n2023 SCC 26 (CanLII)\n\n--- Page 30 ---\n \n [3] Second",
    "token_count": 1000,
    "start_token": 12600,
    "end_token": 13600,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 15,
    "source_file": "2023scc26.txt",
    "text": " ( Criminal \nCode , s. 279.011), receiving a material benefit from the traf ficking of a person under the age of \n18 years (s.  279.02(2)), and withholding or destroying documents for the purpose of committing or \nfacilitating the trafficking of a person under the age of 18 years (s.  279.03(2)).  \n2023 SCC 26 (CanLII)\n\n--- Page 30 ---\n \n [3] Second, both respondents in the companion a ppeals ask the Court to uphold \nthe conclusions in the respective courts below that the mandatory minimum sentences \noutlined in s.  172.1(2)(a) and (b) are inconsistent with s.  12 of the Canadian Charter \nof Rights and Freedoms  and therefore of no force or ef fect. Mr.  Bertrand Marchand \nargues against the one -year mandatory minimum period of incarceration imposed when \nthe Crown proceeds by indictment (s.  172.1(2)(a)), and H.V. impugns the six -month \nmandatory minimum period of incarceration imposed when the Crow n proceeds \nsummarily (s.  172.1(2)(b)). For their part, the Crown appellants ask that the Court \naffirm the constitutionality of the mandatory minimum sentences. While this Court has \npreviously noted that the one -year obligatory penalty concerning s.  172.1(2 )(a) is \n“constitutionally suspect” ( R. v. Morrison , 2019 SCC 15, [2019] 2 S.C.R. 3, at \npara.  146), this is the first time the Court squarely addresses the constitutional validity \nof both penalties.  \n[4] A thorough analysis reveals that these mandatory minimum sentences \ninfringe the Charter ’s s. 12 protection against cruel and unusual punishment. The \nmandatory periods of incarceration apply to such an exceptionally wide scope of \nconduct that the result is grossly disproportionate punishments in reasonably \nforese eable scenarios.  \n[5] Invalidating the mandatory minimums does not mean that child luring is a \nless serious offence. Based on the distinct and insidious psychological damage luring \ngenerates, in some cases the appropriate penalty for child luring will be impri sonment \n2023 SCC 26 (CanLII)\n\n--- Page 31 ---\n \n for a period equal to or longer than that set out in the unconstitutional mandatory \nminimum sentences. In these appeals, the reasonably foreseeable scenarios proffered \nproduce fewer harms, and are presented in circumstances where the moral culpabil ity \nof the offender is reduced. The broad reach and range of the offence means that a \ndefined minimum period of imprisonment in all cases will sometimes produce results \nso excessive as to outrage standards of decency.  \nII. The Luring Offence  \n[6] Since 1987, Parliament has taken a “child -centred” approach to sexual \noffences against children, emphasized the inherently exploitative nature of adult/child \nsexual contact, and focussed on the profound harms these crimes produce (see Bill \nC-15, An Act to amend the Cr iminal Code and the Canada Evidence Act , R.S.C. 1985, \nc. 19 (3rd Supp.); Friesen , at para.  53).  \n[7] To protect a range of social interests, Parliament enacted the offence of \n“luring a child”, at s.  172.1 of the Criminal Code , in 2002 ( Criminal Law Amendment \nAct, 2001 , S.C. 2002, c.  13, s.  8), and introduced the mandatory minimum sentences in \ns. 172.1(2)(a) and (b) of that provision, in 2012 ( Safe Streets and Communities Act , \nS.C. 2012, c.  1, s. 22). T he online world and digital communications between adults an d \nchildren warrant special regulation because children are particularly vulnerable to \nmanipulation in online settings ( R. v. Rayo , 2018 QCCA 824, at para.  141 (CanLII), \nper Kasirer  J.A.). The internet has infinitely expanded the opportunity for offenders t o \nattract or ensnare children and the enactment of a distinct crime protects them from the \n2023 SCC 26 (CanLII)\n\n--- Page 32 ---\n \n possibility of sexual exploitation facilitated by the internet  (R. v. Reynard , 2015 BCCA \n455, 378 B.C.A.C. 293, at para.  19). The luring offence helps keep children safe in a \n",
    "token_count": 1000,
    "start_token": 13500,
    "end_token": 14500,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 16,
    "source_file": "2023scc26.txt",
    "text": " The internet has infinitely expanded the opportunity for offenders t o \nattract or ensnare children and the enactment of a distinct crime protects them from the \n2023 SCC 26 (CanLII)\n\n--- Page 32 ---\n \n possibility of sexual exploitation facilitated by the internet  (R. v. Reynard , 2015 BCCA \n455, 378 B.C.A.C. 293, at para.  19). The luring offence helps keep children safe in a \nvirtual environment  and was intended  to meet “ the very specific danger posed by \ncertain kinds of communications via computer systems” ( R. v. Alicandro , 2009 ONCA \n133, 95 O.R. (3d) 173, at para.  36, per Doherty  J.A.).  \n[8] Parliament thus created this  inchoate preparatory offence to criminalize \nsexualized communications with children that precede or pave the way for the \nperpetration of other offences set out in the Criminal Code  (Rayo , at para.  9; R. v. \nLegare , 2009 SCC 56, [2009] 3 S.C.R. 551, at para . 25; Alicandro , at para.  20, citing \nA. Ashworth, Principles of Criminal Law  (5th ed. 2006), at pp.  468-70). The purpose \nof s. 172.1 is both remedial and preventative. It was enacted “to combat the very real \nthreat posed by adult predators who attempt to g room or lure children by electronic \nmeans” ( Morrison , at para.  39). The provision seeks to safeguard children from sexual \nabuse by identifying and apprehending offenders before they commit a designated \noffence ( Legare , at paras.  25-27, citing Alicandro ). \n[9] Section 172.1(1) and (2) reads : \n172.1  (1) Every person commits an offence who, by a means of \ntelecommunication, communicates with  \n \n(a) a person who is, or who the accused believes is, under the age of 18 \nyears, for the purpose of facilitating the commission  of an offence with \nrespect to that person under subsection 153(1), section 155, 163.1, 170, \n171 or 279.011 or subsection 279.02(2), 279.03(2), 286.1(2), 286.2(2) \nor 286.3(2);  \n \n2023 SCC 26 (CanLII)\n\n--- Page 33 ---\n \n (b) a person who is, or who the accused believes is, under the age of 16 \nyears,  for the purpose of facilitating the commission of an offence \nunder section 151 or 152, subsection 160(3) or 173(2) or section 271, \n272, 273 or 280 with respect to that person; or  \n \n(c) a person who is, or who the accused believes is, under the age of 14 \nyears, for the purpose of facilitating the commission of an offence \nunder section 281 with respect to that person.  \n \n(2) Every person who commits an offence under subsection (1)  \n \n(a) is guilty of an indictable offence and is liable to imprisonment for a \nterm of not more than 14 years and to a minimum punishment of \nimprisonment for a term of one year; or  \n \n(b) is guilty of an offence punishable on summary conviction and is \nliable to imprisonment for a term of not more than two years less a day \nand to a minimum punishment of imprisonment for a term of six \nmonths.  \n[10] The text, context and purpose of s.  172.1(1) demo nstrates that it casts, and \nwas intended to cast, a wide net of potential liability for those who lure children in a \nvirtual environment. This provision is triggered by communicating by a means of \ntelecommunication, which is defined broadly in s.  35(1) of the Interpretation Act , \nR.S.C. 1985, c. I -21. While the communication must be for the purpose of facilitating \nany one of the designated secondary offences against children found in s. 172.1, there \nare 20 such secondary offences listed. The scope of these s econdary offences is \nextensive and covers a wide range of conduct, including sexual exploitation, sexual \nassault, incest and child pornography.  \n[11] Section 172.1(1) proscribes communicating by telecommunication with an \nunderage person or a person the",
    "token_count": 1000,
    "start_token": 14400,
    "end_token": 15400,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 17,
    "source_file": "2023scc26.txt",
    "text": " communication must be for the purpose of facilitating \nany one of the designated secondary offences against children found in s. 172.1, there \nare 20 such secondary offences listed. The scope of these s econdary offences is \nextensive and covers a wide range of conduct, including sexual exploitation, sexual \nassault, incest and child pornography.  \n[11] Section 172.1(1) proscribes communicating by telecommunication with an \nunderage person or a person the accused believes to be underage for the purpose of \nfacilitating the commission of the designated secondary offences with respect to that \n2023 SCC 26 (CanLII)\n\n--- Page 34 ---\n \n person ( R. v. Levigne , 2010 SCC 25, [2010] 2 S.C.R. 3, at para.  23; Morrison , at \npara.  4). While a specific intention to facili tate a designated secondary offence forms \npart of the requisite mens rea , criminal liability will “crystallize” before any actions are \ntaken on the part of the accused to engage in a designated offence ( R. v. Collins , 2013 \nONCA 392). The offence of luring does not require that the parties ever meet or touch.  \n[12] Though luring requires that an offender intend to facilitate the commission \nof a listed secondary offence, the offence of luring is separate and independent from  \nthat secondary offence. The preparatory conduct of luring, meant to “culminate in the \ncommission of a completed crime” ( Legare , at para.  25), produces its own distinct form \nof wrongfulness and harms. By making luring a discrete offence, Parliament indicat ed \nthat these illegal communications generate harms that are different from those caught \nin the secondary offences in s.  172.1(1), and they are sufficiently wrongful and harmful \nto ground criminal liability.  \n[13] Many cases of luring involve multiple communicat ions over a period of \ntime, or what is sometimes described as “grooming”. However, luring does not require \nsustained contact. When the other elements of the offence are satisfied, the offence can \nbe committed even by sending one message.  \n[14] The luring offence  captures communications sent to an actual child, which \nmeans a person under 18 years of age (or 16 or 14, depending on the applicable \nparagraph). It also applies whenever the adult believes the recipient of the \ncommunication is a child, even if that is no t in fact the case. As a result, criminal \n2023 SCC 26 (CanLII)\n\n--- Page 35 ---\n \n liability may arise when the adult’s internet interlocutor is really a police officer \npretending to be a child during a “sting operation”.  \n[15] Child luring is a hybrid offence, meaning that the Crown can choose, based  \non factors such as the seriousness of the accused’s actions and the harm caused, to \nproceed either by indictment or summarily. Parliament has set two mandatory \nminimum penalties for luring, in s.  172.1(2)(a) and (b), depending on how the charge \nis laid. T he indictable offence of luring for which Mr.  Bertrand Marchand was charged \ncarries a mandatory minimum punishment of one year’s imprisonment and a maximum \nof 14  years. The summary conviction offence for which H.V. was charged carries a \nmandatory minimum p unishment of six months’ imprisonment and a maximum of two \nyears less a day. Both offenders pleaded guilty to child luring and challenged the \nconstitutionality of these mandatory minimum punishments as applied to themselves \nor other reasonably foreseeable offenders. Mr.  Bertrand Marchand’s sentence for one \nof the designated secondary offences, sexual interference, is not at issue in this appeal.  \nIII. The Appeal of Mr.  Bertrand Marchand’s Sentence  \n[16] Before this Court, apart from the constitutional question raised,  the Crown \nin Mr.  Bertrand Marchand’s case also separately appealed the fitness his five -month \nconcurrent sentence for luring. In this part of the reasons, I set out the facts and judicial \nhistory of that appeal, apply the approach and insights of Friesen  to the specific \nwrongfulness and harms of child luring, review the errors committed by the sentencing \njudge and set a fit and proportionate sentence for Mr.  Bertrand Marchand.  \n2023 SCC 26 (CanLII)\n\n--- Page 36 ---\n \n A. Facts  \n[17] Maxime Bertrand Marchand met the victim in person in early August  2013, \nwhen he was 22 and she was, to",
    "token_count": 1000,
    "start_token": 15300,
    "end_token": 16300,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 18,
    "source_file": "2023scc26.txt",
    "text": " and insights of Friesen  to the specific \nwrongfulness and harms of child luring, review the errors committed by the sentencing \njudge and set a fit and proportionate sentence for Mr.  Bertrand Marchand.  \n2023 SCC 26 (CanLII)\n\n--- Page 36 ---\n \n A. Facts  \n[17] Maxime Bertrand Marchand met the victim in person in early August  2013, \nwhen he was 22 and she was, to his knowledge, 13 years old. In the weeks that \nfollowed, he sent her a friend request on Facebook, which she accepted. Over the next \ntwo years, they were in contact on social media and also met in person. Between \nAugust  1, 201 3 and July  19, 2015, Mr.  Bertrand Marchand had illegal sexual \nintercourse with the victim four separate times. As a result of these events, the Crown \ncharged him with one count of sexual interference contrary to s.  151(a) of the Criminal \nCode  for this time  period.  \n[18] Mr. Bertrand Marchand was also charged with one count of luring a child \ncontrary to s.  172.1(1)(b). Throughout their contact, Mr. Bertrand Marchand used \nFacebook messenger, and other means of telecommunications, to stay in touch with the \nvictim a nd to arrange meetings. The time frame in the luring count was restricted to the \nperiod between February 25, 2015 and September 13, 2015. During this period, he \nturned 24 and she was 15.  \n[19] In the fall of 2014, as well as during the period covered in the indi ctment \nfor the count of luring, the victim was living at a rehabilitation centre. Mr.  Bertrand \nMarchand’s online communications with the victim repeatedly raised the possibility of \ngetting together in person and resulted in a meeting on July  19, 2015, whic h formed \nthe basis for the fourth occurrence of sexual interference. On that day, the victim paid \na weekend visit to her foster family, but afterwards did not return directly to the \n2023 SCC 26 (CanLII)\n\n--- Page 37 ---\n \n rehabilitation centre. Instead, she went with Mr.  Bertrand Marchand to his  home, and \nhe had illegal sexual intercourse with her. After this, their social media exchanges \nbecame less frequent and eventually ceased completely. In September 2015, the victim \nprovided her statement to the police and filed a complaint. The communicati ons that \npreceded and followed this  final act of sexual interference form the basis for the luring \ncharge against Mr. Bertrand Marchand .  \nB. Judicial History  \n[20] Mr. Bertrand  Marchand pleaded guilty to one count of sexual interference \nand one count of child lurin g. He was sentenced to a 10 -month term of imprisonment \nfor sexual interference (2020 QCCQ 1135). The sentencing judge found that the \nappropriate sentence for the luring charge was five months’ imprisonment to be served \nconcurrently to the sentence for sexu al interference. She imposed that sentence after \nfinding the mandatory term of one year’s imprisonment infringed s.  12 of the Charter  \nas it would be “grossly disproportionate” to the fit sentence of five months. It was \ntherefore declared of no force or eff ect in his regard.  \n[21] In fixing the luring sentence at five months’ imprisonment, the sentencing \njudge determined that this was not a [ TRANSLATION ] “classic case” of luring where “a \nsexual predator .  . . goes on the Internet to find a young victim and facilit ate the \ncommission of sexual offences” (para.  64). The online communications were \n[TRANSLATION ] “instead repeated attempts, through the use of electronic conversations, \nto have sexual intercourse with her again” (para.  70). She also held that [ TRANSLATION ] \n2023 SCC 26 (CanLII)\n\n--- Page 38 ---\n \n “the means used by the offender to communicate with [the victim] is a generational \nchoice rather than a means specifically chosen to anonymously browse various \nwebsites searching for a young victim” (para.  67) and added that “[w]ere it not for the \nadolesc ent’s access to this type of media, the offender never would have succeeded in \nmaintaining the conversations that enabled them to have their repeated rendezvous” \n(para.  65).  \n[22] The sentencing judge went on to distinguish this case from one of \ngrooming, notin g that [",
    "token_count": 1000,
    "start_token": 16200,
    "end_token": 17200,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 19,
    "source_file": "2023scc26.txt",
    "text": " specifically chosen to anonymously browse various \nwebsites searching for a young victim” (para.  67) and added that “[w]ere it not for the \nadolesc ent’s access to this type of media, the offender never would have succeeded in \nmaintaining the conversations that enabled them to have their repeated rendezvous” \n(para.  65).  \n[22] The sentencing judge went on to distinguish this case from one of \ngrooming, notin g that [ TRANSLATION ] “the acts .  . . do not constitute grooming of the \nadolescent for the purpose of lowering her inhibitions and convincing her to participate \nin sexual activities” because “[the victim] had already consented to such activities three \ntimes ” (para.  70). She added that [ TRANSLATION ] “[t]he luring to which the offender \npleaded guilty does not cover a period of grooming in preparation for the commission \nof other offences. It concerns communications leading to the repetition of sexual \nencounters ” (para.  78).  \n[23] Ultimately, the sentencing judge found that the effects of the luring were \nunlike the usual cases. She concluded that the communications simply served the \nfunction of repeating “sexual encounters”, and that the communications were not \ngroomi ng with the aim of “convincing [the victim] to participate in sexual activities” \n(para. 70).  Without this grooming, she found  [TRANSLATION ] “[t]he distinct social \ninterest that luring aims to protect in nearly every situation is not present here, given \nthe specific circumstances of this case” (para.  79). As such, she concluded the luring \n2023 SCC 26 (CanLII)\n\n--- Page 39 ---\n \n sentence should be served concurrently with the 10 months’ imprisonment imposed in \nrespect of the sexual interference offence.  \n[24] The majority of the Quebec Court of Appeal (2 021 QCCA 1285) dismissed \nthe appeal as it saw no grounds to intervene. It upheld both the punishment imposed \nfor luring and the conclusion that the mandatory minimum sentence was \nunconstitutional. Levesque  J.A., dissenting, would have allowed the appeal, s et aside \nthe luring sentence and the constitutional declaration of inoperability and sentenced \nMr. Bertrand Marchand to 12 months’ imprisonment for luring to be served \nconcurrently to the sentence for sexual interference. Because this was the sentence \nrequired under the impugned mandatory minimum, he declined to rule on its \nconstitutionality even though Mr.  Bertrand Marchand had also impugned the penalty \nby advancing a reasonable hypothetical scenario involving a representative offender.  \n[25] The appellants invi te this Court to substitute Mr.  Bertrand Marchand’s \n5-month sentence with a sentence of 12 months’ imprisonment for the luring offence. \nThey argue the sentencing judge should not have departed from the applicable \nsentencing range of 12 to 24 months or impo sed a concurrent sentence.  \nC. Mr. Bertrand Marchand’s Sentence Does Not Reflect This Court’s Direction in \nFriesen  \n[26] Mr. Bertrand Marchand was sentenced in March 2020 and this Court’s \ndecision in Friesen was released in April 2020. This explains the appellants’ concern \n2023 SCC 26 (CanLII)\n\n--- Page 40 ---\n \n that the sentencing judge’s reasons were out of step with Friesen and Parliament’s \nintent in sentencing offenders for sexual offences against children ( A.F., at para.  21). \nIn Friesen , this Court set out sentencing principles for sexual offences aga inst children \nto “fully reflect and give effect to the profound wrongfulness and harmfulness” of these \ncrimes (para.  1).  \n[27] A fit and proportionate sentence must be crafted based on the particular \nfacts of the case and in light of existing legislation and case law ( R. v. Nasogaluak , \n2010 SCC 6, [2010] 1 S.C.R. 206, at para.  43). Pursuant to s.  718.1 of the Criminal \nCode , it is a fundamental principle that the sentence be proportionate to the gravity of \nthe offence and the degree of responsibility of the offender (see also R. v. Lacasse , 2015 \nSCC 64,  [2015] 3 S.C.R. 1089). Section 718.2 enumerates a number of other senten cing \nprinciples, including the consideration of aggravating and mitigating circumstances and \nparity in sentencing.  \n[28] Parliament has specifically indicated that in sentencing",
    "token_count": 1000,
    "start_token": 17100,
    "end_token": 18100,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 20,
    "source_file": "2023scc26.txt",
    "text": " sentence be proportionate to the gravity of \nthe offence and the degree of responsibility of the offender (see also R. v. Lacasse , 2015 \nSCC 64,  [2015] 3 S.C.R. 1089). Section 718.2 enumerates a number of other senten cing \nprinciples, including the consideration of aggravating and mitigating circumstances and \nparity in sentencing.  \n[28] Parliament has specifically indicated that in sentencing offences involving \nabuse of children, including child luring, the objectives of denu nciation and deterrence \nmust be given primary consideration or “ une attention particulière ” (Friesen , at \npara.  101; Criminal Code , s. 718.01). Section 718.01’s open textured language limits \njudicial discretion by giving priority to these objectives, but th eir primary importance \ndoes not exclude consideration of other sentencing objectives, including rehabilitation \n(Rayo , at paras.  102-8). The judge can accord significant weight to other factors, but \ncannot give them precedence or equivalency ( Friesen , at pa ra. 104, citing Rayo , at \n2023 SCC 26 (CanLII)\n\n--- Page 41 ---\n \n paras.  103 and 107 -8; see also R. v. J.  (T.), 2021 ONCA 392, 156 O.R. (3d) 161, at \npara.  27).  \n[29] In Friesen , the offender  was sentenced for sexual interference with a \nfour-year-old child and the subsequent extortion of the child’s mo ther. The Court noted \nexpressly that, given these facts, its primary focus was to provide direction on how to \nimpose fit and proportionate sentences for sexual interference “and closely related \noffences”, like sexual assault and incest (para.  44).  \n[30] Friesen  recognized that the focus of the legislative scheme of sexual \noffences against children has shifted to protect a child’s personal autonomy, bodily \nintegrity, sexual integrity, dignity and equality (paras. 51 and 55, citing E.  Craig, \nTroubling Sex: Towards  a Legal Theory of Sexual Integrity (2012), at p.  68; see also R. \nv. Sharpe , 2001 SCC 2, [2001] 1 S.C.R. 45, at paras.  172, 174 and 185, per L’Heureux -\nDubé, Gonthier and Bastarache  JJ.). The Court outlined how sexual offences against \nchildren produce profo und physical and psychological harms to the most vulnerable \nmembers of our society. It was deeply concerned with how the sexual assault of \nchildren may produce shame, embarrassment, unresolved anger, a reduced ability to \ntrust and fear that other people wo uld also abuse them ( Friesen , at para.  57). It set out \nthe disproportionate impact of violence on girls, women, Indigenous persons and other \nvulnerable groups.   \n[31] Friesen sends the clear message that s entences for these crimes must \naccount for the far -reachi ng and ongoing damage sexual violence causes to children, \n2023 SCC 26 (CanLII)\n\n--- Page 42 ---\n \n families and society at large, which may take many years to manifest. Consequently, \nsentences for offences involving sexual violence against children must generally \nincrease to reflect society’s mod ern understanding of such offences and Parliament’s \nchoice to increase the sentences associated with these crimes (paras.  3-5).  \n[32] Friesen  sets out a useful method of analysis which places children, and the \nharm they suffer, at the centre of the discussion. Its message  is not limited to offences \nwhich include physical contact. Instead, its general framework and lessons can be \napplied to sentencing other forms of sexual abuse of children. Indeed, its sentencing \nprinciples “also have relevance to sentencing for  other sexual offences against children, \nsuch as child luring” (para.  44; see also paras. 46 -47). \n[33] In applying Friesen ’s principles to the offence of child luring, I explore its \ninherent wrongfulness and distinct harms and the legislative trend towards incr easingly \npunitive sentences.  \n(1) The Wrongfulness of Luring  \n[34] Sexual offences against children are crimes that wrongfully exploit \nchildren’s vulnerability ( Friesen , at para.  5). In committing the offence of luring, the \nadult takes advantage of the child’s weake r position and lack of experience and by \ndoing so repudiates",
    "token_count": 1000,
    "start_token": 18000,
    "end_token": 19000,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 21,
    "source_file": "2023scc26.txt",
    "text": " luring, I explore its \ninherent wrongfulness and distinct harms and the legislative trend towards incr easingly \npunitive sentences.  \n(1) The Wrongfulness of Luring  \n[34] Sexual offences against children are crimes that wrongfully exploit \nchildren’s vulnerability ( Friesen , at para.  5). In committing the offence of luring, the \nadult takes advantage of the child’s weake r position and lack of experience and by \ndoing so repudiates the fundamental value of protecting children (para.  65; R. v. \nMelrose , 2021 ABQB 73, [2021] 8 W.W.R. 467, at para.  54). Children are particularly \nexposed and helpless online: the internet allows offenders direct, sometimes \n2023 SCC 26 (CanLII)\n\n--- Page 43 ---\n \n anonymous, and often secret or unsupervised access to children, frequently in the \nprivacy and safety of their own homes ( R. v. Folino  (2005), 77 O.R. (3d) 641 (C.A.), \nat para.  25; R. v. Symes , [2005] O.J. No. 6041 (QL), at para.  29; R. v. Paradee , 2013 \nABCA 41, 542 A.R. 222, at para.  12; R. v. Hajar , 2016 ABCA 222, [2016] 12 W.W.R. \n435, at paras.  279-80). In these online fora, there is often very little that can be done to \nshield children from the inherent power imbalance present  in luring ( R. v. Sutherland , \n2019 NWTSC 48, [2020] 3 W.W.R. 771, at para.  50; Hajar , at para.  279). Luring \nwrongfully takes advantage of this unsupervised access to children and “wrongfully \nexploits children’s vulnerabilities” ( R. v. Wall , 2023 ABPC 3, at para.  42 (CanLII)).  \n[35] The sexualization of children is itself morally blameworthy conduct. \nLuring invades a child’s personal autonomy, sexual integrity, and gravely wounds their \ndignity ( Friesen , at para.  51). Using any person as a means t o an end is unethical, but \nan adult’s manipulation of a child to satisfy their sexual urges is highly blameworthy \nconduct. It is for these reasons that luring is recognized as “manifestly harmful and \nwrongful” ( R. v. Misay , 2021 ABQB 485, [2022] 1 W.W.R. 1 45, at para.  52). Even \nwhen the only interactions with the child occur online, the offender’s conduct is \ninherently wrong because it still constitutes a form of sexual abuse ( R. v. R.S.F. , 2021 \nMBQB 261, at para.  91 (CanLII)). While the degree of exploitat ion may vary from case \nto case, the wrongfulness of the exploitation of children is always relevant to the gravity \nof the offence ( Friesen , at para.  78). \n(2) The Separate Harm of Luring  \n2023 SCC 26 (CanLII)\n\n--- Page 44 ---\n \n [36] It is now well established that sexual offences against children cause \nsignificant harm. The adverse impacts of sexual violence against children hinder \nnormal social growth, and can cause several lasting psychosocial problems. When  \nchildren are young, inexperienced and still developing, the harms caused by even a \nsingle instance  of sexual violence can permanently alter the course of their lives. Many \nsurvivors carry childhood sexual abuse with them throughout their adulthood, and it \ncan permeate every aspect of their lives.  \n[37] This Court has noted that “[e]ven in child luring cases where all \ninteractions occur online, the offender’s conduct can constitute a form of psychological \nsexual violence that has the potential to cause serious harm” ( Friesen , at para. 82, citing \nR. v. Rafiq , 2015 ONCA 768, 342 O.A.C. 193 ). With sexual abuse co mes serious \nemotional and psychological harm that “may often be more pervasive and permanent \nin its effect than any physical harm” ( Friesen , at para.  56, citing R. v. McCraw , [1991] \n3 S.C.R. 72, at p.  81",
    "token_count": 1000,
    "start_token": 18900,
    "end_token": 19900,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 22,
    "source_file": "2023scc26.txt",
    "text": " para. 82, citing \nR. v. Rafiq , 2015 ONCA 768, 342 O.A.C. 193 ). With sexual abuse co mes serious \nemotional and psychological harm that “may often be more pervasive and permanent \nin its effect than any physical harm” ( Friesen , at para.  56, citing R. v. McCraw , [1991] \n3 S.C.R. 72, at p.  81). Victims of luring often suffer a range of negative  impacts \nincluding negative sexual development, subsequent substance misuse and depressive \nsymptomology (G. N. Say et al., “Abuse Characteristics and Psychiatric Consequences \nAssociated with Online Sexual Abuse” (2015), 18 Cyberpsychol., Behav., and Soc. \nNetw. 333).  \n[38] Child luring can also cause distinct psychological and developmental \nharms to young victims that differ in two main ways from harms arising from sexual \ncontact initiated in person. First, o nline communication allows “for abusers to get into \n2023 SCC 26 (CanLII)\n\n--- Page 45 ---\n \n the victim’s head and abuse remotely” and for “manipulation and control over time” \nwhich can lead to serious and lasting psychological consequences ( Rafiq , at para.  44). \nBecause the communications in luring often intentionally emulate positive \nrelationships, it can be difficult for victims to trust anyone intimately following this \nexperience (E.  Hanson, “The Impact of Online Sexual Abuse on Children and Young \nPeople”, in J.  Brown, ed., Online Risk to Children: Impact, Protection and Prevention  \n(1st ed. 2017), 97, at p.  115).  \n[39] Second, since offenders cannot physically touch their victims when \ncommunicating with them online, their power and the effectiveness of their strategies \noften lie in the degree to which they can control the victim and manipulate them into \nengaging with the abuse. Victims of luring often feel that they actively participated in \ntheir own abuse, which may increase self -blame, internalization and shame. This \nworsens the psychological harm (J.  Steel et al., “Psychological sequelae of childhood \nsexual abuse: abuse -related characteristics, coping strategies, and attributional style” \n(2004), 28 Child Abuse & Negl. 785, at pp.  795-96; P.  Gilbert, “What Is Shame? Some \nCore Issues and Controversies”, in P.  Gilbert and B.  Andrews, eds., Shame: \nInterperso nal Behavior, Psychopathology and Culture (1998), 3, at p.  27).  \n[40] Prior jurisprudence has shed light on this distinct harm. In R. v. J.R. , 2021 \nONCJ 14, at para.  16 (CanLII), the victim described the confusion, shame and \nemotional harm that accompanied the luring and extortion she faced. In Rayo , the \nvictim experienced feelings of guilt, shame and anxiety, and reported that \n2023 SCC 26 (CanLII)\n\n--- Page 46 ---\n \n [TRANSLATION ] “she had lost confidence in herself and that the events had led her to \nself-mutilation and suicidal thoughts” (para.  174).  In R. v. Roy , 2020 QCCQ 4546, the \nvictim had difficulty sleeping for several weeks following the offence, lost confidence \nin herself and still struggled to trust others (para.  51 (CanLII)). In R.S.F. , although the \nvictim was not physically touched, “her m ind was manipulated”, she had “nightmares \nabout being hurt again” and she suffered from “overwhelming and significant anxiety, \ndepression and post -traumatic disorder” (paras. 34 -35). \n[41] Friesen recognized that sexual violence against children also affects other \npeople in the victims’ lives (para.  76). The Court highlighted the harmful ripple effects \non families, community and society (para.  63). Child luring can similarly destroy trust \nin friends , families and social institutions and cause children to shut parents out of their \nlives. In Rayo , the luring prompted a severe conflict between the child and her mother \n(para.  174). In Rafiq , the luring led the victim to close herself off from her family \n(paras.  40-41).  \n[42] Identifying the distinct harms of luring in each case may prove more or less \ndifficult, depending on the circumstances. In cases where luring is the standalone",
    "token_count": 1000,
    "start_token": 19800,
    "end_token": 20800,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 23,
    "source_file": "2023scc26.txt",
    "text": " cause children to shut parents out of their \nlives. In Rayo , the luring prompted a severe conflict between the child and her mother \n(para.  174). In Rafiq , the luring led the victim to close herself off from her family \n(paras.  40-41).  \n[42] Identifying the distinct harms of luring in each case may prove more or less \ndifficult, depending on the circumstances. In cases where luring is the standalone \noffence, identifying the distinct harm may be more straightforward. However, in  cases \nwhere the luring actually manifests in the commission of a secondary offence, \nidentifying the distinct harm of luring may be more challenging.  \n[43] One way to identify the distinct harms at play is for courts to differentiate \nbetween contact -driven luri ng, where the offender’s goal is to facilitate in -person \n2023 SCC 26 (CanLII)\n\n--- Page 47 ---\n \n sexual abuse, and luring that leads to sexual abuse occurring entirely online (see R. v. \nM.B. , 2020 ONSC 7605, at para.  78 (CanLII), for an example in relation to child \npornography). In the latter co ntext, the online medium is the primary setting where the \nabuse takes place and the offender may have no intention to take the abuse offline. In \nthe context of contact -driven luring, the online environment can, but need not, play a \nsignificant role in the sexual abuse. The technology may sometimes function solely as \na medium to gain physical access to a victim. Where the luring is contact -driven, \nsentencing judges should consider whether the online communication caused \npsychological harm that stands separat e and apart from the harm of any secondary \noffence that may have been committed. Victims of contact sexual abuse can be sexually \nexploited and psychologically manipulated online by their offenders both before and \nafter they were abused offline. It is an er ror to presume that luring cannot engender \nindependent harm.  \n[44] Other times, the aim of luring will be to commit a designated secondary \noffence set out in s.  172.1(1) that occurs entirely online. This might encompass a range \nof behaviours including sexual ch at, the sharing of sexualized photos or videos, or \nviewing or performing sexual acts by video, all of which may be encapsulated within \nthe secondary offences of invitation to sexual touching or the child pornography \noffences (J. A. Kloess et al., “A Qualit ative Analysis of Offenders’ Modus Operandi in \nSexually Exploitative Interactions With Children Online” (2017), 29 Sex. Abuse  563, \nat pp.  584-87). In such circumstances , the offender uses technology to build a \nrelationship, assert control and psychological ly manipulate young persons, and may \n2023 SCC 26 (CanLII)\n\n--- Page 48 ---\n \n also use that same technology to then carry out sexual acts. In such circumstances, it \nmight be difficult to decipher whether the luring caused distinct psychological harm, \nas the harm caused by the luring might resembl e the harm caused by the underlying \noffence which also occurred online.  \n[45] Contact -driven luring is not necessarily more or less harmful than luring \nthat leads to sexual abuse that occurs entirely online. The severity of the harm caused \nby the online communi cation will depend on the individual offender and his or her \noffending goals, the individual characteristics of the victim, and the unique dynamic \nbetween the offender and the victim.  \n(3) Parliament Has Mandated That Sentences for Luring Must Increase  \n[46] Friesen urges courts to consider Parliament’s legislative initiatives in \nsentencing offenders for sexual offences against children (para.  107). Parliament has \nconsistently raised these sentences to reflect a growing awareness of their gravity, and \nto indicate the serious emotional and psychological harms they cause for victims \n(paras.  56, 98 and  101-5). This same increasingly punitive trend applies to the \nsentencing regime for luring offences:  \n In 2002, when enacting the offence of luring, Parliament provided for a \nmaximum term of five years’ imprisonment for luring proceeding by \nindictment ( Criminal Law Amendment Act, 2001 , s. 8). No maximum \npenalty was set for luring proceeding summarily.  \n2023 SCC 26 (CanLII)\n\n--- Page 49 ---\n \n  In 2005, Parliament enacted s.  718.01 of the Criminal Code  which \nprovides that the objectives of",
    "token_count": 1000,
    "start_token": 20700,
    "end_token": 21700,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 24,
    "source_file": "2023scc26.txt",
    "text": " of luring, Parliament provided for a \nmaximum term of five years’ imprisonment for luring proceeding by \nindictment ( Criminal Law Amendment Act, 2001 , s. 8). No maximum \npenalty was set for luring proceeding summarily.  \n2023 SCC 26 (CanLII)\n\n--- Page 49 ---\n \n  In 2005, Parliament enacted s.  718.01 of the Criminal Code  which \nprovides that the objectives of denunciation and deterrence take priority in \ncases of the abuse of a person under 18 ( An Act to amend the Criminal \nCode  (protection of children and other vulnerable persons) and the \nCanada Evidence Act , S.C. 2005, c.  32, s.  24; Criminal Code , s. 718.01).  \n In 2007, the maximum sentence for luring proceeding by indictment was \nincreased to 10 years’ imprisonment and a maximum sentence of 18 \nmonths’ imprisonment was introduced for luring proceeding summarily \n(An Act to ame nd the Criminal Code (luring a child) , S.C. 2007, c.  20, s.  1).  \n In 2012, mandatory minimum sentences for child luring were introduced \n(Safe Streets and Communities Act , s. 22). As a result, child luring \nproceeding by indictment carried a mandatory minimum  punishment of \none year’s imprisonment, and luring proceeding summarily carried a \nmandatory minimum punishment of 90 days’ imprisonment.  \n In 2015, with the Tougher Penalties for Child Predators Act , S.C. 2015, \nc. 23, s.  11, Parliament elevated the maximum sentence for luring \nproceeding by indictment to 14 years’ imprisonment. The maximum \nsentence for luring proceeding summarily was increased from 18 months \nto 2 years’ less a day imprisonment and the mandatory minimum \npunishment was increased to 6 months’ im prisonment.  \n2023 SCC 26 (CanLII)\n\n--- Page 50 ---\n \n [47] These legislative changes should be regarded as a sign of Parliament’s view \nof the offence’s gravity ( Rayo , at para.  125). They make clear that proportionate \nsentencing that responds to the gravity of the luring offence and the degree of \nrespon sibility of the offender will often require substantial sentences of imprisonment. \nAs a result, courts should depart from dated precedents that do not reflect society’s \ncurrent awareness of the impact of sexual violence on children in imposing a fit \nsenten ce (Friesen , at para.  110).  \n(4) Summary  \n[48] Friesen ’s analytical approach necessitates an understanding of the inherent \nwrongfulness and distinct harms of luring and Parliament’s sentencing goals. \nUnderstanding the wrongfulness and harmfulness of the luring offenc e is integral to \nproperly assessing the gravity of the offence and the degree of responsibility of the \noffender, as well as to avoiding stereotypical reasoning and the misidentification of \naggravating and mitigating factors (para.  50). I use this guidance to inform \nMr. Bertrand Marchand’s fit sentence and as the foundation for the constitutional \nanalysis under s.  12.  \nD. The Sentencing Judge Erred in Assigning a Five -Month Concurrent Sentence for \nthe Luring Offence  \n[49] The sentencing judge properly considered denu nciation and deterrence and \nrecognized that the total sentence must be proportionate to the gravity of the offences \n2023 SCC 26 (CanLII)\n\n--- Page 51 ---\n \n and to the respondent’s degree of responsibility. When addressing the sentence for the \nsexual interference, which is not on appeal before th is Court, she acknowledged that \nthis was a [ TRANSLATION ] “situation of sexual exploitation” (para.  60) and a \n“relationship based on manipulation to satisfy sexual needs with a still -developing \nadolescent”, which would leave “scars” (para.  59). The vulnerab ility of the young \nvictim, who was under the Director of Youth Protection’s care, was also recognized \nregarding both the sexual interference and luring offences (paras. 60 and  70). \n[50] According to Lacasse , sentencing judges are afforded broad discretionary \npowers in crafting a fit sentence (para.  39). Appellate intervention is justified only if a \nsentence is demonstrably unfit or if the judge committed an error in principle that \nimpacted the sentence imposed (para. 44). The sentencing judge committed errors in  \npr",
    "token_count": 1000,
    "start_token": 21600,
    "end_token": 22600,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 25,
    "source_file": "2023scc26.txt",
    "text": ", was also recognized \nregarding both the sexual interference and luring offences (paras. 60 and  70). \n[50] According to Lacasse , sentencing judges are afforded broad discretionary \npowers in crafting a fit sentence (para.  39). Appellate intervention is justified only if a \nsentence is demonstrably unfit or if the judge committed an error in principle that \nimpacted the sentence imposed (para. 44). The sentencing judge committed errors in  \nprinciple that impacted the assigned sentence of five months’ imprisonment that she \nordered be served concurrently to the sexual interference sentence . Specifically, she \nerred by (1) minimizing the harm caused to the victim by failing to recognize the \ngrooming that did occur; (2) misconstruing the offender’s actions; and (3) assigning a \nconcurrent sentence for the luring offence. These errors in principle warranted appellate \nintervention that the majority of the Court of Appeal below failed to undertake. I  would \nthus substitute the 5 -month sentence imposed by the sentencing judge with the 12 -\nmonth sentence sought by the Crown.  \n(1) The Sentencing Judge Failed to Recognize the Grooming That Occurred  \n2023 SCC 26 (CanLII)\n\n--- Page 52 ---\n \n [51] Evidence of grooming may be present where child luring is made o ut. \nGrooming is a process which allows the offender to forge a close relationship with a \nvictim to gain trust, compliance and secrecy for the purpose of eventually engaging in \nsexualization and abuse ( Rayo , at para.  149). The jurisprudence has yet to ident ify a \nuniversal definition of grooming. Understandably, this is in large part due to the \ndifficulties in determining where the process begins and ends, as well as the variety of \nbehaviours that may be involved depending on the offender, the victim, and the  context. \nIndeed, grooming can involve, but is not limited to “rapport building, incentivization, \ndisinhibition, and security management” (I.  A. Elliott, “A Self -Regulation Model of \nSexual Grooming” (2017), 18 Trauma, Violence, & Abuse 83, at p.  88). It is  “a slow \nand gradual process of active engagement and a desensitization of the child’s \ninhibitions — with an increasing gain in power and control over the young person” \n(Rayo , at para.  139, quoting M.  Ospina, C.  Harstall and L.  Dennett, Sexual Exploitation  \nof Children and Youth Over the Internet: A Rapid Review of the Scientific Literature  \n(2010), at p.  7).  \n[52] Grooming often goes hand in hand with the common features of luring, \nnamely a “prolonged, deliberate and careful cultivation of a young person with a v iew \nto engendering trust and intimacy, all designed to promote sexual conduct between the \ntwo parties” ( Paradee , at para.  20). While often a preparatory process, grooming need \nnot culminate in a sexual act to be harmful. Grooming allows an offender to gain  power \nand control over the young person, which in turn may lead to distinct psychological \nharm. This harm exemplifies the vulnerability and exploitation of children facilitated \n2023 SCC 26 (CanLII)\n\n--- Page 53 ---\n \n by the internet that Parliament sought to protect against in enacting the luri ng offence \n(Rayo , at paras.  138-39; Reynard , at paras.  19-20; Alicandro , at para.  36; Legare , at \npara.  25). \n[53] The identification of grooming should be left to the fact -finder in each case. \nIn assessing whether grooming is present, judges should focus on the character, content, \nand consequences of the messages, as well as whether the communication resulted in \npsychological manipulation of the child.  \n[54] The text of s.  172.1 is clear that grooming is not a constituent element of \nthe luring offence. While its prese nce may be aggravating at sentencing, its absence is \nnot mitigating.  \n[55] In this case, the sentencing judge failed to appreciate the harms that \ngrooming generated for this young victim — in fact, the sentencing judge did not \nrecognize the victim had been groom ed at all. By characterizing the luring as a contact -\ndriven means to an end, the sentencing judge failed to account for the psychological \nmanipulation that arose from the online communication alone. With respect, she failed",
    "token_count": 1000,
    "start_token": 22500,
    "end_token": 23500,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 26,
    "source_file": "2023scc26.txt",
    "text": " sentencing, its absence is \nnot mitigating.  \n[55] In this case, the sentencing judge failed to appreciate the harms that \ngrooming generated for this young victim — in fact, the sentencing judge did not \nrecognize the victim had been groom ed at all. By characterizing the luring as a contact -\ndriven means to an end, the sentencing judge failed to account for the psychological \nmanipulation that arose from the online communication alone. With respect, she failed \nto disentangle t he harm caused b y the online communication from the harm caused by \nthe sexual interference. Instead of viewing grooming as a continuous process that \nserves to renew and strengthen an exploitative relationship, she discounted its presence \nbecause prior sexual acts had occu rred. Irrespective of the physical sexual acts that \npreceded and followed the communication, Mr.  Bertrand Marchand’s tactics and \n2023 SCC 26 (CanLII)\n\n--- Page 54 ---\n \n actions demonstrate controlling manipulation using the internet, which I characterize \nas grooming. This grooming should have se rved as an aggravating factor on sentencing.  \n[56] The messages exchanged by Mr.  Bertrand Marchand and the victim \nconfirmed the power imbalance between this adult and this child . During the relevant \nperiod, the respondent requested to meet the victim upwards of  18 times in order to \nhave sexual intercourse (sentencing reasons, at para.  68). The respondent persisted with \nthese requests until he succeeded in using her to serve his own sexual purposes. These \nmeetings impacted the rules and conditions the victim was subject to at the \nrehabilitation centre she resided in at the time, and put her in danger. The respondent \nalso suggested on several occasions that she run away from the centre, even after the \nvictim voiced fears of getting caught by her supervisors (A.R., vol. II, at pp.  109, 115 \nand 137).  \n[57] The messages were often sexually explicit. Several times throughout their \nconversations, Mr. Bertrand  Marchand impatiently asked her to send compromising \nphotos over Snapchat (A.R., vol.  II, at p.  110). He commented on h er body, calling her \nsexy, saying [ TRANSLATION ] “ur really a woman”, and noting that she had gained \nweight and looked like more of a woman (p.  117). He stated [ TRANSLATION ] “ur gonna \nfeel horny later” (p.  129) in the hopes of receiving an explicit photo vi a Snapchat. He \nsaid he was “joking” about screenshotting these explicit photos and saving them to his \nphone (p.  124).  \n2023 SCC 26 (CanLII)\n\n--- Page 55 ---\n \n [58] As recognized by the sentencing judge, the victim understood and \nexpressed that the respondent was only staying in contact with her in ord er to have \nsexual intercourse (p.  80). In certain passages, the victim told the respondent that she \nfelt used and exploited. She stated [ TRANSLATION ] “I’m fed up and don’t want to be \nseen as a slut”, and asked him to respect her (p.  127). She expressed bei ng \n[TRANSLATION ] “in need of love”, to which Mr. Bertrand  Marchand responded “haha \nor in need of sex?” (p.  131).  \n[59] Mr. Bertrand  Marchand also strategically expressed disappointment in the \nvictim to exert control over her actions. He told her that she had los t his respect and \nconveyed frustration when she did not promptly respond to his messages. He told her \nshe was letting him down when she did not send him explicit photos on demand ( A.R. \nvol. II, at p.  115).  \n[60] Simultaneously, Mr.  Bertrand Marchand gradually gained the victim’s \ntrust by showing concern for her, buying her gifts, and making promises. At times he \ntook on the role of a mentor by telling her not to end up in trouble, or asking her how \nschool was going. He expressed that he did not [ TRANSLATION ] “want to be in shit \nbecause you run away to our place” (p.  155). He also promised to purchase her alcohol, \nand cajoled, enticed and praised her in an effort to gain sexual advantage.  \n[61] The record reveals that Mr.  Bertrand Marchand did not respect the victim’s \nstated boundaries. In the final messages exchanged, where [ TRANSLATION ] “the \nteenager stated clearly that she no longer wanted to continue their relationship”, he \n2023 SCC ",
    "token_count": 1000,
    "start_token": 23400,
    "end_token": 24400,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 27,
    "source_file": "2023scc26.txt",
    "text": " away to our place” (p.  155). He also promised to purchase her alcohol, \nand cajoled, enticed and praised her in an effort to gain sexual advantage.  \n[61] The record reveals that Mr.  Bertrand Marchand did not respect the victim’s \nstated boundaries. In the final messages exchanged, where [ TRANSLATION ] “the \nteenager stated clearly that she no longer wanted to continue their relationship”, he \n2023 SCC 26 (CanLII)\n\n--- Page 56 ---\n \n insisted saying that she was [ TRANSLATION ] “too much of a woman” for them to stop \ntalking (se ntencing reasons, at para.  48; see also A.R., vol.  II, at p.  161). Rather than \nrespecting her request to end contact, he made her question her decision, warning her \nthat because he made a lot of money, she would never be able to find someone who \ncould spoi l her like him (A.R., vol.  II, at p.  161).  \n[62] The messages demonstrate that the respondent groomed the victim with the \naim to control and influence this child toward a sexual purpose. He used his relative \nseniority over the victim to manipulate her and capita lized on the power imbalance \nbetween them. He pressured her, berated her and imbued their communications with \nsexual undertones and overtones. He ignored her stated boundaries and oscillated \nbetween endearment and frustration to obtain the sexual contact t hat he wanted. The \noffender did all of this via online messaging platforms — the only medium by which \nthe victim was able to communicate with the outside world. This behaviour is not only \ngrooming, but is precisely what Parliament sought to prevent by intr oducing the luring \nprovisions.  \n[63] The sentencing judge erred by failing to recognize the grooming present \nhere, which should have served as an aggravating factor on sentencing.  \n(2) The Sentencing Judge Misconstrued the Offender’s Actions  \n[64] Taking a critical look at  the language used to describe sexual violence \nexperienced by children is essential to adequately reflect the wrongfulness and the \n2023 SCC 26 (CanLII)\n\n--- Page 57 ---\n \n harmfulness of these offences. In Friesen , the Court warned against the use of \nmisleading language that either euphemizes or eroticizes sexual violence because it \nrisks trivializing that violence, normalizing conduct that is meant to be condemned, and \nit removes responsibility from the offender (paras.  147 and 151). Imprecise language \ncan also indicate the presence of biases tha t may impermissibly affect the court’s \nreasoning (S.  Zaccour and M.  Lessard, “La culture du viol dans le discours juridique: \nsoigner ses mots pour combattre les violences sexuelles” (2021), 33 C.J.W.L.  175, at \np. 203). Courts should avoid language that may  re-victimize victims “by disguising and \nobscuring the violence, pain, and trauma that [they] experienced” ( Friesen , at \npara.  147). \n[65] In the instant case, the sentencing judge stated that this was not a “classic” \ncase of luring, but rather an attempt to repe at the “sexual escapades” that the victim \nhad already “consented” to three times. The judge explained that the impugned \ncommunications occurred online not because of the anonymity that social media \naffords, but because this platform was commonly used by pe rsons of Mr.  Bertrand \nMarchand’s generation.  \n[66] While it is true that the respondent did not anonymously approach a child \nonline that he had never met before, he did use telecommunication platforms to \nmanipulate a child for his own sexual ends. Luring can be  done anonymously, but it is \ninaccurate and unhelpful to characterize this as its “classic” form (S.  Paquette and \nF. Fortin, “Les traces numériques laissées par les cyberdélinquants sexuels: identités \n2023 SCC 26 (CanLII)\n\n--- Page 58 ---\n \n virtuelles, mensonges et protection de l’anonymat” (202 1), 74 R.I.C.P.T.S.  387, at \np. 401; see also  Rayo ; R. v. Miller , 2016 SKCA 32, 476 Sask. R. 150, at para.  23). \nMr. Bertrand",
    "token_count": 1000,
    "start_token": 24300,
    "end_token": 25300,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 28,
    "source_file": "2023scc26.txt",
    "text": ": identités \n2023 SCC 26 (CanLII)\n\n--- Page 58 ---\n \n virtuelles, mensonges et protection de l’anonymat” (202 1), 74 R.I.C.P.T.S.  387, at \np. 401; see also  Rayo ; R. v. Miller , 2016 SKCA 32, 476 Sask. R. 150, at para.  23). \nMr. Bertrand Marchand’s choice to contact the victim online was not merely a \n“generational choice”. Because the victim lived in a rehabilitation centre, online \ncommunication was the only way Mr.  Bertrand Marchand could access the victim and \nbuild a relationship with her in order to repeat the acts constituting sexual interference. \nI agree with the dissenting judge in the court below that [TRANSLATI ON] “the respondent \n. . . chose to use the means of telecommunication available to him and the victim to \nmultiply their encounters to ensure his control and maintain his domination over her” \n(C.A. reasons, at para.  36). The sentencing judge treated the abs ence of anonymity as \nreducing the seriousness of the offence ( Rayo , at para.  88) and misconstrued the use of \nsocial media as merely a generational preference. Both of these elements erroneously \nserved as mitigating factors on sentencing.  \n[67] By employing the term [ TRANSLATION ] “sexual escapade” to describe \nMr. Bertrand Marchand’s illegal sexual interference with a minor (paras.  38, 50 -51, 64 \nand 68), the sentencing judge minimized the harm done to the child. Such a term evokes \npleasure and excitement, and priv ileges the perspective of the adult. This is akin to \nusing terms such as “fondling” and [ TRANSLATION ] “caressing”, which signal that the \nconduct is inherently less blameworthy or harmful than other forms of violence \n(Friesen , at para.  144, citing R. v. Hoo d, 2018 NSCA 18, 45 C.R. (7th) 269,  at \npara.  150, and Caron Barrette v. R. , 2018 QCCA 516, at para.  93 (CanLII)). This \nlanguage “undermines Parliament’s objective of communicating that the use of \n2023 SCC 26 (CanLII)\n\n--- Page 59 ---\n \n children as sexual objects for the gratification of adults i s wrongful” ( Friesen , at \npara.  147).  \n[68] The sentencing judge stated on numerous occasions that the victim had \nalready “consented” to the sexual intercourse. Clearly, given the victim’s age, any \npurported “consent” to sexual activity in these circumstances wa s legally impossible. \nThe presence of prior acts making out the offence of sexual interference should not \nmitigate the wrongfulness of the conduct or minimize the harm it generates. That this \nminor was subject to three prior instances of illegal sexual int ercourse establishes a \npattern of abuse, and not a reason for it. While the sentencing judge acknowledged that \nconsent could not play a role in the sexual interference offence, she did not make this \nsame distinction for the luring offence. The use of langu age that suggests consent in \nsituations where consent is legally impossible is to be avoided. Analogizing a child’s \npsychological manipulated actions to consent is a legal error ( Friesen , at paras. 148 -\n50). \n[69] A review of the sentencing judge’s language revea ls that her framing of the \nillegal sexual encounters as “escapades” and her wrongful characterization of the \nvictim’s behaviour as consent minimized Mr.  Bertrand Marchand’s actions. This \nframing caused her to unduly minimize the wrongfulness and harms of t he offence by \nfactoring in the extent to which the victim “participated” in the violence — which was \na separate error of law ( Friesen , at para.  150).  \nE. A 12-Month Sentence Is Appropriate  \n2023 SCC 26 (CanLII)\n\n--- Page 60 ---\n \n [70] These errors mean this Court is now tasked with setting a fit and \npropo rtionate sentence for Mr.  Bertrand Marchand. I agree with the Crown that given \nthe particular circumstances of the luring in this case, there was no justification for \ndeparting from the existing sentencing range of 12 to 24 months for luring cases \nproceedi ng by indictment ( Morrison , at para.  177, citing ",
    "token_count": 1000,
    "start_token": 25200,
    "end_token": 26200,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 29,
    "source_file": "2023scc26.txt",
    "text": ")\n\n--- Page 60 ---\n \n [70] These errors mean this Court is now tasked with setting a fit and \npropo rtionate sentence for Mr.  Bertrand Marchand. I agree with the Crown that given \nthe particular circumstances of the luring in this case, there was no justification for \ndeparting from the existing sentencing range of 12 to 24 months for luring cases \nproceedi ng by indictment ( Morrison , at para.  177, citing  Jarvis , at para.  31; A.F., at \npara.  75).  \n(1) Significant Factors to Determine a Fit Sentence  \n[71] In addition to determining the gravity of the offence, determining the moral \nblameworthiness of the offender is key t o setting a proportionate sentence . This \nrequires identifying both mitigating and aggravating factors. Here, in order to examine \nMr. Bertrand Marchand’s blameworthiness and set a proportionate sentence, I provide \na non -exhaustive list of aggravating and mi tigating factors that have particular \nrelevance in the context of luring.  \n(a) Mitigating Factors  \n[72] Sentencing judges must consider the mitigating factors that arise on the \nfacts of the particular case before them. Mitigating factors that commonly appear in \nluring cases include whether the offender pleaded guilty (see, e.g., Misay , at para. 141; \nMelrose , at para. 264; Wall , at para. 75; R. v. Ditoro , 2021 ONCJ 540, at para.  43 \n(CanLII); R. v. Gould , 2022 ONCJ 187; R. v. Cooper , 2023 ONSC 875, at para.  17 \n(CanLII) ; R. v. Clarke , 2021 NLCA 8, at para. 53 (CanLII); R.S.F. , at para.  103; R. v. \n2023 SCC 26 (CanLII)\n\n--- Page 61 ---\n \n Aeichele , 2023 BCSC 253, at para. 61 (CanLII); R. v. Wolff , 2020 BCPC 174, at \npara.  64 (CanLII)), whether the offender has expressed genuine remorse or gained \ninsight into the o ffence (see, e.g., Directeur des poursuites criminelles et pénales v. St -\nAmour , 2021 QCCQ 6855, at para.  43 (CanLII); Wall , at para.  75; Ditoro , at para.  59; \nMisay , at para.  150; Gould ; R. v. Rice , 2022 ABKB 773, at para.  48 (CanLII); Clarke , \nat para.  53; R.S.F. , at para.  105; Wolff , at para.  67), and whether the offender has \nundertaken rehabilitative steps such as counselling or treatment (see, e.g., R.S.F. , at \npara.  103; R. v. Wickramasinghe , 2022 ONCJ 331, at para.  25 (CanLII); Gould ; R. v. \nRasiah , 2021 ONCJ 584, at para.  42 (CanLII)). Here, in her analysis of the sentence for \nthe sexual interference count, the sentencing judge considered the pre -sentence report \nand rightly accounted for Mr.  Bertrand Marchand’s guilty plea, lack of prior \nconvictions, hone sty and cooperation throughout the sentencing process, factors which \nwere also relevant to the luring offence.  \n[73] The personal circumstances of the offender can also have a mitigating \neffect on blameworthiness ( Friesen , at paras.  91-92). In the context of det ermining the \nappropriate sentence overall, the sentencing judge in this case accounted for \nMr. Bertrand Marchand’s age at the time of the events, his stable family life, and the \nfact that he had maintained stable employment for around three years. Mr.  Bertrand \nMarchand overcame a substance use disorder during adolescence. At the time, this \ncaused him health problems and panic attacks (sentencing reasons, at para.  22). An \noffender might have a mental disability or substance use disorder that imposes serious \ncognitive limitations, such that their moral culpability is reduced ( Friesen , at para.  91; \n2023 SCC ",
    "token_count": 1000,
    "start_token": 26100,
    "end_token": 27100,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 30,
    "source_file": "2023scc26.txt",
    "text": " that he had maintained stable employment for around three years. Mr.  Bertrand \nMarchand overcame a substance use disorder during adolescence. At the time, this \ncaused him health problems and panic attacks (sentencing reasons, at para.  22). An \noffender might have a mental disability or substance use disorder that imposes serious \ncognitive limitations, such that their moral culpability is reduced ( Friesen , at para.  91; \n2023 SCC 26 (CanLII)\n\n--- Page 62 ---\n \n see, e.g., Hood , at para.  180; Melrose , at paras.  223-35; R. v. Osadchuk , 2020 QCCQ \n2166, at paras.  51-55 (CanLII); R. v. Deren , 2021 ABPC 84, at paras.  44 and 51 \n(CanLII); R. v. Sinclair , 2022 MBPC 40, at paras.  15 and 67 (CanLII); Wolff , at \npara.  65). However, this factor is not as mitigating in Mr.  Bertrand Marchand’s \ncircumstances as his substance use did not overlap with the material time period (unlike \nSinclair , at para. 67; Wolff , at para. 65).  \n(b) Aggravating Factors  \n(i) Grooming  \n[74] As articulated above, the sentencing judge erred in principle by failing to \naccount for the fact that the offender’s actions caused the victim distinct psychological \nharm. Mr.  Bertrand Marchand’s manipulation and grooming are both aggravating \nfactors that increase his moral blameworthiness.  \n[75] Here, no formal victim impact statement was adduced at sentencing. \nNevertheless, even where evidence of actual harm to the victim is not admitted, ha rm \ncan still be inferred. This Court instructed that “sexual violence against children \ninherently has the potential to cause several recognized forms of harm. .  . . [T]he \npotential that these forms of harm will materialize is always present whenever there is \nphysical interference of a sexual nature with a child and can be present even in sexual \noffences against children that do not require or involve physical interference” ( Friesen , \n2023 SCC 26 (CanLII)\n\n--- Page 63 ---\n \n at para.  79). The potential for reasonably foreseeable harm must be conside red on \nsentencing even where the luring results in no actual harm (para. 84).  \n[76] Where there is no direct evidence of actual harm to the victim, “[c]ourts \nmay be able to find actual harm based on the numerous factual circumstances that can \ncause additional ha rm and constitute aggravating factors” (para. 86). In other words, \nsentencing judges can infer the likelihood of actual harm where there are aggravating \nfactors such as grooming (see, e.g., R. v. Pentecost , 2020 NSSC 277, at paras.  50-54 \n(CanLII)).  \n(ii) Charact er of the Communication  \n[77] The character of the communication is relevant to the blameworthiness of \nthe conduct. In this appeal, the period for the count of luring on the indictment spans \nnearly seven months. During this time, hundreds of messages were exchan ged between \nthe respondent and the victim. The duration and frequency of the communications  are \nimportant to the extent that they may generate cumulative or more severe harms, and \nincrease the gravity of the offence and the moral blameworthiness of the off ender. \nBecause repeated and prolonged acts of sexual violence increase the long -term harm \nsuffered by the victim ( Friesen , at para.  131), sending a large volume of messages, or \nsending messages in a persistent and unrelenting way, is aggravating ( R. v. Col lier, \n2021 ONSC 6827, at para.  75 (CanLII); R. v. Kavanagh , 2023 ONSC 283, at para.  84 \n(CanLII); R. v. Moolla , 2021 ONSC 3702, at para.  22 (CanLII); R. v. E.F. , 2021 ABQB \n272; R. v. Battieste , 2022 ONCJ 573, at para.  45 (CanLII)). In addition, while a shorter \n2023 SCC 26 (CanLII)\n\n--- Page 64 ---\n \n duration of",
    "token_count": 1000,
    "start_token": 27000,
    "end_token": 28000,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 31,
    "source_file": "2023scc26.txt",
    "text": "LII); R. v. Moolla , 2021 ONSC 3702, at para.  22 (CanLII); R. v. E.F. , 2021 ABQB \n272; R. v. Battieste , 2022 ONCJ 573, at para.  45 (CanLII)). In addition, while a shorter \n2023 SCC 26 (CanLII)\n\n--- Page 64 ---\n \n duration of communication is not a mitigating factor, maintaining online \ncommunications for a long period of time is aggravating ( R. v. Faille , 2021 QCCQ \n4945, at paras.  68-70 (CanLII)).  \n[78] The substance of the communication is relevant when sentencing. Here, \nMr. Bertrand Marchand often sent sexually explicit and objectifying messages to the \nvictim. Graphic sexual content is clearly aggravating, but so is communication where \nthe offender man ipulates through language about love and affection ( Wolff ; R. v. \nSaberi , 2021 ONCJ 345, 493 C.R.R. (2d) 121; R. v. Boucher , 2020 ABCA 208). It is \nalso aggravating for the offender to rely on trickery, lies or manipulation to lure the \nvictim ( Collier , at pa ra. 77). \n[79] Encouraging a child to share images of themselves or sending explicit \nimages to the child also heightens blameworthiness and may serve as an aggravating \nfactor on sentencing with respect to the luring offence ( Collier ; Kavanagh ; R. v. \nKalliraq , 2022 NUCA 6; R. v. Razon , 2021 ONCJ 616; Deren ). Mr.  Bertrand Marchand \nencouraged the victim on numerous occasions to send explicit photos of herself through \nSnapchat, which he mentioned saving to his phone (A.R., vol.  II, at p.  124). The \nduration and freque ncy of the communications, along with the sexually explicit nature \nof the messages and the repeated requests for explicit photos, are all aggravating factors \nin this case ( Collier ; Kavanagh ; Kalliraq ; Razon ; Deren ). \n(iii) Deceit  \n2023 SCC 26 (CanLII)\n\n--- Page 65 ---\n \n [80] Deceit can present itself in many  forms and is aggravating. Where an \noffender relies on anonymity, for example by using a false name, identity, or age, then \nthe conduct is more blameworthy ( Pentecost ; R. v. Coban , 2022 BCSC 1810; Ditoro ; \nR. v. Bains , 2021 ABPC 20 ; Cooper ; Collier ; Montour  v. R. , 2020 QCCA 1648). \nHowever, not every offender operates under the shield of anonymity. In this case, \nMr. Bertrand Marchand met the victim in person and used his real identity when adding \nher on Facebook. Depending on the circumstances, a vulnerable c hild’s trust may be \nwon by either lying about one’s identity or by exploiting a pre -existing relationship \n(Rayo , at paras.  92-93). \n[81] The communication itself might also include deceitful tactics. In some \ncases, an offender may instruct the victim to erase th e communication to conceal the \nluring, or to refrain from sharing the messages with parents or family members ( Saberi ; \nR. v. LaFrance , 2022 ABCA 351 ). An offender may also tell the victim to dress more \nmaturely when they meet in person ( Saberi ). It is furt her aggravating for an offender to \nintentionally choose a platform that erases records of communication in order to avoid \ndetection (see J.R.), or to suggest a more secure platform after learning of the child’s \nage ( Rasiah ). In this case, Mr.  Bertrand Marc hand asked the victim to send him explicit \nphotos on Snapchat, a platform that erases records of communication. However, photos \nwere also exchanged throughout their communication on Facebook. This suggests that \nthe intention to avoid detection is not prese nt here.  \n(iv) Abuse of a Position or Relationship of Trust  \n2023 SCC 26 (CanLII)\n\n--- Page 66 ---\n \n [82] The jurisprudence provides several examples of traditional positions of \nauthority that may be exploited, including that of a parent (see, e.g., J.R.), teacher (see, \ne.g., Pentecost ;",
    "token_count": 1000,
    "start_token": 27900,
    "end_token": 28900,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 32,
    "source_file": "2023scc26.txt",
    "text": "were also exchanged throughout their communication on Facebook. This suggests that \nthe intention to avoid detection is not prese nt here.  \n(iv) Abuse of a Position or Relationship of Trust  \n2023 SCC 26 (CanLII)\n\n--- Page 66 ---\n \n [82] The jurisprudence provides several examples of traditional positions of \nauthority that may be exploited, including that of a parent (see, e.g., J.R.), teacher (see, \ne.g., Pentecost ; Faille ; R. v. Jissin k, 2021 ABQB 102, 482 C.R.R. (2d) 167), or family \nfriend (see, e.g., Rayo ; R. v. Lemay , 2020 ABCA 365, 14 Alta. L.R. (7th) 45 ; Boucher ). \nHowever, positions of trust fall on a spectrum, and a relationship of trust of any kind \nmay facilitate the commission of the offence ( Rayo , at paras . 87 and 96; Friesen , at \npara.  125). Prior relationships can be leveraged to provide an entry, form a basis of \ntrust, build confidence, and can make it easier to manipulate the victim — often because \nthe offender knows more ab out the victim, including any additional vulnerabilities, like \nthe victim’s family situation. In cases where an offender uses a pre -existing relationship \nin order to exploit pre -existing trust, a  breach of this trust is “likely to increase the harm \nto the victim and thus the gravity of the offence” ( Friesen , at para. 126).  \n[83] In many cases of luring the offender is intentionally attempting to build a \nrelationship of trust, move an existing trust relationship onto sexual terrain, or build \nsecrecy. The eventual breach of trust may produce feelings of fear and shame, \ndiscourage reporting and undermine relationships. When an offender exploits his role \nas the confidante or friend in order to gain a victim’s trust for the purposes of facilitating \nsexual contact, this  increases his degree of responsibility ( R.S.F. ; Rayo , at paras.  87 and \n96).  \n[84] Mr. Bertrand Marchand and the victim met in person through mutual \nfriends, then communicated online. He had illegal intercourse with her three times prior \n2023 SCC 26 (CanLII)\n\n--- Page 67 ---\n \n to engaging in the onli ne communications that led to the luring charge. The luring \ncount, therefore, does not encompass the three instances of sexual interference that \npreceded it. As the appellants remarked in written submissions, the fact that the \nunderlying offence occurred t hree times before the start of the luring does not diminish \nthe seriousness of the subsequent communications (A.F., at paras.  34-48). This pre -\nexisting relationship opened the door to the Facebook communications and allowed \nMr. Bertrand Marchand to access the victim. The respondent exploited the pre -existing \ntrust he had established with the victim when they first met.  \n(v) Age of the Victim  \n[85] The age of the child victim may also be an aggravating factor. Per \ns. 718.2(a)(ii.1) of the Criminal Code , abuse of a per son under 18 years is a statutorily \naggravating circumstance. While luring will always involve a child, practically \nspeaking it requires a child of an age who can access and use telecommunications. As \nsuch, very young children and infants are rarely victim s of this offence. Instead, luring \nwill often involve adolescent victims. Sentencing judges should heed the caution in \nFriesen that courts must “be particularly careful to impose proportionate sentences in \ncases where the victim is an adolescent” because d isproportionately low sentences have \nhistorically been imposed in these cases (para.  136).  \n[86] Luring involves an inherent power imbalance between the adult using \ntechnology and the unsupervised child or adolescent receiving their messages. In \nFriesen , this C ourt discussed the pronounced power imbalance between adults and \n2023 SCC 26 (CanLII)\n\n--- Page 68 ---\n \n children who are “often helpless without the protection and care of their parents” \n(para.  134). Though the victim in this case was an adolescent and not a young child, \nshe was under the care of the Director of Youth Protection when she was targeted by \nMr. Bertrand Marchand, making her exceptionally vulnerable in the circumstances.   \n[87] Further, a wide gap in age between the offender and victim increases \nblameworthiness (see, e.g., Misay , at para.  61; Faille",
    "token_count": 1000,
    "start_token": 28800,
    "end_token": 29800,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 33,
    "source_file": "2023scc26.txt",
    "text": " of their parents” \n(para.  134). Though the victim in this case was an adolescent and not a young child, \nshe was under the care of the Director of Youth Protection when she was targeted by \nMr. Bertrand Marchand, making her exceptionally vulnerable in the circumstances.   \n[87] Further, a wide gap in age between the offender and victim increases \nblameworthiness (see, e.g., Misay , at para.  61; Faille , at para.  74; Jissink , at para.  52; \nR. v. Aguilar , 2021 ONCJ 87, at para.  21 (CanLII), aff’d 2022 ONCA 353, at para.  14 \n(CanLII)). Here, Mr. Bertrand Marchand is nine years older than the victim, who was \nin her early teenage years at the start o f the indictable period. He was aware of her age \nfrom the start and mentioned her youth several times. The significant age gap and the \nvictim’s severe vulnerability are both aggravating factors.  \n(c) A Fit Sentence  \n[88] I accept the appellants’ submission that Parli ament’s legislative initiatives \nregarding sexual offences against children, the aggravating and mitigating factors \narticulated above, and the distinct harm caused by the online communication justify a \nsentence of 12 months’ imprisonment for Mr.  Bertrand Ma rchand.  \n(2) Concurrent Versus Consecutive Sentences  \n[89] I now turn to the sentencing judge’s order that the sentences for the \noffences of sexual interference and luring be served concurrently.  \n2023 SCC 26 (CanLII)\n\n--- Page 69 ---\n \n [90] Because of its constituent elements, luring will often arise with other \noffences. This raises methodological considerations about how to approach sentencing \nfor multiple offences and when sentences should run concurrently or consecutively.  \n[91] The sentencing judge first determined the just and appropriate sentence for \neach offence individually. Next, she considered  whether the sentences ought to be \nconsecutive or concurrent.  Only after doing this did she consider the principle of \ntotality in s.  718.2(a), which  ensures that “the cumulative sentence rendered does not \nexceed the overall culpability of the offender” ( R. v. M. (C.A.) , [1996] 1 S.C.R. 500, at \npara.  42; see also R. v. Hutchings , 2012 NLCA 2, 316 Nfld. & P.E.I.R. 211, at para.  84, \nand Desjardins v. R. , 2015 QCCA 1774, at paras.  37-42 (CanLII), which have endorsed \na similar approach).   \n[92] I agree with the sentencing judge’s approach in this case and believe it has \nbenefits over the alternative manner of simply setting a global amount for multiple \noffences. This sequential approach ensures a separate consideration of the fit and \nappropriate punishment of each offence. Given the separate objectives and distinct \ncriteria for the luring offence, it was appropriate to examine each offence individually \n[TRANSLATIO N] “in order to understand properly the weight this offence contributes to \nthe offender’s moral blameworthiness” ( Rayo , at para.  55). \n[93] Articulating individual sentences for each offence provides needed clarity \nand is of great assistance when one of the chal lenged punishments are varied on appeal \nor declared to be unconstitutional.  Setting an  individual sentence for each offence \n2023 SCC 26 (CanLII)\n\n--- Page 70 ---\n \n provides transparency and allows a judge to weigh the seriousness of each offence. \nClearly identifying individual sentences may also  prove to be of great assistance in any \nsubsequent sentencing proceedings should an offender re-offend — for example, by \nproviding sentencing judges with a starting point when applying the “jump principle” \nto repeat convictions for the same offences (R. v.  Borde  (2003), 63 O.R. (3d) 417 \n(C.A.), at para.  39).  \n[94] The sentencing judge determined that Mr.  Bertrand Marchand’s sentences \nfor sexual interference and luring should be served concurrently because the offences \nwere closely connected. While deference is o wed to a judge’s decision on whether to \nimpose a consecutive or concurrent sentence ( R. v. McDonnell , [1997] 1 S.C.R. 948, at \npara.  46), respectfully, the sentencing judge erred by imposing",
    "token_count": 1000,
    "start_token": 29700,
    "end_token": 30700,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 34,
    "source_file": "2023scc26.txt",
    "text": " 39).  \n[94] The sentencing judge determined that Mr.  Bertrand Marchand’s sentences \nfor sexual interference and luring should be served concurrently because the offences \nwere closely connected. While deference is o wed to a judge’s decision on whether to \nimpose a consecutive or concurrent sentence ( R. v. McDonnell , [1997] 1 S.C.R. 948, at \npara.  46), respectfully, the sentencing judge erred by imposing a concurrent sentence \nin this case. To properly account for the di stinct legal interests that the luring offence \nprotects, the sentences should have been consecutive.  \n[95] Parliament has removed judicial discretion and has dictated that sentences \nmust run consecutively for certain offences, like child pornography where the o ffender \nalso commits another sexual offence against that child, or where there are sexual \noffences other than child pornography committed by the same offender against several \nchildren ( Criminal Code , s. 718.3(7)). Generally speaking, “offences that are so closely \nlinked to each other as to constitute a single criminal adventure may, but are not \nrequired to, receive concurrent sentences, while all other offences are to receive \nconsecutive sentences” ( Friesen , at para.  155; see also Criminal Code , \n2023 SCC 26 (CanLII)\n\n--- Page 71 ---\n \n s. 718.3(4) (b)(i)). Determining whether sentences should be consecutive or concurrent \nis a fact -specific inquiry to be undertaken in the context of each case (C.  C. Ruby, \nSentencing  (10th ed. 2020), at §14.13).  \n[96] Luring is legislatively linked to listed secondary offen ces: an offender must \ncommunicate for the purpose of facilitating the commission of one such offence. While \nthere will be cases where luring stands alone, it often accompanies the actual \ncommission of a listed secondary offence. But the luring that precede d or produced the \noffence is in no way subsumed or supplanted within the secondary offence. This is \nbecause the offence of luring protects a distinct social interest and causes distinct harms \ncompared to the secondary offences ( Rayo , at paras.  130 and 134) . \n[97] Offences constituting “invasions of different legally protected interests” \ncan be sentenced consecutively, even if they form part of the same criminal transaction \n(Rayo , at para.  136, quoting R. v. Gummer  (1983), 38 C.R. (3d) 46 (Ont. C.A), at p.  49; \nR. v. Gillis , 2009 ONCA 312, 248 O.A.C. 1, at para.  9; R. v. Morton , 2021 ABCA 29, \nat paras.  32-33 (CanLII)). Parliament intentionally targeted conduct that precedes the \ncommission of the enumerated sexual offences and seeks to protect children from the \npossi bility of sexual exploitation facilitated by the internet ( Rayo , at paras.  138-39; \nReynard , at paras.  19-20; Alicandro , at para.  36; Legare , at para.  25). As set out above, \nluring can cause distinct harms as a result of psychological manipulation. As such,  in \nmost cases luring will attract a consecutive sentence ( Rayo , at paras.  133-43; R. v. \nMcLean , 2016 SKCA 93, 484 Sask. R. 137, at paras.  50-53; Miller , at paras.  22-23). \n2023 SCC 26 (CanLII)\n\n--- Page 72 ---\n \n As noted in Rayo , the distinct offence of luring may seem to go unpunished, at least  in \npart, where the luring sentence runs concurrently to the sentences for the related \noffences (para.  152).  \n[98] This is not to say that luring must always be sentenced consecutively. \nUnless so mandated by s.  718.3(7), sentencing judges retain discretion on th is point. \nHowever, in exercising their discretion, judges must remain cognizant of the fact that \nthe offence of luring constitutes an invasion of a different legally protected interest. \nThe judge is obliged to explain why the sentence is to be served concu rrently with the \npenalties imposed for other infractions. The reason for imposing a concurrent sentence \nmust be provided. I also note that judges must be mindful not to double",
    "token_count": 1000,
    "start_token": 30600,
    "end_token": 31600,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 35,
    "source_file": "2023scc26.txt",
    "text": "3(7), sentencing judges retain discretion on th is point. \nHowever, in exercising their discretion, judges must remain cognizant of the fact that \nthe offence of luring constitutes an invasion of a different legally protected interest. \nThe judge is obliged to explain why the sentence is to be served concu rrently with the \npenalties imposed for other infractions. The reason for imposing a concurrent sentence \nmust be provided. I also note that judges must be mindful not to double count: where a \njudge orders that a sentence for luring be served consecutively t o any sentence for a \nsecondary offence, the secondary offence cannot act as an aggravating factor in \ndetermining the luring sentence.  \n(3) Totality  \n[99] The effect of the totality principle is to require a judge to ensure that the \nseries of sentences are, in aggreg ate, “just and appropriate” (see M. (C.A.) , at para.  42; \nCriminal Code , s. 718.2(c)). This involves taking “one last look at the combined \nsentence” to assess whether it is “unduly long or harsh, in the sense that it is \ndisproportionate to the gravity of th e offence and the degree of responsibility of the \noffender” ( Hutchings , at paras.  42 and 84; Laguerre v. R. , 2021 QCCA 1537, at \npara.  43 (CanLII); M. (C.A.) , at para.  42). If the principle of totality is offended, the \n2023 SCC 26 (CanLII)\n\n--- Page 73 ---\n \n sentences can be adjusted by making so me concurrent, or if this does not achieve a just \nand appropriate sentence, by reducing the length of one or more sentences ( Desjardins , \nat para.  34). \n[100]  As articulated above, the sentencing judge in this case failed to consider \nthat the distinct legal intere st that the luring offence protects was present in the case at \nbar. This caused her to conflate the sentence for luring with the sentence for the \nsecondary offence.  As such, I conclude that the 12 -month luring sentence ought to be \nserved consecutively with  the 10 -month sentence for sexual interference.  \n[101]  Applying the totality principle, I find that a 22 -month sentence is just in \nlight of the circumstances of the case, Mr.  Bertrand Marchand’s personal \ncircumstances and his moral blameworthiness.  \n[102]  Mr. Bertrand Marchand has already served the 10 -month sentence for \nsexual interference in full and was paroled in July 2020. Given the time that has elapsed \nand the fact that the appellants are not seeking further punishment, it would not serve \nthe ends of justice to r e-incarcerate Mr.  Bertrand Marchand. Accordingly, I order a \npermanent stay of execution of the modified sentence (see R. v. Proulx , 2000 SCC 5, \n[2000] 1 S.C.R. 61, at para.  132; R. v. R.A.R. , 2000 SCC 8, [2000] 1 S.C.R. 163, at \npara.  35; R. v. Anderson , 2014 SCC 41, [2014] 2 S.C.R. 167, at para.  65). \nIV. The Mandatory Minimum Sentences in Section 172.1(2) of the Criminal Code \nViolate Section 12 of the Charter  \n2023 SCC 26 (CanLII)\n\n--- Page 74 ---\n \n [103]  These companion appeals impugn the constitutionality of both the \nsummary and indictable mandatory minimum sentences attached to the hybrid luring \noffence pursuant to s.  12 of the Charter . In the courts below, Mr.  Bertrand Marchand \nsuccessfully challenged t he one -year mandatory minimum for the indictable offence \nand H.V. successfully challenged the six -month mandatory minimum for the summary \nconviction offence. As respondents before this Court, they ask that those decisions be \nupheld. These reasons take a ho listic view of the luring provision and its penalties to \nbest assess whether the mandatory minimum sentences pass constitutional muster. This \nis the first time the Court will answer the constitutional questions arising from these \nmandatory minimums: while the majority in Morrison  declined to rule on the \nconstitutionality of s.  172.1(2)(a), Justice Karakatsanis found it offended s.  12",
    "token_count": 1000,
    "start_token": 31500,
    "end_token": 32500,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 36,
    "source_file": "2023scc26.txt",
    "text": " ask that those decisions be \nupheld. These reasons take a ho listic view of the luring provision and its penalties to \nbest assess whether the mandatory minimum sentences pass constitutional muster. This \nis the first time the Court will answer the constitutional questions arising from these \nmandatory minimums: while the majority in Morrison  declined to rule on the \nconstitutionality of s.  172.1(2)(a), Justice Karakatsanis found it offended s.  12 and was \nnot saved by s. 1.  \n[104]  Recently, this Court reaffirmed and clarified the framework for \nconstitutional challenges to mand atory minimum sentences under s.  12. Whether the \nmandatory minimum sentences in s.  172.1(2)(a) and (b)  are unconstitutional requires a \ntwo-stage inquiry that involves a contextual and comparative analysis ( R. v. Hills , 2023 \nSCC 2 , at para.  40; R. v. Bisson nette , 2022 SCC 23, at para.  62). First, a court must set \na fit and proportionate sentence for the individual offenders before the court and \npossibly other reasonably foreseeable offenders  (Hills , at para.  40; see also Bissonnette , \nat para.  63; R. v. Nur, 2015 SCC 15, [2015] 1 S.C.R. 773, at para.  77). Second, a court \nmust determine whether the mandatory minimum requires imposing a sentence that is \ngrossly disproportionate to the otherwise fit and proportionate sentence  (Hills , at \n2023 SCC 26 (CanLII)\n\n--- Page 75 ---\n \n para.  40; Bissonnette , at para.  63; Nur, at para.  46; R. v. Smith , [1987] 1 S.C.R. 1045, \nat p. 1072). This involves consideration of the scope and reach of the offence, the \neffects of the penalty on the individual or reasonably foreseeable offender, and the \npenalty and its objectiv es (Hills , at para.  122).  \n[105]  The Hills  framework was not available to the courts below in either \nMr. Bertrand Marchand’s or H.V.’s cases when those courts assessed the mandatory \nminimum sentences. Nevertheless all decided that the mandatory minimums at issue \ninfringed s.  12. Their conclusions are consistent with other  courts across the country \n(see, e.g.,  Hood ; Melrose ; R. v. Faroughi , 2020 ONSC 780; R. v. Koenig , 2019 BCPC \n83; Roy; Deren ; R. v. Ward , 2019 NSPC 72; R. v. Fawcett , 2019 BCPC 125).  \n[106]  The Crown appellants argue that the increased sen tences which may result \nafter Friesen  immunize the mandatory minimums at issue. While a proper \nunderstanding of the wrongfulness and harmfulness of luring will lead to significant \npenalties in most circumstances, the constitutional analysis under s. 12 of the Charter  \ndoes not merely ask whether the mandatory minimum is cruel and unusual in \n“common” cases ( Nur, at para. 68). Indeed, the use of reasonably foreseeable scenarios \nis expressly designed to test the lower end of the spectrum of conduct captured by the \noffence (see, e.g., Hills , at para. 169).  \n[107]  The present constitutional analysis does not disturb the maximum sentence \nestablished by Parliament, the sentencing range for luring affirmed in Morrison  or this \nCourt’s clear guidance in Friesen . The sole que stion is whether the mandatory \n2023 SCC 26 (CanLII)\n\n--- Page 76 ---\n \n minimum sentences in s.  172.1(2), which deprive courts of the ability to “tailor \nproportionate sentences at the lower end of a sentencing range” ( Nur, at para.  44), \nimpose cruel and unusual punishment in reasonably foreseeabl e cases.  \n[108]  Put simply, the constituent elements of the child luring offence are so broad \nand unconstrained as to capture conduct that is only remotely related to the heart of the \noffence (see, e.g., Hills , at para.  122). This is ultimately what makes the ma ndatory \nminimum provisions constitutionally suspect. Parliament could have limited the \nconduct captured by the mandatory minimums or built in a “safety valve that would \nallow judges to exempt outliers for whom the mandatory",
    "token_count": 1000,
    "start_token": 32400,
    "end_token": 33400,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 37,
    "source_file": "2023scc26.txt",
    "text": " Put simply, the constituent elements of the child luring offence are so broad \nand unconstrained as to capture conduct that is only remotely related to the heart of the \noffence (see, e.g., Hills , at para.  122). This is ultimately what makes the ma ndatory \nminimum provisions constitutionally suspect. Parliament could have limited the \nconduct captured by the mandatory minimums or built in a “safety valve that would \nallow judges to exempt outliers for whom the mandatory minimum will constitute cruel \nand unusual punishment” ( R. v. Lloyd , 2016 SCC 13, [2016] 1 S.C.R. 130, at para.  36); \nit did not do so here. As with any other challenged provision, this Court must carefully \nevaluate the constitutionality of the mandatory minimum sentences at issue.  \n[109]  For a m andatory minimum sentence to be found unconstitutional pursuant \nto s. 12 of the Charter , it must be “so excessive as to outrage standards of decency” \n(Hills , at para.  109, citing R. v. Boudreault , 2018 SCC 58, [2018] 3 S.C.R. 599, at \npara.  45; Lloyd , at pa ra. 24, citing R. v. Morrisey , 2000 SCC 39, [2000] 2 S.C.R. 90, at \npara.  26; R. v. Wiles , 2005 SCC 84, [2005] 3 S.C.R. 895, at para.  4, citing Smith , at \np. 1072). Only on “rare and unique occasions” will a sentence infringe s.  12 (Steele v. \nMountain Instit ution , [1990] 2 S.C.R. 1385, at p.  1417). As I outline below, the \nmandatory minimum sentences for luring meet this high threshold and must be struck. \nAlthough the mandatory minimum penalties are not grossly disproportionate as applied \n2023 SCC 26 (CanLII)\n\n--- Page 77 ---\n \n to Mr.  Bertrand March and and H.V., they are when applied to reasonably foreseeable \nscenarios.  \nA. A Fit, Proportionate Sentence  \n[110]  As explained, the fit and proportionate sentence for Mr.  Bertrand \nMarchand’s luring of the victim is 12 months’ incarceration, which mirrors the \nmandatory minimum for the indictable offence to which he pleaded guilty. As a result, \ns. 172.1(2)(a)’s mandated minimum sentence is not grossly disproportionate in his \ncircumstances.  \n[111]  In the appeal concerning H.V., who was 52 years old at the material time,  \nhe pleaded guilty to child luring prosecuted by summary conviction, under \ns. 172.1(1)(a), for texts sent to the victim, his 16 -year-old niece and godchild, between \nJuly 31 and August 9, 2017. During a family dinner at his home while he was alone \nwith the victim, H.V. told her that she had nice buttocks and breasts. That same evening, \nhe began sending her sexual text messages, which he continued to do for a period of 10 \ndays. In these texts, he repeatedly asked her to delete his communications and keep \nthem  to herself. H.V. suggested to the victim’s mother that she come work for him at \nthe school where he was the principal.  On her second day of work, he touched her \nbreasts. She subsequently left her job and filed a criminal complaint.  Although H.V. \nwas also initially charged with secondary offences in relation to the illegal sexual \ntouching of the victim’s breasts, he pleaded guilty to and was sentenced only for the \nchild luring count. At sentencing, H.V. challenged the six -month mandatory minimum \n2023 SCC 26 (CanLII)\n\n--- Page 78 ---\n \n sentence fo r luring proceeding by summary conviction under s.  172.1(2)(b), pursuant \nto s. 12 of the Charter . \n[112]  The sentencing judge at the Court of Québec imposed a sentence of \n2 years’ probation and 150 hours of community service reasoning that this conduct fell \nat the lower end of the moral blameworthiness scale and thus warranted a probationary \nsentence. Since the six -month mandatory minimum sentence would be grossly \ndisproportionate to this sentence, it infringed s.  12 of the Charter  and the judge \ndeclared it inoper able in regards to H.V",
    "token_count": 1000,
    "start_token": 33300,
    "end_token": 34300,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 38,
    "source_file": "2023scc26.txt",
    "text": " The sentencing judge at the Court of Québec imposed a sentence of \n2 years’ probation and 150 hours of community service reasoning that this conduct fell \nat the lower end of the moral blameworthiness scale and thus warranted a probationary \nsentence. Since the six -month mandatory minimum sentence would be grossly \ndisproportionate to this sentence, it infringed s.  12 of the Charter  and the judge \ndeclared it inoper able in regards to H.V. On appeal, the Superior Court of Quebec (2021 \nQCCS 837) allowed the appeal, set aside the sentence and replaced it with a sentence \nof four months’ imprisonment (which was reduced to 90 days’ imprisonment to be \nserved intermittently to account for time served). This was because, among other \nthings, the sentencing judge erred regarding the principle of parity of sentences when \nhe relied on outdated jurisprudence in luring cases which ignored the trend towards \nincreased length of senten ces for these types of offences. This error in principle led the \njudge to impose a conditional sentence which constituted a marked departure from \nsentences usually inflicted in luring cases even before the release of Friesen  and \nMontour . The Superior Court  also noted errors in the sentencing judge’s analysis of \naggravating and mitigating factors which further justified its intervention in order to \ndetermine the appropriate sentence of four months’ imprisonment. The court then \ndetermined that the six -month m andatory minimum sentence was not grossly \ndisproportionate to H.V.’s sentence, but would be grossly disproportionate when \napplied to reasonably foreseeable scenarios. The Quebec Court of Appeal dismissed \n2023 SCC 26 (CanLII)\n\n--- Page 79 ---\n \n the appeal. It found no error with respect to a four -month custodial sentence and agreed \nwith the court below that the mandatory minimum sentence was unconstitutional (2022 \nQCCA 16). I accept that the fit and proportionate sentence for H.V. is four months’ \nimprisonment.  \n[113]  For his part, H.V. did not argue tha t the six -month mandatory minimum \noutlined in s.  172.1(2)(b) is grossly disproportionate when applied to his circumstances \n(see R.F., at para.  21). Instead, he argued here and in the courts below that the \nmandatory minimum sentence imposes a cruel and unus ual punishment, thereby \nviolating s.  12 of the Charter , when applied to reasonably foreseeable scenarios. I agree \nwith H.V. that the six -month term of imprisonment required as a result of the \nmandatory minimum is not grossly disproportionate to the fit sen tence of four months’ \nimprisonment. Given that neither the sentence for Mr.  Bertrand Marchand nor H.V. is \ngrossly disproportionate, I will review reasonable hypothetical scenarios to determine \nwhether the mandatory minimum sentences are unconstitutional.  \nB. The Reasonably Foreseeable Scenarios Advanced  \n[114]  This Court recently affirmed in Hills that punishments can be impugned \nwhere they infringe the s.  12 Charter  rights of a reasonably foreseeable offender \n(para.  68). To foreclose this option would “artificially constrain the inquiry into the \nlaw’s constitutionality” ( Nur, at para.  49). The use of representative offenders is “at the \nprotected core of the s.  12 analysis” ( Hills , at para.  71; see also Nur, at paras. 47 and \n49-50). As such, when parties raise hypothe tical scenarios as part of the adversarial \n2023 SCC 26 (CanLII)\n\n--- Page 80 ---\n \n process, a court should not dismiss a constitutional challenge without considering  (1) \nwhether the scenario is, in fact, reasonably foreseeable and, if so, (2) whether the \nrepresentative offender’s scenario could render the impugned law unconstitutional.  \n[115]  Both Mr.  Bertrand Marchand and H.V. proffered several hypothetical \nscenarios in the courts below that they argue render the mandatory minimum sentences \nunconstitutional. They are raised again here. Mr.  Bertrand Ma rchand referenced the \nfacts of the representative offender considered by the Nova Scotia Court of Appeal in \nHood . All parties in Mr.  Bertrand Marchand’s appeal agreed this scenario was \nreasonably foreseeable. During the hearing for H.V., I raised a scenari o inspired by the \nfacts of R. v. John , 2018 ONCA 702, 142 O.R. (3d) 670. I amended it to ensure the \nfacts make out the luring offence. This",
    "token_count": 1000,
    "start_token": 34200,
    "end_token": 35200,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 39,
    "source_file": "2023scc26.txt",
    "text": "facts of the representative offender considered by the Nova Scotia Court of Appeal in \nHood . All parties in Mr.  Bertrand Marchand’s appeal agreed this scenario was \nreasonably foreseeable. During the hearing for H.V., I raised a scenari o inspired by the \nfacts of R. v. John , 2018 ONCA 702, 142 O.R. (3d) 670. I amended it to ensure the \nfacts make out the luring offence. This Court’s reasons in Hills direct that hypothetical \nscenarios are best tested through the adversarial process (para.  93). As such, I put the \nscenario to the appellants and the contours of the scenario were discussed during the \nhearing. While both Mr.  Bertrand Marchand and H.V. make reference to other \nreasonably foreseeable scenarios, I am of the view that the scenarios id entified in Hood \nand John are dispositive of the s.  12 analysis.  \n[116]  For the purposes of the constitutionality analysis for the one -year \nmandatory minimum sentence as outlined in s.  172.1(2)(a), the first scenario is as \nfollows:  \n2023 SCC 26 (CanLII)\n\n--- Page 81 ---\n \n  The representative offender is a first -year high school teacher in her \nlate 20s with no criminal record. The offender has been diagnosed with \nbipolar disorder. One evening, she texts her 15 -year-old student to \ninquire about a school assignment. Feeling man ic, she directs the \nconversation from casual to sexual. The two meet that same evening in \na private location where they both participate in sexual touching. The \noffender does not engage inappropriately with the student on any \nfurther occasions. The offende r pleads guilty and expresses remorse on \nsentencing. See Hood , at para.  150. \n[117]  Mr. Bertrand Marchand also proffered this scenario at the Court of Appeal \nfor the panel’s consideration. Because the majority agreed with the sentencing judge \nthat s.  172.1(2)(a) was unconstitutional as applied to Mr.  Bertrand Marchand, it did not \nconsider this scenario. With respect to the dissenting judge, his refusal to consider any \nscenario advanced by Mr.  Bertrand Marchand as part of his constitutionality analysis \nwas in error . \n[118]  As noted above, this scenario was also previously considered by the Nova \nScotia Court of Appeal in Hood . The court found this scenario was reasonable and not \nremote or far -fetched. The hypothetical offender in the scenario in Hood  was loosely \nbased on th e offender, Ms.  Hood, herself: both were teachers diagnosed with bipolar \ndisorder. However, rather than engaging with several victims as was the case for \nMs. Hood, the representative offender only engaged in luring on one occasion with one \n2023 SCC 26 (CanLII)\n\n--- Page 82 ---\n \n victim. I agree with the Nova Scotia Court of Appeal that this hypothetical scenario is \nnot far -fetched and falls squarely within the scope of the offence, albeit on the less \nserious end of offending behaviour (para.  152). The scenario does not run afoul of this \nCourt’s d irection in Hills that the personal characteristics of representative offenders \nshould not be tailored to create far -fetched examples (para.  78). The court misspoke, \nhowever, by describing a portion of the offending conduct as “fond[ling]” ( Hood , at \npara.  150), because describing sexual violence against children in this way incorrectly \nimplies the behaviour is “inherently less harmful than other forms of sexual violence” \n(Friesen , at para.  144). I have revised the scenario accordingly. With this revision, t he \nfirst scenario is reasonably foreseeable. The appellants in Mr.  Bertrand Marchand’s \nappeal conceded the same during oral argument.  \n[119]  For the purposes of the constitutionality analysis for the six -month \nmandatory minimum sentence as outlined in s.  172.1(2) (b), the second scenario is as \nfollows:  \n The representative offender is an 18 -year-old who is in a romantic and \nsexual relationship with a 17 -year-old. In one text, the offender asks \nher to send him an explicit photo. She does, and he then forwards that \nphoto to his friend without his girlfriend’s knowledge. This friend, who \nis also 18, does not transmit this photo to anyone, but retains it on his \nmobile phone. See John , at para.  29. \n2023",
    "token_count": 1000,
    "start_token": 35100,
    "end_token": 36100,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 40,
    "source_file": "2023scc26.txt",
    "text": " offender is an 18 -year-old who is in a romantic and \nsexual relationship with a 17 -year-old. In one text, the offender asks \nher to send him an explicit photo. She does, and he then forwards that \nphoto to his friend without his girlfriend’s knowledge. This friend, who \nis also 18, does not transmit this photo to anyone, but retains it on his \nmobile phone. See John , at para.  29. \n2023 SCC 26 (CanLII)\n\n--- Page 83 ---\n \n [120]  This scenario is inspired by one approved by the court in John . In that cas e, \nthe Ontario Court of Appeal considered the constitutionality of the then six -month \nmandatory minimum sentence for possession of child pornography (s.  163.1(4)(a)) \npursuant to s.  12 of the Charter . The scenario proffered involved an 18 -year-old whose \nfriend forwards him a “sext” from the friend’s 17 -year-old girlfriend without her \nknowledge (para.  29). Specifically, the court found that the scenario is reasonable \nbecause it falls outside the private use exception outlined in  Sharpe  and would thereby \nattract criminal liability ( John , at para.  38). The court ultimately found the mandatory \nminimum in that case would be grossly disproportionate for this hypothetical offender \nand it was declared of no force or effect. The scenario I proposed for luring also fal ls \noutside the private use exception outlined in Sharpe because the exception does not \napply to the publishing or distributing of child pornography (see Sharpe , at para.  117). \nHere the representative offender, the boyfriend, distributed the child pornograp hy to a \nthird party, his friend, contrary to s.  163.1(3) of the Criminal Code .  \n[121]  This scenario makes out the constituent elements of the offence of luring \nand is reasonable in view of the range of conduct captured by the luring offence (see \nHills , at para.  82). Section 163.1(3) is one of the secondary offences referenced in \ns. 172.1(1)(a). The representative offender in this scenario texted his underage \ngirlfriend with the purpose of facilitating the secondary offence of distributing child \npornography (s.  163.1(3)). Further, though the scenario falls at the less serious end of \nthe spectrum of conduct captured by the child luring offence, I find that it is reasonably \nforeseeable. Teenagers do send one another sexualized photos involving partial nudity \n2023 SCC 26 (CanLII)\n\n--- Page 84 ---\n \n (see L.  Karaian and D.  Brady, “Revisiting the ‘Private Use Exception’ to Canada’s \nChild Pornography Laws: Teenage Sexting, Sex -Positivity, Pleasure, and Control in \nthe Digital Age” (2019), 56 Osgoode Hall L.J.  301, at p.  306). In fact, the practice is \ncommonplace enough that the term “sexting” has gained mainstream recognition. As \nwell, at the hearing, counsel for the appellant His Majesty the King conceded that this \nscenario was reasonably foreseeable.  \nC. A Fit Sentence for the Representative Offenders  \n[122]  In addressing  the first stage of the s.  12 analysis and in setting the fit and \nproportionate sentence for the particular or representative offender,  courts must define \nas specific a sentence as possible ( Hills , at para.  94). “Scrupulously selecting a precise \nand define d sentence also supports an analytically fair and principled result at the \nsecond stage of the s.  12 inquiry” (para.  65). The comparative exercise central to the \ngross disproportionality analysis requires careful adherence to established sentencing \nprincip les in the first stage. To determine the fit and proportionate sentence for the \nrepresentative offenders at bar, the Court must consider the sentencing objectives as set \nout in ss.  718 and following  of the Criminal Code . Any court determining a fit sentenc e \nfor a representative offender must examine any aggravating and mitigating factors at \nplay and exercise restraint in imposing terms of incarceration (s.  718.2(d) and (e)). \nSentencing judges and appellate courts must not magnify aggravating factors or narr ow \nmitigating ones to reach desired conclusions.  \n2023 SCC 26 (CanLII)\n\n--- Page 85 ---\n \n [123]  Section  718.1 directs that sentences “must be proportionate to the gravity \nof the offence and the degree of responsibility",
    "token_count": 1000,
    "start_token": 36000,
    "end_token": 37000,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 41,
    "source_file": "2023scc26.txt",
    "text": " factors at \nplay and exercise restraint in imposing terms of incarceration (s.  718.2(d) and (e)). \nSentencing judges and appellate courts must not magnify aggravating factors or narr ow \nmitigating ones to reach desired conclusions.  \n2023 SCC 26 (CanLII)\n\n--- Page 85 ---\n \n [123]  Section  718.1 directs that sentences “must be proportionate to the gravity \nof the offence and the degree of responsibility of the offender”. Additionally, s.  718.01 \ndirects judges to give primary considerat ion to denunciation and deterrence when \nsentencing offences involving abuse against children. At the same time, judges do \nretain judicial discretion to weigh other relevant sentencing objectives in the \ncircumstances. Courts must individualize the sentence by accounting for the gravity of \nthe offence, the offender’s individual circumstances and the offender’s moral \nculpability ( R. v. Parranto , 2021 SCC 46, at para.  44; Lacasse , at para.  12; R. v. Ipeelee , \n2012 SCC 13, [2012] 1 S.C.R. 433, at para.  51). Even where Parliament has directed \nthat the objectives of denunciation and deterrence are paramount at sentencing, judges \nmust apply all the principles mandated by ss.  718.1 and 718.2 to craft a sentence that \n“furthers the overall objectives of sentencing” ( Ipeelee, at para.  51). Deference to \nParliament’s objectives is not unlimited; to ensure respect for human dignity, the door \nto rehabilitation must remain open ( Bissonnette , at paras.  46 and 85; Hills , at \nparas.  140-41; Nasogaluak , at para.  43).  \n(1) A Fit Sentenc e for Luring in the First Reasonably Foreseeable Scenario  \n[124]  In Hood , when the Nova Scotia Court of Appeal considered a scenario \nsimilar to that of the first scenario proffered here, it concluded that the hypothetical \ncrime would likely attract a suspended se ntence with probation or, at most , a brief \nperiod of incarceration (para.  154). Instead the court found that a global fit sentence for \nthe representative offender would be a suspended sentence with a term of probation. \n2023 SCC 26 (CanLII)\n\n--- Page 86 ---\n \n However, Hood was decided before this  Court’s decision in Friesen . The fit sentence \nassigned by the Court of Appeal in Hood is not reflective of the directive from Friesen \nthat sexual offences against children are violent crimes that “wrongfully exploit \nchildren’s vulnerability” and as such “ [s]entences for these crimes must increase” \n(para.  5). Interestingly, in Friesen , this Court cited Hood  as an example of an offender \nwhose serious cognitive limitations would likely reduce her moral culpability at \nsentencing (para.  91). \n[125]  In the unique circu mstances of this hypothetical scenario, the inherent \nwrongfulness and severity of the offence must be balanced against the offender’s \nmental illness, remorse, and prospects of rehabilitation. A fit sentence for the luring \noffence committed by the represent ative  offender in the first scenario is a 30 -day \nintermittent sentence.  \n[126]  The representative offender is a high school teacher in her late 20s who \ncommitted a serious breach of her professional duties and inappropriately directed a \nconversation with her 15 -year-old student towards sexual matters with the intention of \nfacilitating the secondary offence under s.  151 of the Criminal Code . Although this \nteacher would presumably be relatively junior as compared to her colleagues, she holds \na position of trust and  authority in relation to her student per s.  718.2(a)(iii). A breach \nof trust is “likely to increase the harm to the victim and thus the gravity of the offence” \n(Friesen , at para.  126). The severity of such a breach is not to be taken lightly: teachers \nare entrusted to educate and serve as role models for children, not to sexualize them for \n2023 SCC 26 (CanLII)\n\n--- Page 87 ---\n \n their own purposes. In this case in particular, the representative offender exploited her \nposition of authority in the commission of the offence, including by using her \nrelationship to the victim to gain access by texting him under the guise of discussing \nhomework. This element increases her moral blameworthiness and serves as an \naggravating factor. As well, the wide age gap between the offender",
    "token_count": 1000,
    "start_token": 36900,
    "end_token": 37900,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 42,
    "source_file": "2023scc26.txt",
    "text": "ize them for \n2023 SCC 26 (CanLII)\n\n--- Page 87 ---\n \n their own purposes. In this case in particular, the representative offender exploited her \nposition of authority in the commission of the offence, including by using her \nrelationship to the victim to gain access by texting him under the guise of discussing \nhomework. This element increases her moral blameworthiness and serves as an \naggravating factor. As well, the wide age gap between the offender and the victim is \nfurther aggravating: as the offender was in her late 20s, there is at least a 10 -year age \ndifference.  \n[127]  At the same time, it is important to acknowledge that while the \nrepresentative offender’s conduct was serious, it likely falls at the lower end of the \nrange of g ravity in all the circumstances. All offences of this type have the potential to \ncause substantial harm to victims. However, it remains significant that this offender’s \nactions were spontaneous and of short duration, rather than malicious and calculated. \nUnlike in many other child luring cases that are typically associated with prolonged \ncontact, and thereby far greater harm, in this case there is no evidence of grooming or \nlong term planning. While these factors are not mitigating, they do provide insight into \nthe overall gravity of the offence and culpability of the offender, which is \ncomparatively lower than in other cases. It is well established that spontaneous or spur \nof the moment crimes should be punished less severely than planned or premeditated \nones (see, e.g., R. v. Laberge  (1995), 165 A.R. 375 (C.A.), at para.  18; R. v. Murphy , \n2014 ABCA 409, 593 A.R. 60, at para.  42; R. v. Vienneau , 2015 ONCA 898, at para.  12 \n(CanLII)).  Furthermore, the representative offender entered a guilty plea, expressed \n2023 SCC 26 (CanLII)\n\n--- Page 88 ---\n \n remorse on sentencing and has no prior criminal record — all of which are significant \nmitigating factors.  \n[128]  Finally, in assessing the offender’s moral culpability, it is significant that \nthe representative offender in the first scenario was diagnosed with bip olar disorder \nand her symptoms were similar to the actual offender described in Hood . At trial, \nMs. Hood’s criminal responsibility was an issue of real controversy ( R. v. Hood , 2016 \nNSPC 19, 371 N.S.R. (2d) 324; see also the reasons for sentence in R. v. H ood, 2016 \nNSPC 78). Although the trial judge did find her to be criminally responsible, he \naccepted that Ms.  Hood experienced bipolar disorder type I. As a result, Ms.  Hood’s \n“mania rendered her profoundly disinhibited and prone to risk taking, elevated by  a \nsense of invincibility, and impaired by defective insight and inhibition” (( Hood \n(sentencing reasons), at para.  55 (CanLII)) . The sentencing judge in Hood found that \nher symptoms had “a nexus with her crimes” (para.  55). Similarly, in the instant case \nthe representative offender’s bipolar diagnosis, though it serves as no justification or \nexcuse for her behaviour, attenuates her degree of responsibility and acts as a mitigating \nfactor on sentencing ( R. v. Ayorech , 2012 ABCA 82, 522 A.R. 306, at paras.  10-13; R. \nv. Tremblay , 2006 ABCA 252, 401 A.R. 9, at para.  7; R. v. Belcourt , 2010 ABCA 319, \n490 A.R. 224, at para.  8; R. v. Resler , 2011 ABCA 167, 505 A.R. 330, at para.  14). \nWhere a mental illness existed at the time of the offence and contributed to the \noffender’s behaviour, sentencing judges should consider prioritizing rehabilitation and \ntreatment through community intervention ( R. v. Lundrigan , 2012 NLCA 43, 324 Nfld. \n& P.E.I.R. 270, at paras.  20-21; R. v. Ellis , 2013 ONCA 739, 303 C.C.C. (3d) 228, at \n2023 SCC 26 (CanLII)\n\n--- Page 89 ---\n \n para.  117). This is especially the",
    "token_count": 1000,
    "start_token": 37800,
    "end_token": 38800,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 43,
    "source_file": "2023scc26.txt",
    "text": "reatment through community intervention ( R. v. Lundrigan , 2012 NLCA 43, 324 Nfld. \n& P.E.I.R. 270, at paras.  20-21; R. v. Ellis , 2013 ONCA 739, 303 C.C.C. (3d) 228, at \n2023 SCC 26 (CanLII)\n\n--- Page 89 ---\n \n para.  117). This is especially the case given that offenders with mental illnesses are \noften distinctly negatively affected by imprisonment (see Ruby, at §§5.325 and 5.332 ). \n[129]  Even so, while rehabilitation must be prioritized for this offender, a non -\ncustodi al sentence is not appropriate given the seriousness of the offence. In the result, \nI find a 30 -day intermittent sentence is a fit sentence for the representative  offender at \nbar. Such a sentence recognizes the inherent seriousness and potential harms asso ciated \nwith the offence and appropriately denounces her conduct, while also being mindful of \nher diminished moral blameworthiness and the mitigating factors at play.  \n(2) A Fit Sentence for Luring in the Second Reasonably Foreseeable Scenario  \n[130]  The representativ e offender in the second scenario engaged in a serious \nbreach of the victim’s privacy and dignity that should be condemned by a criminal \nsanction. However, the significant mitigating factors in this scenario warrant a sentence \non the low end of the spectru m. A fit sentence for the luring that the representative  \noffender in the second scenario engaged in is a conditional discharge.  \n[131]  The 18 -year-old offender texted his 17 -year-old girlfriend with the intent \nto wrongfully transmit a pornographic photo of her t o his friend. It is important to \nemphasize that this was far from an innocent communication: the basis for criminal \nliability is the accused’s intent to send the photo on to a person for whom it was not \nintended, as he could not have been convicted of luri ng if the photo was for his own \nprivate use (see  Sharpe ). The representative offender should have known that sharing \n2023 SCC 26 (CanLII)\n\n--- Page 90 ---\n \n a sexualized photo of his underage, adolescent partner with a third party was not only \nimpermissible, but harmful, particularly given the r isk that the photo could have been \ndistributed on to other recipients and could have thereby exposed the victim to bullying \nand sexual extortion (see A.  Carlton, “Sextortion: The Hybrid ‘Cyber -Sex’ Crime” \n(2020), 21:3 N.C. J.L. & Tech.  177, at p.  180). Eve n putting aside that this risk of further \ndistribution did not materialize, non -consensual distribution of an intimate image is \ninherently associated with loss of dignity and autonomy, and could lead to a profound \nsense of shame as well as reduced trust in  future romantic partners. In light of the \nseriousness of the representative offender’s behaviour at the expense of the adolescent \nvictim, a criminal sanction is warranted.  \n[132]  That said, the most significant mitigating factor in this second scenario is \nthat the offender is a youthful first offender. Although the 18 -year-old offender is \nlegally an adult and the 17 -year-old victim is not, without minimizing the impact of the \noffence on the victim, an appropriate sentence must account for the fact that both parties \nare young, close in age, and in a consensual relationship that shows no signs of the \nlong-term exploitation or grooming that is involved in many child luring cases. Similar \nto the representative  offender considered in Hills , the criminalized conduct in  this case \nindicates a lack of guidance or adult mentorship more than it does the offender’s \ncriminal intent (para.  161). Rehabilitation and individual deterrence are primary \nsentencing objectives when sentencing youthful first offenders. Even though an 18 -\nyear-old offender falls outside the scope of the youth criminal justice system, his lack \nof maturity remains an important consideration ( R. v. Priest  (1996), 30 O.R. (3d) 538 \n2023 SCC 26 (CanLII)\n\n--- Page 91 ---\n \n (C.A.), at pp.  543-44; R. v. Tan , 2008 ONCA 574, 268 O.A.C. 385, at para.  32; R. v. \nT. (K.), 2008 ONCA 91, 89 O.R. (3d) 99, at paras. ",
    "token_count": 1000,
    "start_token": 38700,
    "end_token": 39700,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 44,
    "source_file": "2023scc26.txt",
    "text": " (3d) 538 \n2023 SCC 26 (CanLII)\n\n--- Page 91 ---\n \n (C.A.), at pp.  543-44; R. v. Tan , 2008 ONCA 574, 268 O.A.C. 385, at para.  32; R. v. \nT. (K.), 2008 ONCA 91, 89 O.R. (3d) 99, at paras.  41-42). It is crucial that all other \ndispositions be explored before imposing custodial sentences on youthful first \noffenders ( R. v. Stein (1974), 15 C.C.C. (2d) 376 (Ont. C.A.), at p.  377).  \n[133]  Here, a co nditional discharge with strict probationary terms would serve  \nthe objectives of deterrence and denunciation. By contrast, a custodial sentence would \nbe disproportionate and would not reflect the reduced degree of responsibility of a \nyouthful first offende r who would primarily benefit from re -education, not excess \npunishment . As a result, I would sentence this representative offender to a six -month \nconditional discharge with probation.  \nD. The Mandatory Minimum Penalties Are Grossly Disproportionate to the Fit  \nSentences for the Representative Offenders  \n(1) Scope and Reach of the Offence  \n[134]  The scope and reach of the luring offence renders it constitutionally \nsuspect. The jurisprudence instructs that where a mandatory minimum sentence \ncaptures disparate conduct of wide ly varying gravity and degrees of offender \nculpability, it may be more vulnerable to constitutional challenge ( Hills , at para.  125; \nLloyd , at para.  24; Smith , at p.  1078). This Court noted in Lloyd that mandatory \nminimum penalties for offences “that can be  committed in many ways and under many \ndifferent circumstances by a wide range of people are constitutionally vulnerable” \n2023 SCC 26 (CanLII)\n\n--- Page 92 ---\n \n (para.  3). This is because when an offence is inordinately broad, the mandatory \nsentence may be proportionate or permissible for most offenders, but grossly \ndisproportionate for other offenders who are far less culpable or whose conduct is far \nless harmful ( Nur, at para.  83; Hills , at para.  125). As part of this analysis, courts should \nassess how broad a range of conduct is captured by t he actus reus and mens rea of the \noffence and consider the included degree of variation in the offence’s gravity and the \noffender’s culpability ( Hills , at para.  129). While Parliament is not precluded from \nlegislating mandatory minimum sentences, Parliamen t must not mandate grossly \ndisproportionate sentences that subject any offender to cruel and unusual punishment.  \n[135]  The three elements of child luring pursuant to s.  172.1 are: (1) the accused \ncommunicated intentionally by telecommunication; (2) with someone  the accused \nknows or believes is under 18 years of age (or 16 or 14, depending on the applicable \nparagraph); and (3) the accused’s communication was for the specific purpose of \nfacilitating the commission of a designated secondary offence with respect to the \nunderage person ( Legare , at para.  36; Levigne , at para.  23). In the context of a police \n“sting” operation, where the complainant is not in fact a child, the knowledge/wilful \nblindness element is replaced by the accused’s belief  that their interlocutor is a child.  \n[136]  The actus reus  of child luring includes communication with the \ncomplainant by means of telecommunications. The term “telecommunications” is \ndefined in s.  35(1) of the Interpretation Act  as “the emission, transmission or reception \nof signs, sign als, writing, images, sounds or intelligence of any nature by any wire, \n2023 SCC 26 (CanLII)\n\n--- Page 93 ---\n \n cable, radio, optical or other electromagnetic system, or by any similar technical \nsystem”. As an inchoate offence, child luring stands separate and apart from the \ndesignated secondary  offences. Moreover, it attaches to a broad range of secondary \noffences, and “can be committed in various ways, under a broad array of \ncircumstances” ( Morrison , at para.  179, per Karakatsanis  J., concurring). In the context \nof the luring offence,",
    "token_count": 1000,
    "start_token": 39600,
    "end_token": 40600,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 45,
    "source_file": "2023scc26.txt",
    "text": " other electromagnetic system, or by any similar technical \nsystem”. As an inchoate offence, child luring stands separate and apart from the \ndesignated secondary  offences. Moreover, it attaches to a broad range of secondary \noffences, and “can be committed in various ways, under a broad array of \ncircumstances” ( Morrison , at para.  179, per Karakatsanis  J., concurring). In the context \nof the luring offence, “facilita ting” means “helping to bring about and making easier or \nmore probable” ( Legare , at para.  28 (emphasis deleted)).  \n[137]  Relying on Paradee , the intervener the Attorney General of Alberta argues \nthat the mens rea  for child luring is narrow and specific. In its v iew, the Crown must \nprove that the accused subjectively foresaw that the luring communication would \nfacilitate an offence involving abuse of a child and that the accused acted with the \nintention to facilitate that goal. In Paradee , the Court of Appeal of A lberta stated that \nluring “involves pre -meditated conduct specifically designed to engage an underage \nperson in a relationship with the offender, with the goal of reducing the inhibitions of \nthe young person so that he or she will be prepared to engage in further conduct that is \nnot only criminal but extremely harmful” (para.  12). Similarly, this Court has \npreviously discussed child luring by reference to “predators lurking in cyberspace, \ncloaked in anonymity, using online communications as a tool for meeti ng and grooming \nchildren with a view to sexually exploiting them” ( Morrison , at para.  2). \n[138]  However, common characteristics of an offence should not be conflated \nwith its essential elements. While the luring offence certainly captures the mental states \n2023 SCC 26 (CanLII)\n\n--- Page 94 ---\n \n descr ibed in Paradee , they are not part of its requisite mens rea . Pre -meditation or \nplanning may not always be present where the elements of child luring are made out. \nAn accused may impulsively communicate in a sexual manner — and in that moment  \nhave the spec ific intent required to ground a conviction for child luring — without \nhaving taken time beforehand to plan, contemplate, or prepare to execute a secondary \noffence. Neither does “grooming” necessarily accompany the commission of the child \nluring offence. E vidence of grooming may often be present where child luring is made \nout, but it is not a required element.  \n[139]  In this way, the specific intent element — that the accused must \ncommunicate with the purpose of facilitating a designated offence — is not narrow bu t \nbroad. Section  172.1(1) captures a wide range of designated illicit purposes with \nvarying degrees of moral culpability. For example, the jurisprudence demonstrates that \noffenders with developmental disabilities, though less morally blameworthy, are often  \nconvicted of child luring ( Melrose ; Deren ; R. v. S.  (S.), 2014 ONCJ 184, 307 C.R.R. \n(2d) 147). In Morrison , Justice Karakatsanis noted that s.  172.1(2)(a) is vulnerable to \nconstitutional challenge because “[t]he range of conduct that constitutes an offenc e \nunder this section is extremely broad” (para.  181).  \n[140]  As mentioned above, the luring offence is triggered by the use of any \ntelecommunication platform. This includes any and all internet platforms, be it \nFacebook, Instagram, TikTok, Snapchat, Twitch, Hing e, Tinder or other popular \nmessaging, streaming or dating applications. Not only does this demonstrate the \n2023 SCC 26 (CanLII)\n\n--- Page 95 ---\n \n massive breadth of the luring offence, it also raises the issue of the medium and its \neffect on the message. For example, certain online applications  require users to indicate \nthey are the age of the majority and old enough to be present on the platform. However, \nthis requirement can be bypassed by underage users with the click of a button. Or, as \nwas the case in Koenig , adult users who use internet sites not designed for predatory \npurposes may wrongfully engage in conversation with a minor that constitutes luring \nwithout making best efforts to verify the age of other users they engage with online.  \n[141]  This is not to say that individuals who engage sexual ly with children online \nare not morally blameworthy. However, in",
    "token_count": 1000,
    "start_token": 40500,
    "end_token": 41500,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 46,
    "source_file": "2023scc26.txt",
    "text": " requirement can be bypassed by underage users with the click of a button. Or, as \nwas the case in Koenig , adult users who use internet sites not designed for predatory \npurposes may wrongfully engage in conversation with a minor that constitutes luring \nwithout making best efforts to verify the age of other users they engage with online.  \n[141]  This is not to say that individuals who engage sexual ly with children online \nare not morally blameworthy. However, in certain cases the impugned conduct may \nnot rightly attract jail time. In Koenig , Justice Skilnick noted that “the Accused is not \nthe typical offender that Parliament had in mind when it passe d its legislation. He did \nnot seek out or attempt to “lure” a child, and in fact his communications were on a \nwebsite that does not allow the user to pick the person he is communicating with” \n(para.  5 (CanLII)).  \n[142]  The child luring offence also, rightly, pun ishes both offenders who \ncommunicate with actual children and offenders who ultimately communicate with \npolice officers posing as children through sting operations. In Friesen , this Court noted \nthat though the absence of a specific child victim should not be overemphasized in \nsetting a fit sentence, it remains relevant to the proportionality analysis (para.  93). In \nthis way, this Court acknowledged a material difference between the two main ways \nchild luring may be committed: where the offender  is actually communicating with an \n2023 SCC 26 (CanLII)\n\n--- Page 96 ---\n \n underage person versus where the offender is under the impression he is \ncommunicating with someone underage but in actuality is communicating with law \nenforcement. This further demonstrates the provision’s breadth.  \n[143]  The range of conduc t captured is staggering. Notably, the offender need \nnot actually commit any secondary offence. He need only communicate with an \nunderage person for the purpose of facilitating one of the twenty secondary offences \nincluding: sexual exploitation (s.  153(1)) , incest (s.  155), child pornography (s.  163.1), \nprocuring sexual activity (parent or guardian) (s.  170), permitting prohibited sexual \nactivity (householder) (s.  171), trafficking of persons under 18 (s. 279.011), receiving \nbenefit from the trafficking of persons under 18 (s. 279.02(2)), withholding or \ndestroying travel documents in service of trafficking persons under 18 (s. 279.03(2)), \nobtaining sexual services for consideration from a person under 18 (s. 286.1(2)), \nreceiving materials benefit from the se xual services provided by a person under 18 \n(s. 286.2(2)), procuring a person under 18 to provide sexual services (s.  286.3(2)), \nsexual interference (s.  151), invitation to sexual touching of a person under 18 (s. 152), \nbestiality in the presence of or by a child (s.  160(3)), exposure to a person under 16 \n(s. 173(2)), sexual assault of a person under 16 (s.  271), sexual assault with a weapon \nof a person under 16 (s.  272), aggravated sexual assault of a person under 16 (s.  273), \nabduction of a person under 1 6 (s. 280), and abduction of a person under 14 (s.  281). \nIn turn, while all of the secondary offences have the potential to cause devastating harm \nto victims and typically warrant harsh sentences, those offences are, amongst \nthemselves, of varying degrees of seriousness, and the scope of several of them is also \n2023 SCC 26 (CanLII)\n\n--- Page 97 ---\n \n wide. These features of the luring offence further threaten the constitutionality of its \nmandatory penalties.  \n[144]  Lower courts have increasingly noted that the luring offence applies to a \nwide range of c onduct and captures varying degrees of moral blameworthiness ( R. v. \nSaffari , 2019 ONCJ 861, at para.  88 (CanLII); Sutherland , at para.  47). This was also \npreviously recognized by Justice Karakatsanis in her concurring reasons in Morrison . \nThere, Justice Ka rakatsanis explained that the purpose of the luring can vary: offenders \nmight use the internet to “target children for the purpose of physically exploiting them” \nor offenders",
    "token_count": 1000,
    "start_token": 41400,
    "end_token": 42400,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 47,
    "source_file": "2023scc26.txt",
    "text": " v. \nSaffari , 2019 ONCJ 861, at para.  88 (CanLII); Sutherland , at para.  47). This was also \npreviously recognized by Justice Karakatsanis in her concurring reasons in Morrison . \nThere, Justice Ka rakatsanis explained that the purpose of the luring can vary: offenders \nmight use the internet to “target children for the purpose of physically exploiting them” \nor offenders might have “no intention of meeting their victims in person” (para.  182). \nSimilar ly, the duration of the communications can vary: some cases may involve \n“extended dialogue with the victim in order to ‘groom’ him or her” but other cases \nmight involve “a short series of messages lasting only a few minutes” or even “a single \ntext” (para.  182). Finally, she noted that the communications could be between the \noffender and an actual child, or between an offender and a police officer conducting a \nsting operation. Justice Karakatsanis aptly noted that this range of conduct and of moral \nblamewort hiness “may impact the level of harm caused by the offence, thereby \ninforming what constitutes a fit and proportionate sentence” (para.  182).  \n[145]  An examination of the jurisprudence offers additional insight into the range \nof moral blameworthiness foreseeably  captured by s.  172.1. For example, the offender \nin Melrose , who pleaded guilty to offences including luring, was a developmentally \ndelayed adult aged 27 with an IQ that corresponded to the mental age of around a \n2023 SCC 26 (CanLII)\n\n--- Page 98 ---\n \n 9-year-old (para.  132). The victim was 13. The sentencing judge, Justice Renke, found \nthat the offender’s mental age was below the victim’s chronological age. The evidence \nrevealed that Mr.  Melrose was unable to anticipate the long -term consequences of his \nactions and the effect his actions may hav e on the underage victim (para.  145). The \nsentencing judge found that the offender “did not understand the types of harms risked \nby his conduct” and reasoned that Mr.  Melrose’s cognitive difficulties greatly reduced \nthe offender’s moral blameworthiness (pa ras. 229-32). Justice Renke noted that \nluring’s requirement that the offender attempt to “facilitate” a secondary offence “runs \nthe gamut from the impulsive (albeit still intentional) to the carefully calculated” \n(para.  331). Because proof of facilitation does not necessarily include proof of complex \nplanning, the luring offence can capture conduct that is bereft of sophistication or \nconsidered intention. In the result, the mens rea of the offence does not necessitate a \nhigh degree of moral blameworthiness and instead captures a broad range of culpable \nconduct.  \n[146]  Despite this breadth, the distinct harm of luring will, in many cases, rightly \nattract a term of imprisonment that falls within the range of the mandatory minimum \nsentence. This is because in many cas es the gravity of the offence is high: the harms \nare distinct and the conduct is inherently wrongful. As set out in Friesen and reiterated \nabove, luring involves sexual violence, carried out via the internet, and can cause \npervasive and permanent serious p sychological harm to victims (paras.  56-58 and 82). \nDespite the inherent gravity of the offence, the Court in Friesen directed that factors \nthat reduce the offender’s moral culpability remain relevant. Chief Justice Wagner and \n2023 SCC 26 (CanLII)\n\n--- Page 99 ---\n \n Justice Rowe, writing for a u nanimous Court, acknowledged that in the case of sexual \nassault and sexual interference committed against children, these are “broadly -defined \noffences that embrace a wide spectrum of conduct” so, as a result, “the offender’s \nconduct will be less morally b lameworthy in some cases than in others” (para.  91). The \nimpugned offence typifies this reality. The incredible breadth of offending conduct is \nnot reflected in the rigidity of the mandatory minimum sentence. While Parliament \nmust be afforded deference in crafting sentencing provisions, s.  12 of the Charter \nimposes certain constitutional limits ( Hills , at para.  140).  \n(2) The Effect of the Punishment on the Offenders  \n[147]  The effect of the punishment on both representative offenders in this case \nis harsh. This Court directed in",
    "token_count": 1000,
    "start_token": 42300,
    "end_token": 43300,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 48,
    "source_file": "2023scc26.txt",
    "text": "ifies this reality. The incredible breadth of offending conduct is \nnot reflected in the rigidity of the mandatory minimum sentence. While Parliament \nmust be afforded deference in crafting sentencing provisions, s.  12 of the Charter \nimposes certain constitutional limits ( Hills , at para.  140).  \n(2) The Effect of the Punishment on the Offenders  \n[147]  The effect of the punishment on both representative offenders in this case \nis harsh. This Court directed in Hills that the gross disproportionality analysis must \ninclude consideration of what material effects the mandatory minimum may have on \noffenders sub ject to it (para.  133). Courts must examine the particular characteristics \nof the individual offender before them or consider the qualities of the reasonably \nforeseeable offender, and then evaluate what harm may result from the impugned \npunishment. In the instant scenarios, the mandatory minimum punishment is \nalternatively 12 months’ or 6 months’ incarceration.  \n(a) The First Representative Offender  \n[148]  Evidence that imprisonment would have significant deleterious effects on \nan offender should be considered at this  stage ( Hills , at paras. 133 -35). The \n2023 SCC 26 (CanLII)\n\n--- Page 100 ---\n \n representative offender in the first scenario was diagnosed with bipolar disorder and \nher symptoms mirrored that of the actual offender described in Hood . In certain \ncircumstances, courts have found extended periods of  incarceration served in custody \ninappropriate for individuals with bipolar disorder and have instead ordered offenders \nto seek psychiatric care, attend treatment programs and/or serve their sentences in \ncommunity in lieu of a custodial sentence (see R. v.  Dickson , 2007 BCCA 561, 228 \nC.C.C. (3d) 450; R. v. Shevchenko , 2018 ABCA 31, at paras. 60 -63 (CanLII); R. v. \nVivian , 2001 ABQB 468, 289 A.R. 378, at para.  16; R. v. Sulek , 2011 ABPC 314, 21 \nM.V.R. (6th) 336; R. v. Legg , 2014 ABPC 238, 26 Alta. L.R. (6th) 181, at para.  28).  \n[149]  The Office of the Correctional Investigator has accepted that the conditions \nof confinement can be disproportionately harsh on individuals with mental disorders. \nThe carceral setting can induce or augment disordered symptoms and, in tur n, these \nsymptoms may be met with security -driven interventions that exacerbate mental health \nissues in offenders (see, e.g., Office of the Correctional Investigator, Annual Report \n2021 -2022 (2022), at p.  25; Office of the Correctional Investigator, A Lega cy of Missed \nOpportunities: The Case of Ashley Smith , November 23, 2011 (online)). Further, \nprisoners in certain federal institutions may wait up to 12 months before gaining access \nto mental health services (see Annual Report 2021 -2022 , at p.  14). In Ayore ch, the \noffender was diagnosed with schizophrenia and a developmental disorder. The Court \nof Appeal found that Mr.  Ayorech’s mental disorders left him vulnerable in an \ninstitutional setting and accepted the expert witness’ conclusion that the offender was \n“ill equipped to survive in the prison system” (para.  13).  \n2023 SCC 26 (CanLII)\n\n--- Page 101 ---\n \n [150]  Although the first representative offender is not developmentally delayed, \nseveral lower courts have struck mandatory minimums for luring or declined to apply \nthem  in the context of offenders with  severe developmental disabilities with a view to \nthe harsh impacts of imprisonment on these individuals (see Melrose ; Deren ; Fawcett ). \nIn Melrose , the sentencing judge found that the offender would be a “child among men” \nin a custodial setting and would b e taken advantage of by members of the institution’s \ngeneral population (para.  250). Justice Renke found that Mr.  Melrose “would be \nharmed, emotionally, psychologically, and likely physically, should he be sentenced to \nany significant period of imprisonmen t” (para.  250). Incarceration also has a \ndisproportionate effect on individuals with significant cognitive impairments by \ndisrupting the necessary supports that have been implemented to help these individuals \nlive a life of dignity. The sentencing judge in  Deren declined to impose the six -month \nmandatory",
    "token_count": 1000,
    "start_token": 43200,
    "end_token": 44200,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 49,
    "source_file": "2023scc26.txt",
    "text": " that Mr.  Melrose “would be \nharmed, emotionally, psychologically, and likely physically, should he be sentenced to \nany significant period of imprisonmen t” (para.  250). Incarceration also has a \ndisproportionate effect on individuals with significant cognitive impairments by \ndisrupting the necessary supports that have been implemented to help these individuals \nlive a life of dignity. The sentencing judge in  Deren declined to impose the six -month \nmandatory minimum for luring on an offender with severe developmental disabilities, \nin part because a jail sentence of that length would impact his access to Assured Income \nfor the Severely Handicapped, as well as hi s housing and limited employment \n(para.  70).  \n[151]  The effect of the one -year mandatory minimum on the first representative \noffender is harsh. Not only does it replace a short intermittent sentence with a year of \nincarceration, the offender’s individual circums tances would likely make her \nexperience of incarceration perilously grave. In R. v. Valiquette (1990), 60 C.C.C. (3d) \n325 (Que. C.A.), the court noted “most people understand that the mentally ill require \ntreatment and supervision, not punishment” (p.  331). Most often, mental illness is \n2023 SCC 26 (CanLII)\n\n--- Page 102 ---\n \n viewed as a mitigating factor at sentencing as it may reduce an offender’s moral \nculpability and sentencing judges recognize that offenders with mental disorders are \nparticularly affected by imprisonment (see Ruby). Each of these factors indicate the \nmandatory minimum’s constitutional infirmity.  \n(b) The Second Representative Offender  \n[152]  The second representative offender is a youthful offender — a group the \ncriminal law views as holding high rehabilitative prospects. The mandatory m inimum \nin the instance case would replace the fit sentence of a conditional discharge with a \nsubstantial custodial sentence (see also Hills , at para.  143). As a youthful first -time \noffender, the representative offender should benefit from the shortest poss ible sentence \nproportionate to the offence at issue ( see R. v. Brown , 2015 ONCA 361 , 126 O.R. (3d) \n797, at para.  7; R. v. Laine , 2015 ONCA 519 , 338 O.A.C. 264, at para.  85). Youthful \noffenders are often bullied, pressured to join adult prison gangs, and are vulnerable to \nsegregation placements ( Hills , at para.  165; Office of the Correctional Investigator and \nOffice of the Provincial Advocate for Children and Youth, Missed Opp ortunities: The \nExperience of Young Adults Incarcerated in Federal Penitentiaries  (2017)). The \nsix-month mandatory minimum in this case is a far cry from the shortest possible \nrehabilitative sentence for this offender.  \n(3) The Penalty and its Objectives  \n2023 SCC 26 (CanLII)\n\n--- Page 103 ---\n \n [153]  Lurin g is a serious offence that must be punished accordingly. The offence \ndovetails with s.  718.01 of the Criminal Code , which, as mentioned above,  directs that \nin imposing sentences for offences involving abuse of children, primary consideration \nmust be given  to the objectives of denunciation and deterrence. Parliament’s decision \nto increase the maximum penalties for the luring offence in 2015 as part of the Tougher \nPenalties for Child Predators Act further indicates Parliament’s view of the gravity of \nthe off ence. These legislative amendments should have an upward pull on sentences \nfor this offence, regardless of whether the mandatory minimum remains intact.  \n[154]  Parliament enacted s.  172.1 in response to the growth of the internet as a \nburgeoning domain for predat ors to target children ( Morrison , at paras.  1-3). The \naccess that sexual offenders have to children through social media is “unprecedented” \n(R. v. K.R.J. , 2016 SCC 31, [2016] 1 S.C.R. 906, at para.  102). Young people are \nperpetually available online throug h their smartphones, tablets, computers and other \nelectronic devices — all sites where they are vulnerable to being targeted.  \n[155]  Child luring not only lays the foundation for dangerous in -person criminal \noffences, it also causes its own distinct harm to chil d victims.  \n[156]  That being said, the attached mandatory minimum sentences go beyond \nwhat is necessary to achieve Parliament",
    "token_count": 1000,
    "start_token": 44100,
    "end_token": 45100,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 50,
    "source_file": "2023scc26.txt",
    "text": ".  102). Young people are \nperpetually available online throug h their smartphones, tablets, computers and other \nelectronic devices — all sites where they are vulnerable to being targeted.  \n[155]  Child luring not only lays the foundation for dangerous in -person criminal \noffences, it also causes its own distinct harm to chil d victims.  \n[156]  That being said, the attached mandatory minimum sentences go beyond \nwhat is necessary to achieve Parliament’s sentencing objectives. The offence’s wide \nnet of potential liability, while an asset for the preventative nature of the offence, also \nserves as the constitutional undoing of its penalties.  The broad nature of the offence \ncaptures a range of conduct with varying culpability. As a result, it thrusts a mandatory \n2023 SCC 26 (CanLII)\n\n--- Page 104 ---\n \n punishment on conduct far removed and disconnected from that which Parliament \nsought to prevent.  \n[157]  A comparison between the punishments imposed for several of the \nsecondary offences and the mandatory minimum for luring further reveals a significant \ndisproportion. While several of the 20 secondary offences associated with luring \nthemsel ves attract no mandatory minimum penalty, others may attract far lower \npenalties than either  mandatory minimum for the luring offence . For example, exposure \nprosecuted on summary conviction attracts a mandatory minimum of 30 days’ \nimprisonment (see s.  173(2)(b)). This is not to suggest that luring does not create its \nown distinct harm, but it is clear the range of conduct captured by the offence’s actus \nreus includes anything from years of careful grooming to a single online message to a \ncomplainant. It is striking that an impulsive message alone could attract a one -year term \nof imprisonment, while the offence the text attempted to facilitate could itself attract \nlittle to no incarceration.  \n[158]  In the case of both representative offenders, the length of impriso nment \nrequired by the mandatory minimum sentences is excessive in light of alternative \nsentences that would be sufficient to meet Parliament’s sentencing objectives. While a \none-year or six -month minimum term of imprisonment for child luring will not be \ngrossly disproportionate for most offenders, it is a severe punishment for certain \noffenders, particularly youthful offenders, offenders with mental disorders and those \nwith severe developmental disabilities. Where an offender’s mental illness contributes \n2023 SCC 26 (CanLII)\n\n--- Page 105 ---\n \n to the commission of the luring offence, specific deterrence, general deterrence and \ndenunciation are of little use because “such an offender is not an appropriate medium \nfor making an example of others” and because people with mental illnesses will likely \nnot be deterred by the punishment of others (Ruby, at §§5.316 -5.321 ; see Resler , at \npara.  14; R. v. Robinson (1974), 19 C.C.C. (2d) 193 (Ont. C.A.), at p.  197; Deren , at \npara.  65). Instead, rehabilitation should hold greater weight when sentencing mentally \nill offenders like the representative offender at bar ( R. v. Hynes  (1991), 89 Nfld. & \nP.E.I.R. 316 (N.L.C.A.), at para.  53). While this Court directed in Friesen that \nsentences for sexual offences against children should properly reflect the offender’s \nmoral blameworthiness, the Court also acknowledged that the personal circumstances \nof an offender can have a mitigating effect and reduce the offender’s moral culpability \n(para.  91).  \n[159]  In light of the reduced moral blameworthiness of mentally ill offenders, th e \nmandatory minimums in relation to the luring offence not only deprive courts of the \nability to tailor proportionate sentences at the lower end of the sentencing range when \nappropriate, they operate in the extreme to impose unjust sentences that violate t he \nprinciple of proportionality (see Nur, at para.  44). As a result, the mandatory sentences \ndemonstrate the “state’s complete disregard for the specific circumstances of the \nsentenced individual and for the proportionality of the punishment inflicted on t hem” \n(Bissonnette , at para.  61). Imposing six -months’ or one year’s incarceration on a \nmentally ill offender when the fit sentence is a relatively short intermittent sentence \ndoes not respect the fundamental principle of proportionality ( Nasogaluak , at par a. 40). \n2023 SCC 26 (CanLII)\n\n--- Page 106 ---\n \n Instead, it indicates Parliament has prioritized den",
    "token_count": 1000,
    "start_token": 45000,
    "end_token": 46000,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 51,
    "source_file": "2023scc26.txt",
    "text": " the proportionality of the punishment inflicted on t hem” \n(Bissonnette , at para.  61). Imposing six -months’ or one year’s incarceration on a \nmentally ill offender when the fit sentence is a relatively short intermittent sentence \ndoes not respect the fundamental principle of proportionality ( Nasogaluak , at par a. 40). \n2023 SCC 26 (CanLII)\n\n--- Page 106 ---\n \n Instead, it indicates Parliament has prioritized denunciation and deterrence to the near \ncomplete exclusion of rehabilitation. This Court noted in Hills that while deference is \nowed to Parliament’s sentencing choices, “[n]o single sentencing object ive should be \napplied to the exclusion of all others” (para.  140; Nasogaluak , at para.  43). \n[160]  Because intermittent sentences are only available for sentences of 90 days \nor less, the impugned mandatory minimum provides no discretion for courts to impose \na sen tence of this kind. While an intermittent sentence is a form of imprisonment, it is \nmaterially distinct from a full -time carceral sentence in that it allows offenders to serve \ntheir jail term in truncated periods while being subject to probation outside of  jail. An \nintermittent sentence prioritizes rehabilitation by allowing offenders to potentially \npreserve their employment, maintain familial and community ties and continue \nspecialized treatment that may not be available at a correctional institution. Here , the \nfact that the mandatory minimum does not permit courts to impose intermittent \nsentences where that sentence is the fit and proportionate sentence renders the provision \nconstitutionally suspect (see Hills , at para.  144).  \n[161]  Child luring is a hybrid offe nce, meaning that the Crown can choose, based \non factors such as the seriousness of the accused’s actions and the harm caused, to \nproceed either by indictment or summarily. In turn, that choice impacts the severity of \nthe sentence imposed, as the mandatory  minimum attached to a summary luring \nconviction is six -months rather than a year for luring proceeding by indictment. \nJustice  Karakatsanis noted that this legislative choice “clearly demonstrates that \n2023 SCC 26 (CanLII)\n\n--- Page 107 ---\n \n Parliament understood that, in certain circumstances, a sentence far below that required \nby the one -year mandatory minimum would be appropriate” ( Morrison , at para.  185). \nThe disparity between the two mandatory minimum sentences outlined in s.  172.1(2)(a) \nand (b) is disquieting.  \n[162]  The hybrid nature of the chil d luring offence cannot shield it from \nconstitutional scrutiny. This Court has found that an unconstitutional mandatory \nminimum cannot be saved by the Crown’s discretion to proceed summarily. Sentencing \nis a judicial function, while Crown prosecutors are i n an adversarial role to accused \npersons ( Nur, at paras.  85-86). For the impugned offence, there is no clear delineation \nbetween cases that proceed summarily versus cases that proceed by indictment. In R. \nv. C.D.R. , 2020 ONSC 645, the accused was caught by  a police sting operation and \npleaded guilty to, amongst other offences, child luring. The Crown confirmed that cases \nof a similar nature may proceed either summarily or by indictment — little \ndistinguished them (paras.  31-33 (CanLII)). Justice  De Sa right ly queried, “[h]ow can \na seemingly arbitrary imposition of an additional 6 months incarceration in this case \nnot be grossly disproportionate?” (para.  33).  \n[163]  Where a six -month sentence may be an appropriate sentence for a certain \nset of conduct but a one -year sentence is arbitrarily imposed instead, solely as a result \nof prosecutorial discretion, that leads to the same uncertainty and unpredictability in \nthe law that this Court attempted to guard against in R. v. Ferguson , 2008 SCC 6, [2008] \n1 S.C.R. 96 (see para.  72) and Nur (see para.  91). The Crown’s election should not \n2023 SCC 26 (CanLII)\n\n--- Page 108 ---\n \n determine whether an offender receives a fit sentence or an excessive sentence. This \naspect of the sentencing regime would be intolerable and shocking to Canadians (see \nSaffari , at para.  90; C.D.R. , at paras.  31-33 and 38).  \n[164]  Simply striking the one -year mandatory minimum and leaving the \nsix-month punishment intact presents its own set of related issues —",
    "token_count": 1000,
    "start_token": 45900,
    "end_token": 46900,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 52,
    "source_file": "2023scc26.txt",
    "text": "26 (CanLII)\n\n--- Page 108 ---\n \n determine whether an offender receives a fit sentence or an excessive sentence. This \naspect of the sentencing regime would be intolerable and shocking to Canadians (see \nSaffari , at para.  90; C.D.R. , at paras.  31-33 and 38).  \n[164]  Simply striking the one -year mandatory minimum and leaving the \nsix-month punishment intact presents its own set of related issues — including an issue \nof parity. If the summary conviction punishment remains, an individual may be charged \nsummarily for ostensibly less serious conduct than would be charged by indictment and \npotentially face a more serious punishment by virtue of the mandatory minimum. This \npotential outcome further highlights the difference between the role of  a sentencing \njudge and the role of a Crown prosecutor. It is the judge’s role to craft a fit and \nproportionate sentence in light of the circumstances of the offender and the gravity of \nthe offence after being presented with evidence of the offender’s back ground and \nindividual circumstances. In contrast, the Crown prosecutor is tasked with using their \ndiscretion to choose a path to conviction with little information about the offender’s \nindividual circumstances and while balancing other priorities. These in clude local \njudicial resources, considerations of delay and limitation periods, and the prospect of \nthe complainant potentially being required to testify twice, given that the 14 -year \nmaximum penalty for the luring offence when prosecuted by indictment tri ggers the \navailability of a preliminary hearing.  \n[165]  That arrangement would locate this offence squarely within a zone deemed \nproblematic by this Court in Nur. To accept this state of affairs could “result in \n2023 SCC 26 (CanLII)\n\n--- Page 109 ---\n \n replacing a public hearing on the constitutionalit y of [the provision] before an \nindependent and impartial court with the discretionary decision of a Crown prosecutor” \n(para.  86). It would create the potential for an “uneven and unequal application of the \nlaw” (para.  91) where an individual can face a fix ed mandatory minimum punishment \ninstead of a fit and proportionate sentence crafted by a judge, depending solely on a \ndiscretionary decision by the assigned Crown prosecutor. The public’s perception of \nthis imbalance may undermine its confidence in the adm inistration of justice.  \n[166]  The incredible breadth of the luring offence and its harsh effect on \nrepresentative offenders paired with the discordant internal scheme of the penalty \nrenders the mandatory minimums in s.  172.1(2) constitutionally infirm .  \n[167]  Let me be clear. Sexual offences against children are serious crimes and \noften warrant strict sanctions. For this reason, applying Friesen ’s principles to child \nluring will generally result in an increase in the sentences previously ascribed for these \ncrimes. However, there is no incongruity between affirming the severe wrongfulness \nand harms that often accompany child luring offences and finding the mandatory \nminimums ascribed to these sentences unconstitutional . Mandatory minimum \nsentences establish the lowes t possible punishment courts may render for the least \nculpable offender. They do not prevent judges from assigning lengthier sentences for \nmore blameworthy conduct. As such, striking the mandatory minimum sentence should \nnot disturb the effect that the max imum sentence has on sentencing outcomes. The \nguidance of Friesen on the primacy of denunciation and deterrence when sentencing \n2023 SCC 26 (CanLII)\n\n--- Page 110 ---\n \n offenders for sexual offences against children remains. Removal of the mandatory \nminimum should not drain the deterrent effect o f s. 172.1(2) any more than other \noffences where Parliament has directed denunciation and deterrence as primary \nsentencing objectives without assigning a mandatory minimum sentence.  \nV. Conclusion  \n[168]  Parliament is entitled to create criminal offences for broad purposes and \nwith wide applications. Similarly, it may prioritize deterrence and denunciation in the \ncrafting of fit and proportionate sentences and impose high maximum sentences to \nconvey its view of the gravity of a particular offence.  \n[169]  However, when it i mposes a mandatory minimum sentence for a given \noffence, which applies to all cases without discretion or discernment, it runs the risk of \ncreating a grossly disproportionate and unconstitutional penalty. Exceptionally broad \noffences, even inherently serio us ones, can be committed in a variety of ways and with \ndifferent levels of harm and moral culpability. A predatory adult who communicates \nby means of telecommunication over a long period of time to manipulate a child for \nthe purpose of facilitating one of  the secondary offences in s.  172.1(1",
    "token_count": 1000,
    "start_token": 46800,
    "end_token": 47800,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 53,
    "source_file": "2023scc26.txt",
    "text": " all cases without discretion or discernment, it runs the risk of \ncreating a grossly disproportionate and unconstitutional penalty. Exceptionally broad \noffences, even inherently serio us ones, can be committed in a variety of ways and with \ndifferent levels of harm and moral culpability. A predatory adult who communicates \nby means of telecommunication over a long period of time to manipulate a child for \nthe purpose of facilitating one of  the secondary offences in s.  172.1(1) may well merit \na custodial sentence considerably in excess of the mandatory minimum. On the other \nhand, there will be cases in which the gravity of the offence and the degree of moral \nblameworthiness of the offender m ay not merit a custodial sentence at all — and in \nwhich the public would be shocked to hear that a legislated period of imprisonment \nautomatically applies.   \n2023 SCC 26 (CanLII)\n\n--- Page 111 ---\n \n [170]  This Court’s decision in Friesen  demands a more robust understanding of \nthe wrongfulness and harms of luring, which will often yield greater penalties. \nHowever, given the enormous breadth of the luring offences, there will still be cases in \nwhich the mandatory minimum will be so out of sync with the realities of the gravity \nof the offence and the moral blameworthiness of the offender so as to shock the \nconscience of an informed public.  \n[171]  Indeed, despite strong statements in  Friesen  about the inherent \nwrongfulness and harmfulness of sexual violence against children, the Court expressly \ncautioned that their comments should not be taken as a direction to disregard relevant \nfactors that may reduce the offender’s moral culpability. The proportionality principle \nstill governs to require that “the punishment imposed be ‘just and appropriate .  . . and \nnothing more’ ” (para.  91, quoting M. (C.A.) , at para.  80 (emphasis deleted)).  \n[172]  For the above reasons, I would allow the appeal in Mr.  Bertrand \nMarchand’s case in part and increase Mr.  Bertrand Marchand’s luring sentence to \n12 months’ incarceration to be served consecut ively to his sexual interference sentence. \nBoth parties in that appeal have agreed that the remainder of the respondent’s sentence \nbe permanently suspended. Accordingly, I order a permanent stay of execution of the \nmodified sentence. I would affirm the con clusion in the courts below that the \nmandatory minimum sentence in s.  172.1(2)(a) is unconstitutional.  \n[173]  I would dismiss the appeal in H.V.’s case, which has the effect of affirming \nthat the mandatory minimum sentence in s.  172.1(2)(b) is unconstitutional.  \n2023 SCC 26 (CanLII)\n\n--- Page 112 ---\n \n [174]  The mandatory minimum sentences in s.  172.1(2)(a) and (b) of the \nCriminal Code  are inconsistent with s.  12 of the Charter , are not saved by s.  1 and are \ndeclared of no force or effect under s.  52 of the Constitution Act, 1982 .  \n English version of the reaso ns delivered by  \n \n CÔTÉ J. —  \n TABLE OF CONTENTS  \nParagraph  \nI. Overview  175 \nII. Analysis  182 \n Section 172.1(2) Cr.  C. Does Not Violate Section 12 of the Charter  182 \n The Fit and Appropriate  Sentence for the Offender in the First Reasonably \nForeseeable Hypothetical Scenario  184 \n The Fit and Appropriate  Sentence for the Offender in the Second Reasonably \nForeseeable Hypothetical Scenario  201 \n The Difference Between the Fit and Appropria te Sentences for the Offenders \nin the Reasonably Foreseeable Hypothetical Scenarios and the Minimum \nTerm of Imprisonment Provided for in Section 172.1(2)(a) Cr. C. Is Not \nGrossly Disproportionate  212 \n The Offence of Child Luring Is Broad in Scope but Always Involves Conduct \nWith a High Degree of Moral Blameworthiness as Well as Harm or a Risk of \nHarm  212 \n The Effects of the Minimum Term of Imprisonment on the Offenders in the \nReasonably Foreseeable Hypothetical Scenarios Are Not Incompatible With \nHuman Dignity222 \n The Minimum Term of Imprisonment Is Not Grossly Disproportionate to \nWhat Is Necessary to Achieve Parliament’s Objectives226 \nIII. Conclusion",
    "token_count": 1000,
    "start_token": 47700,
    "end_token": 48700,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 54,
    "source_file": "2023scc26.txt",
    "text": " \nWith a High Degree of Moral Blameworthiness as Well as Harm or a Risk of \nHarm  212 \n The Effects of the Minimum Term of Imprisonment on the Offenders in the \nReasonably Foreseeable Hypothetical Scenarios Are Not Incompatible With \nHuman Dignity222 \n The Minimum Term of Imprisonment Is Not Grossly Disproportionate to \nWhat Is Necessary to Achieve Parliament’s Objectives226 \nIII. Conclusion  231 \nI. Overview  \n2023 SCC 26 (CanLII)\n\n--- Page 113 ---\n \n [175]  Sexual violence against children is an evil that afflicts our society and \ndeprives its victims of the childhood to which they were entitled by exposing them to \nvarious forms of serious harm that can interfere with their development and \nself-fulfillment ( R. v. Friesen , 2020 SCC 9, [2020] 1 S.C.R. 424, at para.  58). Like \nconcentric circles, the harm caused by the commission of such offences affects not only \nthe children who are the immediate victims of the offences but also their families, their \ncommunities and, ultimately, society as a whole, which “is diminished and degr aded” \n(Friesen , at paras.  62-64, quoting R. v. Hajar , 2016 ABCA 222, [2016] 12 W.W.R. \n435, at para.  67). \n[176]  The criminalization of sexual violence against minors attests to the cardinal \nimportance that Canada attaches to the protection of its children ( R. v. L. (J. -J.) (1998), \n126 C.C.C. (3d) 235 (Que. C.A.), at p.  250), which is one of the most fundamental \nvalues of Canadian society ( Friesen , at para.  65). As this Court noted in Friesen , “the \ncriminal law in general and sentencing law specifically are importa nt mechanisms that \nParliament has chosen to employ to protect children from sexual violence” (para.  45). \nFurther, sentencing is a way for our society to express, through the courts, its \nabhorrence of such offences, which encroach on the system of values sh ared by all \nCanadians ( R. v. M. (C.A.) , [1996] 1 S.C.R. 500, at para.  81). \n[177]  In this regard, Parliament decided, through the enactment of s.  718.01 of \nthe Criminal Code , R.S.C. 1985, c.  C-46 (“ Cr. C.”), to prioritize the objectives of \ndenunciation and deterr ence in the sentencing process for such offences. It also chose \n2023 SCC 26 (CanLII)\n\n--- Page 114 ---\n \n to increase the maximum sentences for offences of this kind, thereby recognizing “the \nprofound harm .  . . cause[d]” by such conduct ( Friesen , at para.  95). Lastly, Parliament \ndecided, in some cases, to enact mandatory minimum sentences. Notably, it did so for \nthe offence of child luring in s.  172.1 Cr. C., which provides for a minimum term of \nimprisonment of six months or one year, depending on whether the Crown proceeds \nsummarily or by indictm ent. In these appeals, this Court must determine whether these \nminimum terms of imprisonment are cruel and unusual within the meaning of s.  12 of \nthe Canadian Charter of Rights and Freedoms . \n[178]  In addressing this issue, it is important to keep in mind that th ere is no \nconstitutional provision that protects against the imposition of a disproportionate \npunishment; s.  12 of the Charter  protects against the imposition of a grossly \ndisproportionate  punishment. Proportionality is certainly an essential principle of \nsentencing. However, this principle has not been constitutionalized ( R. v. \nSafarzadeh -Markhali , 2016 SCC 14, [2016] 1 S.C.R. 180, at para.  71; R. v. \nMalmo -Levine , 2003 SCC 74, [2003] 3 S.C.R. 571, at para.  169). As this Court \nexplained in Safarzadeh -Markha li, “[t]he principles and purposes for determining a fit \nsentence, enumerated in s.  718 of the Criminal Code  and provisions that",
    "token_count": 1000,
    "start_token": 48600,
    "end_token": 49600,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 55,
    "source_file": "2023scc26.txt",
    "text": "] 1 S.C.R. 180, at para.  71; R. v. \nMalmo -Levine , 2003 SCC 74, [2003] 3 S.C.R. 571, at para.  169). As this Court \nexplained in Safarzadeh -Markha li, “[t]he principles and purposes for determining a fit \nsentence, enumerated in s.  718 of the Criminal Code  and provisions that follow — \nincluding the fundamental principle of proportionality in s.  718.1 — do not have \nconstitutional status” (para.  71). In deed, “Parliament is entitled to modify and abrogate \nthem as it sees fit, subject only to s.  12 of the Charter ” (para.  71; see also R. v. \nBissonnette , 2022 SCC 23, at paras.  52-53). \n2023 SCC 26 (CanLII)\n\n--- Page 115 ---\n \n [179]  The standard of gross disproportionality “is intended to be demanding and \nwill be attained only rarely ” (Bissonnette , at para.  70 (emphasis added), citing, among \nothers,  R. v. Boudreault , 2018 SCC 58, [2018] 3 S.C.R. 599, at para.  45). Accordingly, \nshowing that a sentence is demonstrably unfit, or even excessive, is not sufficie nt \n(Boudreault , at para.  45; R. v. Hills , 2023 SCC 2, at paras.  113-14). To be grossly \ndisproportionate, a minimum sentence must be “so excessive as to outrage standards of \ndecency” and “‘abhorrent or intolerable’ to society” ( R. v. Lloyd , 2016 SCC 13, [20 16] \nS.C.R. 130, at para.  24). By setting such a high bar, courts ensure that the necessary \ndeference is shown to Parliament’s public policy choices with regard to sentencing \n(Hills , at para.  113). With respect, my colleague’s reasons completely erode such \ndeference.  \n[180]  In light of this Court’s recent pronouncements in Friesen  and the high \nstandard that applies in an analysis under s.  12 of the Charter , I cannot conclude that \nsentencing an offender to imprisonment for six months or one year for communicating \nwith a minor for the purpose of facilitating the commission of a sexual offence or other \nspecified offence against the minor is one of the instances in which the demanding and \n“rarely” attained standard of gross disproportionality is met.  \n[181]  Consequently, unlik e my colleague, I am of the view that the mandatory \nminimum sentences provided for in s.  172.1(2)(a) and (b) Cr. C. are not contrary to \ns. 12 of the Charter . I agree with my colleague’s disposition with regard to the sentence \nto be imposed on Mr.  Bertrand Marchand. However, I would set aside the four -month \n2023 SCC 26 (CanLII)\n\n--- Page 116 ---\n \n sentence given to H.V. and impose the mandatory minimum sentence of six months’ \nimprisonment. Since the Crown conceded in oral argument that reincarceration is not \nnecessary in the circumstances, I would order a permanent stay of execution of the \nmodified sentence.  \nII. Analysis  \nSection 172.1(2) Cr.  C. Does Not Violate Section 12 of the Charter  \n[182]  The analytical framework that must be applied under s.  12 of the Charter  \nconsists of two stages. At the first stage, “the court must determine what constitutes a \nproportionate sentence for the offence having regard to the objectives and principles of \nsentencing in the  Criminal Code ” (R. v.  Nur, 2015 SCC 15, [2015] 1 S.C.R. 773 , at \npara.  46). At the second stage, the court must decide “whether the mandatory \npunishment is grossly disproportionate when compared to the fit sentence for either the \nclaimant or for a reasonable hypothetical offender”  (Boudreault , at para.  46, citing Nur, \nat paras.  46 and 77). This “requires a contextual comparison between the fit sentence \nand the impugned mandatory minimum to see whether the latter complies with the \nwidely -worded right set out in s.  12” ( Hills , at para",
    "token_count": 1000,
    "start_token": 49500,
    "end_token": 50500,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 56,
    "source_file": "2023scc26.txt",
    "text": "ishment is grossly disproportionate when compared to the fit sentence for either the \nclaimant or for a reasonable hypothetical offender”  (Boudreault , at para.  46, citing Nur, \nat paras.  46 and 77). This “requires a contextual comparison between the fit sentence \nand the impugned mandatory minimum to see whether the latter complies with the \nwidely -worded right set out in s.  12” ( Hills , at para.  45). To do so, the court must \nconsider (1)  the scope and reach of the offence, (2)  the effects of the penalty on the \noffender, and (3)  the penalty itself, including the balance struck by its objectives ( Hills , \nat para.  122).  \n2023 SCC 26 (CanLII)\n\n--- Page 117 ---\n \n [183]  In the present appeals, my colleague finds that the imposition of minimum \nterms of imprisonment on Mr.  Bertrand Marchand and H.V. is not cruel and unusual. \nHowever, she declares the impugned provisions unconstitutional on the basis of two \nhypothetical scenarios that she considers reasonably foreseeable. It is therefor e \nappropriate to analyze the constitutionality of the mandatory minimum sentences \nprovided for in s.  172.1(2)(a) and (b) in light of these two scenarios.  \n(1) The Fit and Appropriate Sentence for the Offender in the First Reasonably \nForeseeable Hypothetical Sce nario  \n[184]  The first hypothetical scenario identified by my colleague is based on the \none proposed in R. v. Hood , 2018 NSCA 18, 45 C.R. (7th) 269. Drawing on the Court \nof Appeal’s reasoning in that case, my colleague sets out the following reasonably \nforeseeabl e hypothetical scenario (para.  116):  \n The representative offender is a first -year high school teacher in her \nlate 20s with no criminal record. The offender has been diagnosed with \nbipolar disorder. One evening, she texts her 15 -year-old student to \ninquire a bout a school assignment. Feeling manic, she directs the \nconversation from casual to sexual. The two meet that same evening in \na private location where they both participate in sexual touching. The \noffender does not engage inappropriately with the student on any \nfurther occasions. The offender pleads guilty and expresses remorse on \nsentencing. See Hood , at para.  150. \n[185]  In this regard, my disagreement with my colleague relates mainly to the \nsentence that she considers fit and appropriate for this offender. Wit h respect, a 30 -day \n2023 SCC 26 (CanLII)\n\n--- Page 118 ---\n \n term of imprisonment to be served intermittently is far too lenient a sentence having \nregard to the gravity of the offence and the moral blameworthiness  of the offender.  \n[186]  In Friesen , this Court called on courts to impose more severe sent ences on \noffenders who have committed sexual offences against children. It also found that the \nsuccessive increases in maximum sentences indicated Parliament’s intention that these \noffences be treated as more grave and that the sentences imposed for them t herefore be \nhigher than they had been in the past (paras.  99-100). The message sent by this Court \nwas unequivocal: “Sentences must accurately reflect the wrongfulness of sexual \nviolence against children and the far -reaching and ongoing harm that it causes to \nchildren, families, and society at large”  (para.  5). \n[187]  Without establishing a sentencing range, the Court made some comments \nconcerning the factors that courts must consider in determining a fit and appropriate \nsentence for offences of this kind: (i)  any manner of physical sexual contact between \nan adult and a child is inherently violent and harmful (para.  82); (ii)  in child luring \ncases where all interactions occur online, the offender’s conduct can constitute a form \nof psychological sexual violence that has the potential to cause serious harm (para.  82); \n(iii) it is important to give effect to Parliament’s clear and repeated signals to increase \nthe sentences imposed for sexual offences against children (para.  100). In this regard, \ncourts should generally impose higher sentences than those imposed in cases that \npreceded the increases in maximum sentences (para.  100). With respect, although my \n2023 SCC 26 (CanLII)\n\n--- Page 119 ---\n \n colleague emphasizes the principles set out in Friesen , the approach she",
    "token_count": 1000,
    "start_token": 50400,
    "end_token": 51400,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 57,
    "source_file": "2023scc26.txt",
    "text": " it is important to give effect to Parliament’s clear and repeated signals to increase \nthe sentences imposed for sexual offences against children (para.  100). In this regard, \ncourts should generally impose higher sentences than those imposed in cases that \npreceded the increases in maximum sentences (para.  100). With respect, although my \n2023 SCC 26 (CanLII)\n\n--- Page 119 ---\n \n colleague emphasizes the principles set out in Friesen , the approach she uses to \ndetermine the fit and appropriate s entence is inconsistent with that decision.  \n[188]  Indeed, despite her statement to the contrary, my colleague treats the \nabsence of grooming and premeditation as mitigating. She first points out that the \noffender’s actions were spontaneous and of short duration rather than premeditated and \ncalculated. Whi le she acknowledges that these circumstances are not in themselves \nmitigating, she nevertheless concludes that they “provide insight into the overall \ngravity of the offence and culpability of the offender” (para.  127). She adds, at \npara.  127, that “[i]t is  well established that spontaneous or spur of the moment crimes \nshould be punished less severely than planned or premeditated ones (see, e.g., R. v. \nLaberge  (1995), 165 A.R. 375 (C.A.), at para.  18; R. v. Murphy , 2014 ABCA 409, 593 \nA.R. 60, at para.  42; R. v. Vienneau , 2015 ONCA 898, at para.  12 (CanLII))”. I agree \nthat, “ all other things being equal , impulsivity is less blameworthy than planned or \nrepeated conduct”  (Laberge , at para.  18 (emphasis added)). In Laberge , Fraser  C.J. \nspecified, however, that th e fact that an act was committed spontaneously does not \nautomatically lead to the conclusion that the accused had no subjective intent to act and \nthat the conduct in question is therefore less blameworthy: “[the existence of such an \nintent] depends on a co nstellation of factors and not simply on the degree of planning \nthat went into the unlawful act” (para.  20). Thus, “even in the case of impulsive acts, \nother factors in the context must be examined to determine whether there really is a \nlow level of culpab ility” (C.  C. Ruby, Sentencing  (10th  ed. 2020), at p.  252, citing \nLaberge ). \n2023 SCC 26 (CanLII)\n\n--- Page 120 ---\n \n [189]  However, the absence  of grooming and premeditation must have a neutral \neffect on sentencing ( R. v. S.R. , 2008 QCCA 2359, at para.  18 (CanLII); R. v. Barrett , \n2013 QCCA 1351, at paras.  24-25 (CanLII); R. v. D.B. , 2013 QCCA 2199, at para.  13 \n(CanLII); R. v. S.J.B. , 2018 MBCA 62, at paras.  19-20 (CanLII); H.  Parent and \nJ. Desrosiers, Traité de droit criminel , t. III, La peine  (3rd ed. 2020), at p.  98). I find it \ndifficult to underst and how a neutral factor can provide insight into the gravity of the \ncrime and the moral blameworthiness of the offender. If this is the case, it must be \nbecause the factor is seen, wrongly, as mitigating. Giving a de facto  mitigating effect \nto a neutral f actor amounts, in my view, to underestimating the subjective gravity of \nthe offence.  \n[190]  The offender’s conduct in this hypothetical scenario is highly \nblameworthy. Teachers are presumed to be in a relationship of trust with their students \nand in a position of  authority toward them ( R. v. Audet , [1996] 2 S.C.R. 171, at \nparas.  41-43). It is difficult to imagine a more demanding task than the one resting on \nthem, that is, to ensure the well -being, safety and education of our children ( R. v. \nM. (M.R.) , [1998] 3 S. C.R. 393, at para.  1; R.",
    "token_count": 1000,
    "start_token": 51300,
    "end_token": 52300,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 58,
    "source_file": "2023scc26.txt",
    "text": " R. v. Audet , [1996] 2 S.C.R. 171, at \nparas.  41-43). It is difficult to imagine a more demanding task than the one resting on \nthem, that is, to ensure the well -being, safety and education of our children ( R. v. \nM. (M.R.) , [1998] 3 S. C.R. 393, at para.  1; R. v. Jarvis , 2019 SCC 10, [2019] 1 S.C.R. \n488, at para.  84). When parents entrust their children to a school, they delegate part of \ntheir parental authority to the teaching staff working there “and entrust them with the \nresponsibilit y of instilling in their children a large part of the store of learning they will \nacquire during their development” ( Audet , at para.  41; on the power dependency \nrelationships inherent in a student -teacher relationship, see also P.  Coleman, “Sex in \nPower De pendency Relationships: Taking Unfair Advantage of the ‘Fair’ Sex” (1988), \n2023 SCC 26 (CanLII)\n\n--- Page 121 ---\n \n 53 Alb. L. Rev.  95, at pp.  120-21, cited in Audet , at para.  40). In discharging this heavy \nresponsibility, teachers may not abuse the authority they exercise over their students to \ngratify their sexual desires. Such sexual interference involves heightened levels of \nexploitation ( Hajar , at para.  232, per Slatter  J.A., dissenting).  \n[191]  A teacher who disregards this moral and social duty and engages in such \nconduct is committing a very seri ous act that has deleterious social effects. Indeed, such \nbehaviour has the potential to undermine and erode public confidence in the school \nsystem, because “[t]he conduct of a teacher bears directly upon the community’s \nperception of the ability of the te acher to fulfil such a position of trust and influence, \nand upon the community’s confidence in the public school system as a whole” ( Ross v. \nNew Brunswick School District No.  15, [1996] 1 S.C.R. 825, at para.  43). \n[192]  More immediately, the commission of such a cts is likely to have \ndevastating consequences for the child victims, consequences that are glossed over in \nmy colleague’s analysis. Yet  this Court recognized in Friesen  that “sexual offences \nagainst children are inherently wrongful and always put children  at risk of serious harm, \neven as the degree of wrongfulness, the extent to which potential harm materializes, \nand actual harm vary from case to case” (para.  76). In light of this, the Court instructed \nlower courts to always  “take into account forms of pot ential harm that have yet to \nmaterialize at the time of sentencing but that are a reasonably foreseeable consequence \nof the offence and may in fact materialize later in childhood or in adulthood”  (para.  84). \nDuring childhood, these forms of harm may includ e \n2023 SCC 26 (CanLII)\n\n--- Page 122 ---\n \n  . . . overly compliant behaviour and an intense need to please; \nself-destructive behaviour, such as suicide, self -mutilation, chemical \nabuse, and prostitution; loss of patience and frequent temper tantrums; \nacting out aggressive behaviour and frustratio n; sexually aggressive \nbehaviour; an inability to make friends and non -participation in school \nactivities; guilty feelings and shame; a lack of trust, particularly with \nsignificant others; low self -esteem; an inability to concentrate in school \nand a sudden  drop in school performance; an extraordinary fear of males; \nrunning away from home; sleep disturbances and nightmares; regressive \nbehaviours, such as bedwetting, clinging behaviour, thumb sucking, and \nbaby talk; anxiety and extreme levels of fear; and dep ression.  \n (C.-A. Bauman, “The Sentencing of Sexual Offences against Children” \n(1998), 17 C.R. (5th) 352, at pp.  354-55, quoted in Friesen , at para.  80.) \n[193]  In the long run, the consequences of sexual violence may impair the ability \nof child victims to form emotional relationships with another adult. They may make \nthese children, when they reach adulthood, more prone to engage in sexual violence \nthemselves against other children or make them more likely to “struggle with",
    "token_count": 1000,
    "start_token": 52200,
    "end_token": 53200,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 59,
    "source_file": "2023scc26.txt",
    "text": "17 C.R. (5th) 352, at pp.  354-55, quoted in Friesen , at para.  80.) \n[193]  In the long run, the consequences of sexual violence may impair the ability \nof child victims to form emotional relationships with another adult. They may make \nthese children, when they reach adulthood, more prone to engage in sexual violence \nthemselves against other children or make them more likely to “struggle with substance \nabuse, mental illness, post -traumatic stress disorder, eating disorders, suicidal ideation, \nself-harming behaviour, anxiety, depression, sleep disturbances, anger, hostility, and \npoor self -esteem as adults” ( Friesen , at para.  81). \n[194]  In the case of the offender in my colleague’s first h ypothetical scenario, \nthis harm is all the more serious given the fact that the commission of the offence \ninvolves abuse of a position of trust and authority ( Friesen , at para.  126). This is why \nan “offender who abuses a position of trust to commit a sexua l offence against a child \nshould receive a lengthier sentence than an offender who is a stranger to the child” \n(Friesen , at para.  130).  \n2023 SCC 26 (CanLII)\n\n--- Page 123 ---\n \n [195]  My colleague is of the view that rehabilitation “must be prioritized for this \noffender ” (para.  129), which runs counter to the very wording of s.  718.01 Cr. C., the \nconstitutionality of which is not being challenged here. It is important to remember that \nthis section makes it necessary to “prioritize denunciation and deterrence for offences \nthat involve the abuse of childre n” (Friesen , at para.  101; see also R. v. Rayo , 2018 \nQCCA 824, at para.  103 (CanLII)). Let me be clear: in these circumstances, my \ncolleague cannot prioritize another penological objective, as that is the role of \nParliament. Although my colleague makes ref erence to s.  718.01 Cr. C., there is \nnothing in her reasons to indicate that [ TRANSLATION ] “the relative precedence of [the] \nobjectives [set out in s.  718.01 Cr. C.] will be clear” in the sentence she would impose \non the offender in her hypothetical scenar io (Rayo , at para.  112; see also R. v. Bergeron , \n2016 QCCA 339, at para.  32 (CanLII)).  \n[196]  It is true that courts “must not magnify aggravating factors or narrow \nmitigating ones to reach desired conclusions” (Martin  J.’s reasons, at para.  122). But \nconversely,  mitigating factors cannot be overestimated at the expense of aggravating \ncircumstances in order to achieve a certain outcome. I find that a nine -month term of \nimprisonment is a fit and appropriate sentence for the offender in the first hypothetical \nscenar io. \n[197]  In Rayo , which was rendered in 2018, the Quebec Court of Appeal noted \nthat the sentencing range for the offence of child luring is between 12 and 24 months \nwhen the offence is prosecuted by indictment (paras.  125-26). I note that such a range \n2023 SCC 26 (CanLII)\n\n--- Page 124 ---\n \n was propo sed in 2006, well before the 2012 and 2015 legislative amendments \nintroducing the minimum sentences challenged in this case ( R. v.  Jarvis (2006), 211 \nC.C.C. (3d) 20  (Ont. C.A.), at para.  31). In Montour v. R. , 2020 QCCA 1648 , the Court \nof Appeal indicated that this range could be revised upwards as a result of Friesen  \n(paras.  55-60 (CanLII)). Similarly, in Traité de droit criminel , Parent and Desrosiers \nstate that the general sentencing range is from 6 to 24 months’ imprisonment. \nAccording to them, short pr ison sentences range from 6 to 12 months (pp.  869-72), \nintermediate sentences from 9 to 18 months (pp.  872-76), and longer sentences from \n18 months to 5 years (pp.  876-77). Generally, offences in the intermediate",
    "token_count": 1000,
    "start_token": 53100,
    "end_token": 54100,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 60,
    "source_file": "2023scc26.txt",
    "text": " droit criminel , Parent and Desrosiers \nstate that the general sentencing range is from 6 to 24 months’ imprisonment. \nAccording to them, short pr ison sentences range from 6 to 12 months (pp.  869-72), \nintermediate sentences from 9 to 18 months (pp.  872-76), and longer sentences from \n18 months to 5 years (pp.  876-77). Generally, offences in the intermediate category \ninvolve a mix of aggravating and m itigating circumstances (p.  874). Mitigating \ncircumstances that have been identified include a guilty plea, the expression of remorse \nand a low risk of reoffending (p.  874). Aggravating factors include the exploitation of \na relationship of trust and of the  victim’s vulnerability for the purpose of having sexual \nrelations with the victim (pp.  874-75, citing Rayo , at para.  29). In addition, \n[TRANSLATION ] “where luring gives rise to related offences involving the actual assault \nof a child, the global sentences  are generally more significant” ( Rayo , at para.  171; see \nalso Hajar , at para.  156).  \n[198]  A review of the case law also shows that 12 -month terms of imprisonment \nhave been imposed for child luring offences committed in a context involving abuse of \na position of  trust (see, e.g., R. v. Faille , 2021 QCCQ 4945 ; R. v. Jissink , 2021 ABQB \n102, 482 C.R.R. (2d) 167 ). In Faille , a 12 -month term of imprisonment for child luring \nwas imposed on a teacher who had conversations with the victim during which he \n2023 SCC 26 (CanLII)\n\n--- Page 125 ---\n \n frequently talke d about sex and drug and alcohol use. He then tried to contact the victim \nby web video, which she refused, and he later sent her a photograph of a sexual nature. \nThe judge found abuse of a position of trust to be an aggravating factor, noting that \n[TRANSLA TION ] “it was as a teacher, and thus a known figure, that [the accused] \nestablished ties with the two victims” (para.  57 (CanLII)), which is also the case in the \nscenario being considered. A guilty plea and the absence of a criminal record were \nmitigating factors.  \n[199]  In Jissink , a teacher pleaded guilty to one count of child luring for having \nsent sexually explicit messages to a 16 -year-old student. In that case, the Court of \nQueen’s Bench imposed a one -year term of imprisonment even though the \ncommunications had never led to a meeting for sexual purposes between the offender \nand the complainant. The aggravating factors considered by the court included the \nsignificant age difference between the offender and the victim as well as abuse of a \nposition of trust and  authority because of the offender’s status as a teacher. In that case, \nwhich involved circumstances analogous to the scenario being considered here, the \ncourt noted that a sentence of 12 months’ imprisonment “is on par with sentences \nimposed on similar of fenders for similar offences committed in similar circumstances” \n(para.  77). \n[200]  In the scenario being considered, an offender takes advantage of her status \nas a teacher to exploit a 15 -year-old child for sexual purposes. This is a “classic breach \nof trust sit uatio[n]” that increases the offender’s moral blameworthiness ( Friesen , at \n2023 SCC 26 (CanLII)\n\n--- Page 126 ---\n \n paras.  126 and 129). A nine -month term of imprisonment takes into account the moral \nblameworthiness inherent in an offence like child luring, the abuse of a position of trust \nand th e commission of an underlying offence. It also takes into account the significant \nage difference between the offender and the complainant as well as the complainant’s \nvulnerability. Nevertheless, I am of the view that such a penalty acknowledges the role \nthat the offender’s mental illness played in the events, along with her guilty plea and \nthe remorse she expressed.  \n(2) The Fit and Appropriate Sentence for the Offender in the Second \nReasonably Foreseeable Hypothetical Scenario  \n[201]  My colleague proposes a second re asonably foreseeable hypothetical \nscenario to assess the constitutionality of the six -month minimum term of \nimprisonment provided for in s.  ",
    "token_count": 1000,
    "start_token": 54000,
    "end_token": 55000,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 61,
    "source_file": "2023scc26.txt",
    "text": " such a penalty acknowledges the role \nthat the offender’s mental illness played in the events, along with her guilty plea and \nthe remorse she expressed.  \n(2) The Fit and Appropriate Sentence for the Offender in the Second \nReasonably Foreseeable Hypothetical Scenario  \n[201]  My colleague proposes a second re asonably foreseeable hypothetical \nscenario to assess the constitutionality of the six -month minimum term of \nimprisonment provided for in s.  172.1(2)(b) Cr. C. (para.  119):  \n The representative offender is an 18 -year-old who is in a romantic and \nsexual relati onship with a 17 -year-old. In one text, the offender asks \nher to send him an explicit photo. She does, and he then forwards that \nphoto to his friend without his girlfriend’s knowledge. This friend, who \nis also 18, does not transmit this photo to anyone, bu t retains it on his \nmobile phone. See [ R. v.] John , [2018 ONCA 702, 142 O.R. (3d) 670,] \nat para.  29. \n[202]  This hypothetical scenario is based on a scenario considered by the Ontario \nCourt of Appeal in John , in which that court declared the minimum sentence prov ided \nfor in s.  163.1(4)(a) Cr. C. for possession of child pornography unconstitutional.  \n2023 SCC 26 (CanLII)\n\n--- Page 127 ---\n \n [203]  In my colleague’s opinion, the fit and appropriate punishment for this \noffender is a conditional discharge (para.  130). Again, I cannot agree with that position.  \n[204]  It is true that, as a general rule, there is no offence for which a discharge is \nunavailable “other than an offence for which a minimum punishment is prescribed by \nlaw or an offence punishable by imprisonment for fourteen years or for life” (s.  730(1) \nCr. C.). However, in the case of offences committed against a child or an intimate \npartner, [TRANSLATION ] “it will be more difficult to grant a discharge” (Parent and \nDesrosiers, at p.  305 (footnote omitted); see also Medvedev v. R. , 2013 QCCA 540, at \npara.  4 (CanLII)). The jurisprudence also establishes that a conditional discharge is \nrarely granted in cases involving domestic violence (Parent and Desrosiers, at \npp. 305-8; R. v. Laurendeau , 2007 QCCA 1593, at paras.  18-19 (CanLII)). This is so \nbecause the sent ence imposed in such cases must align with two imperatives, \n[TRANSLATION ] “[t]hat of denouncing the unacceptable and criminal nature of domestic \nviolence and that of increasing the confidence of victims and the public in the \nadministration of justice” ( Laurendeau , at para.  19; see also R. v. Davidson , 2021 \nQCCA 545, at paras.  32 and 34 (CanLII)).  \n[205]  In this second hypothetical scenario, the offender was in a romantic \nrelationship with the victim at the time of the offence. However, the conditional \ndischarge pr oposed by my colleague fails to take into account s.  718.2(a)(ii) Cr. C., \nwhich provides that the commission of an offence that involved the abuse of the \noffender’s intimate partner is an aggravating circumstance. In this context, the \n2023 SCC 26 (CanLII)\n\n--- Page 128 ---\n \n objectives of denunci ation and deterrence must be prioritized in sentencing ( R. v. \nCunningham , 2023 ONCA 36, 166 O.R. (3d) 147, at paras.  26 and 52; Davidson , at \nparas.  32 and 34). Not only did the offender engage in conduct that involved the abuse \nof his intimate partner, but  he also committed that offence against a minor, and both of \nthese factors increase the subjective gravity of the offence.  \n[206]  Added to this is another aggravating circumstance, namely the fact that the \noffender abused a position of trust in relation to the co mplainant (s.  718.2(a)(iii) \nCr. C.), who was entitled to expect that her sexually explicit photo would be for the \nexclusive use of her boyfriend. Trust is an intrinsic part of any romantic relationship \n(R.",
    "token_count": 1000,
    "start_token": 54900,
    "end_token": 55900,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 62,
    "source_file": "2023scc26.txt",
    "text": ", and both of \nthese factors increase the subjective gravity of the offence.  \n[206]  Added to this is another aggravating circumstance, namely the fact that the \noffender abused a position of trust in relation to the co mplainant (s.  718.2(a)(iii) \nCr. C.), who was entitled to expect that her sexually explicit photo would be for the \nexclusive use of her boyfriend. Trust is an intrinsic part of any romantic relationship \n(R. v. Stone , [1999] 2 S.C.R. 290, at para.  240; R. v.  Butcher , 2020 NSCA 50, 387 \nC.C.C. (3d) 417, at para.  140). Taking advantage of the existence of such a relationship \nof trust to deceive one’s girlfriend is “likely to increase the harm to the victim and thus \nthe gravity of the offence” ( Friesen , at para.  126).  \n[207]  The hypothetical offender’s actions could have many negative \nconsequences for the complainant. These include not only humiliation and shame but \nalso a violation of her sexual integrity and her interests in personal autonomy, dignity \nand privacy ( Friesen, at paras.  51 and 152; J.  Bailey and C.  Mathen, \n“Technology -Facilitated Violence Against Women & Girls: Assessing the Canadian \nCriminal Law Response” (2019), 97 Can. Bar Rev.  664, at p.  677). Moreover, the fact \nthat the offence was committed through te chnological means amplifies the potential \nharm given the ease with which the photo can be redistributed by the same means to a \n2023 SCC 26 (CanLII)\n\n--- Page 129 ---\n \n theoretically unlimited audience. Once the photo has been transmitted without the \ncomplainant’s consent, she loses all control ov er its future dissemination, which \nexponentially increases her psychological harm and potential emotional suffering \n(Bailey and Mathen, at pp.  676-77). Finally, the offender’s actions involved the abuse \nof an adolescent girl, and the vulnerability of adole scent girls to sexual violence has \nbeen recognized ( Friesen , at para.  136).  \n[208]  I acknowledge that the hypothetical offender is young and has no criminal \nrecord. However, I cannot give these factors the weight given to them by my colleague \nin light of the abov e-mentioned aggravating factors. Indeed, I cannot subscribe to the \nview that in all cases involving a youthful first offender, “[r]ehabilitation and individual \ndeterrence are primary sentencing objectives ” (para.  132). First of all, the decisions \ncited in support of that view are more nuanced. In R. v. Priest (1996), 30 O.R. (3d) 538, \nthe Ontario Court of Appeal held that the fact that a youthful offender has no criminal \nrecord is a mitigating factor and that the sentencing objectives in such a case should \nnormally be individual deterrence and rehabilitation. In the same breath, however, the \nCourt of Appeal stated that rehabilitation is not a paramount factor for serious offences \nor offences involving violence (pp.  543-45; see also R. v. Tan , 2008 ONCA 574, 268 \nO.A.C. 385, at para.  32; R. v. T.  (K.), 2008 ONCA 91, 89 O.R. (3d) 99, at paras.  41-42, \ndecisions that are also cited by my colleague and are to the same effect). The weight to \nbe given to the offender’s age therefore depends on the nature of the offen ce of which \nthe offender is convicted. The same is true for the weight to be given to the absence of \na criminal record ( R. v. Ahmed , 2017 ONCA 76, 136 O.R. (3d) 403, at para.  65, citing \n2023 SCC 26 (CanLII)\n\n--- Page 130 ---\n \n T. (K.), at paras.  41-42; R. v. Brown , 2015 ONCA 361, 126 O.R. (3d) 79 7, at para.  5; \nand R. v. Khalid , 2010 ONCA 861, 103 O.R. (3d) 600, at para.  43). \n[209]  At the risk of repeating myself, in cases involving sexual violence against \na minor, rehabilitation simply cannot be prioritized. Rather",
    "token_count": 1000,
    "start_token": 55800,
    "end_token": 56800,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 63,
    "source_file": "2023scc26.txt",
    "text": ". v. Brown , 2015 ONCA 361, 126 O.R. (3d) 79 7, at para.  5; \nand R. v. Khalid , 2010 ONCA 861, 103 O.R. (3d) 600, at para.  43). \n[209]  At the risk of repeating myself, in cases involving sexual violence against \na minor, rehabilitation simply cannot be prioritized. Rather, Parliament’s choice, \nexpressed in s.  718.01 Cr. C., to prioritize denunciation and deterrence must be given \nfull effect. As this Court explained in Friesen , “[w]here Parliament has indicated which \nsentencing objectives are to receive priority in certain cases, the sentencing judge’s \ndiscretio n is thereby limited, such that it is no longer open to the judge to elevate other \nsentencing objectives to an equal or higher priority” (para.  104, citing Rayo , at \nparas.  103 and 107 -8; see also Lévesque v. R. , 2021 QCCA 1072, at paras.  19-20 \n(CanLII); Davidson , at paras.  32 and 34; Cunningham , at paras.  26 and 52).  \n[210]  The offender’s conduct in this hypothetical scenario is at the lower end of \nthe scale of gravity for the offence, since it involves an isolated act committed by an \n18-year-old with no criminal record (see Parent and Desrosiers, at pp.  869-71). I note \nonce more that short sentences for the offence of child luring ranged from 6 to \n12 months  (Parent and Desrosiers, at p.  869), and this was so even before the 6 -month \nminimum term of imprisonment in s. 172.1(2)(b) Cr. C. was introduced ( R. v. \nBergeron , 2013 QCCA 7, at para.  75 (CanLII)). In short, having regard to the \ncircumstances set out above and the general sentencing range, the fit and appropriate \npunishment is not a conditional discharge but rat her a six -month term of imprisonment.  \n2023 SCC 26 (CanLII)\n\n--- Page 131 ---\n \n [211]  Given that, for both reasonably foreseeable hypothetical scenarios, I \nconclude that the fit and appropriate sentence is equal to or greater than a six -month \nterm of imprisonment, this decides the constitutionality of s . 172.1(2)(b) Cr. C. The \nfollowing analysis therefore concerns the constitutionality of the one -year minimum \nterm of imprisonment set out in s.  172.1(2)(a).  \n(3) The Difference Between the Fit and Appropriate Sentences for the \nOffenders in the Reasonably Forese eable Hypothetical Scenarios and the \nMinimum Term of Imprisonment Provided for in Section 172.1(2)(a) \nCr. C. Is Not Grossly Disproportionate  \n(a) The Offence of Child Luring Is Broad in Scope but Always Involves \nConduct With a High Degree of Moral Blameworthine ss as Well as Harm \nor a Risk of Harm  \n[212]  In my colleague’s opinion, the mens rea  required for the offence of child \nluring “ is not narrow but broad ”, such that s.  172.1(1) Cr. C. “captures a wide range of \ndesignated illicit purposes with varying degrees of mora l culpability ” (para.  139). It is \ntrue that when an offence carrying a mandatory minimum sentence can be committed \nin a way that involves a low degree of moral blameworthiness and no harm or real risk \nof harm, this indicates that the minimum sentence may b e grossly disproportionate (see, \ne.g., Nur, at para.  83, cited in Hills , at para.  125). However, this is not the case for the \noffence of child luring, which involves conduct that is always morally blameworthy \nand that always involves harm or a risk of harm . \n2023 SCC 26 (CanLII)\n\n--- Page 132 ---\n \n [213]  To begin with, I agree that s.  172.1(1) applies to a wide range of situations \n(R. v. Morrison , 2019 SCC 15, [2019] 2 S.C.R. 3 , at paras.  146-48). In spite of this, I \nam of the",
    "token_count": 1000,
    "start_token": 56700,
    "end_token": 57700,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 64,
    "source_file": "2023scc26.txt",
    "text": " always involves harm or a risk of harm . \n2023 SCC 26 (CanLII)\n\n--- Page 132 ---\n \n [213]  To begin with, I agree that s.  172.1(1) applies to a wide range of situations \n(R. v. Morrison , 2019 SCC 15, [2019] 2 S.C.R. 3 , at paras.  146-48). In spite of this, I \nam of the view that the offence of child luring always involves a high degree of moral \nblameworthiness. As was recognized by Moldaver  J., writing for a majority of this \nCourt in Morrison , luring “requires a high level of mens rea  and involves a high degree \nof moral blameworthiness” (para.  153). This is so because s.  172.1(1) Cr. C. requires \nproof beyond a reasonable doubt that “the accused .  . . ‘engage[d] in the prohibited \ncommunication with the specific intent  of facilitating the commission of one of the \ndesignated offences’ with respect to the underage person who was the intended \nrecipient of communication” ( R. v.  Legare , 2009 SCC 56, [2009] 3 S.C.R. 551, at \npara.  32 (emphasis deleted), quoting R. v. Alicandro , 2009 ONCA 133, 246 C.C.C. (3d) \n1, at para.  31). Consequently, requiring proof of such a mens rea  “helps to ensure that \ninnocent communication will not be unintentionally captured by the Code ” (para.  35). \n[214]  I therefore fail to see the relevance of my colleague’s assertion that \n“[b]ecause  proof of facilitation does not necessarily include proof of complex planning, \nthe luring offence can capture conduct that is bereft of sophistication or considered \nintention ” (para.  145). With respect, this amounts to conflating the existence of  \naggravating circumstances with the constituent elements of an offence. Sophistication \nand premeditation are certainly aggravating factors, but they are not essential elements \nof the offence. For the purposes of the analysis under s.  12 of the Charter , these factors \ntell us nothing about the scope of an offence.  \n2023 SCC 26 (CanLII)\n\n--- Page 133 ---\n \n [215]  This error illustrates a fundamental conceptual flaw in such reasoning. In \nthe section of her reasons that deals with the scope of the offence, my colleague does \nnot limit herself to an objective an alysis that involves “consider[ing] whether the \noffence necessarily involves harm to a person or simply the risk of harm, whether there \nare ways of committing the offence that pose relatively little danger, and to what degree \nthe offence’s mens rea require s an elevated degree of culpability of the offender” ( Hills , \nat para.  129). Rather, she assesses the scope of the offence in question in light of \ncircumstances relating to the degree of subjective fault of a particular offender, \nirrespective of the inheren t wrongfulness of the offence ( Friesen , at para.  76). \n[216]  In addition, one must be careful not to emphasize the fact that it is not \nnecessary for the offender to have committed one of the underlying offences listed in \ns. 172.1(1) in order to be convicted of ch ild luring (Martin  J.’s reasons, at para.  143). I \nwould also note that the underlying offences are serious offences that criminalize the \nsexual abuse, trafficking or abduction of children. If s.  172.1(1) casts a wide net, it is \nbecause Parliament’s objecti ve was to “close the cyberspace door before the predator \ngets in to prey” ( Legare , at para.  25). In keeping with this objective, s.  172.1(1) \n“criminalizes conduct that  precedes  the commission of the sexual offences to which it \nrefers, and even an attempt t o commit them” ( Legare , at para.  25 (emphasis deleted)).  \n[217]  In the same vein, in analyzing the constitutionality of s.  172.1(2) Cr. C., I \ncannot assign the weight my colleague does to the fact that the offence of child luring \n2023 SCC 26 (CanLII)\n\n--- Page 134 ---\n \n may be committed in the context o f a police sting operation that does not involve \nchildren (",
    "token_count": 1000,
    "start_token": 57600,
    "end_token": 58600,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 65,
    "source_file": "2023scc26.txt",
    "text": "” ( Legare , at para.  25 (emphasis deleted)).  \n[217]  In the same vein, in analyzing the constitutionality of s.  172.1(2) Cr. C., I \ncannot assign the weight my colleague does to the fact that the offence of child luring \n2023 SCC 26 (CanLII)\n\n--- Page 134 ---\n \n may be committed in the context o f a police sting operation that does not involve \nchildren (para.  142).  \n[218]  Even when the offence of luring is committed in the context of a police \noperation, it involves conduct that is undeniably very serious. An offender charged as \na result of a police sting  cannot rely on the absence of a victim to demonstrate lower \nmoral blameworthiness:  \n Courts must give effect to the moral culpability of the offender in \nsentencing even where the facts giving rise to the conviction involve a \npolice sting operation rather t han a child victim. Child luring may be \ncommitted in two ways: the offender is actually communicating with an \nunderage person, or the offender believes the person he is communicating \nwith is under age even though this is not in fact the case. In particular , the \noffence of child luring is often prosecuted through sting operations: an \nundercover officer poses online as a child and waits for an offender to \ninitiate communication with a sexual purpose (see, e.g., R. v. Levigne , 2010 \nSCC 25, [2010] 2 S.C.R. 3, a t para.  7; Morrison , at para.  4). Although the \nabsence of a specific victim is relevant, it should not be overemphasized in \narriving at a fit sentence. The accused can take no credit for this factor. As \nsuch, it does not detract from the degree of responsi bility of the offender \nfor that offence. After all, to be convicted of child luring in the context of \na police sting operation where the person the offender was communicating \nwith was not in fact under age, the offender both must have intentionally \ncommuni cated with a person who the offender believed to be under age \nand must have had the specific intent to facilitate the commission of a \nsexual or other specified offence against that person  (Morrison , at \npara.  153). [Emphasis added; footnote omitted.]  \n (Friesen , at para.  93) \n[219]  It must be remembered that even when child luring is committed in the \ncontext of a police operation, it must never be seen “as a victimless crime” ( Friesen , at \npara.  94). \n2023 SCC 26 (CanLII)\n\n--- Page 135 ---\n \n [220]  It is difficult to claim that the conduct of an offender arrest ed as a result of \na sting operation poses no risk of harm. Parliament designed the offence of child luring \nprecisely to prevent such a risk from materializing, that is, to apprehend “offenders \nbefore they can successfully target and harm children” ( Friesen , at para.  94). In this \nsense, police operations are a key element in the arsenal available to law enforcement \nagencies to apprehend offenders before it is too late (para.  94). \n[221]  In short, requiring a high level of mens rea  ensures that the offence of child \nluring captures only conduct that involves a high degree of moral blameworthiness as \nwell as serious harm or a risk of such harm ( Friesen , at para.  76). \n(b) The Effects of the Minimum Term of Imprisonment on the Offenders in the \nReasonably Foreseeable Hypothet ical Scenarios Are Not Incompatible \nWith Human Dignity  \n[222]  In addition to the scope of the offence, the grossly disproportionate nature \nof a mandatory minimum sentence is assessed in light of the effects that the penalty \nmay have on the reasonably foreseeable offender ( Hills , at para.  133). If these effects \nentail so much pain and suffering that they undermine human dignity, the impugned \nprovision cannot survive constitutional scrutiny (para.  133). That is not the case here.  \n[223]  For both of the hypothetical offende rs, the effects identified by my \ncolleague relate to the treatment they might receive in prison. It seems that \nimprisonment itself — and not its length — is what plays a major role in her analysis. \nAlthough my colleague refrains from concluding that the ef fects in question, which, I",
    "token_count": 1000,
    "start_token": 58500,
    "end_token": 59500,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 66,
    "source_file": "2023scc26.txt",
    "text": "ugned \nprovision cannot survive constitutional scrutiny (para.  133). That is not the case here.  \n[223]  For both of the hypothetical offende rs, the effects identified by my \ncolleague relate to the treatment they might receive in prison. It seems that \nimprisonment itself — and not its length — is what plays a major role in her analysis. \nAlthough my colleague refrains from concluding that the ef fects in question, which, I \n2023 SCC 26 (CanLII)\n\n--- Page 136 ---\n \n might add, are inherent to incarceration, are such as to undermine human dignity, she \nnevertheless finds that the first offender’s individual circumstances “ would likely make \nher experience of incarceration perilously grave ” (pa ra. 151) and that, for the second \noffender, “[t] he six -month mandatory minimum in this case is a far cry from the \nshortest possible rehabilitative sentence ” (para.  152). Such reasoning has major \nimplications; its logical consequence is that any minimum ter m of imprisonment that \nmay be imposed on an offender who has just reached adulthood or on a person with a \nmental illness will be grossly disproportionate, regardless of the gravity of the offence \nor the circumstances surrounding its commission. Such an out come seems to me to be \nentirely inconsistent with the deference owed to Parliament. Indeed, “if few mandatory \nminimums can survive the scrutiny exemplified in [my colleague’s] reasons on s.  12, \nthen one must question what role is left for Parliament’s legi timate policy choices in \nsetting punishment” ( Lloyd , at para.  107, per Wagner  J. (as he then was), Gascon and \nBrown  JJ., dissenting).  \n[224]  In any event, as explained above, I conclude that a nine -month term of \nimprisonment would be fit and appropriate for the o ffender in the first hypothetical \nscenario and that a six -month term of imprisonment is a fit and appropriate punishment \nin the second hypothetical scenario. In the first case, the imposition of the mandatory \nminimum sentence provided for in s.  172.1(2)(a)  results in an additional period of \nimprisonment of three months. In the second case, the application of s.  172.1(2) Cr. C. \nwould therefore result in an additional six months’ imprisonment if the offence were \nprosecuted by indictment.  \n2023 SCC 26 (CanLII)\n\n--- Page 137 ---\n \n [225]  I cannot bring myself  to conclude that any additional period of \nimprisonment has effects that are incompatible with human dignity, because this would \namount to indirectly introducing a standard of proportionality. I wish to make one \nimportant clarification. My remarks should n ot be taken to mean that, once \nincarceration is found to be the fit and appropriate punishment, any additional period \nof imprisonment is immune from constitutional scrutiny because the offender in \nquestion already has to deal with the negative effects asso ciated with imprisonment. In \nthis case, however, there is nothing in the record that allows me to identify “the precise \nharm associated” with this additional period of imprisonment ( Hills , at para.  133). \nNevertheless, since the period is relatively short, I am of the view that its effects are \nnot incompatible with human dignity.  \n(c) The Minimum Term of Imprisonment Is Not Grossly Disproportionate to \nWhat Is Necessary To Achieve Parliament’s Objectives  \n[226]  The final stage of the analysis is meant to determine whethe r the minimum \nsentence “goes beyond what is necessary to achieve Parliament’s sentencing objectives \nrelevant to the offence” (Hills , at para.  138). In this inquiry, courts must consider “the \nlegitimate purposes of punishment and the adequacy of possible al ternatives” ( Hills , at \npara.  138, quoting R. v. Smith , [1987] 1 S.C.R. 1045, at pp.  1099 -1100). However, it is \nessential to bear in mind at this stage that gross disproportionality is the constitutional \nstandard that applies in the analysis under s.  12 of the Charter . I reiterate this because, \nin my opinion, my colleague’s reasoning transforms the standard of gross \ndisproportionality into one of proportionality.  \n2023 SCC 26 (CanLII)\n\n--- Page 138 ---\n \n [227]  This shift in her analysis can first be seen at para.  158, where she argues \nthat, for offenders whose mental illness contributed to the commission of an offence,",
    "token_count": 1000,
    "start_token": 59400,
    "end_token": 60400,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 67,
    "source_file": "2023scc26.txt",
    "text": " in the analysis under s.  12 of the Charter . I reiterate this because, \nin my opinion, my colleague’s reasoning transforms the standard of gross \ndisproportionality into one of proportionality.  \n2023 SCC 26 (CanLII)\n\n--- Page 138 ---\n \n [227]  This shift in her analysis can first be seen at para.  158, where she argues \nthat, for offenders whose mental illness contributed to the commission of an offence, \n“specific deterrence, general deterrence and denunciation are of little use ”. With \nrespect, this argument misses the mark.  \n[228]  It is not for this Court to question the appropriateness or usefuln ess of the \npenological objectives set by Parliament. The Court’s role at this stage of the analysis \n— and indeed the role of any court tasked with assessing the constitutionality of a \nmandatory minimum sentence — is to determine whether the punishment goes  so far \nbeyond what is necessary to “achieve Parliament’s sentencing objectives relevant to \nthe offence ” (Hills , at para.  138 (emphasis added)) that it is grossly disproportionate. \nThe distinction is a subtle but very important one. Otherwise, courts are s tepping into \na role that is — and must remain — exclusive to Parliament, namely that of assessing \nthe utility of means of responding to social problems ( Malmo -Levine , at para.  177; \nLloyd , at para.  45). I note that the question is not whether Parliament cho se the least \nrestrictive means to achieve its objectives, an inquiry more akin to the one made in the \ncontext of applying s.  1 of the Charter  than to the scrutiny required under s.  12. \n[229]  With respect, I am of the view that the shift continues in the followin g \nparagraph of my colleague’s reasons, where she writes that the imposition of a \nminimum term of imprisonment of 6 or 12 months undermines the principle of \nproportionality and indicates that “P arliament has prioritized denunciation and \ndeterrence to the ne ar complete exclusion of rehabilitation ” (para.  159 (emphasis \n2023 SCC 26 (CanLII)\n\n--- Page 139 ---\n \n added)). But Parliament is perfectly at liberty to do so, provided that it leaves a door \nopen for rehabilitation “even in cases where this objective is of minimal importance” \n(Hills , at paras.  141-42, quoting Bissonnette , at para.  85). It has not been shown here \nhow, by creating minimum terms of imprisonment of six months and one year in \ns. 172.1(2) Cr. C., Parliament has completely excluded this objective.  \n[230]  There is a difference of three months (for the offender in the first \nhypothetical scenario) or six months (for the offender in the second hypothetical \nscenario) between the fit and appropriate sentence and the sentence provided for in \ns. 172.1(2)(a) Cr. C. In my opinion, this difference is not so great as to show that the \npunishment chosen by Parliament grossly exceeds what is necessary to achieve its \nobjectives of deterrence and denunciation of sexual violence against children. Perhaps \nthere is some dispro portion the application of which leads to a demonstrably unfit \npunishment, but this is not sufficient to declare s.  172.1(2)(a) and (b) Cr. C. \nunconstitutional.  \nIII. Conclusion  \n[231]  In summary, the reasonably foreseeable hypothetical scenarios discussed \nby my collea gue do not persuade me that the minimum sentences provided for in \ns. 172.1(2) Cr. C. are grossly disproportionate. In view of the gravity of this offence, \nthe fact that its scope is clearly circumscribed by the high level of mens rea  required , \nthe morally blameworthy and extremely harmful conduct targeted by the offence of \nchild luring, and the deference owed to Parliament’s public policy decisions with regard \n2023 SCC 26 (CanLII)\n\n--- Page 140 ---\n \n to sentencing, I am of the view that the impugned mandatory minimum sentences are \nnot contrary to s. 12 of the Charter . \n[232]  Accordingly, I would allow the appeal of the Attorney General of Quebec \nand the Crown in Mr.  Bertrand Marchand’s case. I would set aside the Quebec Court \nof Appeal’s declaration that s.  172.1(2)(a) Cr. C. is of no force or effect, and  I would \ndeclare that the one -year minimum term of imprisonment provided for in that section",
    "token_count": 1000,
    "start_token": 60300,
    "end_token": 61300,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 68,
    "source_file": "2023scc26.txt",
    "text": "not contrary to s. 12 of the Charter . \n[232]  Accordingly, I would allow the appeal of the Attorney General of Quebec \nand the Crown in Mr.  Bertrand Marchand’s case. I would set aside the Quebec Court \nof Appeal’s declaration that s.  172.1(2)(a) Cr. C. is of no force or effect, and  I would \ndeclare that the one -year minimum term of imprisonment provided for in that section \nis constitutional. For the reasons given by my colleague, I would set aside the sentence \nof five months’ imprisonment imposed on March 11, 2020, on the count of ch ild luring, \nand I would impose on Mr.  Bertrand Marchand a one -year term of imprisonment on \nthat count, to be served consecutively to his term of imprisonment for sexual \ninterference. I would order a permanent stay of execution of the modified sentence. I \nwould also allow the appeal of the Attorney General of Quebec and the Crown in H.V.’s \ncase. I would set aside the Quebec Superior Court’s declaration that s.  172.1(2)(b) \nCr. C. is invalid and of no force or effect, and I would declare that the six -month \nminimum term of imprisonment provided for in that section is constitutional. \nConsequently, I would set aside the sentence imposed on H.V. on February 25, 2021, \nand I would impose the mandatory minimum sentence of six months’ imprisonment on \nhim. I would order  a permanent stay of execution of the modified sentence.  \n Appeal  allowed in part, CÔTÉ J. dissenting in part (39935). Appeal \ndismissed, CÔTÉ J. dissenting (40093).  \n2023 SCC 26 (CanLII)\n\n--- Page 141 ---\n \n  Solicitor  for the appellant  His Majesty The King  (39935) : Director of \nCriminal and Penal Prosecutions , Montréal.  \n Solicitor for the appellant His Majesty The King (40093): Director of \nCriminal and Penal Prosecutions , Saint -Jérôme.  \n Solicitor s for the appellant  the Attorney General of Quebec  (39935) : \nBernard, Roy (Justice  Québec) , Montréal ; Ministère de la Justice du Québec — \nDirection du droit constitutionnel et autochtone , Québec . \n Solicitors for the appellant  the Attorney General of Quebec (40093): \nMinistère de la Justice du Québec — Direction du contentieux, Montréal; Ministère de \nla Justice  du Québec — Direction du droit constitutionnel et autochtone, Québec . \n Solicitor  for the respondent  Maxime Bertrand Marchand : Centre \nCommunautaire juridique  d’Alma , Alma.  \n Solicitors for the respondent H.V.: Desjardins Côté, Montréal.  \n Solicitor for the intervener the Director of Public Prosecutions: Public \nProse cution Service of Canada, Montré al. \n Solicitor for the intervener the Attorney General of Ontario: Attorney \nGeneral of Ontario, Crown Law Office — Criminal , Toronto.  \n2023 SCC 26 (CanLII)\n\n--- Page 142 ---\n \n  Solicitor for the intervener  the Attorney General of Saskatchewan: \nAttorney General of Saskatchewan, Regina.  \n Solicitor  for the intervener the Attorney General of Alberta: Alberta Crown \nProsecution Service — Appeals and Specialized Prosecutions Office , Calgary.  \n Solicitor for the inte rvener the Nunavik Civil Liberties Association: \nChristine Renaud, Montréal.  \n Solicitor  for the intervener Association québécoise des avocats et avocates \nde la défense: Hugo Caissy Avocat  (ad hoc), Amqui , Que.  \n Solicitor s for the intervener the Barbra Schlifer Commemorative Clinic: \nChugh Law Professional Corporation , Cornwall.  \n Solicitors for the intervener Association des avocats de la défense de \nMontréal: Réginal Victorin, Montréal; Walid Hijazi, Montréal.  \n Solicitor s for the intervener  the Independent Criminal Defence Advocacy \nSociety: Peck and Company, Vancouver.  \n2023 SCC 26 (CanLII)\n\n",
    "token_count": 915,
    "start_token": 61200,
    "end_token": 62115,
    "total_tokens_in_source": 62115
  },
  {
    "chunk_id": 69,
    "source_file": "2023scc26.txt",
    "text": " Company, Vancouver.  \n2023 SCC 26 (CanLII)\n\n",
    "token_count": 15,
    "start_token": 62100,
    "end_token": 62115,
    "total_tokens_in_source": 62115
  }
]