[
  {
    "chunk_id": 0,
    "source_file": "2024scc36.txt",
    "text": "--- Page 1 ---\n \n  \nSUPREME COURT OF CANADA  \n \nCITATION : Auer v. Auer, 2024 \nSCC  36   \nAPPEAL HEARD : April  25, 2024  \nJUDGMENT RENDERED : \nNovember 8, 2024  \nDOCKET : 40582  \n \nBETWEEN : \n \nRoland Nikolaus Auer  \nAppellant  \n \nand \n \nAysel Igorevna Auer and  \nAttorney General of Canada  \nRespondents  \n \n- and - \n \nAttorney General of Ontario,  \nAttorney General of Quebec,  \nAttorney General of British Columbia,  \nAttorney General of Saskatchewan,  \nTrial Lawyers Association of British Columbia,  \nHIV & AIDS Legal Clinic Ontario, Health Justice Program,  \nCanadian Council for Refugees, City of Calgary,  \nChicken Farmers of Canada, Egg Farmers of Canada,  \nTurkey Farmers of Canada, Canadian Hatching Egg Producers,  \nNational Association of Pharmacy Regulatory Authorities,  \nAssociation québécoise des avocats et avocates en droit de l’immigration,  \nWorkers’ Compensation Board of British Columbia,  \nCanadian Assoc iation of Refugee Lawyers,  \nAdvocates for the Rule of Law and Ecojustice Canada Society  \nInterveners  \n2024 SCC 36 (CanLII)\n\n--- Page 2 ---\n \n  \n \n \nCORAM : Wagner C.J. and Karakatsanis, Côté, Rowe, Martin, Kasirer, Jamal, \nO’Bonsawin and Moreau JJ.  \n \nREASONS FOR \nJUDGMENT :  \n(paras. 1 to 117)  Côté J. (Wagner C.J. and Karakatsanis, Rowe, Martin, \nKasirer, Jamal, O’Bonsawin and Moreau JJ. concurring)  \n \n \nNOTE: This document is subject to editorial revision before its reproduction in final \nform in the Canada Supreme Court Reports . \n   \n \n  \n2024 SCC 36 (CanLII)\n\n--- Page 3 ---\n \n Roland Nikolaus Auer  Appellant  \nv. \nAysel Igorevna Auer and  \nAttorney General of Canada  Respondents  \nand \nAttorney General of Ontario,  \nAttorney General of Quebec,  \nAttorney General of British Columbia,  \nAttorney General of Saskatchewan,  \nTrial Lawyers Association of British Colum bia, \nHIV  & AIDS Legal Clinic Ontario,  Health Justice Program,  \nCanadian Council for Refugees,  City of Calgary,   \nChicken Farmers of Canada, Egg Farmers of Cana da,  \nTurkey Farmers of Canada,  Canadian Hatching Egg Producers,  \nNational Association of Pharmacy Regulatory Authorities,  \nAssociation québécoise des avocats et avocates en droit de l’immigration,  \nWorkers’ Compensation Board of British Columbia,  \nCanadian Association of Refugee Lawyers,  \nAdvocates for the Rule of Law and  \nEcojustice Canada Society  Interven ers \nIndexed as: Auer  v. Auer  \n2024  SCC  36 \nFile No.: 40582.  \n2024:  April  25; 2024:  November  8. \n2024 SCC 36 (CanLII)\n\n--- Page 4 ---\n \n Present: Wagner  C.J. and Karakatsanis, Côté, Rowe, Martin, Kasire r, Jamal, \nO’Bonsawin and Moreau  JJ. \nON APPEAL  FROM  THE  COURT  OF APPEAL FOR  ALBERTA  \n Administrative law — Judicial review — Standard of review — \nSubordinate legislation — Vires — Federal child support guidelines challenged as \nultra vires Governor in Council — Standard of review applicable to review of vires of \nsubordinate legislation — Whether child supp ort guidelines within scope of authority \ndelegated to Governor in Council by enabling statute — Divorce Act, R.S.C. 1985, c.  3 \n(2nd Supp.), s.  26.1 — Federal Child Support Guidelines, SOR/97 -175. \n The father and the mother were married in 2004, had one chi ld together, \nand divorced in 2008. Their child resides with the mother. The father paid child support \nto the mother, but brought an application for judicial review challenging the vires of \nthe Federal Child Support Guidelines (“Guidelines ”), which determin e the amount of \nchild support to be paid in case of divorce. The father argued that the Governor in \nCouncil (“GIC”) exceeded its authority under s.  26.1(1) and (2) of the Divorce Act  \nwhen enacting the Guidelines  because they require a payer parent",
    "token_count": 1000,
    "start_token": 0,
    "end_token": 1000,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 1,
    "source_file": "2024scc36.txt",
    "text": ". The father paid child support \nto the mother, but brought an application for judicial review challenging the vires of \nthe Federal Child Support Guidelines (“Guidelines ”), which determin e the amount of \nchild support to be paid in case of divorce. The father argued that the Governor in \nCouncil (“GIC”) exceeded its authority under s.  26.1(1) and (2) of the Divorce Act  \nwhen enacting the Guidelines  because they require a payer parent to pay a  greater share \nof the child -related costs than the recipient parent.  \n The chambers judge held that following Canada (Minister of Citizenship \nand Immigration) v. Vavilov , 2019 SCC 65, [2019] 4 S.C.R. 653, reasonableness is the \npresumptive standard of revie w for assessing the vires of subordinate legislation, but \n2024 SCC 36 (CanLII)\n\n--- Page 5 ---\n \n that reasonableness review should be informed by the principles outlined in Katz Group \nCanada Inc. v. Ontario (Health and Long -Term Care) , 2013 SCC 64. The chambers \njudge concluded that the Guidelin es are intra vires and dismissed the father’s \napplication for judicial review.  \n The Court of Appeal unanimously dismissed the father’s appeal but was \ndivided on the applicable standard of review. The majority held that Vavilov did not \novertake Katz Group  and that to be ultra vires for being inconsistent with the purpose \nof the enabling statute, true regulations such as those established by the GIC must be \nirrelevant, extraneous, or completely unrelated to that purpose. A concurring judge held \nthat the reaso nableness standard applies when reviewing the vires of the Guidelines , \nand that the criteria set out in Katz Group inform reasonableness review.  \n Held : The appeal should  be dismissed.  \n Vavilov ’s robust reasonableness  standard is the presumptive standard for \nreviewing the vires of subordinate legislation. In the instant case, the Guidelines  fall \nreasonably within the GIC’s scope of authority under the Divorce Act , having regard \nto the relevant constraints. Under s.  26.1(1), the GIC is granted extremely broad \nauthority to establish guidelines respecting child support. Section 26.1(2) constrains \nthis authority by requiring that the guidelines be based on the principle that spouses \nhave a joint financial obligation to main tain the children of the marriage in accordance \nwith their relative abilities to contribute. The Guidelines respect this constraint.  \n2024 SCC 36 (CanLII)\n\n--- Page 6 ---\n \n  In Vavilov , the Court set out a comprehensive framework for determining \nthe standard of review that applies to any substan tive review of an administrative \ndecision and, in doing  so, contemplated questions involving challenges to the vires  of \nsubordinate legislation. Vavilov ’s framework established a presumption of \nreasonableness review, subject to limited exceptions where the  legislature has indicated \nthat it intends a different standard to apply or where the rule of law requires that the \ncorrectness standard be applied. This framework applies to determining the standard \nfor reviewing the vires  of subordinate legislation.  Subo rdinate legislation derives its \nvalidity from the statute which creates the power, and not from the executive body by \nwhich it is made. Accordingly, the identity of the decision maker who enacted it does \nnot determine the standard of review. Unless the leg islature has indicated otherwise, or \nthe rule of law requires otherwise, the vires of subordinate legislation are to be reviewed \non the reasonableness standard regardless of the delegate who enacted it, their \nproximity to the legislative branch or the proc ess by which the subordinate legislation \nwas enacted. In the instant case,  the legislature has not indicated that the GIC’s decision \nto establish the Guidelines  must be reviewed on a standard other than reasonableness, \nnor does the rule of law require that  questions of vires , in themselves, be reviewed for \ncorrectness. Accordingly, the presumptive standard of reasonableness applies.  \n In conducting a reasonableness review, the reviewing court asks whether \nthe decision bears the hallmarks of reasonableness  — justification, transparency and \nintelligibility — and whether it is justified in relation to the relevant factual and legal \nconstraints that bear on the decision. Many of the principles from the Court’s decision \n2024 SCC 36 (CanLII)\n\n--- Page 7 ---\n \n in Katz Group continue to inform reasonab leness review of the vires of subordinate \nlegislation and remain good law. Specifically: (1)  subordinate legislation must be \nconsistent both with",
    "token_count": 1000,
    "start_token": 900,
    "end_token": 1900,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 2,
    "source_file": "2024scc36.txt",
    "text": " reasonableness  — justification, transparency and \nintelligibility — and whether it is justified in relation to the relevant factual and legal \nconstraints that bear on the decision. Many of the principles from the Court’s decision \n2024 SCC 36 (CanLII)\n\n--- Page 7 ---\n \n in Katz Group continue to inform reasonab leness review of the vires of subordinate \nlegislation and remain good law. Specifically: (1)  subordinate legislation must be \nconsistent both with specific provisions of the enabling statute and with its overriding \npurpose or object; (2)  subordinate legislation benefits from a presumption of validity; \n(3) the challenged subordinate legislation and the enabling statute should be interpreted \nusing a broad and purposive approach to statutory interpretation; and (4)  a vires  review \ndoes not involve assessi ng the policy merits of the subordinate legislation to determine \nwhether it is necessary, wise, or effective in practice.  \n All of the above principles from Katz Group , including the principle that \nsubordinate legislation benefits from a presumption of vali dity, have been repeatedly \naffirmed by the Court’s jurisprudence. The presumption of validity has two aspects: \n(1) it places the burden on challengers  to demonstrate the invalidity of subordinate \nlegislation; and (2)  it favours an interpretive approach tha t reconciles the subordinate \nlegislation with its enabling statute so that, where possible, the subordinate legislation \nis construed in a manner which renders it intra vires . When the reasonableness standard \napplies, challengers must demonstrate that the s ubordinate legislation does not fall \nwithin a reasonable interpretation of the delegate’s statutory authority to overcome the \npresumption of validity. For subordinate legislation to be found ultra vires  on the basis \nthat it is inconsistent with the purpose  of the enabling statute, it no longer needs to be \nirrelevant, extraneous or completely unrelated to that statutory purpose — maintaining \nthis threshold from Katz Group in the face of the significant sea change brought about \nby Vavilov would perpetuate unc ertainty in the law, would be inconsistent with the \n2024 SCC 36 (CanLII)\n\n--- Page 8 ---\n \n robust reasonableness review detailed in Vavilov , and would undermine Vavilov ’s \npromise of simplicity, predictability and coherence. As such, there is a sound basis for \na narrow departure from Katz Group . \n Reasonableness review  is possible in the absence of formal reasons. Most \nof the time, formal reasons are not provided for the enactment of subordinate \nlegislation; however, Vavilov contemplated reasonableness review in the absence of \nformal reasons, incl uding in the context of a vires review of subordinate legislation. \nThe reasoning process can often be deduced from various sources. Furthermore, \nreasonableness review is not an examination of policy merits. A court’s role is to review \nthe legality or valid ity of the subordinate legislation, not to review whether it is \nnecessary, wise, or effective in practice. Potential or actual consequences of the \nsubordinate legislation are relevant only insofar as a reviewing court must determine \nwhether the statutory d elegate was reasonably authorized to enact subordinate \nlegislation that would have such consequences. The reasonableness standard does not \nassess the reasonableness of the rules promulgated by the relevant authority nor is it an \ninquiry into its underlying  political, economic, social, or partisan considerations; rather \nreviewing the vires of subordinate legislation is fundamentally an exercise of statutory \ninterpretation to ensure that the delegate has acted within the scope of their lawful \nauthority under the enabling statute.  The governing statutory scheme, other applicable \nstatutory or common law, and the principles of statutory interpretation are relevant \nconstraints when reviewing the vires of subordinate legislation. The language chosen \nby the legislat ure in an enabling statute describes the limits and contours of a delegate’s \n2024 SCC 36 (CanLII)\n\n--- Page 9 ---\n \n authority. The legislature may use precise and narrow language to delineate the power \nin detail, thereby tightly constraining the delegate’s authority, or may use broad, \nopen -ende d or highly qualitative language, thereby conferring broad authority on the \ndelegate. Statutory delegates must respect the legislature’s choice in this regard. The \nscope of a statutory delegate’s authority may also be constrained by other statutory or \ncomm on law. Unless the enabling statute provides otherwise, when enacting \nsubordinate legislation, statutory delegates must adopt an interpretation of their \nauthority that is consistent with other legislation and applicable common law \nprinciples.  \n In addition,  statutory delegates are empowered to interpret the scope of \ntheir authority when enacting subordinate legislation, but their interpretation must be \nconsistent with the",
    "token_count": 1000,
    "start_token": 1800,
    "end_token": 2800,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 3,
    "source_file": "2024scc36.txt",
    "text": "’s choice in this regard. The \nscope of a statutory delegate’s authority may also be constrained by other statutory or \ncomm on law. Unless the enabling statute provides otherwise, when enacting \nsubordinate legislation, statutory delegates must adopt an interpretation of their \nauthority that is consistent with other legislation and applicable common law \nprinciples.  \n In addition,  statutory delegates are empowered to interpret the scope of \ntheir authority when enacting subordinate legislation, but their interpretation must be \nconsistent with the text, context, and purpose of the enabling statute. The words of the \nenabling statute m ust be read in their entire context and in their grammatical and \nordinary sense harmoniously with the scheme of the Act, the object of the Act, and the \nintention of Parliament, in accordance with the modern principle of statutory \ninterpretation. In conduct ing a vires review, a court does not undertake a de novo \nanalysis to determine the correct interpretation of the enabling statute and then ask \nwhether, on that interpretation, the delegate had the authority to enact the subordinate \nlegislation. Rather, the  court ensures that the delegate’s exercise of authority falls \nwithin a reasonable interpretation of the enabling statute, having regard to the relevant \nconstraints.  \n2024 SCC 36 (CanLII)\n\n--- Page 10 ---\n \n  Applying the reasonableness standard to review the vires  of the Guidelines , \nthe conclusio n is that they are within the GIC’s scope of authority and are therefore \nintra vires . The GIC’s statutory grant of authority is extremely broad. The GIC was \nentitled to choose an approach to calculating child support that (1)  does not take into \naccount the  recipient parent’s income; (2)  assumes that parents spend the same linear \npercentage of income on their children regardless of the parents’ levels of income and \nthe children’s ages; (3)  does not take into account government child benefits paid to \nrecipien t parents; (4)  does not take into account direct spending on the child by the \npayer parent when that parent exercises less than 40 percent of annual parenting time; \nand (5)  risks double counting certain special or extraordinary expenses. Each of these \ndecisions fell squarely within the scope of the authority delegated to the GIC under the \nDivorce Act . \nCases Cited  \n Applied:  Canada (Minister of Citizenship and Immigration) v. Vavilov , \n2019 SCC 65, [2019] 4 S.C.R. 653; explained : Katz Group Canada Inc . v. Onta rio \n(Health and Long -Term Care) , 2013 SCC 64, [2013] 3 S.C.R. 810; referred to: Green \nv. Law Society of Manitoba , 2017 SCC 20, [2017] 1 S.C.R. 360; West Fraser Mills Ltd. \nv. British Columbia (Workers’ Compensation Appeal Tribunal) , 2018 SCC 22, [2018] \n1 S.C.R. 635; Canada (Canadian Human Rights Commission) v. Canada (Attorney \nGeneral) , 2018 SCC 31, [2018] 2 S.C.R. 230; Catalyst Paper Corp. v. North Cowichan \n(District) , 2012 SCC 2, [2012] 1 S.C.R. 5 ; United Taxi Drivers’ Fellowship of Southern \n2024 SCC 36 (CanLII)\n\n--- Page 11 ---\n \n Alberta v. Calgary (City) , 2004 SCC 19, [2004] 1 S.C.R. 485 ; Jafari v. Canada \n(Minister of Employment and Immigration) , [1995] 2 F.C. 595 ; Thorne’s Hardware \nLtd. v. The Queen , [1983] 1 S.C.R. 106; Terrigno v . Calgary (City) , 2021 ABQB 41, 1 \nAdm in. L.R. (7th) 134; Canada (Attorney General) v. Power , 2024 SCC 26; R. v. \nKirkpatrick , 2022 SCC 33; References re Greenhouse Gas Pollution Pricing Act , 2021 \nSCC 11, [2021] 1 S.C.R. 175; Reference re  Impact Assessment Act , 2023 SCC 23; \nCanadian Council for  Refugees v. Canada (Citizenship and Immigration) , 2023 SCC \n17; La Rose v. Canada , 2023 FCA 241, 488 D.L.R. (4th) 340; Portnov v. Canada  \n(Attorney General) , 2021 FCA",
    "token_count": 1000,
    "start_token": 2700,
    "end_token": 3700,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 4,
    "source_file": "2024scc36.txt",
    "text": "C 11, [2021] 1 S.C.R. 175; Reference re  Impact Assessment Act , 2023 SCC 23; \nCanadian Council for  Refugees v. Canada (Citizenship and Immigration) , 2023 SCC \n17; La Rose v. Canada , 2023 FCA 241, 488 D.L.R. (4th) 340; Portnov v. Canada  \n(Attorney General) , 2021 FCA 171, [2021] 4 F.C.R. 501; Innovative Medicines Canada \nv. Canada (Attorney General) , 2022 F CA 210, 8 Admin. L.R. (7th) 44 ; Reference as \nto the Validity of the Regulations in relation to Chemicals , [1943] S.C.R. 1; British \nColumbia (Attorney General) v. Le , 2023 BCCA 200, 482 D.L.R. (4th) 20; Minister of \nIndian Affairs and Northern Development v.  Ranville , [1982] 2 S.C.R. 518; Montréal \n(City) v. Montreal Port Authority , 2010 SCC 14, [2010] 1 S.C.R. 427; Dunsmuir v. \nNew Brunswick , 2008 SCC 9, [2008] 1 S.C.R. 190; Canada (Transport, Infrastructure \nand Communities) v. Farwaha , 2014 FCA  56, [2015] 2 F.C.R. 1006; Rizzo & Rizzo \nShoes Ltd. (Re) , [1998] 1 S.C.R. 27 ; Michel v. Graydon , 2020 SCC 24, [2020] 2 S.C.R. \n763; Childs v. Childs (1990), 107 N.B.R. (2d) 176; Francis v. Baker , [1999] 3 S.C.R. \n250; D.B.S . v. S.R.G. , 2006 SCC 37, [2006] 2 S.C.R. 231; Contino v. Leonelli -Contino , \n2005 SCC 63, [2005] 3 S.C.R.  217. \nStatutes and Regulations Cite d \n2024 SCC 36 (CanLII)\n\n--- Page 12 ---\n \n Bill C-41, An Act to amend the Divorce Act, the Family Orders and Agreements \nEnforcement Assistance Act, the Garnishment, Attachment and Pension \nDiversion Act and the Canada Shipping Act, 2nd Sess. , 35th Parl., 1996 -97. \nDivorce Act , R.S.C. 1985, c.  3 (2nd Supp.) , s. 26.1. \nFederal Child Support Guidelines , SOR/97 -175, ss. 1, 3 to 5, 7, 8, 9, 10. \nAuthors Cited  \nBlake, Sara. Clarity on the standard of review of regulations , December  20, 2022 \n(online:  https://canliiconnects.org/en/commentaries/90432 ; archived version: \nhttps://www.scc -csc.ca/cso -dce/2024SCC -CSC 36_1_eng.pdf ). \nCanada. Department of Justice. Child Support Team.  Formula for the Table of Amounts \nContained in the Federal Child Support Guidelines: A Technical Report . Ottawa, \n1997.  \nCanada. Federal/Provincial/Territorial Family Law Committee. Report and \nRecommendations on Child Support . Ottawa, 1995.  \nCanada. House of Commons. Standing Committee on Justice and Legal Affairs. \nEvidence , No.  54, 2nd Sess., 35th Parl., October  21, 1996, 17:10 to 17:15.  \nCanada. Senate. Standing Senate Committee on Social Affairs, Science and \nTechnology. Proceedings of the Standing Senate Committee on Social Affairs, \nScience and Technology , No.  17, 2nd Sess., 35th  Parl., December  11 and 12, \n1996.  \nDaly, Paul. A Culture of Justification: Vavilov and the Future of Administrative Law . \nVancouver: UBC Press,  2023.  \nDaly, Paul. Resisting which Siren’s Call? Auer v Auer, 2022 ABCA 375 and TransAlta \nGeneration Partnership v Alberta (Minister of Municipal Affairs), 2022 ABCA \n381,",
    "token_count": 1000,
    "start_token": 3600,
    "end_token": 4600,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 5,
    "source_file": "2024scc36.txt",
    "text": "., December  11 and 12, \n1996.  \nDaly, Paul. A Culture of Justification: Vavilov and the Future of Administrative Law . \nVancouver: UBC Press,  2023.  \nDaly, Paul. Resisting which Siren’s Call? Auer v Auer, 2022 ABCA 375 and TransAlta \nGeneration Partnership v Alberta (Minister of Municipal Affairs), 2022 ABCA \n381, November  24, 2022 (online: \nhttps://www.administrativelawmatters.com/blog/2022/11/24/resisting -which -\nsirens -call-auer-v-auer-2022 -abca-375-and-transalta -generation -partnership -v-\nalberta -minister -of-municipal -affairs -2022 -abca-381/; archived version : \nhttps://www.scc -csc.ca/cso -dce/2024SCC -CSC 36_2_eng.pdf ). \nFera, Norman. “New Child -Support Guidelines — A Brief Overview” (1997), 25 \nR.F.L. (4th) 356.  \n2024 SCC 36 (CanLII)\n\n--- Page 13 ---\n \n Finnie, Ross, Carolina Giliberti and Daniel Stripinis. An Ove rview of the Research \nProgram to Develop a Canadian Child Support Formula . Ottawa : Department of \nJustice , 1995.  \nKeyes, John Mark. “Judicial Re view of Delegated Legislation — The Road Beyond \nVavilov ” (2022), 35 C.J.A.L.P.  69. \nKeyes, John Mark. Executive Legislation , 3rd ed. Toronto: LexisNexis, 2021.  \nMancini, Mark  P. “One Rule to Rule Them All: Subordinate Legislation and the Law \nof Judicial Review” (2024), 55 Ottawa L. Rev.  245. \nPayne, Julien  D., and Marilyn  A. Payne. Child Support Guidelines in Canada, 2020 . \nToronto: Irwin Law, 2020.  \nSalembier, Paul. Regulatory Law and Practice , 3rd ed. Toronto: LexisNexis, 2021 . \nSullivan, Ruth. The Construction of Statutes , 7th ed. Toronto: LexisNexis, 2022.  \nWilson on Children and the Law , by Farrah Hudani, ed.  Toronto: LexisNexis, 1994  \n(loose -leaf updated August 2024, release 142).  \n APPEAL from a judgment of the Alberta Court of Appeal ( Crighton, \nPentelechuk and Feehan  JJ.A. ), 2022 ABCA 375 , 52 Alta. L.R. (7th) 8, [2023 ] 3 \nW.W.R. 209 , 81 R.F.L. (8th) 338 , [2022] A.J. No. 1389 (Lexis), 2022 CarswellAlta \n3388 (WL) , affirming a decision of Rothwell  J., 2021 ABQB 370, 32 Alta. L.R. (7th) \n250, [2021] A.J. No. 651 (Lexis), 2021 CarswellAlta 1166 (WL).  Appeal dismissed.  \n Laura Warner , Ronald Robinson , Ryan Phillips  and Paul Daly , for the \nappellant.  \n Tina Huizinga , K.C., for the respondent  Aysel Igorevna Auer . \n2024 SCC 36 (CanLII)\n\n--- Page 14 ---\n \n  Michael  H. Morris , Joseph Cheng  and Amy Martin -LeBlanc , for the \nrespondent  the Attorney General of Canada . \n Judie Im  and Michele Valentini , for the intervener the Attorney General of \nOntario.  \n Stéphane Rochette  and Francesca Boucher , for the intervener the Attorney \nGeneral of Quebec.  \n Emily Lapper  and Christine Bant , for the intervener the Attorney General \nof British Columbia.  \n Kyle McCreary  and Jared Biden , for the intervener the Attorney General \nof Saskatchewan.  \n Aubin  P. Calvert  and Devin Eeg , for the intervener  the Trial Lawyers \nAssociation of British Columbia.  \n Mannu Chowdhury , for the intervener s the HIV & AIDS L egal Clinic \nOntario and the Health Justice Program.  \n Jamie Liew  and Kamaljit Lehal , for the intervener the Canadian Council \nfor Refuge",
    "token_count": 1000,
    "start_token": 4500,
    "end_token": 5500,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 6,
    "source_file": "2024scc36.txt",
    "text": ".  \n Kyle McCreary  and Jared Biden , for the intervener the Attorney General \nof Saskatchewan.  \n Aubin  P. Calvert  and Devin Eeg , for the intervener  the Trial Lawyers \nAssociation of British Columbia.  \n Mannu Chowdhury , for the intervener s the HIV & AIDS L egal Clinic \nOntario and the Health Justice Program.  \n Jamie Liew  and Kamaljit Lehal , for the intervener the Canadian Council \nfor Refugees.  \n2024 SCC 36 (CanLII)\n\n--- Page 15 ---\n \n  Henry Chan  and Andrea Cole , for the intervener the City of Calgary.  \n Alyssa Holland , David Wilson  and Julie Mouris , for the intervener s the \nChicken Farmers of Canada, the Egg Farmers of Canada, the Turkey Farmers of \nCanada and the Canadian Hatching Egg Producers.  \n William  W. Shores , K.C., and Annabritt  N. Chisholm , for the intervener the \nNational Association of Pharmacy  Regulatory Authorities.  \n Lawrence David  and Gjergji Hasa , for the intervener Association \nquébécoise des avocats et avocates en droit de l’immigration.  \n Johanna Goosen , for the intervener the Workers’ Compensation Board of \nBritish Columbia.  \n Andrew  J. Brouwer and Erin V. Simpson , for the intervener the Canadian \nAssociation of Refugee Lawyers.  \n Ewa Krajewska , Peter Henein  and Brandon Chung , for the intervener the \nAdvocates for the Rule of Law.  \n Lindsay Beck  and Joshua Ginsberg , for the intervener the Ecojustice \nCanada Society.  \n2024 SCC 36 (CanLII)\n\n--- Page 16 ---\n \n  The judgment of the Court was delivered by  \n CÔTÉ J. — \n TABLE OF CONTENTS  \n \nParagraph  \nI. Overview  1 \nII. Facts  7 \nIII. Judicial History  10 \nA. Court of Queen’s Bench of Alberta, 2021 ABQB 370, 32 Alta. L.R. (7th) 250  10 \nB. Court of Appeal of Alberta , 2022 ABCA 375, 52 Alta. L.R. (7th) 8  14 \nIV. Issues  18 \nV. Standard of Review  19 \nA. Vavilov Is the Starting Point for Determining the Appropriate Standard of Review  19 \nB. The Vavilov Framework Applies When Reviewing the Vires of Subordinate \nLegislation  21 \nC. Reasonableness Is the Presumptive Standard for Reviewing the Vires of Subordinate \nLegislation  24 \nD. What Is the Role of Katz Group?  29 \n Many of the Principles From Katz Group  Continue To Apply  29 \n The “Irrelevant”, “Extraneous” or “Completely Unrelated” Threshold Is No  \n Longer Relevant  41 \nE. How To Conduct a Reasonableness Review of the Vires of Subordinate Legislation \nUnder the Vavilov Framework  50 \n(1) Reasonableness Review Is Possible in the Absence of Formal Reasons  52 \n(2) Reasonableness Review Is Not an Examination of Policy Merits  55 \n(3) The Relevant Constraints  59 \n Governing Statutory Scheme  61 \n Other Statutory or Common Law  63 \n Principles of Statutory Interpretation  64 \n2024 SCC 36 (CanLII)\n\n--- Page 17 ---\n \n VI. Analysis  67 \nA. Overview of the Child Support Guidelines  67 \nB. Mr. Auer’s Challenge  72 \nC. The Child Support Guidelines Are Within the GIC’s Scope of Authority  75 \n The GIC’s Statutory Grant of Authority Is Extremely Broad  75 \n The GIC Was Authorized Not To Take Into Account the Recipient Parent’s  \n Income in Calculating the Table Amounts  80 \n The GIC Was Authorized To Assume That Parents Spend the Same Linear  \n Percentage of Their Income on Their Children  90 \n The GIC Was Authorized Not To Take Into Account Government Child  \n Benefits Paid to the Recipient Parent in Calculating Child Support Awards  95 \n The GIC Was Authorized Not To Take Into Account the Payer Parent’s Direct  \nSpending When That Parent Exercises Less Than 40  Percent of Annual \nParenting Time  98 \n The GIC Was Authorized To Establish a Separate Category of Special or  \n Extraordinary Expenses  105 \nVII. Conclusion  114 \nI. Overview  \n[1] The Federal Child Support Guidelines , SOR/97 -175 (“ Child Support \n",
    "token_count": 1000,
    "start_token": 5400,
    "end_token": 6400,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 7,
    "source_file": "2024scc36.txt",
    "text": " Calculating Child Support Awards  95 \n The GIC Was Authorized Not To Take Into Account the Payer Parent’s Direct  \nSpending When That Parent Exercises Less Than 40  Percent of Annual \nParenting Time  98 \n The GIC Was Authorized To Establish a Separate Category of Special or  \n Extraordinary Expenses  105 \nVII. Conclusion  114 \nI. Overview  \n[1] The Federal Child Support Guidelines , SOR/97 -175 (“ Child Support \nGuidelines ”), established by the Governor in Council (“GIC”) under the Divorce Act , \nR.S.C. 1985, c.  3 (2nd  Supp.), determine the amount of child support to be paid in case \nof divorce, except in the province of Quebec. The appellant, Roland  Nikolaus  Auer, \nchallenges the vires of the Child Support Guidelines . This challenge requires our Court \nto determine whether the GIC acted within the scope of its delegated authority in \nestablishing the Child Support Guidelines . \n2024 SCC 36 (CanLII)\n\n--- Page 18 ---\n \n [2] To answer this question, our Court has to determine th e standard of review \nthat applies when reviewing the vires of subordinate legislation. Doing so requires the \nCourt to resolve debates about the continued relevance of Katz Group Canada Inc . v. \nOntario (Health and Long -Term Care) , 2013 SCC 64 , [2013] 3 S.C. R. 810 , in light of \nour Court’s decision in Canada (Minister of Citizenship and Immigration) v. Vavilov , \n2019 SCC 65 , [2019] 4 S.C.R. 653 . \n[3] I conclude that the reasonableness standard as set out in Vavilov \npresumptively  applies when reviewing the vires of subordinate legislation. I also \nconclude that some of the principles from Katz Group continue to inform such \nreasonableness review: (1) subordinate legislation must be consistent both with specific \nprovisions of the enabling statute and with its overrid ing purpose or object; (2) \nsubordinate legislation benefits from a presumption of validity; (3) the challenged \nsubordinate legislation and the enabling statute should be interpreted using a broad and \npurposive approach to statutory interpretation; and (4) a vires  review does not involve \nassessing the policy merits of the subordinate legislation to determine whether it is \nnecessary, wise, or effective in practice.  \n[4] However, for subordinate legislation to be found ultra vires on the basis \nthat it is inconsiste nt with the purpose of the enabling statute, it no longer needs to be \n“irrelevant”, “extraneous” or “completely unrelated” to that statutory purpose. \nContinuing to maintain this threshold from Katz Group would be inconsistent with the \n2024 SCC 36 (CanLII)\n\n--- Page 19 ---\n \n robust reasonableness  review  detailed in Vavilov and would undermine Vavilov ’s \npromise of simplicity, predictability and coherence.  \n[5] The Child Support Guidelines are intra vires the GIC. They fall within a \nreasonable interpretation of the scope of the GIC’s authority under s.  26.1 of the \nDivorce Act , having regard to the relevant constraints. Section 26.1(1) of the Divorce \nAct grants  the GIC extremely broad authority to establish guidelines respecting child \nsupport. This authority is constrained by s.  26.1(2) of the Divorce Act , which  requires \nthat the guidelines be based on the principle that spouses have a joint financial \nobligation to maintain the children of the marriage in accordance with their relative \nabilities to contribute. The Child Support Guidelines respect this const raint.  \n[6] Contrary to Mr.  Auer’s submissions, in selecting an approach to \ncalculating child support, the GIC was authorized to: (1) not take into account the \nrecipient parent’s income; (2) assume that parents spend the same linear percentage of \nincome on thei r children regardless of the parents’ levels of income and the children’s \nages; (3) not take into account government child benefits paid to recipient parents; (4) \nnot take into account direct spending on the child by the payer parent when that parent \nexerc ises less than 40  percent of annual parenting time; and (5) risk the double counting \nof certain special or extraordinary expenses. Each of these decisions falls squarely \nwithin the scope of the authority delegated to the GIC under the Divorce Act . \nAccordin gly, I would dismiss Mr.  Auer’s appeal.  \nII. Facts  \n2024",
    "token_count": 1000,
    "start_token": 6300,
    "end_token": 7300,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 8,
    "source_file": "2024scc36.txt",
    "text": "; (4) \nnot take into account direct spending on the child by the payer parent when that parent \nexerc ises less than 40  percent of annual parenting time; and (5) risk the double counting \nof certain special or extraordinary expenses. Each of these decisions falls squarely \nwithin the scope of the authority delegated to the GIC under the Divorce Act . \nAccordin gly, I would dismiss Mr.  Auer’s appeal.  \nII. Facts  \n2024 SCC 36 (CanLII)\n\n--- Page 20 ---\n \n [7] Roland  Auer and the respondent Aysel  Igorevna  Auer were married in \n2004. They had one child together in 2005 and divorced in 2008. Their child resides \nwith Ms.  Auer. Mr.  Auer has paid both child and spousal sup port to Ms.  Auer. \nMr. Auer also has children from other marriages to whom he owes, or has owed, \nsupport.  \n[8] Mr. Auer brought an application for judicial review challenging the vires \nof the Child Support Guidelines . He argued that the GIC exceeded its authority under \ns. 26.1(1) and (2) of the Divorce Act  when enacting the Child Support Guidelines \nbecause they require a payer parent to pay a greater share of the child -related costs than \nthe recipient parent. Ms.  Auer  did not participate in the application before the Court of \nQueen’s Bench of Alberta, and the Attorney General of Canada was granted leave to \nintervene with broad rights, such that he is now a respondent in this matter.  \n[9] Mr. Auer and Ms.  Auer have ongoing a pplications before the Court of \nKing’s Bench of Alberta concerning child and spousal support issues. Those \napplications have been heard and are subject to the outcome of this appeal.  \nIII. Judicial History  \nA. Court of Queen’s Bench of Alberta , 2021 ABQB 370, 32 Alt a. L.R. (7th) 250  \n[10] The chambers judge dismissed Mr.  Auer’s application for judicial review. \nHe held that, following Vavilov , the presumptive standard of review for assessing the \n2024 SCC 36 (CanLII)\n\n--- Page 21 ---\n \n vires of subordinate legislation is reasonableness, but that reasonableness rev iew \nshould be informed by the principles outlined in Katz Group . \n[11] The chambers judge held that s.  26.1(1) of the Divorce Act , which \nauthorizes the GIC to establish guidelines respecting orders for child support, confers \nthe GIC an “extremely broad grant of authority”, and that the Child Support Guidelines ’ \nprovisions were not irrelevant, extraneous or unrelated to the purpose of child support \n(para.  52; see also paras.  76 and 78).  \n[12] Mr. Auer argued that the Child Support Guidelines are ultra vires because \nthey require the payer parent to pay a greater share of the child -related costs than the \nrecipient parent. He relied heavily on s.  26.1(2) of the Divorce Act , which he said \nimposes a specific constraint on the GIC’s regulation -making authority. \nSection  26.1(2)  provides that the Child Support Guidelines  “shall be based on the \nprinciple that spouses have a joint financial obligation to maintain the children of the \nmarriage in accordance with their relative abilities to contribute to the performance of \nthat obliga tion”. Mr.  Auer argued that specific aspects of the Child Support Guidelines \nviolate the constraint imposed in s.  26.1(2) of the Divorce Act  by requiring the payer \nparent to bear a greater share of the child -related costs than the recipient parent. These \naspects include the presumption that both parents earn the same income, a court’s \nauthority to award special or extraordinary expenses under s.  7 of the Child Support \nGuidelines  and the decision not to include child tax benefits as part of the recipient \nparent’s income.  \n2024 SCC 36 (CanLII)\n\n--- Page 22 ---\n \n [13] The chambers judge accepted that s.  26.1(2) “informs, and to a degree, \nconstrains” the GIC’s grant of authority, but held that this constraint must be weighed \nagainst the GIC’s extremely broad grant of authority under s.  26.1(1) (para.  52). I n his \nview, most of the issues Mr.  Auer raised fell outside",
    "token_count": 1000,
    "start_token": 7200,
    "end_token": 8200,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 9,
    "source_file": "2024scc36.txt",
    "text": " Page 22 ---\n \n [13] The chambers judge accepted that s.  26.1(2) “informs, and to a degree, \nconstrains” the GIC’s grant of authority, but held that this constraint must be weighed \nagainst the GIC’s extremely broad grant of authority under s.  26.1(1) (para.  52). I n his \nview, most of the issues Mr.  Auer raised fell outside of a vires review because they \nsought to impugn the GIC’s policy decisions and ignored the GIC’s broad discretion \nunder the Divorce Act . The chambers judge ultimately concluded that the Child Supp ort \nGuidelines  are intra vires . \nB. Court of Appeal of Alberta , 2022 ABCA 375, 52 Alta. L.R. (7th) 8  \n[14] The Court of Appeal unanimously dismissed Mr.  Auer’s appeal. However, \nthe court was divided on the standard of review applicable to a review of the vires of \nsubordinate legislation.  \n[15] Writing for the majority, Pentelechuk  J.A. held that Vavilov did not \novertake Katz Group . In her view, to be ultra vires for being inconsistent with the \npurpose of the enabling statute, “true regulations” (para.  34), such as those established \nby the GIC, which create law through the exercise of a legislative function, must be \n“irrelevant”, “extraneous” or “completely unrelated” to that purpose ( Katz Group , at \npara.  28). However, the reasonableness standard applies when reviewing “by laws, \nrules, and regulations made by administrative tribunals or municipal governments” \n(C.A. reasons, at para.  34; see also para.  20). \n2024 SCC 36 (CanLII)\n\n--- Page 23 ---\n \n [16] Like the chambers judge, Pentelechuk  J.A. concluded that the Child \nSupport Guidelines are not “irrelevant”, “extraneous”  or “completely unrelated” to the \nDivorce Act ’s purpose. She noted that “[w]hile the Guidelines  may not be perfect, time \nhas demonstrated that they have achieved the stated intent of predictability and ease of \nuse” (para.  113). She found that the chambers judge’s analysis was thorough and \nproperly alive to the limitations of reviewing subordinate legislation and to the fact that \nMr. Auer’s arguments were inextricably woven with policy disputes. Thus, she \ndismissed Mr.  Auer’s appeal.  \n[17] Justice  Feehan concurred  in the result but held that the reasonableness \nstandard under the Vavilov  framework applies when reviewing the vires  of the Child \nSupport Guidelines. In his view, the criteria set out in Katz Group inform \nreasonableness review.  \nIV. Issues  \n[18] The issues on appeal  are as follows:  \n1. What is the applicable standard of review when reviewing the vires  of \nsubordinate legislation?  \n2. Are the Child Support Guidelines  ultra vires  the GIC under the Divorce \nAct? \n2024 SCC 36 (CanLII)\n\n--- Page 24 ---\n \n V. Standard of Review  \nA. Vavilov Is the Starting Point for Determining the  Appropriate Standard of \nReview  \n[19] Vavilov  represented a “recalibration of the governing approach to the \nchoice of standard of review analysis and a clarification of the proper application of the \nreasonableness standard” (para.  143). It “set out a holistic re vision of the framework \nfor determining the applicable standard of review” when conducting a substantive \nreview of an administrative decision ( ibid.). Our Court explained that Vavilov is the \nstarting point: “A court seeking to determine what standard is ap propriate in a case \nbefore it should look to these reasons first in order to determine how this general \nframework applies to that case” ( ibid.). \n[20] That said, Vavilov was not itself a case about the vires of subordinate \nlegislation.  It involved the judicial review of a decision by the Canadian Registrar of \nCitizenship to cancel Mr.  Vavilov’s certificate of citizenship on the basis that he was \nnot a Canadian citizen under s.  3(1)(a) of the Citizenship Act , R.S.C. 1985, c.  C-29, \nbecause  he fell within the ambit of an exception set out at s.  3(2)(a). Thus,",
    "token_count": 1000,
    "start_token": 8100,
    "end_token": 9100,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 10,
    "source_file": "2024scc36.txt",
    "text": ".  It involved the judicial review of a decision by the Canadian Registrar of \nCitizenship to cancel Mr.  Vavilov’s certificate of citizenship on the basis that he was \nnot a Canadian citizen under s.  3(1)(a) of the Citizenship Act , R.S.C. 1985, c.  C-29, \nbecause  he fell within the ambit of an exception set out at s.  3(2)(a). Thus, in Vavilov , \nour Court did not explicitly settle the standard of review that applies when reviewing \nthe vires of subordinate legislation (J.  M. Keyes, “Judicial Review of Delegated \nLegis lation  — The Road Beyond Vavilov ” (2022), 35 C.J.A.L.P.  69, at p.  100). \nHowever, as I explain below, Vavilov provides the appropriate framework for \n2024 SCC 36 (CanLII)\n\n--- Page 25 ---\n \n determining the standard of review in this context. Under that framework, I conclude \nthat the reasonableness  standard applies to the vires challenge in this case.  \nB. The Vavilov Framework Applies When Reviewing the Vires of Subordinate \nLegislation  \n[21] In Vavilov , our Court set out a comprehensive framework for determining \nthe standard of review that applies to any subs tantive review of an administrative \ndecision (para.  17). In doing so, this Court brought “greater coherence and \npredictability to this area of law” and eliminated the need for courts to engage in a \ncontextual inquiry to determine the appropriate standard o f review (paras.  10 and 17). \nOur Court recognized that “the sheer variety of decisions and decision makers” posed \na challenge to developing a coherent and unified approach to judicial review (para.  88). \nWe ensured that the revised framework “accommodates a ll types of administrative \ndecision making, in areas that range from immigration, prison administration and social \nsecurity entitlements to labour relations, securities regulation and energy policy” \n(para.  11). These include decisions of “specialized tribu nals exercising adjudicative \nfunctions, independent regulatory bodies, ministers, front -line decision makers, and \nmore .  . . vary[ing] in complexity and importance, ranging from the routine to the \nlife-altering .  . . includ[ing] matters of ‘high policy’ on  the one hand and ‘pure law’ on \nthe other” (para.  88). \n[22] In setting out Vavilov ’s comprehensive framework, our Court expressly \ncontemplated questions of vires . Specifically, this Court ceased to recognize \n2024 SCC 36 (CanLII)\n\n--- Page 26 ---\n \n jurisdictional questions  — also referred to as “true questions of jurisdiction or \nvires ” — as a distinct category of questions attracting correctness review (paras.  65-67 \nand 200). In doing so, we expressly re ferred to cases involving challenges to the vires \nof subordinate legislation, including Green v. Law Society of Manitoba , 2017 SCC 20 , \n[2017] 1 S.C.R. 360, and West Fraser Mills Ltd. v. British Columbia (Workers’ \nCompensation Appeal Tribunal) , 2018 SCC 22 , [2018] 1 S.C.R. 635  (Vavilov , at \npara.  66). This Court explained that “it is often difficult to distinguish between \nexercises of delegated power that raise truly jurisdictional questions from those \nentailing an unremarkable application of an enabling stat ute”, especially where, as in \nGreen and West Fraser Mills , “the legislature has delegated broad authority to an \nadministrative decision maker that allows the latter to make regulations in pursuit of \nthe objects of its enabling statute” ( Vavilov , at para.  66, citing Canada (Canadian \nHuman Rights Commission) v. Canada (Attorney General) , 2018 SCC 31 , [2018] 2 \nS.C.R. 230 , at para.  111, per Brown  J., concurring).  \n[23] Vavilov ’s framework  applies to determining the standard for reviewing the \nvires of subordinate legi slation. Vavilov set out a comprehensive framework for \ndetermining the applicable standard of review and, in doing so, contemplated questions \nof vires . \nC. Reasonableness Is the Presumptive Standard for Reviewing the Vires of \nSubordinate Legislation  \n2024 SCC 36 (CanLII)\n\n--- Page",
    "token_count": 1000,
    "start_token": 9000,
    "end_token": 10000,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 11,
    "source_file": "2024scc36.txt",
    "text": "curring).  \n[23] Vavilov ’s framework  applies to determining the standard for reviewing the \nvires of subordinate legi slation. Vavilov set out a comprehensive framework for \ndetermining the applicable standard of review and, in doing so, contemplated questions \nof vires . \nC. Reasonableness Is the Presumptive Standard for Reviewing the Vires of \nSubordinate Legislation  \n2024 SCC 36 (CanLII)\n\n--- Page 27 ---\n \n [24] Vavilov ’s framework established a presumption of reasonableness review. \nIt set out limited exceptions where the legislature has indicated that it intends a different \nstandard to apply or where the rule of law requires that the correctness standard be \napplied (para.  17). The questions for which the rule of law requires that the correctness \nstandard be applied include: (1) constitutional questions that require a final and \ndeterminate answer from the courts; (2) general questions of law of central importance \nto the lega l system as a whole; and (3) questions related to the jurisdictional boundaries \nbetween two or more administrative bodies (para.  53). \n[25] No exception to the presumption of reasonableness review applies in this \ncase. The legislature has not indicated that the GIC’s decision to establish the Child \nSupport Guidelines must be reviewed on a standard other than reasonableness, nor does \nthe rule of law require that the correctness standard be applied to a vires review of the \nChild Support Guidelines . \n[26] In Vavilov , our Court explained that the rule of law does not require that \nquestions of vires , in themselves, be reviewed for correctness (paras.  67-69 and 109; \nsee also J. M. Keyes,  Executive Legislation  (3rd ed. 2021), at pp.  171-72). A robust \nreasonableness review is sufficient to ensure that statutory delegates act within the \nscope of their lawful authority ( Vavilov , at paras.  67-69 and 109). Further, when \nexplaining that reasonableness review can be conducted even in the absence of reasons, \nour Court cited Catalyst P aper Corp. v. North Cowichan (District) , 2012 SCC 2 , [2012] \n2024 SCC 36 (CanLII)\n\n--- Page 28 ---\n \n 1 S.C.R. 5, and Green , both of which involved a review of the vires  of subordinate \nlegislation ( Vavilov , at para.  137).  \n[27] All of this indicates that Vavilov ’s robust reasonableness standard is the \ndefault standard when reviewing the vires of subordinate legislation (Keyes (2021), at \np. 171; see also Keyes (2022); P.  Daly, A Culture of Justification: Vavilov and the \nFuture of Administrative Law  (2023), at pp.  146-47; M.  P. Mancini, “One Rule to Rule \nThem All: Subordinate Legislation and the Law of Judicial Review” (2024), 55 Ottawa \nL. Rev.  245). However, in exceptional cases, a vires review may engage a question that \nthe rule of law requires be reviewed for correctness. In such cases, the presumption o f \nreasonableness review may be rebutted. For example, a challenge to the validity of \nsubordinate legislation on the basis that it fails to respect the division of powers \nbetween Parliament and provincial legislatures would require that the correctness \nstandard be applied.  \n[28] Reviewing the vires of the Child Support Guidelines  does not engage a \nquestion that the rule of law requires be reviewed for correctness. Accordingly, the \npresumptive standard of reasonableness applies in this case.  \nD. What Is the Role of Kat z Group?  \n(1) Many of the Principles From Katz Group  Continue To Apply  \n2024 SCC 36 (CanLII)\n\n--- Page 29 ---\n \n [29] In Katz Group , our Court upheld the validity of Ontario regulations adopted \nby the Lieutenant Governor in Council that aimed to control the price of prescription \ndrugs. Justice  Abella, writi ng for our Court, did not discuss the applicable standard of \nreview. However, she outlined the following principles for assessing the vires of \nsubordinate legislation:  \n “A successful challenge to the vires of regulations requires that they be \nshown to be in consistent with the objective of the enabling statute or \nthe scope of the statutory mandate” (para.  24); \n “Regulations benefit from a presumption of",
    "token_count": 1000,
    "start_token": 9900,
    "end_token": 10900,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 12,
    "source_file": "2024scc36.txt",
    "text": "drugs. Justice  Abella, writi ng for our Court, did not discuss the applicable standard of \nreview. However, she outlined the following principles for assessing the vires of \nsubordinate legislation:  \n “A successful challenge to the vires of regulations requires that they be \nshown to be in consistent with the objective of the enabling statute or \nthe scope of the statutory mandate” (para.  24); \n “Regulations benefit from a presumption of validity  . . . . This \npresumption has two aspects: it places the burden on challengers to \ndemonstrate the in validity of regulations . . . and it favours an \ninterpretive approach that reconciles the regulation with its enabling \nstatute so that, where possible, the regulation is construed in a manner \nwhich renders it intra vires ” (para.  25 (emphasis deleted) ); \n “Both the challenged regulation and the enabling statute should be \ninterpreted using a ‘broad and purposive approach . . . consistent with \nthe Court’s approach to statutory interpretation generally’” (para.  26, \nquoting United Taxi Drivers’ Fellowship of So uthern Alberta v. \nCalgary (City) , 2004 SCC 19, [2004] 1 S.C.R. 485, at para.  8); \n2024 SCC 36 (CanLII)\n\n--- Page 30 ---\n \n  “This inquiry does not involve assessing the policy merits of the \nregulations to determine whether they are ‘necessary, wise, or effective \nin practice’” (para.  27, quoting Jafari v. Canada (Minister of \nEmployment and Immigration) , [1995] 2 F.C. 595 (C.A.), at p.  604). \n“It is not an inquiry into the underlying ‘political, economic, social or \npartisan considerations’” or an assessment of whether the regulations \n“will actually suc ceed at achieving the statutory objectives” (para.  28, \nquoting Thorne’s Hardware Ltd. v. The Queen , [1983] 1 S.C.R. 106, at \npp. 112-13); \n The regulations “must be ‘irrelevant’, ‘extraneous’ or ‘completely \nunrelated’ to the statutory purpose to be found ultra vires  on the basis \nof inconsistency with statutory purpose” (para.  28). \n[30] For convenience, I will refer to the final principle as the “irrelevant”, \n“extraneous” or “completely unrelated” threshold.  \n[31] In setting out Vavilov ’s comprehensive framework for deter mining the \napplicable standard of review, our Court did not entirely discard prior jurisprudence. \nRather, the Court explicitly stated that “past precedents will often continue to provide \nhelpful guidance” (para.  143). This remains true even when considerin g cases \ninvolving “true questions of jurisdiction or vires ”, though they “will necessarily have \nless precedential force” because Vavilov ceased to recognize such questions as a \n2024 SCC 36 (CanLII)\n\n--- Page 31 ---\n \n distinct category attracting correctness review (paras.  65 and 143). As Paul  Daly \nexplains, “past jurisprudence has not been ‘ousted’” by Vavilov  ((2023) , at pp.  148-49, \nciting  Terrigno v . Calgary (City) , 2021 ABQB 41, 1 Admin. L.R. (7th) 134, at \npara.  62). Since Katz Group involved a true question of jurisdiction or vires , the Court  \nmust carefully examine the role  of that case going forward.  \n[32] In my view, all of the above -mentioned principles in Katz Group , except \nfor the “irrelevant”, “extraneous” or “completely unrelated” threshold, remain good \nlaw and continue to inform the review o f the vires of subordinate legislation. As I will \nexplain, the significant sea change brought about by Vavilov  in favour of a presumption \nof reasonableness as a basis for review erodes the rationale for the “irrelevant”, \n“extraneous” or “completely unrelat ed” threshold, and maintaining this threshold \nwould perpetuate uncertainty in the law. Accordingly, there is sound basis for a narrow \ndeparture from Katz Group  (see Canada (Attorney General) v. Power , 2024 SCC 26, \nat paras.  98 and 209; R. v. Kirkpatrick , 2022 SCC 33, at",
    "token_count": 1000,
    "start_token": 10800,
    "end_token": 11800,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 13,
    "source_file": "2024scc36.txt",
    "text": " review erodes the rationale for the “irrelevant”, \n“extraneous” or “completely unrelat ed” threshold, and maintaining this threshold \nwould perpetuate uncertainty in the law. Accordingly, there is sound basis for a narrow \ndeparture from Katz Group  (see Canada (Attorney General) v. Power , 2024 SCC 26, \nat paras.  98 and 209; R. v. Kirkpatrick , 2022 SCC 33, at para.  202, per Côté, Brown \nand Rowe  JJ., concurring). Otherwise, Katz Group  continues to “provide valuable \nguidance on the application of the reasonableness standard” (Daly (2023), at p.  148).  \nTo the extent that the principles in Katz Group do not conflict with Vavilov , they “are \nto form part of the application of the reasonableness standard” ( p. 149). \n[33] For greater clarity, the principle that subordinate legislation “must be \nconsistent both with specific provisions of the enabling statute and with its overriding \npurpose or object” continues to apply when conducting a vires review ( References re \n2024 SCC 36 (CanLII)\n\n--- Page 32 ---\n \n Greenhouse Gas Pollution Pricing Act , 2021 SCC 11 , [2021] 1 S.C.R. 175 , at para.  87; \nsee also Vavilov , at paras.  108 and 110; Reference re  Impact Assessment Act , 2023 SCC \n23, at para.  283, per Karakatsanis and Jamal  JJ., dissenting  in part, but not on this \npoint). The principle that subordinate legislation benefits from a presumption of \nvalidity also continues to apply ( Canadian Council for Refugees  v. Canada (Citizenship \nand Immigration) , 2023 SCC 17, at para.  54). Further, the challenged subordinate \nlegislation and the enabling statute should continue to be interpreted using a broad and \npurposive approach ( Green , at para.  28; West Fraser Mills , at para.  12). Finally, a vires  \nreview does not involve assessing the policy merits of the subordinate legislation to \ndetermine whether it is “necessary, wise , or effective in practice”. Courts are to review \nonly the legality or validity of subordinate legisla tion ( West Fraser Mills , at para.  59, \nper Côté  J., dissenting , but not on this point; La Rose v. Canada , 2023 FCA 241 , 488 \nD.L.R. (4th) 340, at para.  26; see also Mancini, at p.  276). \n[34] These well -established principles are consistent with Vavilov , and they \nshould continue to be applied in accordance with the foundational common law \nprinciple of stare decisis . \n[35] As explained, Vavilov recognized the continued relevance and application \nof prior jurisprudence insofar as that jurisprudence is consistent with Vavilo v’s \nframework for determining the appropriate standard of review and its principles \ngoverning robust reasonableness review. Nothing in Vavilov  contradicts the principles \nthat: (1) subordinate legislation “must be consistent both with specific provisions of  the \n2024 SCC 36 (CanLII)\n\n--- Page 33 ---\n \n enabling statute and with its overriding purpose or object”, (2) the challenged \nsubordinate legislation and the enabling statute are to be interpreted using a broad and \npurposive approach to statutory interpretation and (3) a review of the vires of \nsubordinate legislation does not involve assessing policy merits.  \n[36] The principle that subordinate legislation benefits from a presumption of \nvalidity has been criticized by some for being inconsistent with Vavilov (see Portnov \nv. Canada  (Attorney General) , 2021 FCA 171, [2021] 4 F.C.R. 501, at paras.  20-22; \nInnovative Medicines Canada v. Canada (Attorney General) , 2022 FCA 210, 8 Admin. \nL.R. (7th) 44, at para.  30). However, this criticism is mistaken.  \n[37] In Katz Group , our Court explained that this presumption has two aspects: \n(1) “it places the burden on challengers to demonstrate the invalidity of [subordinate \nlegislation]”; and (2) “it favours an interpretive approach that reconciles the \n[subordinate legislation] wi th its enabling statute so that, where possible , the \n",
    "token_count": 1000,
    "start_token": 11700,
    "end_token": 12700,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 14,
    "source_file": "2024scc36.txt",
    "text": ". (7th) 44, at para.  30). However, this criticism is mistaken.  \n[37] In Katz Group , our Court explained that this presumption has two aspects: \n(1) “it places the burden on challengers to demonstrate the invalidity of [subordinate \nlegislation]”; and (2) “it favours an interpretive approach that reconciles the \n[subordinate legislation] wi th its enabling statute so that, where possible , the \n[subordinate legislation] is construed in a manner which renders it intra vires ” (para.  25 \n(emphasis in original)).  \n[38] The first aspect  — that the burden is on challengers to demonstrate the \ninvalidity of s ubordinate legislation  — is uncontroversial. Indeed, in Vavilov , our Court \nexplained that where an administrative decision is reviewed for reasonableness, “[t]he \nburden is on the party challenging the decision to show that it is unreasonable” \n(para.  100).  \n2024 SCC 36 (CanLII)\n\n--- Page 34 ---\n \n [39] The second aspect  — that, where possible , subordinate legislation should \nbe construed in a manner that renders it intra vires  — is also consistent with Vavilov . \nThis aspect does not heighten the burden that challengers would otherwise face \npursuant to Vavilov. The burden on challengers depends on the applicable standard of \nreview. If the reasonableness standard applies, to overcome the presumption of validity, \nchallengers must demonstrate that the subordinate legislation does not fall within a \nreasonable  interpretation of the delegate’s statutory authority. If the correctness \nstandard applies, challengers can overcome the presumption of validity by \ndemonstrating that the subordinate legislation does not fall within the correct  \ninterpretation of the delegate’ s statutory authority.  \n[40] All of these principles from Katz Group , including the principle that \nsubordinate legislation benefits from a presumption of validity, have been repeatedly \naffirmed by our Court (see Vavilov , at paras.  108 and 110; References re Gree nhouse \nGas Pollution Pricing Act , at para.  87; Reference re  Impact Assessment Act , at \npara.  283; Canadian Council for Refugees , at para.  54; Green , at para.  28; West Fraser \nMills , at paras.  12 and 59 ). In these circumstances, it would be inconsistent with the \ncommon law tradition and the principle of stare decisis to discard Katz Group and the \ncontinued application of these principles.  \n(2) The “Irrelevant”, “Extraneous” or “Completely Unrelated” Threshold Is \nNo Longer Relevant  \n2024 SCC 36 (CanLII)\n\n--- Page 35 ---\n \n [41] Writing for a majority of the Cour t of Appeal, Pentelechuk  J.A. held that \nthe vires  of the Child Support Guidelines  was to be reviewed on the basis of the \n“irrelevant”, “extraneous” or “completely unrelated” threshold, instead of on the \nreasonableness standard in accordance with Vavilov . I disagree. As I explain in this \nsection, the conceptual basis for the “irrelevant”, “extraneous” or “completely \nunrelated” threshold does not hold in a legal landscape now organized by the principles \nset out in Vavilov , which centre around reasonableness r eview. This threshold from \nKatz Group is now out of step with these principles; maintaining it would perpetuate \nuncertainty in the law. Accordingly, the “irrelevant”, “extraneous” or “completely \nunrelated” threshold  does not provide a standalone rule for a  vires  review.  \n[42] Justice  Pentelechuk distinguished between “true regulations”, which create \nlaw through the exercise of a legislative function, such as those passed by the GIC, and \n“bylaws, rules, and regulations made by administrative tribunals or municipal  \ngovernments” (paras.  20 and 34). She held that the vires of “true regulations” are not \nto be reviewed on the reasonableness standard; rather, the appropriate test is whether \nthey are “irrelevant”, “extraneous” or “completely unrelated” to the purpose of their \nenabling statute, as outlined in Katz Group . By contr ast, the vires of bylaws, rules and \nregulations made by administrative tribunals or municipal governments are to be \nreviewed for reasonableness (para.  82). In making this distinction, Pentelechuk  J.A. \nrelied on the fact that",
    "token_count": 1000,
    "start_token": 12600,
    "end_token": 13600,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 15,
    "source_file": "2024scc36.txt",
    "text": " test is whether \nthey are “irrelevant”, “extraneous” or “completely unrelated” to the purpose of their \nenabling statute, as outlined in Katz Group . By contr ast, the vires of bylaws, rules and \nregulations made by administrative tribunals or municipal governments are to be \nreviewed for reasonableness (para.  82). In making this distinction, Pentelechuk  J.A. \nrelied on the fact that “true regulations” are subject to a “consultation process \nculminating in parliamentary review” while “bylaws, rules, and regulations made by \nadministrative tribunals or municipal governments” are not (para.  34). \n2024 SCC 36 (CanLII)\n\n--- Page 36 ---\n \n [43] According to Pentelechuk  J.A., the appropriate standard for reviewing the \nvires of subordinate legislation depends on the identity of the decision maker who \nenacted it. I disagree. The identity of the decision maker does not determine the \nstandard of review. “Regulations ‘derive their validity from the statute which creates \nthe p ower, and not from the executive body by which they are made’” ( Canadian \nCouncil for Refugees , at para.  51, citing Reference as to the Validity of the Regulations \nin relation to Chemicals , [1943] S.C.R. 1, at p.  13). In Vavilov , our Court noted the \n“sheer variety of [administrative] decisions and decision makers” and yet confirmed \nthat reasonableness is a single standard that takes account of this diversity (para.  88). \n[44] To summarize, unless the legislature has indicated otherwise or if a matter \ninvokes an is sue pertaining to the rule of law which would require a review on the basis \nof correctness, the vires of subordinate legislation are to be reviewed on the \nreasonableness standard regardless of the delegate who enacted it, their proximity to \nthe legislative  branch or the process by which the subordinate legislation was enacted. \nIntroducing these distinctions into the standard of review framework would be \n“contrary to the Vavilovian purposes of simplification and clarity” (P.  Daly, Resisting \nwhich Siren’s Cal l? Auer v Auer, 2022 ABCA 375 and TransAlta Generation \nPartnership v Alberta (Minister of Municipal Affairs), 2022 ABCA 381 , \nNovember  24 2022 (online) ; Daly (2023), at p.  147).  \n[45] In concurring reasons, Feehan  J.A. held that while the vires of subordinate \nlegislation are to be reviewed for reasonableness pursuant to Vavilov , the “irrelevant”, \n2024 SCC 36 (CanLII)\n\n--- Page 37 ---\n \n “extraneous” or “completely unrelated” threshold informs that analysis. He explained \nthat the presumption that subordinate legislation is valid may “be overcome if the \nregulation is ‘irrelevant’, ‘extraneous’ or ‘completely unrelated’ to the objectives of \ngoverning statutes” (para.  123(b)). The chambers judge was of a similar view (see \nparas.  17 and 78). I reject this approach. The “irrelevant”, “extraneous” or “completely  \nunrelated” threshold should not inform reasonableness review under the Vavilov  \nframework . This is because that threshold  is inconsistent with robust reasonableness \nreview under that framework and because maintaining it would undermine Vavilov ’s \npromise of  simplicity, predictability and coherence.  \n[46] Reasonableness review ensures that courts intervene in administrative \nmatters where it is truly necessary to do so to safeguard the legality, rationality and \nfairness of the administrative process ( Vavilov , at par a. 13). While reasonableness \nreview “finds its starting point in the principle of judicial restraint and demonstrates a \nrespect for the distinct role of administrative decision makers”, “[i]t remains a robust \nform of review” ( ibid.). By contrast, the “irre levant”, “extraneous” or “completely \nunrelated” threshold  connotes a very high degree of deference, one that is inconsistent \nwith the degree of scrutiny required under a reasonableness review (see British \nColumbia (Attorney General) v. Le , 2023 BCCA 200, 4 82 D.L.R. (4th) 20, at para.  94). \n[47] This inconsistency is of particular importance when considering “the \nconcern that an administrative decision",
    "token_count": 1000,
    "start_token": 13500,
    "end_token": 14500,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 16,
    "source_file": "2024scc36.txt",
    "text": "pletely \nunrelated” threshold  connotes a very high degree of deference, one that is inconsistent \nwith the degree of scrutiny required under a reasonableness review (see British \nColumbia (Attorney General) v. Le , 2023 BCCA 200, 4 82 D.L.R. (4th) 20, at para.  94). \n[47] This inconsistency is of particular importance when considering “the \nconcern that an administrative decision maker might interpret the scope of its own \nauthority beyond what the legislature intended” ( Vavilov , at para.  109; see also \n2024 SCC 36 (CanLII)\n\n--- Page 38 ---\n \n para.  68). In Vavilov , our Court explained that robust reasonableness review is “capable \nof allaying [this] concern” and allows “courts to fulfill their constitutional duty to \nensure that administrative bodies have acted within the scope of thei r lawful authority” \n(paras.  67 and 109). By contrast, the very high degree of deference that the “irrelevant”, \n“extraneous” or “completely unrelated” threshold accords statutory delegates in \ninterpreting their authority under their enabling statute does no t adequately address this \nconcern. This is demonstrated by Abella  J.’s comment that it would take an “egregious \ncase” to strike down subordinate legislation on the basis that it is “irrelevant”, \n“extraneous” or “completely unrelated” to the purpose of its enabling statute  (Katz \nGroup , at para.  28, citing Thorne’s Hardware , at p.  111).  \n[48] Further, Vavilov  sought to bring simplicity, predictability and coherence to \nthe analysis for determining the appropriate standard of review. Our Court noted that \nreasonablene ss is a single standard that applies in different contexts (para.  89). \nVavilov ’s objective of providing simplicity, predictability and coherence would be \nundermined if different tests, such as the “irrelevant”, “extraneous” or “completely \nunrelated” thresh old, applied as part of the reasonableness standard. Even if different \ntests were sufficiently robust, the mere fact of applying them would create undue \ncomplexity and fragmentation (Keyes (2022), at pp.  75-76; see also Innovative \nMedicines Canada , at para . 35). \n[49] Ultimately, we should depart from the “irrelevant”, “extraneous” or \n“completely unrelated” threshold established in Katz Group  because its rationale was \n2024 SCC 36 (CanLII)\n\n--- Page 39 ---\n \n eroded by Vavilov and because continuing to maintain it would “create or perpetuate \nuncertainty in the law” ( Vavilov , at para.  20; Minister of Indian Affairs and Northern \nDevelopment v. Ranville , [1982] 2 S.C.R. 518, at p.  528). \nE. How To Conduct a Reasonableness Review of the Vires of Subordinate \nLegislation Under the Vavilov Framework  \n[50] In conducting a reasonableness review,  “the reviewing court asks whether \nthe decision bears the hallmarks of reasonableness  — justification, transparency and \nintelligibility  — and whether it is justified in relation to the relevant factual and legal \nconstraints that bear on the decision” ( Vavilov , at para.  99). Subordinate legislation \nbenefits from a presumption of validity ( Katz Group , at para.  25). The burden is on the \nparty challenging the subordinate legislation to show that it is not reasonably within \nthe scope of the  delegate’s authority ( Vavilov , at paras.  100 and 109).  \n[51] Vavilov recognized two types of fundamental flaws that would make an \nadministrative decision unreasonable: (1) there is a failure of rationality internal to the \nreasoning process; or (2) the decision is untenable in light of the factual and legal \nconstraints that bear on it (para.  101). In what follows, I will explain how the principles \noutlined in Vavilov for conducting reasonableness review apply to a review of the vires \nof subordinate legislation.  \n(1) Reasonableness Review Is Possible in the Absence of Formal Reasons  \n2024 SCC 36 (CanLII)\n\n--- Page 40 ---\n \n [52] Most of the time formal reasons are not provided for the enactment of \nsubordinate legislation ( Vavilov , at para.  137). However, Vavilov",
    "token_count": 1000,
    "start_token": 14400,
    "end_token": 15400,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 17,
    "source_file": "2024scc36.txt",
    "text": " principles \noutlined in Vavilov for conducting reasonableness review apply to a review of the vires \nof subordinate legislation.  \n(1) Reasonableness Review Is Possible in the Absence of Formal Reasons  \n2024 SCC 36 (CanLII)\n\n--- Page 40 ---\n \n [52] Most of the time formal reasons are not provided for the enactment of \nsubordinate legislation ( Vavilov , at para.  137). However, Vavilov contemplated \nreasonableness review in the absence of f ormal reasons, including in the context of a \nvires review of subordinate legislation ( ibid., referring to Catalyst Paper  and Green ). \n“[E]ven in such circumstances, the reasoning process that underlies the decision will \nnot usually be opaque” ( Vavilov , at p ara. 137). The reasoning process can often be \ndeduced from various sources.  \n[53] In Catalyst Paper , our Court reviewed the validity of municipal taxation \nbylaws. Chief Justice  McLachlin noted that “[t]he reasons for a municipal bylaw are \ntraditionally deduced f rom the debate, deliberations and the statements of policy that \ngive rise to the bylaw” (para.  29). Courts can also look to regulatory impact analysis \nstatements if they are available. As Mancini explains:  \n. . . something akin to a form of justification  — whether a record of \nsubmissions, an accompanying statement of purpose, or specific \nrecitals  — may sometimes accompany regulatory action. \nSpecifically  — especially in the modern era  — the problem of having \nneither a record nor reasons is less likely to aris e. As [John Mark] Keyes \nnoted, the sources for the “reasoning process” of executive legislation \n“have become increasingly rich as the processes for making it have become \nmore transparent in the latter part of the 20th century and into the 21st.” At \nthe fed eral level, statutory instruments, like regulations, “are accompanied \nby Regulatory Impact Analysis Statements outlining the reasons for \nregulations and their anticipated impact.” Courts can use Regulatory \nImpact Analysis Statements to assess the reasonabl eness of executive \nlegislation by providing insight into the interlocking purposes of the \nenabling statute and regulatory instrument.  \n \n(pp. 278-79, citing J.  M. Keyes, “Judicial Review of Delegated \nLegislation: The Long and Winding Road to Vavilov ”, in University of \n2024 SCC 36 (CanLII)\n\n--- Page 41 ---\n \n Ottawa Faculty of Law, Working Paper No.  2020 -14 (June  18, 2020), at \np. 11, and J.  M. Keyes,  Executive Legislation (2nd ed. 2010) , at ch.  4.) \n[54] Even where such sources are not available, “it is possible for the record and \nthe context to reveal that a decision was made on the basis of an improper motive or \nfor another impermissible reason, as, for example, in Roncarelli [v. Duplessis , [1959] \nS.C.R. 121] ” (Vavilov , at para.  137). However, importantly, as I explain below, the \nissue of whether the r egulations is a reasonable decision depends on whether the \nregulations are justifiably (or reasonably) within the scope of the authority delegated \nby the enabling legislation.  \n(2) Reasonableness Review Is Not an Examination of Policy Merits  \n[55] Justice  Pentelechuk  was of the view that applying Vavilov ’s reasonableness \nstandard when reviewing the vires of subordinate legislation would violate the principle \nof separation of powers because the court would be examining the policy merits of the \nsubordinate legislation ( paras.  58-59 and 63; see also S.  Blake, Clarity on the standard \nof review of regulations , December  20, 2022 (online)).  \n[56] With respect, this concern is misplaced. As Paul  Salembier  explains, “[t]he \nreasonableness standard does not assess the reasonableness of the rules promulgated \nby the regulation -making authority; rather, it addresses the reasonableness of the \nregulation -making authority’s interpretation of its statutory regulatio n-making power” \n(Regulatory Law and Practice  (3rd ed. 2021), at p.  159). A court’s role is to review the \n2024 SCC 36 (CanLII)\n\n--- Page 42 ---\n \n legality or validity of the subordinate legislation,",
    "token_count": 1000,
    "start_token": 15300,
    "end_token": 16300,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 18,
    "source_file": "2024scc36.txt",
    "text": "ableness of the rules promulgated \nby the regulation -making authority; rather, it addresses the reasonableness of the \nregulation -making authority’s interpretation of its statutory regulatio n-making power” \n(Regulatory Law and Practice  (3rd ed. 2021), at p.  159). A court’s role is to review the \n2024 SCC 36 (CanLII)\n\n--- Page 42 ---\n \n legality or validity of the subordinate legislation, not to review whether it is “necessary, \nwise, or effective in practice” ( Katz Group , at para.  27, citing Jafari , at p.  604; see also \nKeyes (2021), at pp.  186-88). “It is not an inquiry into the underlying ‘political, \neconomic, social or partisan considerations’” ( Katz Group , at para.  28, citing Thorne’s \nHardware , at pp.  112-13). \n[57] A court must be mindful  of its proper role when reviewing the vires of \nsubordinate legislation, especially when it relies on the record, other sources or the \ncontext to ascertain the delegate’s reasoning process. Mancini explains:  \nImportantly courts must organize these various s ources properly to \npreserve the focus on the limiting statutory language. Again, the \nreasonableness review should not focus on the content of the inputs into \nthe process or the policy merits of those inputs. Rather, courts must key \nthese sources to the ana lysis of whether the subordinate instrument is \nconsistent with the enabling statute’s text, context, and purpose. For \nexample, Regulatory Impact Analysis Statements can inform a court as to \nthe link between an enabling statute’s purpose and a regulatory ai m, much \nlike Hansard evidence. These analyses can help show how the effects of a \nregulation which, at first blush appear unreasonable, are enabled by the \nprimary legislation. [p.  279] \n[58] The potential or actual consequences of the subordinate legislation are \nrelevant only insofar as a reviewing court must determine whether the statutory \ndelegate was reasonably authorized to enact subordinate legislation that would have \nsuch consequences. Whether those consequences are in themselves necessary, \ndesirable or wise  is not the appropriate inquiry.  \n(3) The Relevant Constraints  \n2024 SCC 36 (CanLII)\n\n--- Page 43 ---\n \n [59] In Vavilov , our Court explained that “[e]lements of the legal and factual \ncontexts of a decision operate as constraints on the decision maker in the exercise of its \ndelegated powers” (para.  105). Re viewing the vires of subordinate legislation is \nfundamentally an exercise of statutory interpretation to ensure that the delegate has \nacted within the scope of their lawful authority under the enabling statute (para.  108; \nMancini, at pp.  274-75; see, e.g.,  West Fraser Mills , at para.  23). \n[60] Accordingly, the governing statutory scheme, other applicable statutory or \ncommon law and the principles of statutory interpretation are particularly relevant \nconstraints when reviewing the vires of subordinate legislation  (Keyes (2021), at \np. 175).  \n(a) Governing Statutory Scheme  \n[61] “Because administrative decision makers receive their powers by statute, \nthe governing statutory scheme is likely to be the most salient aspect of the legal context \nrelevant to a particular decision” ( Vavilov , at paras.  108-9; Mancini, at p. 275). \n[62] The language chosen by the legislature in an enabling statute describes the \nlimits and contours of a delegate’s authority ( Vavilov , at para.  110). The legislature \nmay use precise and narrow language to delinea te the power in detail, thereby tightly \nconstraining the delegate’s authority. Alternatively, the legislature may use broad, \nopen -ended or highly qualitative language, thereby conferring broad authority on the \ndelegate ( ibid.; see also Keyes (2021), at pp.  195-96). Statutory delegates must respect \n2024 SCC 36 (CanLII)\n\n--- Page 44 ---\n \n the legislature’s choice in this regard. They “must ultimately comply ‘with the rationale \nand purview’” of their enabling statutory scheme in accordance with its text, context \nand purpose ( Vavilov , at para.  108, c iting Catalyst Paper , at paras.  15 and 25 -28, and \nGreen , at para.  44). \n(b) Other Statutory or Common Law  \n[63] The scope of a statutory delegate’s authority may also be constrained by \nother statutory or",
    "token_count": 1000,
    "start_token": 16200,
    "end_token": 17200,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 19,
    "source_file": "2024scc36.txt",
    "text": "must ultimately comply ‘with the rationale \nand purview’” of their enabling statutory scheme in accordance with its text, context \nand purpose ( Vavilov , at para.  108, c iting Catalyst Paper , at paras.  15 and 25 -28, and \nGreen , at para.  44). \n(b) Other Statutory or Common Law  \n[63] The scope of a statutory delegate’s authority may also be constrained by \nother statutory or common law. Unless the enabling statute provides otherwise, whe n \nenacting subordinate legislation, statutory delegates must adopt an interpretation of \ntheir authority that is consistent with other legislation and applicable common law \nprinciples ( Vavilov , at para.  111, referring to Katz Group , at paras.  45-48; Montréa l \n(City) v. Montreal Port Authority , 2010 SCC 14 , [2010] 1 S.C.R. 427, at para.  40; \nDunsmuir v. New Brunswick , 2008 SCC 9 , [2008] 1 S.C.R. 190 , at para.  74; Canada \n(Transport, Infrastructure and Communities) v. Farwaha , 2014 FCA 56 , [2015] 2 \nF.C.R. 1006 , at paras.  93-98; Keyes  (2021) , at pp.  205-6). \n(c) Principles of Statutory Interpretation  \n[64] Statutory delegates are empowered to interpret the scope of their authority \nwhen enacting subordinate legislation. Their interpretation must, however, be \nconsistent with th e text, context and purpose of the enabling statute ( Vavilov , at \nparas.  120-21; Keyes (2021), at p.  193). They must interpret the scope of their authority \nin accordance with the modern principle of statutory interpretation. The words of the \n2024 SCC 36 (CanLII)\n\n--- Page 45 ---\n \n enabling statut e must be read “in their entire context and in their grammatical and \nordinary sense harmoniously with the scheme of the Act, the object of the Act, and the \nintention of Parliament” ( Rizzo & Rizzo Shoes Ltd. (Re) , [1998] 1 S.C.R. 27, at para.  21, \nciting E.  A. Driedger, Construction of Statutes (2nd ed. 1983), at p.  87). \n[65] In conducting a vires review, a court does not undertake a de novo analysis \nto determine the correct interpretation of the enabling statute and then ask whether, on \nthat interpretation, the d elegate had the authority to enact the subordinate legislation. \nRather, the court ensures that the delegate’s exercise of authority falls within a \nreasonable interpretation of the enabling statute, having regard to the relevant \nconstraints.  \n[66] In what follows , I apply the reasonableness standard to review the vires of \nthe Child Support Guidelines . \nVI. Analysis  \nA. Overview of the Child Support Guidelines  \n[67] In Canada, child support has been legislated since 1855. Early statutory \nschemes vested judges with discretion to determine child support amounts based on \nneed. Judges were thus required to decide upon a reasonable amount of child support \nfor the care of the child ( Michel v. Graydon , 2020 SCC 24, [2020] 2 S.C.R. 763, at \npara.  46). This discretionary approach was heavi ly criticized for being “uncertain, \n2024 SCC 36 (CanLII)\n\n--- Page 46 ---\n \n inconsistent, and often resulting in unfair awards” (para.  48; J.  D. Payne and \nM. A. Payne, Child Support Guidelines in Canada, 2020  (2020), at p.  1). This was in \npart because “judges, counsel, or parties underestimat[ed ] the cost of raising a child” \nand because courts would insist on proof of the child’s expenses ( Michel , at para.  48). \nThis placed the burden of proof on the recipient parent, and where such evidence was \nnot adduced, there was concern that the award would be “subjective and somewhat \narbitrary” ( ibid., citing Childs v. Childs (1990), 107 N.B.R. (2d) 176 (C.A.), at para.  6). \n[68] As Martin  J. explained in her concurring reasons in Michel , the objective \nof the Child Support Guidelines  “was to",
    "token_count": 1000,
    "start_token": 17100,
    "end_token": 18100,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 20,
    "source_file": "2024scc36.txt",
    "text": " on the recipient parent, and where such evidence was \nnot adduced, there was concern that the award would be “subjective and somewhat \narbitrary” ( ibid., citing Childs v. Childs (1990), 107 N.B.R. (2d) 176 (C.A.), at para.  6). \n[68] As Martin  J. explained in her concurring reasons in Michel , the objective \nof the Child Support Guidelines  “was to remedy this situation by maintaining the \nprinciples core to child support while providing much -needed certainty, consistency, \npredictability, and efficiency” (para.  49, citing Francis v. Baker , [1999] 3 S.C.R. 250, \nat paras.  39-40). The federal, provincial and territorial gover nments formed a Family \nLaw Committee (“Committee”) to undertake major research studies on child support \nin Canada (Payne and Payne, at p.  1). The Committee “recommended the application \nof a child support formula under the Divorce Act , ‘guided by the princi ple that both \nparents have a responsibility to meet the financial needs of the children according to \ntheir income’” ( Michel , at para.  49, citing Federal/Provincial/Territorial Family Law \nCommittee, Report and Recommendations on Child Support (1995), at p.  i). In 1996, \nfollowing the Committee’s recommendation, Parliament introduced Bill  C-41, An Act \nto amend the Divorce Act, the Family Orders and Agreements Enforcement Assistance \nAct, the Garnishment, Attachment and Pension Diversion Act and the Canada Shipp ing \nAct, 2nd  Sess., 35th  Parl., 1996 -97 (as passed by the House of Commons on \n2024 SCC 36 (CanLII)\n\n--- Page 47 ---\n \n November  18, 1996). Bill  C-41 amended the Divorce Act to expressly authorize the \nGIC to establish guidelines respecting orders for child support ( Divorce Act , s. 26.1(1)) . \n[69] On May  1, 1997, the GIC established the Child Support Guidelines , which \nintroduced a “radical change” to child support rights and obligations under the Divorce \nAct (Payne and Payne, at p.  1). Our Court has described the purpose of the Child \nSupport Guidelines as being to “establish fair levels of support for children from both \nparents upon marriage breakdown, in a predictable and consistent manner” ( Francis , \nat para.  39; see also Child Support Guidelines , s. 1). While the Child Support \nGuidelines depart from the discretionary model that preceded them, they continue to \nreflect the following core principles: (1) child support is the right of the child; (2) the \nright to support survives the breakdown of the child’s parents’ marriage; (3) child \nsupport should, as much  as possible, provide children with the same standard of living \nthey enjoyed when their parents were together; and (4) the specific amounts of child \nsupport owed will vary based upon the income of the payer parent ( D.B.S . v. S.R.G. , \n2006 SCC 37 , [2006] 2 S.C.R. 231, at para.  38). \n[70] Section 3 of the Child Support Guidelines “creates a presumptive rule \nwhereby, unless otherwise provided by the Divorce Act  or under the Guidelines, the \namount of a child support order for children under the age of majority is (a)  the amount \nset out in the applicable table .  . . and (b) the amount, if any, determined under section  7 \nof the Guidelines for special or extraordinary expenses” (Payne and Payne, at p.  12). \nThe table amount “is a function of the income of the paying paren t and the number of \n2024 SCC 36 (CanLII)\n\n--- Page 48 ---\n \n children the award is to cover” ( Francis , at para.  1). The table “focus[es] on a system \nof ‘average’ justice and move[s] away from creating individual justice on a \ncase-by-case basis” (N.  Fera, “New Child -Support Guidelines  — A Brief Ov erview” \n(1997), 25 R.F.L. (4th) 356, at p.  356). The use of the table is “intended to bring about \nan objective and predictable determination of child support, and bring an end to the \nsubjective, ad hoc [pre -Child Support Guidelines ]",
    "token_count": 1000,
    "start_token": 18000,
    "end_token": 19000,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 21,
    "source_file": "2024scc36.txt",
    "text": " from creating individual justice on a \ncase-by-case basis” (N.  Fera, “New Child -Support Guidelines  — A Brief Ov erview” \n(1997), 25 R.F.L. (4th) 356, at p.  356). The use of the table is “intended to bring about \nan objective and predictable determination of child support, and bring an end to the \nsubjective, ad hoc [pre -Child Support Guidelines ] case decisions” (F.  Hudani, ed., \nWilson on Children and the Law (loose -leaf), at §  4.10). Judges may deviate from the \ntable amount in cases involving children over the age of majority ( Child Support \nGuidelines , s. 3(2)), payer parents with an income over $150,000 (s.  4), special  or \nextraordinary expenses (s.  7), shared parenting time (s.  9(b)) or undue hardship (s.  10). \n[71] A proper construction of a provision of the Child Support Guidelines \n“requires that the objectives of predictability, consistency and efficiency on the one \nhand, be balanced with those of fairness, flexibility and recognition of the actual \n‘condition[s], means, needs and other circumstances of the children’ on the other” \n(Contino v. Leonelli -Contino , 2005 SCC 63, [2005] 3 S.C.R. 217, at para.  33, citing \nFrancis , at para.  40). \nB. Mr. Auer’s Challenge  \n[72] Mr. Auer bears the burden of proving that the Child Support Guidelines are \nultra vires (Katz Group , at para.  25). He submits that the Child Support Guidelines are \nultra vires because they violate two constraints on the GIC’ s authority. First, the \namounts transferred can only be in respect of “direct child costs” and cannot more \n2024 SCC 36 (CanLII)\n\n--- Page 49 ---\n \n broadly redistribute income between parents (A.F., at para.  57). Mr.  Auer submits that \nthis constraint applies because support awards under the Child  Support Guidelines \ncompensate only for “direct child costs”; “indirect [child] costs” are left to the law of \nspousal support (para.  56). Second, under s.  26.1(2) of the Divorce Act , child -related \ncosts are to be shared according to the parents’ relative a bilities to contribute (para.  58). \n[73] According to Mr.  Auer, the Child Support Guidelines  violate these two \nconstraints by requiring the payer parent to bear more than their fair share of direct \nchild -related costs. This is because the Child Support Guidelines  (1) do not take into \naccount the recipient parent’s income; (2) incorrectly assume that parents spend the \nsame linear percentage of income on their children regardless of the parents’ levels of \nincome and the children’s ages; (3) do not take int o account government child benefits \npaid to the recipient parent; (4) do not take into account direct spending on the child by \nthe payer parent when that parent exercises less than 40  percent of annual parenting \ntime; and (5) double count the payer parent’ s obligations with respect to special or \nextraordinary expenses.  \n[74] Below, I will review each of Mr.  Auer’s submissions, having regard to the \nGIC’s authority under the Divorce Act . I conclude that the Child Support Guidelines  \nare intra vires  the GIC.  \nC. The Chil d Support Guidelines  Are Within the GIC’s Scope of Authority  \n(1) The GIC’s Statutory Grant of Authority Is Extremely Broad  \n2024 SCC 36 (CanLII)\n\n--- Page 50 ---\n \n [75] Section 26.1(1) of the Divorce Act grants the GIC extremely broad \nauthority to establish guidelines respecting orders for child support:  \n26.1 (1)  The Governor in Council may establish guidelines respecting \norders for child support, including, but without limiting the generality of \nthe foregoing , guidelines  \n \n(a) respecting the way in which the amount of an order for child support \nis to be de termined;  \n \n(b) respecting the circumstances in which discretion may be exercised \nin the making of an order for child support;  \n \n(c) authorizing a court to require that the amount payable under an order \nfor child support be paid in periodic payments, in a lu mp sum or in a \nlump sum and periodic payments;",
    "token_count": 1000,
    "start_token": 18900,
    "end_token": 19900,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 22,
    "source_file": "2024scc36.txt",
    "text": " generality of \nthe foregoing , guidelines  \n \n(a) respecting the way in which the amount of an order for child support \nis to be de termined;  \n \n(b) respecting the circumstances in which discretion may be exercised \nin the making of an order for child support;  \n \n(c) authorizing a court to require that the amount payable under an order \nfor child support be paid in periodic payments, in a lu mp sum or in a \nlump sum and periodic payments;  \n \n(d) authorizing a court to require that the amount payable under an order \nfor child support be paid or secured, or paid and secured, in the manner \nspecified in the order;  \n \n(e) respecting the circumstances tha t give rise to the making of a \nvariation order in respect of a child support order;  \n \n(f) respecting the determination of income for the purposes of the \napplication of the guidelines;  \n \n(g) authorizing a court to impute income for the purposes of the \napplica tion of the guidelines; and  \n \n(h) respecting the production of information relevant to an order for \nchild support and providing for sanctions and other consequences when \nthat information is not provided.  \n[76] The use of the language “without limiting the general ity of the foregoing” \nconfirms that this plenary power is not limited by anything that follows in s.  26.1(1) \n(see Vavilov , at para.  110; West Fraser Mills , at para.  10). \n2024 SCC 36 (CanLII)\n\n--- Page 51 ---\n \n [77] However, this power is not unrestricted. Section  26.1(2) provides as \nfollows:  \n(2) The guidelines shall be based on the principle that spouses have a joint \nfinancial obligation to maintain the children of the marriage in accordance \nwith their relative abilities to contribute to the performance of that \nobligation.  \n[78] Mr. Auer interprets “the principle that spouses have a joint financial \nobligation to maintain the children of the marriage” to mean that both parents must \ncontribute equally to child -related costs. I acknowledge that the principle under \ns. 26.1(2) is mandatory; this is made clear by Parliament’s use of the word “shall” \n(R. Sullivan, The Construction of Statutes  (7th ed. 2022), at §  4.05). However, a plain \nreading of s.  26.1(2) does not support Mr.  Auer’s interpretation.  \n[79] Section  26.1(2) does not require that each parent make an equal financial \ncontribution to maintaining their children. Rather, it states that each parent has a “joint \nfinancial obligation to maintain the children of the marriage in accordance with their \nrelative abilities to contribute to the performance of that obligation”. While a “joint \nfinancial obligation” means that the parents have a shared financial obligation to \nsupport their children, it does not necessarily mean that this obligation must be equal \n(see C.A. reasons, at para.  112). The constraint under s.  26.1(2) is expressed in broad \nterms. For example, it does not prescribe a particular method of estimating child -related \ncosts or state the percentage of child -related costs that each parent must cov er. Given \n2024 SCC 36 (CanLII)\n\n--- Page 52 ---\n \n this, while s.  26.1(2) constrains the GIC’s extremely broad grant of authority under \ns. 26.1(1), it does not restrict it as narrowly as Mr.  Auer submits.  \n(2) The GIC Was Authorized Not To Take Into Account the Recipient Parent’s \nIncome in Calculating  the Table Amounts  \n[80] Mr. Auer submits that the presumptive table amounts in the Child Support \nGuidelines violate the requirement in s.  26.1(2) that support awards be based on the \nparents’ “relative abilities to contribute” by ignoring the recipient parent’s income. In \nhis view, the table amounts cannot be based on the parents’ “relative abilities to \ncontribute” if they are based solely on the payer parent’s income.  \n[81] The formula on which the table amounts are based assumes that the payer \nparent and recipient pa rent have the same income ( chambers judge’s reasons , at \npara.  86). It only considers the payer parent’s income and seeks to determine the \namount that must be transferred from the payer parent to the recipient parent in order \nto make both households equally  well off (Department of Justice  Canada, Child \nSupport Team, Formula for the Table",
    "token_count": 1000,
    "start_token": 19800,
    "end_token": 20800,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 23,
    "source_file": "2024scc36.txt",
    "text": " payer parent’s income.  \n[81] The formula on which the table amounts are based assumes that the payer \nparent and recipient pa rent have the same income ( chambers judge’s reasons , at \npara.  86). It only considers the payer parent’s income and seeks to determine the \namount that must be transferred from the payer parent to the recipient parent in order \nto make both households equally  well off (Department of Justice  Canada, Child \nSupport Team, Formula for the Table of Amounts Contained in the Federal Child \nSupport Guidelines: A Technical Report  (1997) (“DOJ Report”) , at p. 2). As our Court \nexplained in D.B.S. , the Child Support Guideli nes move away from pure need -based \ncriteria towards an approach based on the payer parent’s income (para.  47). This \napproach shapes each parent’s free -standing obligation to support their children \ncommensurate with their income, “with the result that the t otal amount of child support \n2024 SCC 36 (CanLII)\n\n--- Page 53 ---\n \n is determined  — and not merely divided  — according to the income of the payor \nparent” (para.  48). \n[82] Adopting a formula for calculating the table amounts that does not \nexpressly consider the recipient parent’s income falls within a reasonable interpretation \nof the authority granted to the GIC. It is reasonable to interpret this authority as being \nconferred as part of the broad grant under s.  26.1(1), which includes the authority to \nestablish guidelines “respecting the way in which the amount of an order for child \nsupport is to be determined” and “respecting the determination of income for the \npurposes of the application of the guidelines”.  \n[83] The formula selected by the GIC for calculating the table amounts was \nrecommended by the Commi ttee after extensive research and consultation. In its report, \nthe Committee justified the decision regarding the recipient parent’s income in \ncalculating the table amounts as follows:  \nAlthough the formula appears to be based solely on the non -custodial \nparent’s income, this does not imply that the custodial parent does not \ncontribute to the financial needs of the child. On the contrary  — because \nthe child lives with the custodial parent and shares the same living standard \nas this parent, the custodial pare nt will continue to pay for the remaining \nexpenses in proportion to his/her income. [p.  i] \n[84] The Committee considered different options for the formula and how the \nawards should change with the recipient parent’s income:  \n2024 SCC 36 (CanLII)\n\n--- Page 54 ---\n \n With some other formulas the award ri ses; with others it falls; while with \nstill others it does not change at all. Thus, there is considerable \ndisagreement over how awards should change with the custodial parent’s \nincome. The Revised Fixed Percentage formula [which was recommended \nby the Comm ittee] retains the principle common to all fixed percentage \nsystems: the award does not vary with the income of the custodial parent. \n[p. ii] \n[85] The Committee explained that its recommended approach “is essentially \nchild -centred: the child benefits from the s tandard of living of the non -custodial parent \nbefore the separation/divorce and should retain this benefit after the \nseparation/divorce” (p.  ii). \n[86] During the debates on Bill  C-41, the then Minister of Justice, Allan  Rock, \nreiterated the Committee’s justific ations. He explained that it is fair to assume that the \nrecipient parent is supporting their child in a manner that is proportionate to their \nincome, because the child lives with the recipient parent and their standards of living \nare inseparable (House of Commons Standing Committee on Justice and Legal Affairs, \nEvidence , No.  54, 2nd  Sess., 35th  Parl., October  21, 1996, at 17:10 to 17:15; Standing \nSenate Committee on Social Affairs, Science and Technology, Proceedings of the \nStanding Senate Committee on Soci al Affairs, Science and Technology , No.  17, \n2nd Sess., 35th  Parl., December  11 and 12, 1996).  \n[87] As these justifications make clear, the formula for calculating the table \namounts takes into account the ways in which the recipient parent contributes to the \nfinancial needs of the child, as required by s.  26.1(2). It does so by assuming that, \nbecause the child resides with the recipient parent, that parent will support the child in",
    "token_count": 1000,
    "start_token": 20700,
    "end_token": 21700,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 24,
    "source_file": "2024scc36.txt",
    "text": "2nd Sess., 35th  Parl., December  11 and 12, 1996).  \n[87] As these justifications make clear, the formula for calculating the table \namounts takes into account the ways in which the recipient parent contributes to the \nfinancial needs of the child, as required by s.  26.1(2). It does so by assuming that, \nbecause the child resides with the recipient parent, that parent will support the child in \n2024 SCC 36 (CanLII)\n\n--- Page 55 ---\n \n a manner that is proportionate to their income. This assumption is consistent with  the \nobjectives of the Child Support Guidelines , which include establishing a fair standard \nof support for children that ensures that they continue to benefit from the financial \nmeans of both parents after separation (s.  1). \n[88] The parties do not dispute that  recipient parents contribute to child -related \ncosts by virtue of living with the children. While some recipient parents may contribute \na larger proportion of their income towards child -related costs than others, it was open \nto the GIC, in establishing a n ationwide regime for child support, to assume that \nrecipient parents contribute to child -related costs in proportion to their income. In \nreviewing the vires of the Child Support Guidelines , our Court must not assess the \npolicy merits of that assumption to determine whether it is “necessary, wise, or \neffective in practice” ( Katz Group , at para.  27, citing Jafari , at p.  604).  \n[89] For these reasons, I conclude that an interpretation of the GIC’s broad \nauthority to establish guidelines “respecting the way in which the amount of an order \nfor child support is to be determined” and “respecting the determination of income for \nthe purposes of the application of the guidelines” as including the authority to adopt a \nformula for calculating the table amounts based solely on  the payer parent’s income, is \nreasonable.  \n(3) The GIC Was Authorized To Assume That Parents Spend the Same Linear \nPercentage of Their Income on Their Children  \n2024 SCC 36 (CanLII)\n\n--- Page 56 ---\n \n [90] Mr. Auer submits that the Child Support Guidelines  unreasonably assume \nthat parents spend the same l inear percentage of income on their children regardless of \nthe parents’ income levels and the children’s ages. In his view, as income rises, the \noverall amount spent on children increases but the percentage of income spent on \nchildren decreases (A.F., at p ara. 138). He submits that this assumption results in payer \nparents paying a disproportionate share of child -related costs.  \n[91] The table amounts assume that parents spend the same linear percentage of \nincome on their children. The table establishes a fixed mo netary amount of support for \npayer parents whose annual income does not exceed $150,000. Where the payer \nparent’s annual income exceeds that amount, the amount payable is increased by a \ndesignated percentage of the payer parent’s income over $150,000 (Payn e and Payne, \nat p. 382). However, s.  4(b)(ii) of the Child Support Guidelines authorizes a court to \ndepart from the table amount in respect of the payer parent’s income above $150,000 \nif it considers the table amount to be “inappropriate” having regard to the “condition, \nmeans, needs and other circumstances of the children who are entitled to support and \nthe financial ability of each spouse to contribute to the support of the children”.  \n[92] Mr. Auer submits that courts are unlikely to depart from a linear \nappli cation of the table amounts despite having the discretion to do so (A.F., at \npara.  139). He asks our Court to consider this reality in assessing the validity of the \nChild Support Guidelines . \n2024 SCC 36 (CanLII)\n\n--- Page 57 ---\n \n [93] Under s.  26.1(1)(b) of the Divorce Act , the GIC is authorized to establish \nguidelines “respecting the circumstances in which discretion may be exercised in the \nmaking of an order for child support”. Thus, it was plainly open to the GIC to give \ncourts the discretion to depart from the table amo unts for annual payer parent incomes \nexceeding $150,000 if they consider those amounts to be “inappropriate”. Courts have \nthe discretion to decide whether to depart from a linear application of the table amounts. \nHow this discretion is exercised has no bea ring on the legality or validity of the Child \nSupport Guidelines . \n[94] Mr. Auer argues that the Child Support Guidelines fail to",
    "token_count": 1000,
    "start_token": 21600,
    "end_token": 22600,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 25,
    "source_file": "2024scc36.txt",
    "text": " the GIC to give \ncourts the discretion to depart from the table amo unts for annual payer parent incomes \nexceeding $150,000 if they consider those amounts to be “inappropriate”. Courts have \nthe discretion to decide whether to depart from a linear application of the table amounts. \nHow this discretion is exercised has no bea ring on the legality or validity of the Child \nSupport Guidelines . \n[94] Mr. Auer argues that the Child Support Guidelines fail to reflect the fact \nthat parents spend different percentages of their income on children at different ages. \nThe Child Support Guideline s do not consider the ages of the children, except when \nthey are over the age of majority. However, the GIC’s authority under s.  26.1(1) of the \nDivorce Act , which includes the authority to establish guidelines “respecting the way \nin which the amount of an order for child support is to be determined”, can reasonably \nbe interpreted as authorizing guidelines which do not take children’s specific ages into \naccount when calculating child support awards. Mr.  Auer has not met the burden of \nproving that the Child S upport Guidelines are invalid on this basis ( Katz Group , at \npara.  25). \n(4) The GIC Was Authorized Not To Take Into Account Government Child \nBenefits Paid to the Recipient Parent in Calculating Child Support Awards  \n2024 SCC 36 (CanLII)\n\n--- Page 58 ---\n \n [95] The formula used to calculate the table amount s does not include the \nfederal Canada Child Benefit and the GST/HST rebate for children paid to the recipient \nparent (DOJ Report, at p.  5; Payne and Payne, at p.  121). Mr.  Auer argues that these \nbenefits increase the recipient parent’s standard of living a nd decrease the income \nneeds created by the child (A.F., at para.  97). He submits that failing to consider them \nin calculating the table amounts causes the payer parent to overcontribute, contrary to \nthe principle under s.  26.1(2) of the Divorce Act . \n[96] The Child Support Guidelines represent a move away from a purely \nneeds -based approach towards one that seeks to maximize the amount available to be \nspent on children while ensuring that payer parents can adequately support themselves \n(D.B.S. , at para.  54; DOJ R eport, at p.  1). Government benefits improve children’s \nwelfare by increasing the ability of recipient parents to spend more on them than would \notherwise be possible. These benefits “are deemed to be the government’s contribution \nto children and [are] not available as income to the receiving parent” (DOJ Report, at \np. 5). \n[97] Section  26.1(1)(f) of the Divorce Act authorizes the GIC to establish \nguidelines “respecting the determination of income for the purposes of the application \nof the guidelines”. The GIC ele cted not to include government benefits paid to the \nrecipient parent when determining income for the purposes of calculating the table \namounts. That decision falls reasonably within the scope of the GIC’s broad authority. \n2024 SCC 36 (CanLII)\n\n--- Page 59 ---\n \n Again, it is not for our Court to assess the policy merits of that decision ( Katz Group , \nat paras.  27-28). \n(5) The GIC Was Authorized Not To Take Into Account the Payer Parent’s \nDirect Spending When That Parent Exercises Less Than 40  Percent of \nAnnual Parenting Time  \n[98] The table amounts do not ta ke into account the payer parent’s direct \nspending on the child; they “do not assume that the payor parent pays for the housing, \nfood, or any other expense for the child” ( Contino , at para.  52). However, s.  9 of the \nChild Support Guidelines  provides that i f each spouse exercises at least 40  percent of \nparenting time with a child over the course of a year, the amount of the child support \norder must be determined by taking into account: (a) the amounts set out in the \napplicable tables for each of the spouses;  (b) the increased costs of shared parenting \ntime arrangements; and (c) the conditions, means, needs and other circumstances of \neach spouse and of any child for whom support is sought.  \n[99] Once it is established that a payer parent exercises 40  percent or more  of \nannual parenting time, a court may consider the payer parent’s direct spending on the \nchild under s.  9(b). Section 9(b)",
    "token_count": 1000,
    "start_token": 22500,
    "end_token": 23500,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 26,
    "source_file": "2024scc36.txt",
    "text": " for each of the spouses;  (b) the increased costs of shared parenting \ntime arrangements; and (c) the conditions, means, needs and other circumstances of \neach spouse and of any child for whom support is sought.  \n[99] Once it is established that a payer parent exercises 40  percent or more  of \nannual parenting time, a court may consider the payer parent’s direct spending on the \nchild under s.  9(b). Section 9(b) “recognizes that the total cost  of raising children in \nshared custody situations may be greater than in situations where there is so le custody” \n(Contino , at para.  52 (emphasis in original)). It requires courts “to examine the budgets \nand actual child care expenses of each parent. These expenses will be apportioned \nbetween the parents in accordance with their respective incomes” (para.  53). \n2024 SCC 36 (CanLII)\n\n--- Page 60 ---\n \n [100]  Mr. Auer submits that it is unreasonable for the table amounts to assume \nthat payer parents do not spend directly on their children in addition to making support \npayments. In his view, failing to recognize that payer parents may spend directly on \ntheir chi ldren when they exercise between 0 and 39  percent of annual parenting time \nviolates the principle under s.  26.1(2) of the Divorce Act that spouses have a joint \nfinancial obligation to maintain the children of the marriage in accordance with their \nrelative abilities. He submits that the Child Support Guidelines are ultra vires on this \nbasis.  \n[101]  The GIC is authorized under s.  26.1(1) of the Divorce Act to establish \nguidelines “respecting the way in which the amount of an order for child support is to \nbe determin ed” and “respecting the circumstances in which discretion may be exercised \nin the making of an order for child support”. In my view, this authority permits the GIC \nto allow courts to consider payer parents’ direct spending on their children only when \nthe p ayer parent exercises at least 40  percent of annual parenting time. Section  26.1(2) \nstates only that parents have a “joint financial obligation” to maintain their children in \naccordance with their relative abilities to contribute. It does not require that each parent \nmake an equal financial contribution to child -related costs. Thus, the principle in \ns. 26.1(2) is not violated even if setting the threshold for considering payer parents’ \ndirect spending on their children at 40  percent of annual parenting time  results in some \npayer parents paying more than half of the child -related costs.  \n2024 SCC 36 (CanLII)\n\n--- Page 61 ---\n \n [102]  I do not mean to suggest that payer parents overcontribute. However, it is \nimportant to keep in mind, as counsel for Ms.  Auer explained during the hearing, that \nrecipient pare nts bear many financial responsibilities that are an inherent part of \nproviding primary care for a child (transcript, at pp.  45-47). Because the child lives \nprimarily with the recipient parent, the payer parent may not always share in these \nresponsibilitie s. \n[103]  Furthermore, s.  10(1) of the Child Support Guidelines provides that a court \nmay, on either spouse’s application, award an amount of child support that is different \nfrom the amount determined under ss.  3 to 5, 8 or 9 if the court finds that the spouse \nmaking the request would otherwise suffer undue hardship. Section 10(2) sets out \ncircumstances that may cause a spouse to suffer undue hardship. One such \ncircumstance is that “the spouse has unusually high expenses in relation to exercising \nparenting time wi th a child”. Courts therefore retain the discretion to ensure that payer \nparents contribute to child -related costs in accordance with their ability to do so without \nsuffering undue hardship, including as a result of having unusually high expenses in \nrelati on to exercising parenting time.  \n[104]  Interpreting the enabling statute as authorizing the making of guidelines \nwhich set the threshold percentage for when a court may consider the increased costs \nof shared parenting time arrangements is reasonable, as it falls  squarely within the \nGIC’s broad grant of authority and Mr.  Auer has not demonstrated that it violates the \nprinciple in s.  26.1(2). As mentioned, whether the GIC’s decision was “necessary, wise, \n2024 SCC 36 (CanLII)\n\n--- Page 62 ---\n \n or effective in practice” is",
    "token_count": 1000,
    "start_token": 23400,
    "end_token": 24400,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 27,
    "source_file": "2024scc36.txt",
    "text": " threshold percentage for when a court may consider the increased costs \nof shared parenting time arrangements is reasonable, as it falls  squarely within the \nGIC’s broad grant of authority and Mr.  Auer has not demonstrated that it violates the \nprinciple in s.  26.1(2). As mentioned, whether the GIC’s decision was “necessary, wise, \n2024 SCC 36 (CanLII)\n\n--- Page 62 ---\n \n or effective in practice” is irrelevant in the context of a vires review  (Katz Group , at \npara.  27, citing Jafari , at p.  604). \n(6) The GIC Was Authorized To Establish a Separate Category of Special or \nExtraordinary Expenses  \n[105]  Section  3(1) of the Child Support Guidelines sets out the presumptive rule \nregarding child support  awards: unless otherwise provided, the amount of a child \nsupport order for children under the age of majority is (a) the amount set in the \napplicable table and (b) the amount, if any, determined under s.  7 (special or \nextraordinary expenses).  \n[106]  Mr. Auer sub mits that adding s.  7 expenses to the table amounts in \naccordance with the presumptive rule results in the “double counting” of child expenses \nfor which the payer parent is responsible because “[a]ll conceivable average costs are \nreflected in the table amo unt” (A.F., at paras.  121 and 128). He adds that the scale \nchosen by the GIC to calculate the table amounts “produced high child cost estimates \nand, therefore, the highest child support awards” (para.  123). Thus, Mr.  Auer submits \nthat the Child Support Gui delines result in the payer parent overcontributing to \nchild -related costs, contrary to s.  26.1(2) of the Divorce Act . \n[107]  I reject Mr.  Auer’s submission.  \n2024 SCC 36 (CanLII)\n\n--- Page 63 ---\n \n [108]  Mr. Auer’s submission is rooted in a purely needs -based approach to child \nsupport. The underlying theory of a purely needs -based regime is that “both parents \nshould provide enough support to their children to meet their needs, and that they \nshould share this obligation proportionate to their incomes” ( D.B.S. , at para.  45). A \npurely needs -based approach begins  by calculating the child -related costs. It then \napportions those costs between the parents. If the amount of child support were to be \ndetermined solely on the basis of the child’s needs, it would be problematic for the \npresumptive rule to result in the “d ouble counting” of certain special or extraordinary \nexpenses.  \n[109]  However, the Child Support Guidelines have eschewed a purely \nneeds -based approach to child support ( D.B.S. , at para.  54). The Child Support \nGuidelines seek to ensure that the child benefits as m uch as possible from the income \nof both parents, in accordance with their relative abilities to contribute. Support awards \nrecognize that the child benefitted from the standard of living of the payer parent \npre-separation and should continue to retain this  benefit post -separation (Committee, \nat p. ii; R.  Finnie, C.  Giliberti and D.  Stripinis, An Overview of the Research Program \nto Develop a Canadian Child Support Formula  (1995), at p.  28). As the DOJ Report \nexplains at p.  1: \nThe concept of “cost of raising children” is an illusory theoretical \nconstruct. Spending on children is not fixed; it changes as the income of \neither parent changes. Families with higher incomes spend more on their \nchildren than do families of lower income. In the post separation \narrange ment, the Federal Child Support Guidelines aim to approximate, as \n2024 SCC 36 (CanLII)\n\n--- Page 64 ---\n \n closely as possible, the spending on the children that occurred in the \npre-separation family.  \n[110]  In short, the Child Support Guidelines begin with the payer parent’s income \nand determine the am ount of support that that parent must pay to ensure that the child \ncontinues to benefit from their income post -separation. The Child Support Guidelines \ndo not determine the child’s costs up front and then ask the payer parent to cover a \nportion of them. It  is assumed that “any financial contribution  from the [payer] parent \nwill typically be used to improve the child",
    "token_count": 1000,
    "start_token": 24300,
    "end_token": 25300,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 28,
    "source_file": "2024scc36.txt",
    "text": "  In short, the Child Support Guidelines begin with the payer parent’s income \nand determine the am ount of support that that parent must pay to ensure that the child \ncontinues to benefit from their income post -separation. The Child Support Guidelines \ndo not determine the child’s costs up front and then ask the payer parent to cover a \nportion of them. It  is assumed that “any financial contribution  from the [payer] parent \nwill typically be used to improve the child’s circumstances” (Payne and Payne, at p.  7). \n[111]  The parent applying for s.  7 expenses must demonstrate that the expenses \nare necessary in relation  to the child’s best interests and are reasonable in relation to \nthe means of the spouses and the child as well as the family’s spending pattern prior to \nthe separation. Where the recipient parent has applied for s.  7 expenses, the payer \nparent may challen ge the necessity or reasonableness of those expenses. A payer parent \ncould argue that the alleged s.  7 expenses are already covered by the table amount. \nHowever, it is ultimately up to the court to determine whether the applying parent has \nestablished that  the s.  7 expenses they seek are necessary and reasonable.  \n[112]  The GIC’s broad authority under s.  26.1(1) of the Divorce Act to establish \nguidelines “respecting the way in which the amount of an order for child support is to \nbe determined” clearly entitled the  GIC to adopt  guidelines that do not focus purely on \nthe child’s needs but instead seek to ensure that the child continues to benefit from the \npayer parent’s income in accordance with that parent’s ability to contribute. Further, \n2024 SCC 36 (CanLII)\n\n--- Page 65 ---\n \n the GIC’s authority to est ablish guidelines “respecting the circumstances in which \ndiscretion may be exercised in the making of an order for child support” entitled the \nGIC to grant courts the discretion to determine whether to include certain special or \nextraordinary expenses in a  child support award.  \n[113]  Thus, contrary to Mr.  Auer’s assertion, it is not problematic if there is some \noverlap between the expenses contemplated in the table amounts and “special or \nextraordinary” expenses under s.  7. The child continues to benefit from the payer \nparent’s income in accordance with that parent’s ability to contribute. Mr.  Auer has not \ndemonstrated that the potential for “double counting” s.  7 expenses arises from an \nunreasonable interpretation of the authority granted to the GIC in light of th e relevant \nconstraints, and has not met the burden of proving that the Child Support Guidelines \nare ultra vires . \nVII. Conclusion  \n[114]  The reasonableness standard under the Vavilov  framework presumptively \napplies when reviewing the vires of subordinate legislation. Katz Group continues to \nprovide helpful guidance. However, for subordinate legislation to be ultra vires on the \nbasis that it is inconsistent with the purpose of the enabling statute, it no longer needs \nto be “irrelevant”, “extraneous” or “completely unrela ted” to that statutory purpose. \nContinuing to maintain this threshold from Katz Group would be inconsistent with \nrobust reasonableness review  and would undermine Vavilov ’s promise of simplicity, \npredictability and coherence.  \n2024 SCC 36 (CanLII)\n\n--- Page 66 ---\n \n [115]  The Child Support Guidelines fall reasonably within the GIC’s scope of \nauthority under s.  26.1 of the Divorce Act , having regard to the relevant constraints. \nUnder s.  26.1(1), the GIC is granted extremely broad authority to establish guidelines \nrespecting child support. Section 26.1(2) constrains this authority by requiring that the \nguidelines be based on the principle that spouses have a joint financial obligation to \nmaintain the children of the marriage in accordance with their relative abilities to \ncontribute. The Child Support Guidel ines respect this constraint.  \n[116]  The GIC was entitled to choose an approach to calculating child support \nthat (1) does not take into account the recipient parent’s income; (2) assumes that \nparents spend the same linear percentage of income on their children r egardless of the \nparents’ levels of income and the children’s ages; (3) does not take into account \ngovernment child benefits paid to recipient parents; (4) does not take into account direct \nspending on the child by the payer parent when that parent exercis es less than \n40 percent of",
    "token_count": 1000,
    "start_token": 25200,
    "end_token": 26200,
    "total_tokens_in_source": 26950
  },
  {
    "chunk_id": 29,
    "source_file": "2024scc36.txt",
    "text": " child support \nthat (1) does not take into account the recipient parent’s income; (2) assumes that \nparents spend the same linear percentage of income on their children r egardless of the \nparents’ levels of income and the children’s ages; (3) does not take into account \ngovernment child benefits paid to recipient parents; (4) does not take into account direct \nspending on the child by the payer parent when that parent exercis es less than \n40 percent of annual parenting time; and (5) risks double counting certain special or \nextraordinary expenses. Each of these decisions fell squarely within the scope of the \nauthority delegated to the GIC under the Divorce Act . \n[117]  The appeal is dis missed with costs to the respondent Aysel  Igorevna  Auer.  \n Appeal  dismissed with costs.  \n2024 SCC 36 (CanLII)\n\n--- Page 67 ---\n \n  Solicitor s for the appellant:  Jensen Shawa Solomon Duguid Hawkes, \nCalgary ; Ronald Robinson  Barrister & Solicitor, Calgary ; Paul Daly Law Professional \nCorporation, Ottawa . \n Solicitor s for the respondent  Aysel Igorevna Auer : Huizinga Di Toppa \nColes & Layton, Edmonton.  \n Solicitor for the respondent  the Attorney General of Canada : Attorney \nGeneral of Canada , Department of Justice, National Litigation Sector — Ontario \nRegional Office , Toronto ; Attorney General of Canada, Department of Justice, \nNational Litigation Sector  — Prairie Regional Office, Edmonton . \n Solicitor for the intervener t he Attorney General of Ontario:  Ministry of \nthe Attorney General, Crown Law Office — Civil, Toronto.  \n Solicitor for the intervener the Attorney General of Quebec:  Ministère de \nla Justice du Québec , Québec.  \n Solicitor for the intervener the Attorn ey General of British \nColumbia:  Ministry o f Attorney General of British Columbia, Legal Services Branch, \nVancouver . \n Solicitor for the intervener the At torney General of Saskatchewan: \nSaskatchewan Ministry of Justice and Attorney General , Regina.  \n2024 SCC 36 (CanLII)\n\n--- Page 68 ---\n \n  Solicitors for the intervener the Trial Lawyers A ssociation of British \nColumbia:  Hunter Litigation Chambers, Vancouver.  \n Solicitors for the intervener s the HIV & AIDS Legal Clinic Ontario and  \nthe Health Justice Program:  Paliare Roland Rosenberg Rothstein, Toronto.  \n Solicitors for the intervener the Canad ian Council for Refugees:  Jamie \nLiew, Ottawa; Lehal Law Corporation , Delta  (B.C.) . \n Solicitor for the intervener the City of Calgary:  City of Calgary , Law/Legal \nServices and Security , Calgary.  \n Solicitors for the intervener s the  Chicken Farmers of Canada, the Egg \nFarmers of Canada, the Turkey Farmers of Canada and  the Canadian Hatching Egg \nProducers:  Conway Baxter Wilson, Ottawa.  \n Solicitors for the intervener the National Association of P harmacy \nRegulatory Authorities:  Shores Jardine, Edmonton.  \n Solicitors  for the intervener Association québécoise des avocats et \navoc ates en droit de l’immigration:  Hasa Avocats Inc., Montréal.  \n Solicitor for the intervener the Workers’ Compensation Boa rd of British \nColumbia:  Workers’  Compensation Board of British Columbia, Richmond.  \n2024 SCC 36 (CanLII)\n\n--- Page 69 ---\n \n  Solicitor s for the intervener the Canadian Association of Refugee \nLawyers:  Refugee Law Office, Toronto ; Landings, Toronto . \n Solicitors for the intervener  the Advocates for the Rule of Law:  Henein \nHutchiso n Robitaille, Toronto.  \n Solicitor for the intervener the Ecojustice Canada Society:  Ecojustice \nCanada Society, Toronto.  \n2024 SCC 36 (CanLII)\n\n",
    "token_count": 850,
    "start_token": 26100,
    "end_token": 26950,
    "total_tokens_in_source": 26950
  }
]