[
  {
    "chunk_id": 0,
    "source_file": "2024canlii108265.txt",
    "text": "--- Page 1 ---\n \n  \nSUPREME COURT OF CANADA  \n \nCITATION : R. v. Stevenson, 2024 \nSCC 41    \nAPPEAL HEARD AND JUDGMENT \nRENDERED : November 8, 2024  \nREASONS FOR JUDGMENT : \nDecember  5, 2024  \nDOCKET : 41269  \n \nBETWEEN : \n \nThomas Stevenson  \nAppellant  \n \nand \n \nHis Majesty The King  \nRespondent  \n \n- and - \n \nIndependent Criminal Defence Advocacy Society  \nIntervener  \n \n \n \nCORAM : Rowe, Martin, Kasirer, Jamal and O’Bonsawin  JJ. \n \nJOINT REASONS \nFOR JUDGMENT : \n(paras.  1 to 7) Martin, Kasirer, Jamal and O’Bonsawin  JJ. \n  \n2024 SCC 41 (CanLII)\n\n--- Page 2 ---\n \n DISSENTING \nREASONS : \n(paras.  8 to 11) Rowe  J. \n \n \n \nNOTE: This document is subject to editorial revision before its reproduction in final \nform in the Canada Supreme Court Reports . \n   \n \n  \n2024 SCC 41 (CanLII)\n\n--- Page 3 ---\n \n Thomas Stevenson  Appellant  \nv. \nHis Majesty The King  Respondent  \nand \nIndependent Criminal Defence Advocacy Society  Intervener  \nIndexed as: R. v. Stevenson  \n2024  SCC  41 \nFile No.: 41269.  \nHearing and judgment:  November 8 , 2024.  \nReasons delivered:  December 5,  2024.  \nPresent: Rowe, Martin, Kasirer, Jamal and O’Bonsawin JJ.  \nON APPEAL  FROM  THE  COURT OF APPEAL FOR SASKATCHEWAN  \n Criminal law — Evidence — Assessment — Unsavoury witness — Accused \nconvicted of robbery and of having face masked with intent to commit indictable offence \non basis of unsavoury witness testimony — Whether trial judge recognized dangers of \n2024 SCC 41 (CanLII)\n\n--- Page 4 ---\n \n relying on eviden ce of unsavoury witness — Whether trial judge entitled to accept \nevidence of unsavoury witness without corroboration.  \n The accused was convicted at trial of robbery and having his face masked \nwith the intent to commit an indictable offence. The robbery was  recorded on a security \ncamera video and revealed two participants, both of whom had their faces fully masked. \nThe Crown’s case hinged on the recognition evidence of a former gang associate of the \naccused, who identified him as a participant in the robbery . The trial judge found the \nformer associate’s evidence to be both credible and reliable and found the accused \nguilty. A majority of the Court of Appeal dismissed the appeal from conviction. The \ndissenting judge would have allowed the appeal and ordered a new trial on the basis \nthat the trial judge erred in law in applying the requisite Vetrovec  scrutiny to the \nevidence of the Crown’s unsavoury witness.  \n Held (Rowe J. dissenting) : The appeal should be dismissed.  \n Per Martin , Kasirer , Jamal  and O’Bonsawin  JJ.: There is no basis for \nappellate intervention. The trial judge recognized the Vetrovec  dangers and applied the \nrequisite scrutiny to the recognition evidence. She did not view the unsavoury witness \nas more worthy of belief because he had no motive to fal sely implicate the accused. \nThe trial judge did not err by finding that the unsavoury witness’ evidence was \nconsistent with the security camera video. She was entitled to accept the recognition \nevidence without corroboration because she was satisfied that it was true, and her \nfactual determinations on credibility and reliability are entitled to deference.  \n2024 SCC 41 (CanLII)\n\n--- Page 5 ---\n \n  Per Rowe  J. (dissenting): The appeal should be allowed and a new trial \nordered. The conviction arose from a failure to apply the requisite scrutiny to th e \nVetrovec  witness’ evidence. While it is open to a trier of fact to convict based solely on \nthe testimony of a Vetrovec  witness, a high degree of caution is warranted. In the instant \ncase, the Vetrovec  witness identified the accused from a short surveilla nce video where \ntwo robbers were masked and their respective heights indistinguishable, and the \nwitness then told police that the accused had confessed. When such a confession is \nrecounted only after the witness has identified the accused, the risk is enha nced that \n",
    "token_count": 1000,
    "start_token": 0,
    "end_token": 1000,
    "total_tokens_in_source": 2735
  },
  {
    "chunk_id": 1,
    "source_file": "2024canlii108265.txt",
    "text": " solely on \nthe testimony of a Vetrovec  witness, a high degree of caution is warranted. In the instant \ncase, the Vetrovec  witness identified the accused from a short surveilla nce video where \ntwo robbers were masked and their respective heights indistinguishable, and the \nwitness then told police that the accused had confessed. When such a confession is \nrecounted only after the witness has identified the accused, the risk is enha nced that \ntheir testimony is contrived.  \nCases Cited  \nBy Martin, Kasirer, Jamal and O ’Bonsawin JJ.  \n Referred to:  Vetrovec v. The Queen , [1982] 1 S.C.R. 811.  \nBy Rowe  J. \n Vetrovec v. The Queen , [1982] 1 S.C.R. 811; R. v. Kehler , 2004 SCC 11, \n[2004] 1 S.C.R. 328; R. v. Khela , 2009 SCC 4, [2009] 1 S.C.R. 104; R. v. Smith , 2009 \nSCC 5, [2009] 1 S.C.R. 146; R. v. Hurley , 2010 SCC 18, [2010] 1 S.C.R. 637; R. v. \nSauvé  (2004),  182 C.C.C. (3d) 321.  \n2024 SCC 41 (CanLII)\n\n--- Page 6 ---\n \n  APPEAL from a judgment of the Saskatchewan Court of Appeal \n(Kalmakoff and Drennan JJ.A. and Layh J. ( ad hoc )), 2024 SKCA 40 , 436 C.C.C. (3d) \n279, [2024] S.J. No.  92 (Lexis), 2024 CarswellSask 138 (WL) , affirming the \nconviction s of the accused for robbery and having his face masked with the intent to \ncommit  an indictable offence. Appeal dismissed, Rowe J. dissenting.  \n Thomas Hynes  and Logan R. Marchand , for the appellant.  \n Andrew S. Davis , for the respondent.  \n Tony C. Paisana  and Nikos Harris , K.C., for the intervener.  \n The following are the reasons for judgment delivered by  \n MARTIN , KASIRER , JAMAL AND O’B ONSAWIN JJ. —  \n[1] The appellant was convicted at trial before a provincial court judge of the \noffences of robbery and having his face masked with the intent to commit an indictable \noffence. The robbery was recorded on a security camera video and revealed two \nparticipants, both of whom had their faces fully masked, in a sequence that lasted about \na minute. The sole issue at trial was  the appellant’s identity.  \n[2] The Crown’s case against the appellant hinged on the recognition evidence \nof C.S., a former gang associate of the appellant, who identified the appellant as a \n2024 SCC 41 (CanLII)\n\n--- Page 7 ---\n \n participant in the robbery. The trial judge found C.S.’s evidence to b e both credible and \nreliable and found the appellant guilty. A majority of the Court of Appeal for \nSaskatchewan dismissed the appeal from conviction. Drennan J.A., in dissent, would \nhave allowed the appeal and ordered a new trial (2024 SKCA 40, 436 C.C.C. (3d) 279). \nThe appellant now appeals to this Court as of right on the question of whether the trial \njudge erred in law in assessing the evidence of the Crown’s unsavoury witness.  \n[3] We would dismiss the appeal. We agree with Kalmakoff J.A., for the \nmajority, that the trial judge’s reasons “amply demonstrate that she recognized the \ndangers of relying on C.S.’s evidence in a general sense and based on Vetrovec  \nconsiderations” (para. 75, citing Vetrovec v. The Queen , [1982] 1 S.C.R. 811 ). \n[4] First, the trial judge did not view the evidence of C.S. as more worthy of \nbelief on the basis that C.S. had no motive to falsely implicate the appellant. In our \nview, having self -instructed on the dangers associated with C.S.’s evidence and applied \nto it the requisite scrutiny,  the trial judge was entitled to accept that evidence without \ncorroboration because she was satisfied that it was true.  \n[5] Second, the trial judge did not",
    "token_count": 1000,
    "start_token": 900,
    "end_token": 1900,
    "total_tokens_in_source": 2735
  },
  {
    "chunk_id": 2,
    "source_file": "2024canlii108265.txt",
    "text": " the trial judge did not view the evidence of C.S. as more worthy of \nbelief on the basis that C.S. had no motive to falsely implicate the appellant. In our \nview, having self -instructed on the dangers associated with C.S.’s evidence and applied \nto it the requisite scrutiny,  the trial judge was entitled to accept that evidence without \ncorroboration because she was satisfied that it was true.  \n[5] Second, the trial judge did not engage in circular reasoning by finding that \nthe evidence of C.S. was more credible because it was consi stent with the contents of \nthe security camera video. The trial judge simply found that the evidence of C.S. \nprovided contextual details based on his personal knowledge and experience of the \nappellant, which supported the truthfulness of his testimony. The  trial judge was best \npositioned to make this credibility determination.  \n2024 SCC 41 (CanLII)\n\n--- Page 8 ---\n \n [6] Lastly, we do not accept that the trial judge did not apply the requisite \nscrutiny to the reliability of C.S.’s recognition evidence. In our view, the trial judge \nunderstood and corre ctly applied the relevant legal principles bearing on reliability. Her \nfactual determinations on reliability are entitled to deference, as Kalmakoff J.A. \nproperly noted at para.  75 of his reasons.  \n[7] Accordingly, we see no basis for appellate intervention and  we would \ndismiss the appeal.  \n The following are the reasons delivered by  \n ROWE J. — \n[8] As a matter of law, it is open to a trier of fact to convict based solely on the \ntestimony of a Vetrovec  witness; yet, a high degree of caution is warranted, given the \ninherent weaknesses of such evidence ( Vetrovec v. The Queen , [1982] 1 S.C.R. 811, at \npp. 830 -32; R. v. Kehler , 2004 SCC 11, [2004] 1 S.C.R. 328, at paras. 16 -17; R. v. \nKhela , 2009 SCC 4, [2009] 1 S.C.R. 104, at paras. 2, 11 and 47; R. v. Smith , 2009 SCC \n5, [2009] 1 S.C.R. 146 , at para. 14;  R. v. Hurley , 2010 SCC 18, [2010] 1 S.C.R. 637 , at \npara. 12 ). \n[9] In this case, the only evidence linking the accused to the offence was the \ntestimony of a Vetrovec  witness. This witness, while in custody for an unrelated \noffenc e, identified the accused from a short surveillance video where two robbers were \n2024 SCC 41 (CanLII)\n\n--- Page 9 ---\n \n masked and their respective heights were indistinguishable. After identifying the \naccused from the video, the witness then told police that the accused had confessed to \nthe ro bbery.  \n[10] Such an alleged confession by an accused can feature in the testimony of a \nVetrovec  witness ( R. v. Sauvé  (2004),  182 C.C.C. (3d) 321 (Ont. C.A.), at para.  76); \nwhen such a confession is recounted to police only after the Vetrovec  witness has \nidentified the accused, the risk is enhanced that the witness’s testimony is contrived.  \n[11] I agree with Justice Drennan (in dissent) that the conviction arose from a \n“failure to apply the requisite scrutiny” to the Vetrovec  witness’s evidence (20 24 SKCA \n40, 436 C.C.C. (3d) 279, at para. 109). I would have allowed the appeal and ordered a \nnew trial.  \n Appeal  dismissed, ROWE J. dissenting.  \n Solicitors for the appellant: Pfefferle Law Office, Saskatoon ; Ward \nMischuk Thomson, Saskatoon . \n Solicitor  for the respondent: Office of the Attorney General for \nSaskatchewan, Regina.  \n Solicitors for the intervener: Peck and Company, Vancouver.  \n2024 SCC 41 (CanLII)\n\n",
    "token_count": 935,
    "start_token": 1800,
    "end_token": 2735,
    "total_tokens_in_source": 2735
  },
  {
    "chunk_id": 3,
    "source_file": "2024canlii108265.txt",
    "text": " General for \nSaskatchewan, Regina.  \n Solicitors for the intervener: Peck and Company, Vancouver.  \n2024 SCC 41 (CanLII)\n\n",
    "token_count": 35,
    "start_token": 2700,
    "end_token": 2735,
    "total_tokens_in_source": 2735
  }
]