[
  {
    "chunk_id": 0,
    "source_file": "2024scc34.txt",
    "text": "--- Page 1 ---\n \n  \nSUPREME COURT OF CANADA  \n \nCITATION : R. v. Wolfe, 2024 \nSCC 34    \nAPPEAL HEARD : March 26, 2024  \nJUDGMENT RENDERED : October \n18, 2024  \nDOCKET : 40558  \n \nBETWEEN : \n \nBraydon Wolfe  \nAppellant  \n \nand \n \nHis Majesty The King  \nRespondent  \n \n \n \nCORAM : Wagner C.J. and Karakatsanis, Côté, Rowe, Martin, Kasirer, Jamal, \nO’Bonsawin and Moreau JJ.  \n \nREASONS FOR \nJUDGMENT : \n(paras. 1 to 92)  Martin J. (Wagner C.J. and Karakatsanis, Rowe and \nO’Bonsawin JJ. concurring)  \n  \nDISSENTING \nREASONS : \n(paras. 93 to 144)  Moreau J. (Côté, Kasirer and Jamal JJ. concurring)  \n \nNOTE: This document is subject to editorial revision before its reproduction in final \nform in the Canada Supreme Court Reports . \n2024 SCC 34 (CanLII)\n\n--- Page 2 ---\n \n    \n \n  \n2024 SCC 34 (CanLII)\n\n--- Page 3 ---\n \n Braydon Wolfe  Appellant  \nv. \nHis Majesty T he King  Respondent  \nIndexed as:  R. v. Wolfe  \n2024  SCC 34 \nFile No .: 40558.  \n2024: March 26 ; 2024: October 18 . \nPresent: Wagner C.J. and Karakatsanis, Côté, Rowe, Martin, Kasirer, Jamal, \nO’Bonsawin and Moreau JJ.  \nON APPEAL  FROM  THE  COURT OF APPEAL FOR SASKATCHEWAN  \n Criminal law — Sentencing — Criminal negligence — Driving prohibition \n— Criminal Code permitting discretionary driving prohibition to be imposed as \nsentence for several enumerated offences — Enumerated offences including dangerous \noperati on of conveyance but not criminal negligence causing death or criminal \nnegligence causing bodily harm — Accused convicted of criminal negligence causing \ndeath and causing bodily harm for role in head -on collision — Trial judge imposing \n2024 SCC 34 (CanLII)\n\n--- Page 4 ---\n \n driving prohibition — Whether driving prohibition may be imposed upon conviction \nfor criminal negligence causing death or bodily harm in operation of conveyance — \nCriminal Code, R.S.C. 1985, c. C -46, s.  320.24(4).  \n The accused  drove on the w rong side of a divided highway and  caused a \nhead -on collision, killing two people and se riously injuring another. He was found \nguilty of  two counts of criminal negligence causing death contrary to s.  220 of the \nCriminal Code  and one count of criminal negligence causing bodily harm contrary to \ns. 221. In his reasons, the trial judge alternatively held that, if his  analysis of the \ncriminal negligence counts set out in the indictment was  faulty, then h e would convict \nthe accused  of two counts of  dangerous driving causing death contrary to s.  320.13(3) \nand one count of dangerous driving causing bodily injury contrary to s.  320.13(4). In \naddition to sentencing the ac cused to terms of imprisonment, the trial judge issued a \ndriving p rohibition order imposing concurrent 10 -year driving prohibitions for each \ncriminal negligence causing death count and a concurrent 7 -year prohibition for the \ncriminal negligence ca using bodily harm count.  \n The Court of Appeal dismissed the accused’s sente nce appeal. With respect \nto the availability of the d riving prohibition order, the court  interpreted s.  320.24(4) of \nthe Criminal Code , which  permits sentencing judges to impose a discretionary driving \nprohibition where an offender has been “found guilty” of one of the provi sion’s \nenumerated offences, as authorizing that order, even though the offences in ss.  220 and \n221 are not enumerated offences . It held that the  criminal negligence convictions under \n2024 SCC 34 (CanLII)\n\n--- Page 5 ---\n \n ss. 220 and 221  necessarily includ ed a finding of guil t for the lesser and included \noffence of dangerous driving under s.  320.13 , which is enumerated.  \n Held  (Côté, Kasirer, Jamal and Moreau JJ. dissenting): The appeal should \nbe allowed and the driving prohibition order set aside.",
    "token_count": 1000,
    "start_token": 0,
    "end_token": 1000,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 1,
    "source_file": "2024scc34.txt",
    "text": " that the  criminal negligence convictions under \n2024 SCC 34 (CanLII)\n\n--- Page 5 ---\n \n ss. 220 and 221  necessarily includ ed a finding of guil t for the lesser and included \noffence of dangerous driving under s.  320.13 , which is enumerated.  \n Held  (Côté, Kasirer, Jamal and Moreau JJ. dissenting): The appeal should \nbe allowed and the driving prohibition order set aside.  \n Per Wagner C.J. and Karakats anis, Rowe, Martin  and O’Bonsawin JJ.: \nThe drivi ng prohibitions imposed on the accused  were unlawful. The accused  was \nconvicted of criminal negligence causing death and criminal negligence causing bodily \nharm, which are not enumerated offences under s.  320.24(4) of the Criminal Code . He \nwas not “found guilty” of an enumerated offence within the meaning of that provision. \nAccordingly, discretionary driving prohibitions were not available as a sentencing \noption.  \n Bill C -46, which introduced s.  320.24 into the Criminal Code  in 2018, \ncontained a complete overhaul of the Criminal Code ’s driving provisions. All of the \nformer driving -related offences were repealed and re -enacted under Part VIII.1 of the \nCriminal Code to ensure a clear, coherent structure in an a rea that had become complex \nand difficult to understand. Bill C -46 made two noteworthy changes to discretionary \ndriving prohibition orders. First, the new s. 320.24  enumerates fewer offences that are \neligible for that  punishment. Removed fro m the list previously found in  the former \ns. 259(2)  are the general offences of criminal negligence causing death, criminal \nnegligence causing bodily harm and manslaughter. Second, the description of the event \nthat triggers the provision’s operation has been modified, in  English, from  “convicted \n2024 SCC 34 (CanLII)\n\n--- Page 6 ---\n \n or discharged” of an enumera ted offence to “found guilty”, and in French from  “déclaré \ncoupable ou absous ” to “déclaré coupable ”. \n Determining whether s. 320.24(4) of  the Criminal Code now permits a \ndiscretionary driving prohibiti on upon  a conviction for criminal negligence causing \ndeath or bodily harm requires the Court to interpret s.  320.24(4) by employing \nlongstanding principles of statutory interpretation. Words of a statute are to be read in \ntheir entire context and in their grammatical and ordinary sense harmoniously with the \nscheme of the Act, the object of the Act, and the intention of Parliament.  \n With respect to the text,  s. 320.24(4) expressly enumerates 12  offences for \nwhich a discretionary driving prohibition is availa ble and authorized; on its face a \nclosed list that does not include  s. 220 or s.  221. Where express reference is expected, \nthe court can infer that the failure to mention something is a deli berate decision to \nexclude it. Furthermore,  Parliament’s usual pra ctice is to specify available punishments \nexpressly. If Parliament wished to enable driving prohibitions for criminal negligence \nconvictions, it would have expressly listed ss.  220 and 221 in s.  320.24(4). As well,  \nParliament chose to remov e ss. 220 and 221 from the  list of enumerated provisions \nwhen it enacted s.  320.24(4). It is well established that prior enactments may throw \nsome light on the intent ion of Parliament in repealing and  replacing a statute. This \ntextual evolution is consistent  with legisl ative intention to exclude  the general offences \nof crimin al negligence and manslaughter from the ambit of s.  320.24(4) . \n2024 SCC 34 (CanLII)\n\n--- Page 7 ---\n \n  The availability of a discretionary driving prohibition for a criminal \nnegligence conviction i s not  implied through Parliament’s use of  the term “found \nguilty” in s. 324.24(4) . Findings of guilt and convictions are conceptually distinct. A \nfinding of guil t is a verdict following trial that  occurs when the essential elements of \nthe offence have been proven. A conviction is a final judgment  of the court by which a \nfinding of guilt is entered. A finding of guilt can lead to several different outcomes, \ninclu ding a conviction and sentence or a stay of proceedings or an absolute or \nconditional discharge . This distinction however offers little as sistance",
    "token_count": 1000,
    "start_token": 900,
    "end_token": 1900,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 2,
    "source_file": "2024scc34.txt",
    "text": ") . Findings of guilt and convictions are conceptually distinct. A \nfinding of guil t is a verdict following trial that  occurs when the essential elements of \nthe offence have been proven. A conviction is a final judgment  of the court by which a \nfinding of guilt is entered. A finding of guilt can lead to several different outcomes, \ninclu ding a conviction and sentence or a stay of proceedings or an absolute or \nconditional discharge . This distinction however offers little as sistance because  \ns. 320.24(4) plainly indicates that a discretionary driving prohibition  is available when \nan offender has been “found guilty” of an enumerated offence. What must be \nconsidered is  whether an offender is “found guilty” of an enumerated offen ce under \ns. 320.24(4) when convicted of an unenumerated offence for which an enumerated \noffence is included.  \n The included offence machinery in s.  662 of the Criminal Code  does not  \nfacilitate the imposition of punishment by implication. Section  662 signals  that the \nfunction  of the included offence provisions is limited to situations where a charged \noffence is not proved . It makes clear that only where the evidence does not prove \ncriminal negligence or manslaughter  does it become possible  to convict  the accu sed of \nthe included dangerous operation offence. This provides fair notice of an alternate  \npathway to a guilty verdict but it is  not at all clear this gives  notice of liability for \npunishments attached  uniquely to included offences if  convicted of the charged \noffence. Accused persons must be informed in advance and in a non -ambiguous manner \n2024 SCC 34 (CanLII)\n\n--- Page 8 ---\n \n of the punishments they are liable to if convicted of a particular offence. The inc luded \noffence machinery should not  be extended beyond situations  where the charged offence \nis not proved a bsent a clear legislative signal.  \n An addition al signal of Parliament’s intent is that,  when an offender  is \nfound guilty of an offence enumerated in s.  320.24(4) , a driving prohibition can be \nimposed in addition to  any other punishment “for that offence”. Criminal negligence is \nnot enumerated; it cannot qualify as “that offence”. As well,  the French version of \ns. 320.24(4) is  equally authoritative and must be considered. With Bill C -46, there was \nno change to the “ déclaré coupable ” language akin to the switch in English from \n“convicted or discharged” to “found guilty”. This renders unpersuasive the argument \nthat Parliament employed the distinction between concepts of conviction and guilt to \ncreate a new approach for imposing driving prohibitions. The text of s.  320.24(4) as a \nwhole is clear and does not reveal any ambiguity. Criminal negligence offences are no \nlonger listed as offences that can attract a dis cretionary driving prohibition and the use \nof “found guilty” strongly points to the need for an express judicial determination of \nguilt on an offence stipulat ed in the charging document or an included offence  where \nthe charged offence is not proved.  \n Statutory interpretation also requires  considering context, purpos e, and \nrelevant legal norms. Several considerations stemming from surrounding statutory \ncontext and criminal law principles shed light on s.  320.24(4), such as  s. 320.24(1) and  \ns. 320.25, as well as  the Kienapple principle. Statutory  interpretations that a re \n2024 SCC 34 (CanLII)\n\n--- Page 9 ---\n \n consistent with or promote legislative purpose should be adopted. Bill C -46 ra ised \ncertain maximum penalties and  it is significant that penalties for the da ngerous \noperation offences are now  greater than or equal to those available for the  criminal \nnegligence offences. These changes further Parliament’s objectives of developing a \nsimplified, coherent, and efficient driving offence scheme under a single part of the \nCriminal Code . They signal that dangerous driving is best addressed by resorting to the \ndangerous operation offences under s.  320.13, which have been made more versatile \nand consistent with other driving offences resulting in similar harm. The exclusion of \nthe criminal negligence offences from the ambit of s.  320.24(4) is therefore neither  \nincon sistent with legislative purpose nor  an absurdity.  \n Per Côté, Kasirer, Jamal and Moreau  JJ. (dissenting): The appeal should \nbe dismissed. Section 320.24(4) of the Criminal Code , properly interpreted, authorizes  \na driving prohibition order where an",
    "token_count": 1000,
    "start_token": 1800,
    "end_token": 2800,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 3,
    "source_file": "2024scc34.txt",
    "text": " driving offences resulting in similar harm. The exclusion of \nthe criminal negligence offences from the ambit of s.  320.24(4) is therefore neither  \nincon sistent with legislative purpose nor  an absurdity.  \n Per Côté, Kasirer, Jamal and Moreau  JJ. (dissenting): The appeal should \nbe dismissed. Section 320.24(4) of the Criminal Code , properly interpreted, authorizes  \na driving prohibition order where an offender is convicted under ss.  220 or 221 of the \nCriminal Code . A finding of guilt for a pri ncipal  offence necessarily entails findings of \nguilt for any lesser included offences. Under s.  662(5) of the Criminal Code , dangerous \noperation of a conveyance contrary to s.  320.13 is a lesser included offence of criminal \nnegligence through the operation of a conveyance under ss.  220 and 221. Therefore, a \nfinding of guilt in respect of criminal negligence through the operation  of a conveyance \nnecessarily entails a finding of guilt in respect of dangerous operation of a conveyance.  \n The modern approach to  statutory interpretation entails discerning \nlegislative intent by examining statutory text in its entire context and in its g rammatical \n2024 SCC 34 (CanLII)\n\n--- Page 10 ---\n \n and ordinary sense, in harmony with the statute’s scheme and objects. The plain \nmeaning of the text is not in itself determinative. To ascertain legislative intent, the text \nof a provision must be placed in context and tested against other indic ators of legislative \nmeaning, including legislative objectives. The consequences of adopting a particular \ninterpretation serve as an important interpretive aid. Consequences consistent with the \npurpose and scheme of the legislation are presumed to have bee n intended whereas  \nconsequences that are absurd or otherwise unacceptable are presumed not to have been \nintended.  \n There is a meaningful distinction between a finding of guilt and a \nconviction or discharge for the purpose of s.  320.24(4) — they are distinc t concepts \nand are not interchangeable. The change from “convicted or discharged” in the former \ns. 259(2) to “found guilty” in s.  320.24(4)  indicates that, for a valid driving prohibition \norder to be impose d, only a finding of guilt for a listed offence is  required and a driving \nprohibition order may  be imposed prior to the entry of a conviction. Several examples \nin the Criminal Code  and the Youth Criminal Justice Act  demonstrate that a conviction \ndoes not  necessarily flow from a finding of guilt. However, when a conviction for an \noffence is recorded, it will always mean that the offender has been found guilty of that \noffence. Further,  a conviction or discharge is not always necessary for a penalty to be \nimposed. Section 320.23 permits delaying sentencing fo r an offence in the operation of \na conveyance to allow opportunity to attend a treatment program and apply for a \nmedical discharge.  \n2024 SCC 34 (CanLII)\n\n--- Page 11 ---\n \n  The use of “ déclaré coupable ” in the French version of 320.24(4) and its \npredecessor  does not assist in determining whether  Parliament intended to create a new \napproach. A “ déclaration de culpabilité ” can refer either to a finding of guilt or a \nconviction. The change in the English wording from “convicted or discharged” to \n“found guilty” informs the interpretation of “ déclaré coupable ” and suggests that it \nnow refers to a finding of guilt in the context of s.  320.24(4).  \n A finding of guilt for a pri ncipal  offence necessitates, by operation of law, \nfindings of guilt for all lesser included offences. By definition, all elements o f the lesser \nincluded offence are cont ained in the elements of the principal offence. As well,  an \nindictment chargi ng an offence also charges all lesser included offences, because they \nare necessarily committed in the commis sion of the principal offence. I t is appropriate \ntherefore  for a penalty for a lesser included offence to formally attach to the pri ncipal  \noffence. Section 662(5) explicitly makes dangerous operation of a conveyance under \ns. 320.13 a lesser included offence to criminal negligence where t he offence involves \nthe operation of a conveyance. This necessitates that if an individual is convicted under \nss. 220 or 221, they are by operation of law found guilty of the offence under s.  320.13. \nIt is impossible to",
    "token_count": 1000,
    "start_token": 2700,
    "end_token": 3700,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 4,
    "source_file": "2024scc34.txt",
    "text": " offence to formally attach to the pri ncipal  \noffence. Section 662(5) explicitly makes dangerous operation of a conveyance under \ns. 320.13 a lesser included offence to criminal negligence where t he offence involves \nthe operation of a conveyance. This necessitates that if an individual is convicted under \nss. 220 or 221, they are by operation of law found guilty of the offence under s.  320.13. \nIt is impossible to act in a criminally negligent manner  through the operation of a \nconveyance without dangerously operating a conveyance.  \n Parliament’s choice not to expressly list ss.  220 and 221 in s.  320.24(4) \nsignals an intention to include criminal negligence through the inclusion of dangerous \noperation u nder 320.13 in the listed offences . Parliament has determined that only a \n2024 SCC 34 (CanLII)\n\n--- Page 12 ---\n \n finding of guilt for one of the listed offences is required for a driving prohibition order \nto be imposed. This is consistent with criminal law principles including the requirement \nof fair notice, recognition of lesser included offences, and the rul e against multiple \nconvictions set out in  Kienapple . The text of s.  662(5) and an indictment charging \ns. 220 or 221 offences  provide adequate notice that a court may impose a driving \nprohib ition order following a conviction for criminal negligence causing death or \nbodily harm where it arises out of the operation of a conveyance. Where  an offender is \n“found guilty” through the operation of s.  662(5) of the lesser included offence, a \ndriving p rohibition order is requir ed by the text of s.  320.24(4) as  a punishment for \n“that offence” because it is one of the l isted offences in s.  320.24(4). The driving \nprohibition order attaches to the conviction for criminal negligence.  \n An interpretation of s.  320.24(4) that does not authorize driving prohibition \norders as a penalty for criminal negligence through the operation of a conveyance \nproduces an absurd consequence. It create s an irrational distinction by authorizing  a \nsanction for a lesser included of fence, but not the more serious pri ncipal  offence. It is \ninconsistent with Parliament’s stated purposes for enacting Part VIII.1 of the Criminal \nCode  of reducing  the significant number of deaths and injuries caused by impaired \ndriving. Nor is it  sufficient ly clear that Parliament intended to signal through Bill C -46 \nthat the Crown should resort to charging dangerous operation in preference to criminal \nnegligence. Finally, the absence of the ss.  220 and 221 offences amon g the listed \noffences in s. 320.24(4) is not indicative of  a drafting error that creates a legislative gap \nbecause no gap exists if s.  320.24(4) is  properly read with s.  662(5).  \n2024 SCC 34 (CanLII)\n\n--- Page 13 ---\n \n Cases Cited  \nBy Martin J.  \n Referred to:  R. v. Boily , 2022 ONCA 611, 163 O.R. (3d) 161; R. v. \nFrancisco , 2023 BCCA 450, 433 C.C.C. (3d) 1; Rizzo & Rizzo Shoes Ltd. (Re) , [1998] \n1 S.C.R. 27; R. v. Alex , 2017 SCC 37, [2017] 1 S.C.R. 967; McLean v. British Columbia \n(Securities Commission) , 2013 SCC 67, [2013] 3 S.C.R. 895; Canada Trustco \nMortgage Co. v. Canada , 2005 SCC 54, [2005] 2 S.C.R. 601; R. v. Downes , 2023 SCC \n6; Bell ExpressVu Limited Partnership v. Rex , 2002 SCC 42, [2002] 2 S.C.R. 559; \nCanada v. Loblaw Financial Holdings Inc. , 2021 SCC 51; Cadieux (Litigation \nGuardian of) v. Cloutier , 2018 ONCA 903, 1 43 O.R. (3d) 545; R. v. Poulin , 2019 SCC \n47, [2019] 3 S.C.R. 566; R. v. Ulybel Enterprises Ltd. , 2001 SCC 56",
    "token_count": 1000,
    "start_token": 3600,
    "end_token": 4600,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 5,
    "source_file": "2024scc34.txt",
    "text": " \nCanada v. Loblaw Financial Holdings Inc. , 2021 SCC 51; Cadieux (Litigation \nGuardian of) v. Cloutier , 2018 ONCA 903, 1 43 O.R. (3d) 545; R. v. Poulin , 2019 SCC \n47, [2019] 3 S.C.R. 566; R. v. Ulybel Enterprises Ltd. , 2001 SCC 56, [2001] 2 S.C.R. \n867; Gravel v. City of St -Léonard , [1978] 1 S.C.R. 660; British Columbia Human \nRights Tribunal v. Schrenk , 2017 SCC 62, [2017] 2 S .C.R. 795; R. v. Bérubé , 2012 \nBCCA 345, 326 B.C.A.C. 241; R. v. Senior  (1996), 181 A.R. 1; Morris v. The Queen , \n[1979] 1 S.C.R. 405; R. v. McInnis  (1973), 1 O.R. (2d) 1; R. v. Mack , [1988] 2 S.C.R. \n903; R. v. Pearson , [1998] 3 S.C.R. 620; Kienapple v. The Queen , [1975] 1 S.C.R. 729; \nR. v. Provo , [1989] 2 S.C.R. 3; R. v. G.R. , 2005 SCC 45, [2005] 2 S.C.R. 371; R. v. \nRonald , 2019 ONCA 971; R. v. Wong  (2006), 209 C.C.C. (3d) 520; R. v. Savage , 2023 \nONCA 240; R. v. Pawluk , 2017 ONCA 863, 357 C.C.C. (3d) 86; R. v. Wong , 2018 SCC \n25, [2018] 1 S.C.R. 696; R. v. D.L.W. , 2016 SCC 22, [2016] 1 S.C.R. 402; La Presse \ninc. v. Quebec , 2023 SCC 22; R. v. Summers , 2014 SCC 26, [2014] 1 S.C.R. 575; R. v. \nT. (V.) , [1992] 1 S.C.R. 749; R. v. Basque , 2023 SCC 18; R. v. Quesnell e, 2014 SCC \n2024 SCC 34 (CanLII)\n\n--- Page 14 ---\n \n 46, [2014] 2 S.C.R. 390; ATCO Gas and Pipelines Ltd. v. Alberta (Energy and Utilities \nBoard) , 2006 SCC 4, [2006] 1 S.C.R. 140; R. v. Prince , [1986] 2 S.C.R. 480; R. v. J.F. , \n2008 SCC 60, [2008] 3 S.C.R. 215; R. v. Doliente , [1997] 2 S.C.R. 11, rev’g (1996), \n108 C.C.C. (3d) 137; R. v. Lights , 2017 ONSC 5153, 18 M.V.R. (7th) 110, aff’d 2020 \nONCA 102, 60 M.V.R. (7th) 47; R. v. Bhangal , 2016 ONCA 857, 100 M.V.R. (6th) \n173; R. v. Mowlai , 2017 ONSC 4815, 15 M.V.R. (7th) 38; R. v. K. (R.)  (2005), 198 \nC.C.C. (3d) 232.  \nBy Moreau J. (dissenting)  \n R. v. Alex , 2017 SCC 37, [2017] 1 S.C.R. 967; Bell ExpressVu Limited \nPartnership v. Rex , 2002 SCC 42, [2002] 2 S.C.R. 559; Michel v. Graydon , 2020 SCC \n24, [2020] 2 S.C.R. 763; La",
    "token_count": 1000,
    "start_token": 4500,
    "end_token": 5500,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 6,
    "source_file": "2024scc34.txt",
    "text": " 232.  \nBy Moreau J. (dissenting)  \n R. v. Alex , 2017 SCC 37, [2017] 1 S.C.R. 967; Bell ExpressVu Limited \nPartnership v. Rex , 2002 SCC 42, [2002] 2 S.C.R. 559; Michel v. Graydon , 2020 SCC \n24, [2020] 2 S.C.R. 763; La Presse inc. v. Quebec , 2023 SCC 22; Rizzo & Rizzo Shoes \nLtd. (Re) , [1998] 1 S.C.R. 27; Wang v. British Columbia (Securities Commission) , 2023 \nBCCA 101, 480 D.L.R. (4th) 1; R. v. Francisco , 2023 BCCA 450, 433 C.C.C. (3d) 1; \nR. v. Boily , 2022 ONCA 611, 163 O.R. (3d) 161; R. v. P earson , [1998] 3 S.C.R. 620; \nR. v. Ahmad , 2020 SCC 11, [2020] 1 S.C.R. 577; R. v. Mack , [1988] 2 S.C.R. 903; R. \nv. Basque , 2023 SCC 18; R. v. Ulybel Enterprises Ltd. , 2001 SCC 56, [2001] 2 S.C.R. \n867; Canada (Canadian Human Rights Commission) v. Canada (At torney General) , \n2011 SCC 53, [2011] 3 S.C.R. 471; R. v. G.R. , 2005 SCC 45, [2005] 2 S.C.R. 371; R. \nv. Harmer and Miller  (1976), 33 C.C.C. (2d) 17;  R. v. Al -Kassem , 2015 ONCA 320, \n78 M.V.R. (6th) 183; R. v. Abau -Jabeen , 2019 ONSC 5399, 58 M.V.R. (7th) 304;  R. v. \nGardner and Fraser , 2021 NSCA 52, 406 C.C.C. (3d) 156; Kienapple v. The Queen , \n2024 SCC 34 (CanLII)\n\n--- Page 15 ---\n \n [1975] 1 S.C.R. 729; R. v. Heaney , 2013 BCCA 177, 337 B.C.A.C. 43; Sarazin v. R. , \n2018 QCCA 1065; R. v. J.F. , 2008 SCC 60, [2008] 3 S.C.R. 215; R. v. Javanmardi , \n2019 SCC  54, [2019] 4 S.C.R. 3; R. v. Beatty , 2008 SCC 5, [2008] 1 S.C.R. 49; R. v. \nRoy, 2012 SCC 26, [2012] 2 S.C.R. 60.  \nStatutes and Regulations Cite d \nAct to amend the Criminal Code , S.C. 1921, c.  25, s.  3. \nAct to amend the Criminal Code , S.C. 1938, c.  44, s.  16. \nAct to amend the Criminal Code (offences relating to conveyances) and to make \nconsequential amendments to other Acts , S.C. 2018, c.  21, preamble, s s. 14, 15. \nCannabis Act , S.C. 2018, c.  16. \nCriminal Code , R.S.C. 1985, c.  C-46, ss. 2.2(2), 9, 15 , Part VIII, 220, 221, 236, 249 \n[rep. 2018, c. 21, s. 14 ], 249.1  [idem ], 250 [ idem ], 251 [ idem ], 252 [ idem ], 255(2)  \n[idem ], (2.1)  [idem ], (2.2)  [idem ], (3) [idem ], (3.1)  [idem ], (3.2",
    "token_count": 1000,
    "start_token": 5400,
    "end_token": 6400,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 7,
    "source_file": "2024scc34.txt",
    "text": " 236, 249 \n[rep. 2018, c. 21, s. 14 ], 249.1  [idem ], 250 [ idem ], 251 [ idem ], 252 [ idem ], 255(2)  \n[idem ], (2.1)  [idem ], (2.2)  [idem ], (3) [idem ], (3.1)  [idem ], (3.2) [ idem ], 259(2) \n[idem ], (4)  [idem ], 261 (1) [idem ], 284, Part VIII.1  [ad. idem , s. 15], 320.12, \n320.13 to 320.18 , 320.19, 320.2, 320.21, 320.23 , 320.24, 320.25 , 570, \n606(1.1)(b) , 662, 667 (1), 720(1) , 730.  \nCriminal Code , S.C. 1953 -54, c.  51, s.  221(1). \nCriminal Code, 1892 , S.C. 1892, c.  29, s.  253. \nCriminal Law Amendment Act, 1985 , R.S.C. 1985, c.  27 (1st Supp.) , s. 36. \nInterpretation Act , R.S.C.  1985, c.  I-21, s. 45(2) . \nYouth Criminal Justice Act , S.C. 2002, c.  1, ss. 42, 82. \nAuthors Cited  \nBlack’s Law Dictionary , 11th ed. by Bryan A. Garner. St. Paul, Minn.: Thomson \nReuters, 2019, “find”.  \n2024 SCC 34 (CanLII)\n\n--- Page 16 ---\n \n Canada. Department of Justice. Legislative Background: reforms to the Transportation \nProvisions of the Criminal Code (Bill C -46). Ottawa, 2017.  \nCanada. House of Commons. House of Commons Debates , vol.  148, No.  181, 1st Sess. , \n42nd Parl., May 19, 2017, pp.  11459, 11461,  11491 -92. \nCanada. House of Commons. House of Commons Debates , vol.  148, No.  224, 1st Sess., \n42nd Parl., October 27, 2017, p.  14638.  \nCanada. Law Reform Commission. Report on Recodifying Criminal Procedure , vol.  1, \nPolice Powers . Ottawa, 1991.  \nCanada. Senate. Debates of the Senate , vol.  150, No.  156, 1st Sess., 4 2nd Parl., \nNovember 7, 2017, p.  4103.  \nCanada.  Senate. Standing Senate Committee on Legal and Constitutional Affairs. \nProceedings of the Standing Senate Committee on Legal a nd Constitutional \nAffairs , No. 34, 1st Sess., 42nd Parl., January 31, 2018 , p. 34:10 . \nCôté, Pierre -André, in collaboration with Stéphane Beaulac and Mathieu Devinat. The \nInterpretation of Legislation in Canada , 4th ed. Toronto: Carswell, 2011.  \nFuerst, Michelle, Mary Anne Sanderson and Stephen Firestone, w ith the assistance of \nRobert N.  Beaudoin et al. Ontario Courtroom Procedure , 5th ed. Toronto: \nLexisNexis, 2020.  \nJokinen, Karen, and Peter Keen. Impaired Driving and Other Criminal Code Driving \nOffences:  A Practitioner’s Handbook . Toronto: Emond, 20 19. \nJokinen, Karen, and Peter Keen. Impaired Driving and Other Criminal Code Driving \nOffences , 2nd ed. Toronto: Emond, 2023.  \nMcGuinness, Kevin P. The Encyclopedic Dictionary of Canadian Law . Toronto: \nLexisNexis , 2021, “finding”.  \nPenney, Steven, Vincenzo Rondinelli and James Stribopoulos. Criminal Procedure in \nCanada , 3rd ed. Toronto: LexisNexis, 2022.  \nRose, David. Quigley’s Criminal Procedure in Canada . Tor",
    "token_count": 1000,
    "start_token": 6300,
    "end_token": 7300,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 8,
    "source_file": "2024scc34.txt",
    "text": " Emond, 2023.  \nMcGuinness, Kevin P. The Encyclopedic Dictionary of Canadian Law . Toronto: \nLexisNexis , 2021, “finding”.  \nPenney, Steven, Vincenzo Rondinelli and James Stribopoulos. Criminal Procedure in \nCanada , 3rd ed. Toronto: LexisNexis, 2022.  \nRose, David. Quigley’s Criminal Procedure in Canada . Toront o: Thomson Reuters, \n2024 (loose -leaf updated February  2024, release 1).  \nSalhany, R. E. Canadian Criminal Procedure , 6th ed. Toronto: Thomson Reuters, 2024 \n(loose -leaf updated May 2024, release 2).  \nSullivan, Ruth. “Statutory Interpretation in a New Nutshell” (2003), 82 Can. Bar Rev.  \n51. \nSullivan, Ruth. The Construction of Statutes , 7th ed. Toronto: LexisNexis, 2022.  \n2024 SCC 34 (CanLII)\n\n--- Page 17 ---\n \n  APPEAL from a judgment of the Saskatchewan Court of Appeal \n(Kalmakoff, Schwann and McCreary JJ.A.), 2022 SKCA 132 , 420 C.C.C. (3d) 290, \n[2023] 3 W .W.R. 574, [2022] S.J. No.  405 (Lexis), 2022 CarswellSask 531 (WL), \naffirming a decision of Danyliuk J., 2021 SKQB 141, 84 M. V.R. (7th) 257, [2021] S.J. \nNo. 247 (Lexis), 2021 CarswellSask 314 (WL). Appeal allowed  and order of driving \nprohibition set aside , Côté,  Kasirer , Jamal and Moreau JJ. dissenting . \n Brent D. Little  and Katherine Pocha , for the appellant.  \n Pouria Tabrizi -Reardigan , for the respondent.  \nThe judgment of Wagner C.J. and Karakatsanis, Rowe, Martin and \nO’Bonsawin JJ. was delivered by  \n MARTIN J. —  \nI. Overview  \n[1] The Court is called upon to decide between competing interpretations of \ns. 320.24(4) of the Criminal Code , R.S.C. 1985, c. C -46. This provision, which came \ninto force in 2018 following the adoption of Bill C -46, An Act to amend the Criminal \nCode ( offences relating to conveyances) and to make consequential amendments to \nother Acts , S.C. 2018, c. 21, permits sentencing judges to impose a discretionary \ndriving prohibition where an offender has been “found guilty” of one of the provision’s \n2024 SCC 34 (CanLII)\n\n--- Page 18 ---\n \n enumerated o ffences, an express list of driving -specific offences which includes \ndangerous operation of a conveyance contrary to s. 320.13. The former s. 259(2) \nprovided for the ability to impose a prohibition where an offender had been “convicted \nor discharged” of a broader list of enumerated offences. Three general offences that \napply beyond driving cases  are no longer included in the list of offences that can attract \na driving prohibition under the new s. 320.24(4): criminal negligence causing death \n(s. 220), crimin al negligence causing bodily harm (s. 221), and manslaughter (s.  236).  \n[2] The appellant, Braydon Wolfe, was convicted of general criminal \nnegligence -based offences, which are no longer expressly listed as giving rise to a \ndiscretionary driving prohibition un der the new Criminal Code  provision. The issue \nbefore this Court is whether, in addition to his term of imprisonment, it remains lawful \nto impose the further punishment of a driving prohibition upon him.  \n[3] The Court of Appeal for Saskatchewan’s interpretatio n of s. 320.24(4) of \nthe Criminal Code preserves the ability of sentencing judges to impose a driving \nprohibition on an offender convicted of driving -related criminal negligence. The Court \nof Appeal upheld the prohibition imposed on the appellant on the ba sis that his criminal \nnegligence convictions in this context necessarily included findings of guilt for the \nincluded offence of dangerous operation, which is enumerated under s. 320.24(4) of \nthe Criminal Code .  \n[4] Conversely, in other cases, the Court of Appe al for Ontario and Court of",
    "token_count": 1000,
    "start_token": 7200,
    "end_token": 8200,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 9,
    "source_file": "2024scc34.txt",
    "text": " sentencing judges to impose a driving \nprohibition on an offender convicted of driving -related criminal negligence. The Court \nof Appeal upheld the prohibition imposed on the appellant on the ba sis that his criminal \nnegligence convictions in this context necessarily included findings of guilt for the \nincluded offence of dangerous operation, which is enumerated under s. 320.24(4) of \nthe Criminal Code .  \n[4] Conversely, in other cases, the Court of Appe al for Ontario and Court of \nAppeal for British Columbia have rejected the result and the reasoning adopted by the \n2024 SCC 34 (CanLII)\n\n--- Page 19 ---\n \n Saskatchewan court ( R. v. Boily , 2022 ONCA 611, 163 O.R. (3d) 161; R. v. Francisco , \n2023 BCCA 450, 433 C.C.C. (3d) 1).  \n[5] I conclude that the dri ving prohibitions imposed on the appellant were \nunlawful. Criminal negligence offences are no longer listed under s. 320.24(4) as \noffences that can attract a driving prohibition. The Crown’s proposed interpretation \ndepends on the proposition that, followin g the enactment of Bill C -46, Parliament’s use \nof the term “found guilty” permits punishment to be imposed by implication and \nindirectly, rather than expressly and directly. This interpretation is implausible; it \nconflicts with the text of s. 320.24(4), si ts in tension with the surrounding statutory \ncontext and purpose, and fails to fully accord with criminal law principles.  \n[6] With Bill C -46, Parliament endeavoured to create a clear, coherent, and \nself-contained scheme for driving offences. Driving -specific offences were reorganized \ninto a new part of the Criminal Code , they were made more versatile through \nhybridization, and their maximum penalties were increased. It is neither absurd nor \ninconsistent with legislative purpose to exclude criminal negligence a nd manslaughter \n— general offences that are not limited to driving cases — from the ambit of \ns. 320.24(4). Nor has it been shown that Parliament made a mistake in drafting the \nprovision by somehow inadvertently omitting the previously enumerated offences f rom \nthe new section’s express list of captured offences. Rather, Parliament has broadly \nsignalled through Bill C -46 that resorting to specific driving -related offences is \npreferable to general criminal negligence offences in driving cases. The changes to t he \n2024 SCC 34 (CanLII)\n\n--- Page 20 ---\n \n availability of discretionary driving prohibitions reflect a logical and deliberate choice \nto limit driving -specific punishments to driving -specific offences. This is a choice \nParliament was free to make.  \n[7] For the reasons that follow, I would allow the a ppeal.  \nII. Background  \nA. The Relevant Legislation at Issue on This Appeal  \n[8] The Criminal Code ’s driving -related provisions, which lie at the heart of \nthis appeal, developed gradually and intermittently over a century. The Criminal Code, \n1892 , S.C. 1892, c. 29, cont ained one of the first driving offences: causing bodily harm \n“by wanton or furious driving, or racing or other wilful misconduct” while “having the \ncharge of any carriage or vehicle”, which carried a maximum sentence of two years’ \nimprisonment (s. 253). Im paired driving was addressed for the first time in 1921 with \nthe enactment of a prohibition on driving while intoxicated (S.C. 1921, c.  25, s. 3). In \n1938, Parliament criminalized dangerous driving — defined as driving a motor vehicle \n“recklessly, or in a manner which is dangerous to the public, having regard to all the \ncircumstances of the case” — regardless of whether death or injury ensued (S.C. 1938, \nc. 44, s. 16). Offenders were liable to up to two years’ imprisonment, a fine of up to \n$1,000, and a dri ving prohibition of up to three years.  \n2024 SCC 34 (CanLII)\n\n--- Page 21 ---\n \n [9] Both prior to and following the introduction of the first dangerous driving \nand impaired driving offences, the Crown could prosecute serious driving -related \nmisconduct that caused death or bodily harm by resorting to the manslaughter and \ncriminal negligence offences (see K. Jokinen and P. Keen, Impaired Driving and Other \nCriminal Code Driving Offences (2nd ed. 2023), at p. 7). These offences carried \nsignificant maximum penalties of imprisonment, including life sentence",
    "token_count": 1000,
    "start_token": 8100,
    "end_token": 9100,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 10,
    "source_file": "2024scc34.txt",
    "text": "] Both prior to and following the introduction of the first dangerous driving \nand impaired driving offences, the Crown could prosecute serious driving -related \nmisconduct that caused death or bodily harm by resorting to the manslaughter and \ncriminal negligence offences (see K. Jokinen and P. Keen, Impaired Driving and Other \nCriminal Code Driving Offences (2nd ed. 2023), at p. 7). These offences carried \nsignificant maximum penalties of imprisonment, including life sentence s (in cases \nwhere the driver caused death).  \n[10] Over time, there were gradual legislative reforms to the dangerous driving \nand impaired driving offences to account for developing consensus on what constitutes \nimpairment, scientific advancements in breath testi ng, and a greater understanding of \nthe harms caused by driving -related misconduct (see Jokinen and Keen, at pp. 8 -12; \nDepartment of Justice Canada, Legislative Background: reforms to the Transportation \nProvisions of the Criminal Code (Bill C -46) (2017), at  pp. 4 -5). Maximum penalties \nwere increased. The furious driving and dangerous driving offences were consolidated \nin 1954 into the offence of criminal negligence in the operation of a motor vehicle, \nincreasing the maximum term of imprisonment to five years  (Criminal Code , S.C. \n1953 -54, c. 51, s. 221(1)). The enactment of the Criminal Law Amendment Act, 1985 , \nR.S.C. 1985, c.  27 (1st Supp.), s. 36, further increased penalties and trifurcated the \noffence into three separate dangerous operation offences: danger ous operation \nsimpliciter (a hybrid offence that, when prosecuted by indictment, attracted a maximum \npenalty of 5 years’ imprisonment), dangerous operation causing bodily harm (10 -year \nmaximum), and dangerous operation causing death (14 -year maximum) (s. 2 49). \n2024 SCC 34 (CanLII)\n\n--- Page 22 ---\n \n [11] Over 30 years later, the government proposed Bill C -46 — a \ncomprehensive revision to the Criminal Code ’s driving -related provisions. The \nlegislation proposed major changes (1) concerning the detection and prosecution of \ndrug-impaired driving to coincide with the coming into force of the Cannabis Act , S.C. \n2018, c. 16; and (2) authorizing mandatory roadside  alcohol screening. These two \nproposals were largely the focus of the legislative debates.  \n[12] However, Bill C -46 also contained a complete overhaul of the Criminal \nCode ’s driving provisions. All of the former driving -related offences were to be \nrepealed and re-enacted under the new Part VIII.1 of the Criminal Code (“Offences \nRelating to Conveyances”). The Minister of Justice explained that this part of the bill’s \npurpose was to ensure a “clear, coherent structure” in an area that has “become too \ncomplex and d ifficult to understand” ( House of Commons Debates , vol. 148, No. 181, \n1st Sess., 42nd Parl. , May 19, 2017, at p. 11459 (Hon. J. Wilson -Raybould)). Speaking \nabout the impaired driving regime in particular, the Minister noted:  \nThis area of the criminal law p erplexes even the most seasoned criminal \nprofessionals. It has developed in a piecemeal fashion since the first \noffence was enacted in 1921. It has never been comprehensively reformed, \nand according to a 1991 report by the former Law Reform Commission, its  \nprovisions are “virtually unreadable”.  \n \nThis state of affairs cannot be permitted to continue, especially in the \narea of criminal law that is among the most litigated. Bill C -46 proposes to \ncreate a clear, simplified, and modernized legislative framework to ensure \nthat the public can better understand the law and also ensure that the police \ncan effectively enforce it.  \n \n(House of Commons Debates , vol. 148, No. 224, 1st Sess., 42nd Parl., \nOctober 27, 2017, at p. 14638 (Hon. J. Wilson -Raybould) ; see also Law \n2024 SCC 34 (CanLII)\n\n--- Page 23 ---\n \n Reform Commission of Canada, Report on Recodifying Criminal \nProcedure , vol. 1, Police Powers  (1991), at p. 84; Legislative Background: \nreforms to the Transportation Provisions of the Criminal Code (Bill C -46), \nat p. 11.)  \n[",
    "token_count": 1000,
    "start_token": 9000,
    "end_token": 10000,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 11,
    "source_file": "2024scc34.txt",
    "text": " at p. 14638 (Hon. J. Wilson -Raybould) ; see also Law \n2024 SCC 34 (CanLII)\n\n--- Page 23 ---\n \n Reform Commission of Canada, Report on Recodifying Criminal \nProcedure , vol. 1, Police Powers  (1991), at p. 84; Legislative Background: \nreforms to the Transportation Provisions of the Criminal Code (Bill C -46), \nat p. 11.)  \n[13] Bill C -46 was adopted by Parliamen t, and the new Part VIII.1 of the \nCriminal Code came into force on December 18, 2018. Various maximum and \nminimum penalties were increased by the legislation. For example, the maximum \npunishment for the indictable offence of dangerous operation causing dea th (contrary \nto s. 320.13(3)) was increased from 14 years’ imprisonment to life imprisonment — \nconsistent with the maximum penalties available for impaired operation causing death \n(s. 320.14(3)) and criminal negligence causing death (s. 220). The offence o f dangerous \noperation causing bodily harm (contrary to s. 320.13(2)) was transformed into a hybrid \noffence, and its maximum penalty, when prosecuted by indictment, was increased to \n14 years’ imprisonment (from the previous 10 -year maximum). This 14 -year ma ximum \nis now equal to the potential punishment for impaired operation causing bodily harm \n(s. 320.14(2)) and exceeds that of criminal negligence causing bodily harm (s. 221).  \n[14] Bill C -46 also made changes to driving prohibition orders. The new \ns. 320.24 gove rns the availability of such orders. Offenders found guilty of impaired \noperation simpliciter (s. 320.14(1)) or failing to comply with a breath demand \nsimpliciter  (s. 320.15(1)) are subject to a mandatory prohibition order under \ns. 320.24(1). For other dri ving-related offences, a sentencing judge has the discretion \nto impose an order under s. 320.24(4), which reads:  \n2024 SCC 34 (CanLII)\n\n--- Page 24 ---\n \n (4) If an offender is found guilty of an offence under section 320.13, \nsubsection 320.14(2) or (3), 320.15(2) or (3) or under any of sections \n320.16 to 320.18, the court that sentences the offender may, in addition to \nany other punishment that may be imposed for that offence, make an order \nprohibiting the offender from operating the type of conveyance in question \nduring a period to be determined in accordance with subsection (5).  \n \n(4) Le tribunal qui inflige une peine au contrevenant déclaré coupable \nd’une infraction prévue à l’article 320.13, aux paragraphes 320.14(2) ou \n(3) ou 320.15(2) ou (3), ou à l’un des articles 320.16 à 320.18 peut rendre,  \nen plus de toute autre peine applicable à cette infraction, une ordonnance \nlui interdisant de conduire le moyen de transport en cause durant la période \nétablie conformément au paragraphe (5).  \nPrior to Bill C -46, discretionary driving prohibitions were an available sentencing tool \nunder s. 259(2):  \n(2) If an offender is convicted or discharged under section 730 of an \noffence under section 220, 221, 236, 249, 249.1, 250, 251 or 252 or any of \nsubsections 255(2) to (3.2) committed by means of a motor vehicle, a  \nvessel, an aircraft or railway equipment, the court that sentences the \noffender may, in addition to any other punishment that may be imposed for \nthat offence, make an order prohibiting the offender from operating a motor \nvehicle on any street, road, highw ay or other public place, or from \noperating a vessel, an aircraft or railway equipment, as the case may \nbe . . . . \n \n(2) Lorsqu’un contrevenant est déclaré coupable ou absous sous le régime \nde l’article 730 d’une infraction prévue aux articles 220, 221, 236 , 249, \n249.1, 250, 251 ou 252 ou à l’un des paragraphes 255(2) à (3.2) commise \n",
    "token_count": 1000,
    "start_token": 9900,
    "end_token": 10900,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 12,
    "source_file": "2024scc34.txt",
    "text": " aircraft or railway equipment, as the case may \nbe . . . . \n \n(2) Lorsqu’un contrevenant est déclaré coupable ou absous sous le régime \nde l’article 730 d’une infraction prévue aux articles 220, 221, 236 , 249, \n249.1, 250, 251 ou 252 ou à l’un des paragraphes 255(2) à (3.2) commise \nau moyen d’un véhicule à moteur, d’un bateau, d’un aéronef ou de matériel \nferroviaire, le tribunal qui lui inflige une peine peut, en plus de toute autre \npeine applicable en l’e spèce, rendre une ordonnance lui interdisant de \nconduire un véhicule à moteur dans une rue, sur un chemin ou une grande \nroute ou dans tout autre lieu public, un bateau, un aéronef ou du matériel \nferroviaire  . . . . \nParliament repealed the former s. 259(2) when it enacted Bill C -46 (s. 14).  \n2024 SCC 34 (CanLII)\n\n--- Page 25 ---\n \n [15] It is apparent by comparing the versions of the provision that Bill C -46 \nmade two noteworthy changes to discretionary driving prohibition orders. First, the \nnew provision enumerates fewer offences that are eligible for th e punishment. \nSentencing judges may impose a discretionary driving prohibition for the driving -\nspecific offences of dangerous operation (s. 320.13, formerly s. 249), impaired \noperation causing bodily harm or death (s. 320.14(2) and (3), formerly s. 255(2),  (2.1), \n(3) and (3.1)), failure/refusal to comply with a demand while knowing or being reckless \nto whether they were involved in an accident causing bodily harm or death (s. 320.15(2) \nand (3), formerly s. 255(2.2) and (3.2)), failure to stop after accident  (s. 320.16, \nformerly s. 252), flight (s. 320.17, formerly s. 249.1), and operation while prohibited \n(s. 320.18, formerly s. 259(4)). Removed from the list and no longer enumerated are \nthe general offences of criminal negligence causing death (s. 220), cri minal negligence \ncausing bodily harm (s. 221), and manslaughter (s. 236), along with the now -repealed \noffences of failure to keep watch on person towed (former s. 250) and unseaworthy \nvessel/unsafe aircraft (former s. 251).  \n[16] Second, the description of the e vent that triggers the provision’s operation \nhas been modified. In the English version of the provision, a driving prohibition could \npreviously be imposed when the offender was “convicted or discharged under section \n730” of an enumerated offence. Bill C -46 has changed the trigger to “found guilty”. \nHowever, Bill C -46 brought about a more minor change to the French version of the \ntext. The former s. 259(2) permitted driving prohibitions when the offender was \n“déclaré coupable ou absous sous le régime de l’ar ticle 730 ” of an enumerated offence. \n2024 SCC 34 (CanLII)\n\n--- Page 26 ---\n \n Following Bill C -46, a prohibition is available when the offender has been “ déclaré \ncoupable ”. \nB. The Underlying Offences and Proceedings  \n(1) Circumstances of the Offences  \n[17] On August 21, 2017, the appellant drove on the wrong s ide of a divided \nhighway near Langham, Saskatchewan. He caused a head -on collision, killing two \npeople and seriously injuring another.  \n[18] The indictment alleged that the appellant committed two counts of criminal \nnegligence causing death (contrary to s. 220 o f the Criminal Code ) and one count of \ncriminal negligence causing bodily harm (contrary to s. 221 of the Criminal Code ).  \n(2) Saskatchewan Court of Queen’s Bench (Danyliuk J.)  \n[19] In the Court of Queen’s Bench, the appellant was found guilty of the three \ncriminal  negligence charges set out in the indictment. Near the end of his reasons for \njudgment, the trial judge stated:  \nThe findings of guilt on the criminal negligence counts effectively end \nmy inquiry. However, I have gone on. Alternatively, in",
    "token_count": 1000,
    "start_token": 10800,
    "end_token": 11800,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 13,
    "source_file": "2024scc34.txt",
    "text": " to s. 221 of the Criminal Code ).  \n(2) Saskatchewan Court of Queen’s Bench (Danyliuk J.)  \n[19] In the Court of Queen’s Bench, the appellant was found guilty of the three \ncriminal  negligence charges set out in the indictment. Near the end of his reasons for \njudgment, the trial judge stated:  \nThe findings of guilt on the criminal negligence counts effectively end \nmy inquiry. However, I have gone on. Alternatively, in case I am in err or \nin my analysis of criminal negligence, I have gone on to consider whether \nthe evidence amounts to proof beyond a reasonable doubt of dangerous \ndriving.  \n \n2024 SCC 34 (CanLII)\n\n--- Page 27 ---\n \n (2020 SKQB 324, 73 M.V.R. (7th) 242 (“trial reasons”), at para. 171)  \nThe trial judge then considered  the facts of the case in relation to the elements of the \ndangerous operation offences (also referred to as “dangerous driving”). He concluded \nthat, in the alternative, he was “fully satisfied the Crown has met all the requirements \nto prove dangerous drivi ng beyond a reasonable doubt” and therefore “[i]n the event \n[that the] analysis of the three criminal negligence counts is faulty, then [he] would \nconvict the accused of three counts involving dangerous driving causing death and \ninjury” (para. 180).  \n[20] The t rial judge later sentenced the appellant to six years’ imprisonment on \neach of the criminal negligence causing death counts and three years’ imprisonment on \nthe criminal negligence causing bodily harm count, all to run concurrently (2021 SKQB \n141, 84 M.V.R . (7th) 257). The trial judge further imposed 10 -year driving prohibitions \non the criminal negligence causing death counts and a 7 -year prohibition on the \ncriminal negligence causing bodily harm count, all to run concurrently. He did not \nadvert in his reas ons to any issue regarding the availability of this sanction.  \n[21] The formal record of conviction, dated May 13, 2021, and prepared under \ns. 570 of the Criminal Code , indicates that the appellant was convicted of two counts \nof criminal negligence causing deat h (contrary to s. 220) and one count of criminal \nnegligence causing bodily harm (contrary to s. 221) and further indicates the \npunishment imposed for those offences. The formal driving prohibition order, dated the \nsame day, recites that the appellant was c onvicted of the criminal negligence counts \n2024 SCC 34 (CanLII)\n\n--- Page 28 ---\n \n and prohibits the appellant from operating a motor vehicle in relation to those \nconvictions.  \n(3) Saskatchewan Court of Appeal, 2022 SKCA 132, [2023] 3 W.W.R. 574 \n(Kalmakoff J.A., Schwann and McCreary JJ.A. Concurring)  \n[22] The Court of Appeal dismissed the appellant’s sentence appeal, having \nconsidered the length of the carceral sentence and the availability of the driving \nprohibition order. Only the latter is contested at this Court. Writing for a unanimous \npanel, Kalmakof f J.A. observed that Bill C -46 was driven by two key themes: “.  . . (i) \ncoherence, efficiency, simplification, and modernization of the Criminal Code  \nprovisions relating to driving offences; and (ii) increased punishments, with a focus on \ndeterring people from dangerous and impaired driving” (para. 57). In Kalmakoff J.A.’s \nview, Parliament intended for Bill C -46 to “increase or, at the very least, maintain the \npenalties previously available for all criminal driving offences” (para. 58). On its face, \nthe rem oval of a driving prohibition from the roster of available sanctions for criminally \nnegligent driving that causes death or bodily harm is inconsistent with such an \nintention.  \n[23] Kalmakoff J.A. then examined a number of Criminal Code  and Youth \nCriminal Justice  Act, S.C. 2002, c. 1, provisions, as well as common law rules, \ndemonstrating the legal distinction between findings of guilt and convictions. \nSection  662(5) of the Criminal Code  provides that the offence of dangerous operation \nis an included offence for c riminal negligence under ss. 220 and 221. By operation of \n2024 SCC 34 (CanLII)\n\n--- Page 29 ---\n \n s. 662(5), it is not possible to be convicted of driving -related criminal negligence",
    "token_count": 1000,
    "start_token": 11700,
    "end_token": 12700,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 14,
    "source_file": "2024scc34.txt",
    "text": " well as common law rules, \ndemonstrating the legal distinction between findings of guilt and convictions. \nSection  662(5) of the Criminal Code  provides that the offence of dangerous operation \nis an included offence for c riminal negligence under ss. 220 and 221. By operation of \n2024 SCC 34 (CanLII)\n\n--- Page 29 ---\n \n s. 662(5), it is not possible to be convicted of driving -related criminal negligence \nwithout also being guilty of the lesser included offence of dangerous operation. A \nconviction for criminal neglig ence necessarily includes a finding of guilt for dangerous \noperation. Moreover, while he was not obliged to, the trial judge also made an explicit \nfinding that the Crown had proven all of the elements of the dangerous operation \noffences.  \n[24] Thus, Kalmakoff J .A. reasoned, just as Parliament must be taken to have \nunderstood the difference between a finding of guilt and a conviction, it must also be \ntaken, in drafting s. 320.24(4) of the Criminal Code , as having been aware that \ndangerous operation is a lesser in cluded offence of criminal negligence arising out of \nthe operation of a conveyance. Interpreting s. 320.24(4) as authorizing a sentencing \njudge to impose a driving prohibition order following a criminal negligence conviction \nis the only interpretation that  is consistent with the stated purpose of Bill C -46. An \nabsurdity would result from the contrary interpretation; an offender would be subject \nto less serious consequences upon conviction of the more serious criminal negligence \noffence, compared to the less er included dangerous operation offence.  \n[25] Accordingly, the Court of Appeal held that the driving prohibition orders \nagainst the appellant were lawful.  \nIII. Issue on Appeal  \n2024 SCC 34 (CanLII)\n\n--- Page 30 ---\n \n [26] The sole issue on appeal to this Court is whether s. 320.24(4) of the \nCriminal Code permits the imposition of a driving prohibition upon conviction for the \noffence of criminal negligence causing death or bodily harm committed by means of a \nmotor vehicle.  \nIV. Parties’ Positions  \nA. Appellant (Mr. Wolfe)  \n[27] The appellant submits that the driving prohi bitions were unlawful given \nthat s. 320.24(4) does not list the offences of criminal negligence causing death (s. 220) \nand criminal negligence causing bodily harm (s. 221) as offences that can attract that \npunishment. With respect to the Court of Appeal’s interpretation, the appellant points \nto examples where “findings of guilt” and “convictions” are used interchangeably in \nvarious contexts throughout the Criminal Code . He argues that the Court should \ntherefore not assume that Parliament acted purposefully in drafting s. 320.24(4) of the \nCriminal Code  and used the term “found guilty” to preserve the ability of a sentencing \njudge to impose a driving prohibition for an included offence. In effect, the Court of \nAppeal’s interpretation creates a situation where punishment can be imposed by \nimplication rather than by express terms.  \nB. Respondent (His Majesty The King)  \n2024 SCC 34 (CanLII)\n\n--- Page 31 ---\n \n [28] Under the former legislation, a driving prohibition could be imposed where \na person was convicted of an enumerated offence. Consistent with the public protection \nobjectives of the amendments, the new approach casts a wider net: a driving prohibition \nis available so long as a conviction for the more serious offence entails a finding of \nguilt for one of the basic enumerated offences.  \n[29] The Crown submits tha t the difference between a finding of guilt and a \nconviction is deeply entrenched in law, and Parliament must be taken to have \nunderstood the distinction. A finding of guilt is the proof of the essential elements of \nthe offence and is a precondition to bot h a conviction and a discharge. At their highest, \nthe appellant’s examples of Criminal Code  provisions using the two terms only show \nthat “conviction” can sometimes stand for its constituent element of guilt, which the \nCrown does not take issue with. But, the appellant fails to show that the Criminal Code \nuses the narrow concept of guilt in place of the end -result concept of conviction.  \n[30] Dangerous driving is an included offence for criminal negligence causing \ndeath or bodily harm arising out of the operation  of a motor vehicle. Thus, the Crown \nargues, the criminal negligence conviction proved the appellant guilty of one of the \nenumerated “basic driving offences” listed under s. 320.24(4). The driving prohibition \norders were therefore lawful.",
    "token_count": 1000,
    "start_token": 12600,
    "end_token": 13600,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 15,
    "source_file": "2024scc34.txt",
    "text": " that the Criminal Code \nuses the narrow concept of guilt in place of the end -result concept of conviction.  \n[30] Dangerous driving is an included offence for criminal negligence causing \ndeath or bodily harm arising out of the operation  of a motor vehicle. Thus, the Crown \nargues, the criminal negligence conviction proved the appellant guilty of one of the \nenumerated “basic driving offences” listed under s. 320.24(4). The driving prohibition \norders were therefore lawful.  \nV. Analysis  \nA. Governin g Principles of Statutory Interpretation  \n2024 SCC 34 (CanLII)\n\n--- Page 32 ---\n \n [31] Determining whether the Criminal Code permits a discretionary driving \nprohibition when there has been a conviction for criminal negligence causing death or \nbodily harm requires the Court to interpret s. 320.24(4) by  employing longstanding \nprinciples of statutory interpretation.  \n[32] Words of a statute are to be read “in their entire context and in their \ngrammatical and ordinary sense harmoniously with the scheme of the Act, the object \nof the Act, and the intention of Par liament” ( Rizzo & Rizzo Shoes Ltd. (Re) , [1998] 1 \nS.C.R. 27, at para. 21, citing E. A. Driedger, Construction of Statutes  (2nd ed. 1983), \nat p. 87). While it is a proper starting point, the ordinary meaning of text is not \ndeterminative (R. Sullivan, The Co nstruction of Statutes  (7th ed. 2022), at § 3.01[3]). \nStatutory interpretation is incomplete without considering context, purpose, and \nrelevant legal norms ( R. v. Alex , 2017 SCC 37, [2017] 1 S.C.R. 967, at para. 31; \nMcLean v. British Columbia (Securities C ommission) , 2013 SCC 67, [2013] 3 S.C.R. \n895, at para. 43; Canada Trustco Mortgage Co. v. Canada , 2005 SCC 54, [2005] 2 \nS.C.R. 601, at para. 10; R. v. Downes , 2023 SCC 6, at paras. 24 -25; Sullivan, at \n§ 2.01[4]).  \n[33] In the analysis that follows, text, contex t, and legislative purpose will each \nbe considered in a separate section, but they are not intended to be watertight \ncompartments. Statutory interpretation factors are “closely related and interdependent” \n(Bell ExpressVu Limited Partnership v. Rex , 2002 SC C 42, [2002] 2 S.C.R. 559, at \n2024 SCC 34 (CanLII)\n\n--- Page 33 ---\n \n para. 31). Other principles of statutory interpretation also apply and will be referenced \nwhere applicable.  \nB. Interpretation of Section 320.24(4)  \n(1) Text \n[34] For convenience, I reproduce s. 320.24(4) below:  \n(4) If an offender is found  guilty of an offence under section 320.13, \nsubsection 320.14(2) or (3), 320.15(2) or (3) or under any of sections \n320.16 to 320.18, the court that sentences the offender may, in addition to \nany other punishment that may be imposed for that offence, make a n order \nprohibiting the offender from operating the type of conveyance in question \nduring a period to be determined in accordance with subsection (5).  \n \n(4) Le tribunal qui inflige une peine au contrevenant déclaré coupable \nd’une infraction prévue à l’artic le 320.13, aux paragraphes 320.14(2) ou \n(3) ou 320.15(2) ou (3), ou à l’un des articles 320.16 à 320.18 peut rendre, \nen plus de toute autre peine applicable à cette infraction, une ordonnance \nlui interdisant de conduire le moyen de transport en cause duran t la période \nétablie conformément au paragraphe (5).  \n(a) The Criminal Negligence Offences Are Not Enumerated in Section \n320.24(4)  \n[35] Section 320.24(4) expressly enumerates 12 offences for which a \ndiscretionary driving prohibition is available and authorized. On i ts face, it",
    "token_count": 1000,
    "start_token": 13500,
    "end_token": 14500,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 16,
    "source_file": "2024scc34.txt",
    "text": " ordonnance \nlui interdisant de conduire le moyen de transport en cause duran t la période \nétablie conformément au paragraphe (5).  \n(a) The Criminal Negligence Offences Are Not Enumerated in Section \n320.24(4)  \n[35] Section 320.24(4) expressly enumerates 12 offences for which a \ndiscretionary driving prohibition is available and authorized. On i ts face, it establishes \na closed list. In interpreting s. 320.24(4) to determine whether a driving prohibition can \nbe imposed where there has been a conviction for a criminal negligence offence, it is \nvery significant that neither s. 220 (criminal negligen ce causing death) nor s. 221 \n2024 SCC 34 (CanLII)\n\n--- Page 34 ---\n \n (criminal negligence causing bodily harm) are expressly included on the list of offences \nthat can attract that punishment. In my view, the maxim expressio unius est exclusio \nalterius  (“to express one thing is to exclude another ”) is of interpretive significance \nhere. Sullivan explains that an “implied exclusion argument lies whenever there is \nreason to believe that if the legislature had meant to include a particular thing within \nits legislation, it would have referred to that t hing expressly” (§ 8.09[1]; see also \nCanada v. Loblaw Financial Holdings Inc. , 2021 SCC 51, at para. 59; Cadieux \n(Litigation Guardian of) v. Cloutier , 2018 ONCA 903, 143 O.R. (3d) 545, at para. 114). \nWhere express reference is expected, the court can infer  that the failure to mention \nsomething is the result of a deliberate decision to exclude it.  \n[36] A driving prohibition is a punishment (see R. v. Poulin , 2019 SCC 47, \n[2019] 3 S.C.R. 566, at para. 38). Parliament’s usual practice is to specify available \npunis hments expressly. Within Part VIII.1 of the Criminal Code , provisions \nauthorizing punishment — whether fines, imprisonment, or driving prohibitions — \nexpressly list the offences to which those punishments directly apply (see ss. 320.19, \n320.2, 320.21 and 3 20.24). The same is true in other parts of the Criminal Code , where \nthe usual drafting practice is to either specify the punishment to which an offender is \nliable in the provision creating the offence or to enumerate the offences to which a \nparticular puni shment can attach.  \n[37] There is, therefore, strong reason to believe that if Parliament wished to \nenable driving prohibitions for criminal negligence convictions, it would have \n2024 SCC 34 (CanLII)\n\n--- Page 35 ---\n \n expressly listed ss. 220 and 221 in s. 320.24(4). The fact it did not do so signal s that \nthe intention of Parliament was to exclude criminal negligence from the ambit of s. \n320.24(4).  \n[38] Not only are the criminal negligence offences absent from the list of \noffences that can attract a discretionary driving prohibition, they were listed under the \nformer s. 259(2), and Parliament chose to remove them when it repealed the former \nprovision and re -enacted a different provision as s. 320.24(4).  \n[39] It is well established that “[p]rior enactments may throw some light on the \nintention of Parliament in repealing, amending, replacing or adding to a statute” ( R. v. \nUlybel Enterprises Ltd. , 2001 SCC 56, [2001] 2 S.C.R. 867, at para. 33; see also Gravel \nv. City of St -Léonard , [1978] 1 S.C.R. 660, at p. 667; British Columbia Human Rights \nTribunal v. Schrenk , 2017 SCC 62, [2017] 2 S.C.R. 795, at para. 60; Sullivan, at \n§ 23.02[2]). Courts must presume that “amendments to the wording of a legislative \nprovision are made for some intelligible purpose” (Sullivan, at § 23.02[3]). This \nremains so where the am endment takes the form of repeal and re -enactment, which is \n“generally viewed as the amendment of the former law” from a substantive perspective \n(P.-A. Côté, in collaboration with S",
    "token_count": 1000,
    "start_token": 14400,
    "end_token": 15400,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 17,
    "source_file": "2024scc34.txt",
    "text": "§ 23.02[2]). Courts must presume that “amendments to the wording of a legislative \nprovision are made for some intelligible purpose” (Sullivan, at § 23.02[3]). This \nremains so where the am endment takes the form of repeal and re -enactment, which is \n“generally viewed as the amendment of the former law” from a substantive perspective \n(P.-A. Côté, in collaboration with S. Beaulac and M. Devinat, The Interpretation of \nLegislation in Canada (4th ed. 2011), at p. 111). Here, Parliament deliberately chose \nto repeal the former provision that listed the criminal negligence offences and replace \nit with a new one that does not. The textual evolution of the discretionary driving \nprohibition provision is consistent with legislative intention to limit the availability of \n2024 SCC 34 (CanLII)\n\n--- Page 36 ---\n \n that sanction to the driving -specific offences in Part VIII.1 of the Criminal Code , \nexcluding the general offences of criminal negligence and manslaughter.  \n[40] In short, criminal negligence off ences are not listed as offences that can \nattract a discretionary driving prohibition. They used to be listed, but are no longer. \nParliament has expressed a strong legislative signal by repealing the provision that \nlisted such criminal negligence offences and enacting another section that excludes \nthem. This situation is a significant obstacle to the Crown’s submission that a driving \nprohibition remains an available punishment where an offender has been convicted of \na criminal negligence offence.  \n(b) The Disti nction Between Findings of Guilt and Convictions  \n[41] To get around the lack of express reference to the criminal negligence \noffences in s. 320.24(4), the Crown argues that the continued availability of a \ndiscretionary driving prohibition for a criminal neglige nce conviction is implied \nthrough Parliament’s use of the term “found guilty” in the provision. As noted above, \ncompared to the previous English version of the legislation, Bill C -46 changed the \nevent that triggers the availability of a discretionary drivi ng prohibition from situations \nwhere an offender is “convicted or discharged under section 730” of an enumerated \noffence to situations where the offender is “found guilty”.  \n2024 SCC 34 (CanLII)\n\n--- Page 37 ---\n \n [42] I proceed to consider whether the term “found guilty” in s. 320.24(4) can \nperform t he function argued by the Crown and reflects Parliament’s introduction of a \nnew circular drafting technique into the Criminal Code . \n[43] Findings of guilt and convictions are conceptually distinct in the criminal \ntrial context. A finding of guilt is a verdict o f the court following trial. It occurs when \nthere has been a finding that the essential elements of the offence have been proven \nbeyond a reasonable doubt (see Quigley’s Criminal Procedure in Canada  (loose -leaf), \nby D. Rose, ed., at § 22:7; Boily , at para.  55; see also, regarding the related concept of \na plea of guilt, Criminal Code , s. 606(1.1)(b); Ontario Courtroom Procedure (5th ed. \n2020), by M. Fuerst, M. A. Sanderson and S. Firestone, eds., with the assistance of \nR. N. Beaudoin et al., at p. 586). A co nviction, on the other hand, is “a final judgment \nof the court by which a finding of guilt is entered” ( R. v. Bérubé , 2012 BCCA 345, 326 \nB.C.A.C. 241, at paras. 44 and 49; see also Boily , at para. 55; R. v. Senior  (1996) , 181 \nA.R. 1 (C.A.), at para.  19). T here is some authority to the effect that the meaning of the \nterm “conviction” can vary based on the context (see Morris v. The Queen , [1979] 1 \nS.C.R. 405, at p. 429; R. v. McInnis  (1973), 1 O.R. (2d) 1 (C.A.)). There is no doubt, \nhowever, that a finding o f guilt is a distinct and earlier step in the trial process than the \nrecording of a conviction (see R. E. Salhany, Canadian Criminal Procedure  (6th ed. \n(loose -leaf)), at § 6:88; Fuerst, Sanderson and",
    "token_count": 1000,
    "start_token": 15300,
    "end_token": 16300,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 18,
    "source_file": "2024scc34.txt",
    "text": "; R. v. McInnis  (1973), 1 O.R. (2d) 1 (C.A.)). There is no doubt, \nhowever, that a finding o f guilt is a distinct and earlier step in the trial process than the \nrecording of a conviction (see R. E. Salhany, Canadian Criminal Procedure  (6th ed. \n(loose -leaf)), at § 6:88; Fuerst, Sanderson and Firestone, at p. 586). Section 570 of the \nCriminal Code describes the process by which a trial for an indictable offence \nconcludes and the judgment of the court is recorded:  \n2024 SCC 34 (CanLII)\n\n--- Page 38 ---\n \n 570 (1)  If an accused who is tried under this Part is determined by a judge \nor provincial court judge to be guilty of an offence on accept ance of a plea \nof guilty or on a finding of guilt, the judge or provincial court judge, as the \ncase may be, shall endorse the information accordingly and shall sentence \nthe accused or otherwise deal with the accused in the manner authorized \nby law and, on request by the accused, the prosecutor, a peace officer or \nany other person, a conviction in Form 35 and a certified copy of it, or an \norder in Form 36 and a certified copy of it, shall be drawn up and the \ncertified copy shall be delivered to the person ma king the request.  \n[44] A finding of guilt can lead to several different outcomes, including a \nconviction and the passing of sentence. Some issues that arise in criminal trials — such \nas whether to stay proceedings based on the entrapment defence or the rule aga inst \nmultiple convictions — are considered by the trial judge after a finding of guilt has \nbeen made but before a conviction is recorded (see R. v. Mack , [1988] 2 S.C.R. 903, at \np. 972; R. v. Pearson , [1998] 3 S.C.R. 620, at paras. 10, 13 and 16; Kienapple  v. The \nQueen , [1975] 1 S.C.R. 729; R. v. Provo , [1989] 2 S.C.R. 3; see also Salhany, at §  6:88). \nCourts must, “as soon as practicable after an offender has been found guilty, conduct \nproceedings to determine the appropriate sentence to be imposed” (s. 720 (1)). For some \noffences, where an accused “pleads guilty .  . . or is found guilty”, the court may direct \nthat the accused be absolutely or conditionally discharged “instead of convicting the \naccused” (s. 730(1)).  \n[45] In short, a finding of guilt is not synony mous with a conviction. Indeed, \nthe former is a precondition to the latter.  \n[46] The parties’ written submissions (see A.F., at paras. 46 -87; R.F., at \nparas.  31-53), and much of the discussion from the Court of Appeal (see C.A. reasons, \n2024 SCC 34 (CanLII)\n\n--- Page 39 ---\n \n at paras. 59 -74), focus  on whether findings of guilt and convictions are used \ninterchangeably throughout the Criminal Code and the common law and whether this \nheightens or lessens the significance of Parliament’s choice (in the English version of \nthe text) to change the event tr iggering s. 320.24(4)’s operation from “convicted or \ndischarged” to “found guilty”. Kalmakoff J.A. stated that Parliament must “be taken to \nhave acted intentionally when it changed the description of the event that triggers the \noperation of the section .  . . and to have done so with the difference between those \nconcepts in mind” (para. 74 (emphasis deleted)).  \n[47] However, it is my view that, despite the emphasis in the parties’ \nsubmissions on this issue, this appeal does not turn on whether the concepts of a f inding \nof guilt and conviction are used interchangeably at various parts of the Criminal Code . \nThroughout the Criminal Code , it is possible to identify provisions that signal that \nParliament was alive to the conceptual distinction between findings of guilt  and \nconvictions (such as ss. 570(1), 570(4) and 730(1), noted above), and other provisions \nwhere the distinction is not so clear. This exercise offers little assistance in resolving \nthis appeal. The issue in",
    "token_count": 1000,
    "start_token": 16200,
    "end_token": 17200,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 19,
    "source_file": "2024scc34.txt",
    "text": " \nof guilt and conviction are used interchangeably at various parts of the Criminal Code . \nThroughout the Criminal Code , it is possible to identify provisions that signal that \nParliament was alive to the conceptual distinction between findings of guilt  and \nconvictions (such as ss. 570(1), 570(4) and 730(1), noted above), and other provisions \nwhere the distinction is not so clear. This exercise offers little assistance in resolving \nthis appeal. The issue in this case is not whether a conviction or a find ing of guilt is the \ngateway to a driving prohibition under s. 320.24(4); the text plainly indicates that this \nsentencing option is available when an offender has been “found guilty” of an \nenumerated offence. Rather, this Court must consider whether, as the  Crown submits \nand the Court of Appeal accepted, an offender is “found guilty” of an enumerated \noffence under s. 320.24(4) — triggering the availability of a discretionary driving \nprohibition — when they are convicted of an unenumerated offence for which a n \n2024 SCC 34 (CanLII)\n\n--- Page 40 ---\n \n enumerated offence is included. The Crown’s incorporation by implication argument \ndepends in part on the proper meaning of “found guilty” in the context of the provision.  \n(c) Included Offences  \n[48] The Crown argues that the appellant’s convictions on the crimina l \nnegligence counts “proved him guilty” of dangerous operation. Further, they point to \nthe fact that the trial judge conducted a separate analysis of the dangerous operation \noffence in the reasons and “explicitly found him guilty of that included offence” (R.F., \nat paras. 54 and 86 -87). \n[49] Section 662 of the Criminal Code governs included offences. It provides, \nin part:  \n662 (1)  A count in an indictment is divisible and where the commission of \nthe offence charged, as described in the enactment creating it or as  charged \nin the count, includes the commission of another offence, whether \npunishable by indictment or on summary conviction, the accused may be \nconvicted  \n \n(a) of an offence so included that is proved, notwithstanding that the \nwhole offence that is charged  is not proved; or  \n \n(b) of an attempt to commit an offence so included.  \n \n. . . \n \n(5) For greater certainty, when a count charges an offence under section \n220, 221 or 236 arising out of the operation of a conveyance, and the \nevidence does not prove that offe nce but proves an offence under section \n320.13, the accused may be convicted of an offence under that section.  \n2024 SCC 34 (CanLII)\n\n--- Page 41 ---\n \n Stated briefly, an “offence is ‘included’ if its elements are embraced in the offence \ncharged (as described in the enactment creating it or as charged in the count) or if it is \nexpressly stated to be an included offence in the Criminal Code  itself” ( R. v. G.R., 2005 \nSCC 45, [2005] 2 S.C.R. 371, at para. 25).  \n[50] The terms of the included offence provisions signal that their function is \nlimited to situations where the charged offence is not proved. The provisions provide \nfair notice of an alternate  pathway to a guilty verdict. Section 662(5) makes clear that \nthe dangerous operation offence (contrary to s. 320.13) is an included offence for \ncriminal negligence offences arising out of the operation of a conveyance (ss.  220 and \n221). But, s. 662(5) also  makes clear that only where the evidence does not prove the \ncharged offence does it become possible the accused could be convicted of the included \ndangerous operation offence (as demonstrated by Parliament’s use of the phrases “does \nnot prove that offence ” and “may be convicted”). The trial judge in this case recognized \nthis when he stated that he was satisfied that the appellant was guilty of dangerous \noperation “in the alternative” and “in case [he was] in error in [his] analysis of criminal \nnegligence” (paras. 171 and 183). Similarly, in jury trials, the trial judge should not \ninstruct a jury on potential liability for an included offence when there is no realistic \npossibility of an acquittal on the charged offence and a conviction on the included \noffenc e (see R. v. Ronald , 2019 ONCA 971, at para. 42; R. v. Wong (2006), 209 C.C.C. \n(3d)",
    "token_count": 1000,
    "start_token": 17100,
    "end_token": 18100,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 20,
    "source_file": "2024scc34.txt",
    "text": "paras. 171 and 183). Similarly, in jury trials, the trial judge should not \ninstruct a jury on potential liability for an included offence when there is no realistic \npossibility of an acquittal on the charged offence and a conviction on the included \noffenc e (see R. v. Ronald , 2019 ONCA 971, at para. 42; R. v. Wong (2006), 209 C.C.C. \n(3d) 520 (Ont. C.A.), at para.  12; R. v. Savage , 2023 ONCA 240, at para.  42). This \nreflects the role of included offences as being an alternative basis for a finding of guilt.  \n2024 SCC 34 (CanLII)\n\n--- Page 42 ---\n \n [51] The Crown’s argument jumps from the uncontroversial principle that the \naccused may, in the alternative, be convicted (or discharged) of an included offence, to \nthe novel principle that the accused may be liable for a punishment available for an \nincluded off ence even if not convicted or discharged of that offence. The words used \nin s. 662 speak clearly to the former idea but not the latter. The Crown’s position \nstretches the included offence rules beyond their current understanding in law and \namounts to a nov el method of statutory interpretation of criminal offences and \npenalties.  \n[52] The jurisprudence on included offences typically centers on the idea of fair \nnotice (see, e.g., G.R., at paras. 11 -12). In R. v. Pawluk , 2017 ONCA 863, 357 C.C.C. \n(3d) 86, Paciocco J .A. explained that “the very concept of an included offence is \npredicated on the fact that it is not unfair to try the accused on an included offence since \nthe charge laid alerts the accused person that they are alleged to have satisfied all of the \nelement s of the included offence, as well as the charged offence” (para. 28; see also \nG.R., at para. 30). In G.R., Binnie J. outlined three categories of included offences: (1) \noffences included by statute; (2) offences included in the enactment creating the \noffence charged; and (3) offences which become included by the addition of apt words \nof description to the principal charge (paras. 29 -33). Each of these categories meets the \ntest for fair notice; the accused is notified of the extent of their possible jeopard y by \neither the terms of the Criminal Code or by the words of the indictment (see also Rose, \nat § 22:8).  \n2024 SCC 34 (CanLII)\n\n--- Page 43 ---\n \n [53] Accordingly, an accused has no complaint if, in the alternative, they are \nfound guilty by the court of an included offence, even if that offence is not  stipulated \non the charging document. It is not at all clear, however, that an accused has been fairly \nput on notice of their liability for punishments attached uniquely to included offences \nin situations where they are convicted of the charged offence. Ac cused persons must \nbe informed in advance and in a non -ambiguous manner of the punishments they are \nliable to if convicted of a particular offence. This imperative is particularly \nconsequential where an accused pleads guilty to an offence, given the requir ement that \nthey be aware of the criminal consequences of their plea (see R. v. Wong , 2018 SCC \n25, [2018] 1 S.C.R. 696, at para. 4). I do not think that offenders who have pleaded \nguilty to criminal negligence causing death — as in Boily — would reasonably have \nunderstood based on the legislation that they may be liable to a driving prohibition for \nthat offence at the time of their plea.  \n[54] I understand the logic of the Crown’s argument, but I am not persuaded \nthat the relevance of the included offence machine ry, which provides fair notice of an \nalternative basis upon which an accused could be found guilty and subsequently \nconvicted, should be extended beyond situations where the charged offence is not \nproved. It is well established that “[a]bsent clear legisla tive intention to the contrary, a \nstatute should not be interpreted as substantially changing the law” ( R. v. D.L.W. , 2016 \nSCC 22, [2016] 1 S.C.R. 402, at para. 21; see also La Presse inc. v. Quebec , 2023 SCC \n22, at para. 59; R.",
    "token_count": 1000,
    "start_token": 18000,
    "end_token": 19000,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 21,
    "source_file": "2024scc34.txt",
    "text": "proved. It is well established that “[a]bsent clear legisla tive intention to the contrary, a \nstatute should not be interpreted as substantially changing the law” ( R. v. D.L.W. , 2016 \nSCC 22, [2016] 1 S.C.R. 402, at para. 21; see also La Presse inc. v. Quebec , 2023 SCC \n22, at para. 59; R. v. Summers , 2014 SCC 26, [2 014] 1 S.C.R. 575, at paras. 55 -56; R. \nv. T. (V.) , [1992] 1 S.C.R. 749, at pp. 763 -64; R. v. Basque , 2023 SCC 18, at para. 49; \n2024 SCC 34 (CanLII)\n\n--- Page 44 ---\n \n Interpretation Act , R.S.C. 1985, c. I -21, s.  45(2)). In my view, Parliament’s use of the \nterm “found guilty” in s. 320.24(4) does  not amount to a clear legislative signal that the \nincluded offence machinery should take on a new role and facilitate the imposition of \npunishment by implication rather than express reference. This would be a subtle and \npeculiar expression of legislative intent.  \n[55] I add that it is of no moment in this case that the trial judge chose to conduct \na separate analysis of the included dangerous operation offences (paras. 171 -80). It was \nnot improper for the trial judge to conduct an alternative analysis on the inc luded \noffences. But the availability of a driving prohibition should not depend on whether a \ntrial judge chose to analyze the elements of an included offence in circumstances where \nthey were not required to do so.  \n[56] In my view, the use of the wording “found guilty” in s. 320.24(4) is \nsuggestive of an express judicial determination, whether by a jury in announcing its \nverdict or a judge. McGuinness defines a “finding” as a “determination made by an \nadjudicator during the course of a proceeding on some question  of fact” (K. P. \nMcGuinness, The Encyclopedic Dictionary of Canadian Law (2021)). Black’s Law \nDictionary  (11th ed. 2019) defines to “find” as “[t]o determine a fact in dispute by \nverdict or decision” and offers the phrase “find guilty” as an illustration . I agree with \nSkolrood J.A. that the natural and ordinary meaning conveyed by “found guilty” is that \nthere has been a specific  finding of guilt ( Francisco , at para. 42). Given the usual \nfunction of included offences that I have described above, I cannot acc ept that a finding \n2024 SCC 34 (CanLII)\n\n--- Page 45 ---\n \n of guilt within the meaning of s. 320.24(4) can be the implied  result of some other \njudicial determination (i.e., a conviction for an offence not enumerated in s. 320.24(4)).  \n(d) An Additional Signal in the Text of Section 320.24(4)  \n[57] Another  obstacle to the Crown’s proposed interpretation lies in the fact that \ns. 320.24(4) provides that when an offender is “found guilty” of an enumerated offence, \na driving prohibition can be imposed “in addition to any other punishment that may be \nimposed for that offence ”. In other words, the provision contemplates the imposition \nof punishment — including a driving prohibition and “other punishment” such as \nimprisonment — for the commission of an enumerated offence (see Francisco , at para. \n43). Criminal negli gence is not enumerated; it cannot qualify as “ that offence ”. The \nCrown’s proposed interpretation contemplates a form of bifurcation that conflicts with \nthis limitation: a driving prohibition would be imposed for the enumerated dangerous \noperation offence,  and “other punishment” (in the appellant’s case, imprisonment) \nwould be imposed for the unenumerated criminal negligence offence. Put differently, \nthe second half of the text of s. 320.24(4) signals that a driving prohibition can be \nordered in addition to  other punishment imposed for an enumerated offence — not in \naddition to punishment imposed for another offence.  \n(e) Comparison of the English and French Changes to Section 320.24(4)  \n[58] The English and French versions of s. 320.24(4) are",
    "token_count": 1000,
    "start_token": 18900,
    "end_token": 19900,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 22,
    "source_file": "2024scc34.txt",
    "text": " the unenumerated criminal negligence offence. Put differently, \nthe second half of the text of s. 320.24(4) signals that a driving prohibition can be \nordered in addition to  other punishment imposed for an enumerated offence — not in \naddition to punishment imposed for another offence.  \n(e) Comparison of the English and French Changes to Section 320.24(4)  \n[58] The English and French versions of s. 320.24(4) are equally authoritative \nand both must be considered (see R. v. Quesnelle , 2014 SCC 46, [2014] 2 S.C.R. 390, \n2024 SCC 34 (CanLII)\n\n--- Page 46 ---\n \n at para. 53; Sullivan, at §§ 5.02[3] -[5]). As explained, the gateway to a discretionary \ndriving prohibition as a sentencing option in s. 320.24(4) is where an offender has be en \n“found guilty” (in the English version) or “ déclaré coupable ” (in the French version) \nof an enumerated offence. With Bill C -46, while the “convicted” language in the former \ns. 259(2) was dropped from the English version and replaced with “found guilty”,  the \nFrench version of former s. 259(2) permitted driving prohibitions when the offender \nwas “ déclaré coupable ou absous sous le régime de l’article 730 ”. There was no change \nto the “ déclaré coupable ” language in the French version akin to the switch in En glish \nfrom “convicted or discharged” to “found guilty”.  \n[59] For this reason, the Crown’s submission that Parliament “employed the \nlong-recognized distinction between concepts of conviction and guilt to create a new \napproach  for imposing driving prohibitions” i s unpersuasive (R.F., at para. 3 (emphasis \nadded)). While there is no doubt that there is a distinction between convictions and \nfindings of guilt, the force of the Crown’s submission is derived from the change in \nEnglish from the deletion of the word “conv icted” and the introduction of the “found \nguilty” language — a change which did not occur in the equally authoritative French \nversion.  \n(f) Conclusion on the Text of Section 320.24(4)  \n[60] In my view, the text of s. 320.24(4) as a whole is clear and does not reveal  \nany ambiguity. Criminal negligence offences are no longer listed as offences that can \nattract a discretionary driving prohibition. Moreover, Parliament’s use of the phrase \n2024 SCC 34 (CanLII)\n\n--- Page 47 ---\n \n “found guilty” strongly points to the need for an express judicial determination of  guilt \non an offence stipulated in the charging document or included in one that is (in \nsituations where the charged offence is not proved). The Crown fails to persuade me \nthat a finding  of guilt on an included offence — sufficient to attract punishment un der \ns. 320.24(4) — necessarily flows from conviction on the charged offence. This a very \nweak basis on which to argue that the text implies the inclusion of something that was \nrepealed and not carried forward in a fundamentally altered scheme for driving \noffences.  \n[61] In such circumstances, the text of the provision usually dominates the \ninterpretive exercise, but the relevant jurisprudence directs that the Court must still go \non to consider context and legislative purpose (see Canada Trustco Mortgage Co. , at \npara. 10; ATCO Gas and Pipelines Ltd. v. Alberta (Energy and Utilities Board) , 2006 \nSCC 4, [2006] 1 S.C.R. 140, at para. 48).  \n(2) Statutory and Broader Criminal Law Context  \n[62] There are several considerations stemming from the surrounding statutory \ncontext and bro ader criminal law principles that shed light on s. 320.24(4).  \n(a) Other Provisions in Part VIII.1 of the Criminal Code  \n[63] The upshot of the Crown’s position is that when one is convicted of an \noffence, there is, by necessary implication, a finding of guilt on any  included offence. \n2024 SCC 34 (CanLII)\n\n--- Page 48 ---\n \n And they attach legal consequences to that implied finding of guilt. The Court must \nassess the implications of this position.  \n[64] It is instructive to consider Criminal Code provisions that are closely \nproximate to s. 320.24(4). Section 320. ",
    "token_count": 1000,
    "start_token": 19800,
    "end_token": 20800,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 23,
    "source_file": "2024scc34.txt",
    "text": " is convicted of an \noffence, there is, by necessary implication, a finding of guilt on any  included offence. \n2024 SCC 34 (CanLII)\n\n--- Page 48 ---\n \n And they attach legal consequences to that implied finding of guilt. The Court must \nassess the implications of this position.  \n[64] It is instructive to consider Criminal Code provisions that are closely \nproximate to s. 320.24(4). Section 320. 24(1) provides for a mandatory driving \nprohibition order in certain situations and contains similar wording to that in \ns. 320.24(4):  \n320.24 (1)  If an offender is found guilty of an offence under subsection \n320.14(1) or 320.15(1), the court that sentences t he offender shall , in \naddition to any other punishment that may be imposed for that offence, \nmake an order prohibiting the offender from operating the type of \nconveyance in question during a period to be determined in accordance \nwith subsection (2).  \nBy its  terms, the provision mandates a driving prohibition where an offender has been \nfound guilty of impaired operation simpliciter (contrary to s. 320.14(1)) or \nfailure/refusal to comply with a demand simpliciter (s. 320.15(1)). On a first offence, \nthe duratio n of the prohibition order is to be “ not less than one year and not more than \nthree years, plus the entire period to which the offender is sentenced to imprisonment” \n(s. 320.24(2)).   \n[65] The Crown’s proposed interpretation of s. 320.24(4) sits uneasily with th e \nmandatory driving prohibition provision. I note that the more serious offences of \nimpaired operation causing bodily harm (s. 320.14(2)) and impaired operation causing \ndeath (s. 320.14(3)), and their equivalents in s. 320.15, fall under the discretionary \n2024 SCC 34 (CanLII)\n\n--- Page 49 ---\n \n driving prohibition provision in s. 320.24(4). Suppose a first -time offender were to be \nconvicted of impaired operation causing death, which provides that: “Everyone \ncommits an offence who commits an offence under subsection (1) and who , while \noperating th e conveyance, causes the death of another person” (s. 320.14(3)). As this \noffence fully embraces the impaired operation simpliciter offence as one of its \ncomponents, the effect of the Crown’s position in this case would be that there would \nbe a conviction on the s. 320.14(3) offence and a finding of guilt on the included s. \n320.14(1) offence. Could the offender be subject to both a discretionary driving \nprohibition of “any duration that the court considers appropriate” with respect to the \nformer and a manda tory prohibition of “not less than one year and not more than three \nyears” (in addition to the duration of any prison term) with respect to the latter \n(s. 320.24(2) and (5))? Would any discretionary driving prohibition imposed for \nimpaired operation causin g death have to comply with the minimum and maximum \ntemporal parameters of s. 320.24(2) — ostensibly mandatory upon a finding of guilt \nfor impaired operation simpliciter ? That the implications of the Crown’s position are \nunclear in relation to its applicat ion to a closely proximate statutory provision detracts \nfrom its plausibility in relation to s. 320.24(4).  \n[66] I consider also s. 320.25, which governs stays of driving prohibition orders \npending appeal:  \n320.25 (1)  Subject to subsection (2), if an appeal is taken against a \nconviction or sentence for an offence under any of sections 320.13 to \n320.18 , a judge of the court to which the appeal is taken may direct that the \nprohibition order under section 320.24 arising out of the conviction  shall, \n2024 SCC 34 (CanLII)\n\n--- Page 50 ---\n \n on any condition s that the judge imposes, be stayed pending the final \ndisposition of the appeal or until otherwise ordered by that court.  \nThis section contemplates stays of driving prohibition orders when an appeal is brought \nagainst a conviction or sentence for an offenc e under ss. 320.13 to 320.18. The \n“conviction” language in English was retained with the enactment of Bill C -46 \ncompared to the former s. 261(1) of the Criminal Code . In French",
    "token_count": 1000,
    "start_token": 20700,
    "end_token": 21700,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 24,
    "source_file": "2024scc34.txt",
    "text": " judge imposes, be stayed pending the final \ndisposition of the appeal or until otherwise ordered by that court.  \nThis section contemplates stays of driving prohibition orders when an appeal is brought \nagainst a conviction or sentence for an offenc e under ss. 320.13 to 320.18. The \n“conviction” language in English was retained with the enactment of Bill C -46 \ncompared to the former s. 261(1) of the Criminal Code . In French, Parliament replaced \n“déclaration de culpabilité ” (“finding of guilt”) with “ condamnation ” (“conviction”). \nAlthough the criminal negligence offences were listed under the former s. 261(1), they \nhave been dropped from the stay pending appeal provision following Bill C -46. \n[67] It is not clear that s. 320.25(1) could operate to stay the app ellant’s driving \nprohibitions pending appeal if the Crown’s interpretation is accepted, as the appellant \nwas not convicted  of any of the offences listed under that subsection. Though it perhaps \ncould be argued that the effect of the Crown’s proposed interp retation would be that \nthe appellant was sentenced to a driving prohibition for the included s. 320.13 offence, \nCrown counsel clarified during the oral hearing that, in his submission, punishment \nattaches to the offence for which an offender is convicted — not the finding of guilt \n(transcript, at pp. 60 -61). In any event, s. 320.25(1) refers to a driving prohibition order \n“arising out of the conviction” — referring to the conviction specified in the opening \nwords of the provision that is limited to those fa lling between ss. 320.13 and 320.18. \nThe argument that s. 320.24(4) operates to allow for driving prohibitions to be imposed \nfor criminal negligence convictions (under ss. 220 and 221) sits uncomfortably with s. \n320.25(1), whose text appears not to contemp late stays pending appeal for this \n2024 SCC 34 (CanLII)\n\n--- Page 51 ---\n \n situation. Further, Bill C -46’s deletion of any reference to the criminal negligence \noffences from what is now s. 320.25(1) also supports the conclusion that driving \nprohibitions are no longer contemplated for criminal ne gligence convictions.  \n[68] Finally, the Crown relies on the new s. 320.23 to illustrate how Parliament \nwas attuned to the “liminal space between ‘a finding of guilt’ and ‘conviction or \ndischarge’ to create a unique post -guilt but pre -sentence treatment option”  (R.F., at \npara. 68). Section 320.23 also uses the “found guilty” language and provides:  \n320.23 (1)  The court may, with the consent of the prosecutor and the \noffender, and after considering the interests of justice, delay sentencing of \nan offender who has been found guilty of an offence under subsection \n320.14(1) or 320.15(1)  to allow the offender to attend a treatment program \napproved by the province in which the offender resides. If the court delays \nsentencing, it shall make an order prohibiting the offen der from operating, \nbefore sentencing, the type of conveyance in question, in which case \nsubsections 320.24(6) to (9) apply.  \n \n(2) If the offender successfully completes the treatment program, the court \nis not required to impose the minimum punishment under  section 320.19 \nor to make a prohibition order under section 320.24, but it shall not direct \na discharge under section 730.  \nThis mechanism only applies to those found guilty of the simpliciter impaired driving \nand failure/refusal to comply offences in ss. 320.14(1) and 320.15(1). Ordinarily, these \noffenders would be sentenced to a mandatory driving prohibition under s. 320.24(1), \nbut s. 320.23(2) permits an exception where the offender successfully completes a \ntreatment program. Where sentencing is delayed for the purpose of allowing the \noffender to attend such a treatment program, the court is required to make a temporary \ndriving prohibition order under this section (and not under s. 320.24).  \n2024 SCC 34 (CanLII)\n\n--- Page 52 ---\n \n [69] The pre -sentencing context of this section differs from s. 320.24 (4), which \nauthorizes a particular punishment on sentencing. Delaying sentencing to allow the \noffender to attend a treatment program is conditional upon",
    "token_count": 1000,
    "start_token": 21600,
    "end_token": 22600,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 25,
    "source_file": "2024scc34.txt",
    "text": " attend such a treatment program, the court is required to make a temporary \ndriving prohibition order under this section (and not under s. 320.24).  \n2024 SCC 34 (CanLII)\n\n--- Page 52 ---\n \n [69] The pre -sentencing context of this section differs from s. 320.24 (4), which \nauthorizes a particular punishment on sentencing. Delaying sentencing to allow the \noffender to attend a treatment program is conditional upon the consent of the Crown \nand the offender, which distinguishes the interim driving prohibitions authori zed by \ns. 320.23(1) from the punishments that s. 320.24 authorizes in the sentencing context. \nThe most that can be said of s. 320.23 in support of the Crown’s position on this appeal \nis that it demonstrates that a finding of guilt is not synonymous with a conviction, which \nI accept.  \n(b) Rule Against Multiple Convictions  \n[70] The Crown’s proposed interpretation of s. 320.24(4) would permit the \nappellant to be sentenced to custody as a result of his convictions for criminal \nnegligence causing death and bodily harm an d sentenced to driving prohibitions as a \nresult of having been “found guilty” of dangerous operation causing death and bodily \nharm. In Boily , Fairburn A.C.J.O. raised the concern that “if charged with the included \noffence, the [Crown’s] interpretation has the effect of creating a punishment for a crime \nthat, through the operation of the principles in Kienapple , would necessarily attract a \nconditional stay because a person cannot be punished twice for the same offence” \n(para.  57; see also para. 58).  \n[71] The Kien apple  principle prevents an accused from being convicted of \nmultiple offences when there is a factual and legal nexus connecting the offences \n(Kienapple ; R. v. Prince , [1986] 2 S.C.R. 480). There is a factual nexus where the same \n2024 SCC 34 (CanLII)\n\n--- Page 53 ---\n \n act grounds both charges ( Prince , at pp. 492 -93). A legal nexus exists where “there is \nno additional and distinguishing element that goes to guilt contained in the offence for \nwhich a conviction is sought to be precluded by the Kienapple  principle” (pp. 498 -99; \nsee also S. Penney, V. Rondinelli and J. Stribopoulos, Criminal Procedure in Canada \n(3rd ed. 2022), at ¶14.33). In short, the rule precludes more than one conviction arising \nout of the same delict ( Kienapple , at p. 748; Prince , at pp. 488 -90).  \n[72] In situations where there have been multiple findings of guilt and \nKienapple is found to apply, the offender should be convicted and sentenced on the \nmore serious offence, and a conditional stay should be ordered on the less serious \noffence ( Provo , at p. 16; R. v. J.F. , 2008 SCC 60, [20 08] 3 S.C.R. 215, at paras. 13 and \n15). \n[73] The rule  can apply to bar multiple convictions for two charges arising out \nof the same delict where one charge is included in the other (see, e.g., R. v. Doliente , \n[1997] 2 S.C.R. 11). This could certainly be the cas e where an offender has been found \nguilty of both a criminal negligence offence and a separately charged dangerous \noperation offence (see, e.g., R. v. Lights , 2017 ONSC 5153, 18 M.V.R. (7th) 110, at \npara. 1, aff’d 2020 ONCA 102, 60 M.V.R. (7th) 47; R. v. B hangal , 2016 ONCA 857, \n100 M.V.R. (6th) 173, at para. 3; R. v. Mowlai , 2017 ONSC 4815, 15 M.V.R. (7th) 38). \nWhether barring multiple convictions in the case of included offences is properly \ndescribed as an application of the Kienapple principle or some oth er similar rule that \nspecifically pertains to included offences (see R. v. Doliente  (1996), 108 C.C.C. (3d) \n2024 SCC 34 (CanLII)\n\n--- Page 54 ---\n \n 137 (Alta",
    "token_count": 1000,
    "start_token": 22500,
    "end_token": 23500,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 26,
    "source_file": "2024scc34.txt",
    "text": ", 15 M.V.R. (7th) 38). \nWhether barring multiple convictions in the case of included offences is properly \ndescribed as an application of the Kienapple principle or some oth er similar rule that \nspecifically pertains to included offences (see R. v. Doliente  (1996), 108 C.C.C. (3d) \n2024 SCC 34 (CanLII)\n\n--- Page 54 ---\n \n 137 (Alta. C.A.), at pp. 152 -54, per  Harradence J.A., dissenting, rev’d [1997] 2 S.C.R. \n11; R. v. K. (R.) (2005), 198 C.C.C. (3d) 232 (Ont. C.A.), a t para. 35), it is not in doubt \nthat multiple convictions in this context are precluded.  \n[74] In this case, there is no suggestion that the rule from Kienapple is directly \nengaged as the appellant was not convicted of multiple offences arising out of the same \ndelict. He was only convicted of the criminal negligence offences. But had there been \nseparate counts on the indictment alleging dangerous operation, the appellant could not \nhave been convicted of all of the counts. The trial judge would have been required to \ndetermine which counts would be stayed under the Kienapple rule. As I see it, accepting \nthe Crown’s argument on s. 320.24(4) would nonetheless have the effect of permitting \npunishment for the stayed offences.  \n[75] I appreciate the clarification offered by C rown counsel during the oral \nhearing to the effect that, on the Crown’s argument, the driving prohibitions would \nformally attach to the criminal negligence convictions and not the implied findings of \nguilt on the included dangerous operation offences (tran script, at pp. 60 -61). This \nclarification may serve to address Fairburn A.C.J.O.’s practical concern about “how \n[one would] reflect a punishment for a stayed offence on someone’s criminal record” \n(Boily , at para. 58). But s. 320.24(4) nonetheless provides for punishment — a \ndiscretionary driving prohibition — in relation to dangerous operation, not criminal \nnegligence.  \n2024 SCC 34 (CanLII)\n\n--- Page 55 ---\n \n [76] In my view, the well -established rule against multiple convictions is a \nrelevant legal principle that bears on the interpretation of s. 320 .24(4). The notion that \na conviction for an offence opens the door to punishments not expressly provided for \nthat offence, but by implication based on those available for an included offence, sits \nin tension with the rule against multiple convictions. This  is because the rule would \noperate to prevent punishment in relation to the included offence had it been charged \nseparately on the indictment.  \n(3) Legislative Purpose  \n[77] Sullivan explains that “[i]n so far as the language of the text permits, \ninterpretations tha t are consistent with or promote legislative purpose should be \nadopted, while interpretations that defeat or undermine legislative purpose should be \navoided” (§ 9.01[1]; see also Côté, Beaulac and Devinat, at pp. 421 -22). \n[78] I agree with the Court of Appeal t hat Bill C -46 furthered objectives of \n“coherence, efficiency, simplification, and modernization of the Criminal Code  \nprovisions relating to driving offences” (para. 57; see also Boily , at para. 11). With this \nlegislation, Parliament repealed the Criminal C ode’s driving -related provisions and re -\nenacted them in a new, self -contained Part VIII.1 (“Offences Relating to \nConveyances”). This new part contains the declaration of principles, driving offences, \npunishments, other sentencing provisions, investigative provisions, and evidentiary \nrules. Several offences were transformed from straight indictable to hybrid offences, \naffording greater flexibility to prosecutors in less serious cases (ss. 320.13(2), \n2024 SCC 34 (CanLII)\n\n--- Page 56 ---\n \n 320.14(2), 320.15(2) and 320.16(2)). Hansard records reveal  that parliamentarians \nwere attuned to this change ( House of Commons Debates , May 19, 2017, at pp. 11491 -\n92 (P. Damoff); Debates of the Senate , vol. 150, No. 156, 1st Sess., 42nd Parl. , \nNovember 7, 2017, at",
    "token_count": 1000,
    "start_token": 23400,
    "end_token": 24400,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 27,
    "source_file": "2024scc34.txt",
    "text": "(2), 320.15(2) and 320.16(2)). Hansard records reveal  that parliamentarians \nwere attuned to this change ( House of Commons Debates , May 19, 2017, at pp. 11491 -\n92 (P. Damoff); Debates of the Senate , vol. 150, No. 156, 1st Sess., 42nd Parl. , \nNovember 7, 2017, at p. 4103 (Hon. G. Boniface)).  \n[79] Bill C -46 also rais ed certain maximum penalties, which the Court of \nAppeal noted was another key theme of the legislation (para. 57). In my view, while \nthese changes no doubt promote the statutory goal of “ deterring persons from operating \nconveyances dangerously or while the ir ability to operate them is impaired by alcohol \nor a drug” (s. 320.12(b)), they mainly serve to further Bill C -46’s aims of \nsimplification, coherence, and efficiency. The new maximum penalty of 14 years’ \nimprisonment for dangerous driving causing bodily harm (s. 320.13(2)), when \nprosecuted by indictment, aligns with the punishment provided for the other driving -\nrelated  offences in situations where bodily harm ensues (ss. 320.14(2), 320.15(2) and \n320.16(2)). The same goes for dangerous driving causing death (s.  320.13(3)), whose \nmaximum penalty was increased to life imprisonment — like other driving -related \noffences resu lting in death. Again, parliamentarians recognized that Bill C -46 brought \nabout consistency to the penalty scheme ( House of Commons Debates , May 19, 2017, \nat p. 11492 (P. Damoff); Debates of the Senate , November 7, 2017, at p. 4103 (Hon. \nG. Boniface)).  \n[80] It is significant that the increased penalties expressly enacted by Bill C -46 \nfor the dangerous operation offences are greater than or equal to those available for the \n2024 SCC 34 (CanLII)\n\n--- Page 57 ---\n \n criminal negligence offences. The maximum penalty for dangerous operation causing \ndeath (s.  320.13(3)) is now equal to criminal negligence causing death (s. 220): life \nimprisonment, the highest prison term available in the Criminal Code . The maximum \npenalty of 14 years for dangerous operation causing bodily harm (s. 320.13(2)) now \nexceeds the 10 -year maximum available for criminal negligence causing bodily harm \n(s. 221).  \n[81] In my view, these changes further Parliament’s objectives of developing a \nsimplified, coherent, and efficient driving offence scheme under a single part of the \nCriminal Code . They signal that dangerous driving is best addressed by resorting to the \ndangerous operation offences under s. 320.13, which have been made more versatile \n(with respect to hybridization) and consistent with other driving offences resulting in \nsimilar harm (w ith respect to penalties). As one parliamentarian noted during the \ndebates: “With the increase of the dangerous driving causing death maximum penalty, \nthere would no longer be a need for the prosecution to pursue separate offences  in order \nto allow for a m aximum penalty of life imprisonment” ( House of Commons Debates , \nMay 19, 2017, at p. 11492 (P. Damoff) (emphasis added)).  \n[82] I note that practitioners and courts have recognized the prosecutorial \nadvantages following Bill C -46 of resorting to dangerous operati on as opposed to \ncriminal negligence. In their book Impaired Driving and Other Criminal Code Driving \nOffences , Jokinen and Keen write that they “predict that criminal negligence will fall \ninto disuse in driving cases, as it is a harder offence to prove and  other available \n2024 SCC 34 (CanLII)\n\n--- Page 58 ---\n \n offences, such as dangerous driving, now bear harsher penalties” (p. 531). They list \nseveral advantages, from the Crown’s perspective, of proceeding under the dangerous \noperation offences: the increased maximum penalties, the hybrid nature  of the \ndangerous operation causing bodily harm offence, and the minimum fines and jail \nsentences that do not apply to criminal negligence (p. 157). In Boily , Fairburn A.C.J.O. \nmade a similar observation related to the equal maximum penalties of life \nimpri sonment for dangerous operation causing death and criminal negligence causing \ndeath (para. 73).  \n",
    "token_count": 1000,
    "start_token": 24300,
    "end_token": 25300,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 28,
    "source_file": "2024scc34.txt",
    "text": " perspective, of proceeding under the dangerous \noperation offences: the increased maximum penalties, the hybrid nature  of the \ndangerous operation causing bodily harm offence, and the minimum fines and jail \nsentences that do not apply to criminal negligence (p. 157). In Boily , Fairburn A.C.J.O. \nmade a similar observation related to the equal maximum penalties of life \nimpri sonment for dangerous operation causing death and criminal negligence causing \ndeath (para. 73).  \n[83] The Court of Appeal below reasoned that it would be absurd if s. 320.24(4) \ndid not allow for a driving prohibition for criminal negligence convictions given th at \nthe result would be that “being convicted of the more serious offence — criminal \nnegligence — would leave the offender subject to less serious consequences than being \nconvicted of a lesser included offence” (para. 79; see also Boily , at para. 50). The \nCrown argues that the effect of the appellant’s interpretation of s.  320.24(4) is that there \nwould be an “inversion of the relationship between punishment and seriousness of the \noffence” (R.F., at para. 81; see also para. 93).  \n[84] Given the objectives advanced by Bill C -46, I do not accept that the \nexclusion of the criminal negligence offences from the ambit of s. 320.24(4) would be \ninconsistent with legislative purpose or represent an absurdity. Rather, this \ninterpretation is perfe ctly consistent with Bill C -46’s stated purpose and what \nParliament has actually enacted. Over time, Parliament has increasingly underscored \n2024 SCC 34 (CanLII)\n\n--- Page 59 ---\n \n the seriousness of dangerous driving by gradually raising the penalties attached to the \ndangerous operation offence . Bill C -46 marked the point where those penalties matched \nor exceeded those available for criminal negligence — a more general offence that is \nnot unique to the driving context. Jokinen and Keen have observed, as a result, that \n“criminal negligence is no longer the most serious penal offence” in driving cases \n(Impaired Driving and Other Criminal Code Driving Offences: A Practitioner’s \nHandbook (2019), at p. 137). I recognize that dangerous operation is nonetheless an \nincluded offence for criminal negligenc e under s. 662(5). But, the legislative changes \nto the penalty scheme significantly detract from the Crown’s absurdity argument. The \nassumption that criminal negligence is relatively more serious than dangerous \noperation may need to be revisited following the enactment of Bill C -46. \n[85] My colleague states that although “lengthier penalties are available for the \noffence of dangerous operation of a conveyance, the offence of criminal negligence is \nat least as serious  as dangerous [operation]” (Moreau J.’s reason s, at para.  140 \n(emphasis added)). In my view, for the absurdity argument to have any purchase, the \ncriminal negligence offences must be shown to be more serious than dangerous \noperation. The existence of countervailing considerations pointing in different  \ndirections with respect to the comparative seriousness of these offences forecloses the \nabsurdity argument being raised by the Crown. Parliament was entitled to modify the \nsentencing regime for driving offences; the exclusion of the criminal negligence \noffences from the ambit of s. 320.24(4) is only absurd if one applies old law to changed \nlaw and ignores what Parliament did by overhauling the penalty scheme in Bill C -46. \n2024 SCC 34 (CanLII)\n\n--- Page 60 ---\n \n [86] I conclude that the exclusion of the criminal negligence offences from the \nlist of en umerated offences that can attract a discretionary driving prohibition under \ns. 320.24(4) is not absurd or inconsistent with legislative purpose. There is therefore no \nneed to give the phrase “found guilty” in that provision the meaning argued by the \nCrown  in order to avoid such a result.  \n[87] Moreover, changing the event that triggers the operation of s. 320.24(4) \nfrom “convicted or discharged under section 730” language to “found guilty” in the \nEnglish version and from “ déclaré coupable ou absous sous le régim e de l’article 730 ” \nto “déclaré coupable ” in the French version makes sense in light of the legislative \nobjectives of simplicity, coherence, and efficiency. As I have explained, a finding of \nguilt on a particular charge can lead to several different outcom es, including a \nconviction, discharge, and stay of proceedings. However, s",
    "token_count": 1000,
    "start_token": 25200,
    "end_token": 26200,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 29,
    "source_file": "2024scc34.txt",
    "text": " in the \nEnglish version and from “ déclaré coupable ou absous sous le régim e de l’article 730 ” \nto “déclaré coupable ” in the French version makes sense in light of the legislative \nobjectives of simplicity, coherence, and efficiency. As I have explained, a finding of \nguilt on a particular charge can lead to several different outcom es, including a \nconviction, discharge, and stay of proceedings. However, s. 320.24(4) pertains to the \nsentencing context (given its reference to the “court that sentences the offender”). As \nthe Crown notes, “[o]nly two options are available at this point: a conviction and \nsentence, or a discharge” (R.F., at para. 49). Using the term “found guilty” promotes \nsimplicity and economy of language, as the term would capture both situations of \nconviction and discharge (see Boily , at para. 61). The change also sugge sts an attempt \nto harmonize the English and French versions of the provision, given that the French \nversions of both the former s. 259(2) and the new s. 320.24(4) have used “ déclaré \ncoupable ”. Such harmonization would be entirely consistent with the object ive of Bill \nC-46, as expressed by the Minister of Justice, to re -enact the driving offence scheme in \na manner that is “more clearly drafted and organized” ( Proceedings of the Standing \n2024 SCC 34 (CanLII)\n\n--- Page 61 ---\n \n Senate Committee on Legal and Constitutional Affairs , No. 34, 1st Sess.,  42nd Parl., \nJanuary 31, 2018, at p. 34:10 (Hon. J. Wilson -Raybould)).  \n(4) Conclusion on Interpretation of Section 320.24(4)  \n[88] A driving prohibition can be imposed under s. 320.24(4) when the offender \nhas been found guilty of an offence enumerated under that sub section. This requires an \nexpress judicial pronouncement on an offence stipulated in the charging document or \nincluded in one that is (where the charged offence is not proved). This interpretation is \nsupported by the plain and clear text of s. 320.24(4), t he surrounding statutory context \nand purpose, and criminal law principles — which Parliament should not be taken to \nhave departed from lightly.  \n[89] The Crown argues that where an offender is convicted of a criminal \nnegligence offence, they are necessarily “fo und guilty” within the meaning of the \nprovision of the included offence of dangerous operation. It acknowledges this would \nbe a “new approach for imposing driving prohibitions” (R.F., at para. 3). However, I \nagree with Fairburn A.C.J.O. in Boily that if “P arliament had intended to navigate such \na novel .  . . course in criminal law, one would think that clarity would have been the \norder of the day” (para. 59). That Parliament employed a new drafting technique, as the \nCrown argues, is anything but evident. Th e machinery of included offences, which \nprovides fair notice of an alternative path to a guilty verdict, does not provide \npersuasive support for the notion that a finding of guilt (that opens the door to \npunishment) can be implied. The Crown’s proposed int erpretation sits in tension with \n2024 SCC 34 (CanLII)\n\n--- Page 62 ---\n \n statutory provisions contained in the new Part VIII.1 of the Criminal Code as well as \nthe rule against multiple convictions.  \n[90] Finally, I am not persuaded that accepting the Crown’s proposed \ninterpretation of s. 320.24(4) is  necessary to avoid an absurdity or inconsistency with \nlegislative purpose. With Bill C -46, Parliament chose to group driving -specific \noffences together in a self -contained part of the Criminal Code , make them more \nversatile, increase their penalties, and provide for unique driving -specific sentencing \noptions. Parliament’s logic in excluding the general offences of criminal negligence \nand manslaughter — which are not specific to the driving context — from the ambit of \ns. 320.24(4) is apparent given the emph asis on promoting the utility of the driving -\nspecific Criminal Code provisions. The reforms are consistent with the purposes of Bill \nC-46 and the Minister of Justice’s stated goals of clarifying and simplifying the \ncriminal driving provisions.  \nVI. Conclusion  \n[91] The appellant was convicted of criminal negligence causing death and \ncriminal negligence causing bodily harm, which are not enumerated",
    "token_count": 1000,
    "start_token": 26100,
    "end_token": 27100,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 30,
    "source_file": "2024scc34.txt",
    "text": " the driving context — from the ambit of \ns. 320.24(4) is apparent given the emph asis on promoting the utility of the driving -\nspecific Criminal Code provisions. The reforms are consistent with the purposes of Bill \nC-46 and the Minister of Justice’s stated goals of clarifying and simplifying the \ncriminal driving provisions.  \nVI. Conclusion  \n[91] The appellant was convicted of criminal negligence causing death and \ncriminal negligence causing bodily harm, which are not enumerated offences under \ns. 320.24(4). He was not “found guilty” of an enumerated offence within the meaning \nof that provision. Acc ordingly, discretionary driving prohibitions were not available as \na sentencing option.  \n2024 SCC 34 (CanLII)\n\n--- Page 63 ---\n \n [92] I would therefore allow the appeal and set aside the order of driving \nprohibition imposed on Mr. Wolfe.  \n The reasons of Côté, Kasirer, Jamal and  Moreau JJ. were deliver ed by  \n MOREAU J. —  \n TABLE OF CONTENTS  \n \nParagraph  \nI. Overview  93 \nII. Background  100 \nIII. Issue  104 \nIV. Analysis  105 \nA. The Modern Approach to Statutory Interpretation  105 \nB. A Finding of Guilt for the Principal Offence Necessarily Entails a Finding of Guilt \nfor Lesser Included Offences  108 \n A Finding of Guilt Is Distinct From a Conviction or Discharge in Section \n320.24(4)  109 \n A Finding of Guilt for a Principal Offence Necessarily Entails Findings of \nGuilt for Lesser Included Offences in the Criminal Code118 \n A Finding of Guilt for Criminal Negligence Under Sections 220 or 221, Where \nIt Arises From the Operation of a Conveyance, Contains Findings of Guilt for \nthe Lesser Included Offence of Dangerous Operation Under Section 320.13121 \n The Availability of a Driving Prohibition Order as a Penalty for Criminal \nNegligence Is Consistent With Criminal Law Principles123 \nC. Consequences of Competing Interpretations of Section 320.24(4)  131 \n The Availability of a Driving Prohibition Order  as a Punishment for Criminal \nNegligence Is Consistent With the Stated Purposes of Section 320.24(4)  134 \n Criminal Negligence Is at Least as Serious an Offence as Dangerous \nOperation of a Conveyance140 \nD. Conclusion  143 \n2024 SCC 34 (CanLII)\n\n--- Page 64 ---\n \n V. Disposition  144 \n \nI. Overview  \n[93] The issue in this appeal is whether s. 320.24(4) of the Criminal Code , \nR.S.C. 1985, c. C -46, authorizes a court to impose a driving prohibition order following \nconvictions for criminal negligence causing death or criminal negligence causing \nbodily harm under ss. 220(b) and 221 of the Criminal Code , respectively. Section \n320.24(4) came into force on December 18, 2018,  through the adoption of  Bill C -46, \nAn Act to amend the Criminal Code (offences relating to conveyances) and to make \nconsequential amendments to other Acts , S.C. 2018, c. 21.  \n[94] Bill C -46 contained amendments relat ed to driving -related offences in the \nCriminal Code . Section 15 of Bill C -46 became Part VIII.1, “Offences Relating to \nConveyances”, in the Criminal Code , and replaced many of the former provisions of \nPart VIII that pertained to driving offences. The amend ments in Bill C -46 included the \nreplacement of s.  259(2) with s. 320.24(4). There are two noteworthy differences \nbetween s. 320.24(4) and the former s. 259(2). First, the former s. 259(2) authorized a \ndriving prohibition order where an offender was “convic ted or discharged” of a listed \noffence. That is, a driving prohibition order could only be imposed upon a conviction \nor a discharge under s. 730 of the Criminal Code for an offence listed in former \ns. 259(2). The current s.  320.24(4) applies where an offen der is “found guilty” of a \nlisted offence. Second, the former s. 259(2) expressly included the offences of criminal \n2024 SCC 34 (CanLII)\n\n--- Page 65 ---\n \n negligence causing death (s. 220) and bodily harm (s",
    "token_count": 1000,
    "start_token": 27000,
    "end_token": 28000,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 31,
    "source_file": "2024scc34.txt",
    "text": " discharge under s. 730 of the Criminal Code for an offence listed in former \ns. 259(2). The current s.  320.24(4) applies where an offen der is “found guilty” of a \nlisted offence. Second, the former s. 259(2) expressly included the offences of criminal \n2024 SCC 34 (CanLII)\n\n--- Page 65 ---\n \n negligence causing death (s. 220) and bodily harm (s. 221). Section 320.24(4), \nhowever, has omitted any mention of those sections and, among  the listed offences, \nonly includes specified driving offences, including dangerous operation causing death \nor bodily harm (s. 320.13).  \n[95] Section 320.24(4) states:  \n(4) If an offender is found guilty  of an offence under section 320.13, \nsubsection 320.14(2) or  (3), 320.15(2) or (3) or under any of sections \n320.16 to 320.18, the court that sentences the offender may, in addition to \nany other punishment that may be imposed for that offence, make an order \nprohibiting the offender from operating the type of conveya nce in question \nduring a period to be determined in accordance with subsection (5).  \n \n(4) Le tribunal qui inflige une peine au contrevenant déclaré coupable  \nd’une infraction prévue à l’article 320.13, aux paragraphes 320.14(2) ou \n(3) ou 320.15(2) ou (3), ou  à l’un des articles 320.16 à 320.18 peut rendre, \nen plus de toute autre peine applicable à cette infraction, une ordonnance \nlui interdisant de conduire le moyen de transport en cause durant la période \nétablie conformément au paragraphe (5).  \n[96] The introducti on of the term “found guilty” in the English version is a clear \nchange from the former s. 259(2), which previously stated:  \n(2) If an offender is convicted or discharged  under section 730 of an \noffence under section 220, 221, 236, 249, 249.1, 250, 251 or 252 or any of \nsubsections 255(2) to (3.2) committed by means of a motor vehicle, a \nvessel, an aircraft or railway equipment, the court that sentences the \noffender may, in  addition to any other punishment that may be imposed for \nthat offence, make an order prohibiting the offender from operating a motor \nvehicle on any street, road, highway or other public place, or from \noperating a vessel, an aircraft or railway equipment, as the case may \nbe . . . . \n \n2024 SCC 34 (CanLII)\n\n--- Page 66 ---\n \n (2) Lorsqu’un contrevenant est déclaré coupable ou absous  sous le régime \nde l’article 730 d’une infraction prévue aux articles 220, 221, 236, 249, \n249.1, 250, 251 ou 252 ou à l’un des paragraphes 255(2) à (3.2) commise \nau moyen d’un véhicule à moteur, d’un bateau, d’un aéronef ou de matériel \nferroviaire, le tribunal qui lui inflige une peine peut, en plus de toute autre \npeine applicable en l’espèce, rendre une ordonnance lui interdisant de \nconduire un véhicule à moteur dans une r ue, sur un chemin ou une grande \nroute ou dans tout autre lieu public, un bateau, un aéronef ou du matériel \nferroviaire  . . . . \n[97] I conclude that s. 320.24(4), properly interpreted, does authorize \nsentencing judges to impose a driving prohibition order where an offender is convicted \nof an offence under ss. 220 or 221 of the Criminal Code . I depart with the majority on \ntwo main points. First, a finding of guilt for a principal offence necessarily entails \nfindings of guilt for any lesser included offences. Under  s. 662(5) of the Criminal Code , \nwhere criminal negligence under ss. 220 and 221 arises through the operation of a \nconveyance, dangerous operation of a conveyance contrary to s. 320.13 is a lesser \nincluded offence of criminal negligence. Therefore, where c riminal negligence arises",
    "token_count": 1000,
    "start_token": 27900,
    "end_token": 28900,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 32,
    "source_file": "2024scc34.txt",
    "text": " the majority on \ntwo main points. First, a finding of guilt for a principal offence necessarily entails \nfindings of guilt for any lesser included offences. Under  s. 662(5) of the Criminal Code , \nwhere criminal negligence under ss. 220 and 221 arises through the operation of a \nconveyance, dangerous operation of a conveyance contrary to s. 320.13 is a lesser \nincluded offence of criminal negligence. Therefore, where c riminal negligence arises \nthrough the operation of a conveyance, a finding of guilt in respect of criminal \nnegligence necessarily entails a finding of guilt in respect of dangerous operation of a \nconveyance.  \n[98] Second, the majority’s interpretation of s. 320. 24(4) produces the absurd \nconsequence that a driving prohibition order can be imposed for a lesser included \noffence, but not the principal offence, which has a higher mens rea  requirement. It is \ninconsistent with the purposes of Part VIII.1 of the Criminal  Code  (“Offences Relating \nto Conveyances”), including coherence, public safety, and deterrence of driving -related \n2024 SCC 34 (CanLII)\n\n--- Page 67 ---\n \n offence. Given the seriousness of criminal negligence and Parliament’s policy concerns \nwith respect to public safety, it would be absurd to su ggest that Parliament intended for \ndriving prohibition orders to be unavailable following a conviction for criminal \nnegligence.  \n[99] For the reasons that follow, I would dismiss the appeal.  \nII. Background  \n[100]  The appellant, Braydon Wolfe, drove his vehicle into oncom ing traffic and \ncrashed head -on into a family vehicle. The collision seriously injured a woman and \nkilled her husband and child. Following trial, the appellant was convicted on December \n8, 2020, of two counts of criminal negligence causing death and one co unt of criminal \nnegligence causing bodily harm contrary to ss. 220(b) and 221 of the Criminal Code , \nrespectively. In his reasons, the trial judge indicated that if he was mistaken on the \nelements of the offence of criminal negligence, the Crown had proven all the elements \nof the offences of dangerous operation of a conveyance causing death and dangerous \noperation of a conveyance causing bodily harm contrary to s. 320.13 of the Criminal \nCode  (2020 SKQB 324, 73 M.V.R. (7th) 242).  \n[101]  The trial judge sentenced th e appellant to a global period of imprisonment \nof 6 years and imposed driving prohibition orders of 10 years on each count of criminal \nnegligence causing death and 7 years on the count of criminal negligence causing \nbodily harm, along with a DNA order (202 1 SKQB 141, 84 M.V.R. (7th) 257).   \n2024 SCC 34 (CanLII)\n\n--- Page 68 ---\n \n [102]  The appellant appealed the length of his term of incarceration to the \nSaskatchewan Court of Appeal. The Court of Appeal raised the issue of whether the \ndriving prohibition orders were authorized by law and invited furthe r submissions from \nthe parties. The Court of Appeal ultimately dismissed the appeal and maintained the \ndriving prohibition orders (2022 SKCA 132, [2023] 3 W.W.R. 574).  \n[103]  The appellant now appeals the driving prohibition orders to this Court. He \nargues that the sentencing judge had no authority to make the driving prohibition orders \npursuant to s. 320.24(4) of the Criminal Code  because s. 320.24(4) does not include \nss. 220 and 221 of the Criminal Code among the listed offences for which a driving \nprohibition order may be imposed.  \nIII. Issue  \n[104]  The issue in this appeal is whether s. 320.24(4) of the Criminal Code  \npermits sentencing judges to impose driving prohibition orders following convictions \nfor criminal negligence causing death and criminal negligence causing bod ily harm \nunder ss. 220(b) and 221 of the Criminal Code , respectively, when those offences arise \nout of the operation of a conveyance.  \nIV. Analysis  \nA. The Modern Approach to Statutory Interpretation  \n2024 SCC 34 (CanLII)\n\n--- Page 69 ---\n \n [105]  Section 320.24(4) must be interpreted according to the modern approach \nto statutory interpretation. The modern approach requires that the words of a statutory \nprovision are read “in their entire context and in their grammatical and ordinary sense \nharmoniously with the scheme of the Act, the object of the Act,",
    "token_count": 1000,
    "start_token": 28800,
    "end_token": 29800,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 33,
    "source_file": "2024scc34.txt",
    "text": ". Analysis  \nA. The Modern Approach to Statutory Interpretation  \n2024 SCC 34 (CanLII)\n\n--- Page 69 ---\n \n [105]  Section 320.24(4) must be interpreted according to the modern approach \nto statutory interpretation. The modern approach requires that the words of a statutory \nprovision are read “in their entire context and in their grammatical and ordinary sense \nharmoniously with the scheme of the Act, the object of the Act, and the  intention of \nParliament” ( R. v. Alex , 2017 SCC 37, [2017] 1 S.C.R. 967, at para. 24, citing Bell \nExpressVu Limited Partnership v. Rex , 2002 SCC 42, [2002] 2 S.C.R. 559, at para. 26, \nquoting E. A. Driedger, Construction of Statutes  (2nd ed. 1983), at p. 87 ). Statutory \ninterpretation entails “discerning legislative intent by examining statutory text in its \nentire context and in its grammatical and ordinary sense, in harmony with the statute’s \nscheme and objects” ( Michel v. Graydon , 2020 SCC 24, [2020] 2 S.C. R. 763, at para. \n21; see also La Presse inc. v. Quebec , 2023 SCC 22, at para. 22; Rizzo & Rizzo Shoes \nLtd. (Re) , [1998] 1 S.C.R. 27, at paras. 21 and 27). The plain meaning of the text is not \nin itself determinative. To ascertain legislative intent, the te xt of a provision must be \nplaced in context and tested against other indicators of legislative meaning, including \nlegislative objectives ( La Presse , at para.  23; Alex, at para. 31).  \n[106]  The consequences of adopting a particular interpretation serve as an \nimpo rtant interpretive aid within the modern approach to statutory interpretation. \nConsequences that are consistent with the purpose and scheme of the legislation are \npresumed to have been intended. Conversely, consequences that are absurd or \notherwise unaccep table are presumed not to have been intended ( Rizzo , at para. 27; \nWang v. British Columbia (Securities Commission) , 2023 BCCA 101, 480 D.L.R. (4th) \n1, at paras. 42 -43, cited in R. v. Francisco , 2023 BCCA 450, 433 C.C.C. (3d) 1, at para. \n2024 SCC 34 (CanLII)\n\n--- Page 70 ---\n \n 34; R. Sullivan, “Statutory Interpretation in a New Nutshell” (2003), 82 Can. Bar Rev.  \n51, at p. 63). The greater the absurdity that flows from a particular interpretation, the \nmore justified an interpreter is in rejecting it, provided that the words of th e provision \ncan reasonably bear the interpretation ultimately adopted ( Wang , at paras. 42 -43; \nSullivan, at p. 64).  \n[107]  This case largely turns on the interpretation of the words “found guilty” in \ns. 320.24(4). In interpreting s. 320.24(4), I first consider the  operation of findings of \nguilt for lesser included offences and then the consequences of the available competing \ninterpretations of s. 320.24(4).  \nB. A Finding of Guilt for the Principal Offence Necessarily Entails a Finding of \nGuilt for Lesser Included Offe nces \n[108]  There is agreement with the majority that there is a meaningful distinction \nbetween a finding of guilt and a conviction or discharge for the purpose of s. 320.24(4). \nHowever, as I am of the view that a finding of guilt necessarily entails findings of guilt \nfor lesser included offences, a finding of guilt for criminal negligence, where it arises \nthrough the operation of a conveyance, is also a finding of guilt for dangerous \noperation.  \n(1) A Finding of Guilt Is Distinct From a Conviction or Discharge in Sec tion \n320.24(4)  \n2024 SCC 34 (CanLII)\n\n--- Page 71 ---\n \n [109]  A finding of guilt and a conviction or discharge are distinct concepts and \nare not interchangeable. The change from “convicted or discharged” to “found guilty” \nindicates that a conviction or discharge for one of the listed offences in s.  320.24(4) is \nnot essential",
    "token_count": 1000,
    "start_token": 29700,
    "end_token": 30700,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 34,
    "source_file": "2024scc34.txt",
    "text": "inct From a Conviction or Discharge in Sec tion \n320.24(4)  \n2024 SCC 34 (CanLII)\n\n--- Page 71 ---\n \n [109]  A finding of guilt and a conviction or discharge are distinct concepts and \nare not interchangeable. The change from “convicted or discharged” to “found guilty” \nindicates that a conviction or discharge for one of the listed offences in s.  320.24(4) is \nnot essential for a valid driving prohibition order to be imposed. Rather, only a finding \nof guilt for one of the listed offences is required. The language of “found guilty” instead \nof “convicted or discharged” permits a driving prohibition orde r to be imposed prior to \nthe entry of a conviction ( R. v. Boily , 2022 ONCA 611, 163 O.R. (3d) 161, at para. 62).  \n[110]  The Saskatchewan Court of Appeal referred to several examples in the \nCriminal Code  and the Youth Criminal Justice Act , S.C. 2002, c. 1 (“ YCJA ”), that \ndemonstrate the distinction between a finding of guilt and a conviction. For example, \nthe provisions relating to the granting of a discharge pursuant to ss. 730(1) and 667(1) \nof the Criminal Code  clearly demonstrate that there are alternatives to c onviction \nfollowing a finding of guilt. Similarly, ss. 42 and 82 of the YCJA  make it clear that \nyoung offenders are found guilty but not convicted.   \n[111]  Another example is the defence of entrapment, which can only be \nconsidered after a finding of guilt but be fore the entry of a conviction ( R. v. Pearson , \n[1998] 3 S.C.R. 620, at para. 5; R. v. Ahmad , 2020 SCC 11, [2020] 1 S.C.R. 577). While \nentrapment offers a defence for those who have been found guilty of a particular \noffence, it operates differently than oth er defences in the Criminal Code  in three \nrespects. First, a finding of entrapment does not negate the elements of the offence. In \nother words, where a court determines that the police entrapped an individual into \n2024 SCC 34 (CanLII)\n\n--- Page 72 ---\n \n committing an offence, the court recognize s that each of the essential elements of the \noffence has been proven (see R. v. Mack , [1988] 2 S.C.R. 903, at p. 972; Ahmad , at \npara. 17). Second, when entrapment is established on a balance of probabilities, a stay \nof proceedings is entered, and unlike ot her defences, the accused is not acquitted of the \nassociated charge or charges. Third, the defence of entrapment, unlike most other \ndefences, must be considered after a finding of guilt but before the entry of a formal \nconviction in order to retain the ava ilability of a stay of proceedings (see Pearson , at \npara. 5).   \n[112]  The difference in the wording of ss. 259(2) and 320.24(4), considered \nalong with examples of provisions in the Criminal Code  and YCJA  described above, \nsupport the conclusion that a conviction and a finding of guilt are not interchangeable. \nAs these examples illustrate, it is not the case that a conviction necessarily flows from \na finding of guilt. However, when a conviction for an offence is recorded, it will always \nmean that the offender has b een found guilty of that offence.  \n[113]  A conviction or discharge is not always necessary for a penalty to be \nimposed. Section 320.23, which was also an amendment introduced by Bill C -46, \npermits a court to delay sentencing of someone found guilty of an offence  in the \noperation of a conveyance to allow them the opportunity to attend a treatment program \nand apply for a medical discharge. In those circumstances, the offender having been \n“found guilty”, a driving prohibition order may be imposed under s. 320.24(4),  thereby \ncurtailing the offender’s driving privileges prior to a conviction being entered.  \n2024 SCC 34 (CanLII)\n\n--- Page 73 ---\n \n [114]  My colleague rightly notes that there was no change to the wording of the \nFrench version of former s. 259(2) — “déclaré coupable ” — while the English version \nof s. 320.24(4) was changed from “convicted” to “",
    "token_count": 1000,
    "start_token": 30600,
    "end_token": 31600,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 35,
    "source_file": "2024scc34.txt",
    "text": "),  thereby \ncurtailing the offender’s driving privileges prior to a conviction being entered.  \n2024 SCC 34 (CanLII)\n\n--- Page 73 ---\n \n [114]  My colleague rightly notes that there was no change to the wording of the \nFrench version of former s. 259(2) — “déclaré coupable ” — while the English version \nof s. 320.24(4) was changed from “convicted” to “found guilty”, and that the French \nand English versions of the Criminal Code  are equally authoritative. However, a \n“déclaration de culpabilité ” can refer either to a finding of guilt or a conviction, though \nthere remains an important distinction between them (see, e.g., R. v. Basque , 2023 SCC \n18, at paras. 57 -58). “ Déclaré coupable ” is used elsewhere in the Criminal Code , \nregardless of whether the English version uses “convicted” or “found guilty” (see, e.g., \nss. 2.2(2), 9, 15 and 284). Therefore, in this case, the use of “ déclaré coupable ” in the \nFrench versions of both ss. 259(2) and 320.24(4) does not assist in determining whether \nParliament intended to create a new approach to imposing driving prohibition orders  \nby distinguishing between a finding of guilt and a conviction or discharge.  \n[115]  The legislative evolution of a provision is relevant to determining its \nintended meaning ( R. v. Ulybel Enterprises Ltd. , 2001 SCC 56, [2001] 2 S.C.R. 867, at \npara. 33; Canada (Ca nadian Human Rights Commission) v. Canada (Attorney \nGeneral) , 2011 SCC 53, [2011] 3 S.C.R. 471, at paras. 43 -44; R. Sullivan, The \nConstruction of Statutes  (7th ed. 2022), at § 23.02[2]). If the concepts of a finding of \nguilt and a conviction or discharge w ere intended to be interchangeable, there would \nhave been no reason for the change in the English version of s. 320.24(4). The French \nand English versions of s. 320.24(4) must be read together. The change in the English \nwording from “convicted or discharge d” in s. 259(2) to “found guilty” in s. 320.24(4) \n2024 SCC 34 (CanLII)\n\n--- Page 74 ---\n \n informs the interpretation of “ déclaré coupable ” in the French version and suggests \nthat it now refers to a finding of guilt in the context of s. 320.24(4).   \n[116]  As noted in the Court of Appeal decision, at pa ra. 74:  \n. . . just as Parliament must be taken to have acted intentionally  when it \nremoved the explicit reference to ss. 220 and 221 in s. 320.24(4), it must \nalso be taken to have acted intentionally  when it changed the description \nof the event that triggers the operation of the section from being “convicted \nor discharged under section 730” of an enumerated offence to being “found \nguilty” of an enumerated offence, and to have done so with the differen ce \nbetween those concepts in mind. [Emphasis in original.]  \n[117]  In order to resolve this appeal, however, we must determine the further \nissue of whether a finding of guilt for a principal offence is also a finding of guilt for \neach lesser included offence.  \n(2) A Finding of Guilt for a Principal Offence Necessarily Entails Findings of \nGuilt for Lesser Included Offences in the Criminal Code  \n[118]  A finding of guilt for a principal offence necessitates, by operation of law, \nfindings of guilt for all lesser included offences.   \n[119]  I respectfully disagree with my colleague that the use of the wording \n“found guilty” in s. 320.24(4) is suggestive of an express judicial determination, \nwhether by a jury in announcing its verdict or a judge (majority reasons, at para. 56). \nAn express ru ling or verdict of guilt is unnecessary, as a finding of guilt is constituted \nby each of the elements of the offence being proven beyond a reasonable doubt and the \n2024 SCC 34 (CanLII)\n\n--- Page 75 ---\n \n negation of any applicable defences ( Quigley’s Criminal Procedure in Canada  (loose -\nleaf), by ",
    "token_count": 1000,
    "start_token": 31500,
    "end_token": 32500,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 36,
    "source_file": "2024scc34.txt",
    "text": "whether by a jury in announcing its verdict or a judge (majority reasons, at para. 56). \nAn express ru ling or verdict of guilt is unnecessary, as a finding of guilt is constituted \nby each of the elements of the offence being proven beyond a reasonable doubt and the \n2024 SCC 34 (CanLII)\n\n--- Page 75 ---\n \n negation of any applicable defences ( Quigley’s Criminal Procedure in Canada  (loose -\nleaf), by  D. Rose, ed., at §  22:7). This can be expressed either by a single finding of \nguilt of the offence, or individual findings that each of the elements have been proven.  \n[120]  A finding of guilt for a lesser included offence is established by a finding \nof guilt f or the principal offence because, by definition, all elements of the lesser \nincluded offence are contained in the elements of the principal offence (R.  E. Salhany, \nCanadian Criminal Procedure  (6th ed. (loose -leaf)), at § 6:89). A finding of guilt \nsignifies  that the Crown has proved its case beyond a reasonable doubt. Further, as \npreviously held by this Court, “an indictment charging an offence also charges all \noffences which as a matter of law are necessarily committed  in the commission of the \nprincipal off ence” ( R. v. G.R. , 2005 SCC 45, [2005] 2 S.C.R. 371, at para. 30 (emphasis \nin original), quoting R. v. Harmer and Miller  (1976), 33 C.C.C. (2d) 17 (Ont. C.A.), at \np. 19). Because an indictment charging a principal offence entails all lesser included \noffenc es, it is appropriate for a penalty for a lesser included offence to formally attach \nto the principal offence.  \n(3) A Finding of Guilt for Criminal Negligence Under Sections 220 or 221, \nWhere It Arises From the Operation of a Conveyance, Contains Findings \nof G uilt for the Lesser Included Offence of Dangerous Operation Under \nSection 320.13  \n[121]  The text of s. 662(5), read in combination with s. 320.24(4), is sufficient \nfor a conviction for criminal negligence arising out of the operation of a conveyance to \nauthorize a driving prohibition order. Section 662(5) explicitly makes dangerous \n2024 SCC 34 (CanLII)\n\n--- Page 76 ---\n \n operation of a conveyance under s. 320.13 a lesser included offence to criminal \nnegligence where the offence involves the operation of a conveyance:  \n(5) For greater certainty, when a count charges an offence under section \n220, 221 or 236 arising out of the operation of a conveyance, and the \nevidence does not prove that offence but proves an offence under section \n320.13, the accused may be convicted of an offence under that section.  \n \n(5) Il est entendu que lorsqu’un chef d’accusation vise une infraction \nprévue aux articles 220, 221 ou 236 et découle de la conduite d’un moyen \nde transport, et que la preuve n’établit pas la commission de cette \ninfraction, mai s plutôt celle d’une infraction prévue à l’article 320.13, \nl’accusé peut être déclaré coupable de cette dernière.  \n[122]  The operation of s. 662(5) necessitates that if an individual is convicted \nunder ss. 220 or 221 for criminal negligence arising out of the ope ration of a \nconveyance, they are, by operation of law, found guilty of the offence under s. 320.13. \nThe elements of dangerous operation of a conveyance under s. 320.13 are imbedded \nwithin the elements of criminal negligence under ss. 220, 221 or 236, where  it arises \nthrough the operation of a conveyance (see R. v. Al -Kassem , 2015 ONCA 320, 78 \nM.V.R. (6th) 183, at para.  8 (judgment rendered prior to Bill C -46 coming into force); \nR. v. Abau -Jabeen , 2019 ONSC 5399, 58 M.V.R. (7th) 304, at paras. 60 -61; R. v. \nGardner and Fraser , 2021 NSCA 52, 406 C.C.C. (3d) 156, at",
    "token_count": 1000,
    "start_token": 32400,
    "end_token": 33400,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 37,
    "source_file": "2024scc34.txt",
    "text": ") 183, at para.  8 (judgment rendered prior to Bill C -46 coming into force); \nR. v. Abau -Jabeen , 2019 ONSC 5399, 58 M.V.R. (7th) 304, at paras. 60 -61; R. v. \nGardner and Fraser , 2021 NSCA 52, 406 C.C.C. (3d) 156, at para.  20). Therefore, it \nis impossible to act in a criminally negligent manner through the operation of a \nconveyance contrary to ss. 220 or 221 without dangerously operating a conveyance \ncontrary to s. 320.13.  \n(4) The Availability of a Driving Prohibition Order as a Penalty for Criminal \nNegligence Is Consistent With Criminal Law Principles  \n2024 SCC 34 (CanLII)\n\n--- Page 77 ---\n \n [123]  Parliament’s choice not to expressly list ss. 220 and 221 in s. 320.24(4), in \nlight of the relationship between princ ipal and lesser included offences and the \npurposes of the scheme for driving -related offences, signals an intention to include \ncriminal negligence through the inclusion of dangerous operation under s. 320.13 in \nthe listed offences in s. 320.24(4).  \n[124]  It is a matter for Parliament to determine what is procedurally required for \na punishment to be imposed, provided it is constitutionally permissible. With respect \nto s. 320.24(4), Parliament has determined that only a finding of guilt for one of the \nlisted offence s in s. 320.24(4) is required for a driving prohibition order to be imposed, \nrather than any additional procedural steps that typically follow a finding of guilt \n(Salhany, at § 6:88). This approach to the imposition of driving prohibition orders is \nconsist ent with existing criminal law principles, including the requirement of fair notice \nto accused and the public, the recognition of lesser included offences, and the rule \nagainst multiple convictions.  \n[125]  The text of s. 662(5) serves to provide adequate notice t o an accused and \nthe public that a court may impose a driving prohibition order following a conviction \nfor criminal negligence causing death or bodily harm where it arises out of the \noperation of a conveyance. Both accused and the public as a whole have ad equate \nnotice that lesser included offences are included within principal offences. Moreover, \nan indictment charging an accused with one offence gives fair notice to the accused \n2024 SCC 34 (CanLII)\n\n--- Page 78 ---\n \n regarding their legal jeopardy in relation to offences that are included withi n the \ncharged offence ( G.R., at para. 30).  \n[126]  Having been found guilty of at least one of the s. 220 or s. 221 offences, \nan offender is also “found guilty” through the operation of s. 662(5) of the lesser \nincluded offence under s. 320.13. Therefore, a drivin g prohibition order is, as required \nby the text of s. 320.24(4), a punishment for “that offence” — “that offence” being one \nof the listed offences in s. 320.24(4). The driving prohibition order attaches to the \nconviction for criminal negligence. However, f or the driving prohibition order to be \nimposed, it is only necessary that an accused is “found guilty” of “that offence”, which \noccurs when an accused is necessarily found guilty of the lesser included offence of \ndangerous operation upon being found guilty  of criminal negligence.  \n[127]  This interpretation of s. 320.24(4) — which authorizes judges to impose \ndriving prohibition orders provided one of the listed offences is a lesser included \noffence of one for which the offender was convicted — is also consistent w ith this \nCourt’s decision in Kienapple v. The Queen , [1975] 1 S.C.R. 729. The “ Kienapple  \nprinciple” applies to avoid multiple convictions for offences where the offences “do \nnot describe different criminal wrongs, but instead describe different ways of \ncommitting the same criminal wrong” (see R. v. Heaney , 2013 BCCA 177, 337 \nB.C.A.C. 43, at para.  25, per Bennett J.A.; see also Sarazin v. R. , 2018 QCCA 1065, at \npara. 28 (CanLII), per Healy J.A.).  \n2024 SCC 34 (CanL",
    "token_count": 1000,
    "start_token": 33300,
    "end_token": 34300,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 38,
    "source_file": "2024scc34.txt",
    "text": ", but instead describe different ways of \ncommitting the same criminal wrong” (see R. v. Heaney , 2013 BCCA 177, 337 \nB.C.A.C. 43, at para.  25, per Bennett J.A.; see also Sarazin v. R. , 2018 QCCA 1065, at \npara. 28 (CanLII), per Healy J.A.).  \n2024 SCC 34 (CanLII)\n\n--- Page 79 ---\n \n [128]  In Kienapple , this Court held that a stay of proceedings must  be entered to \navoid multiple convictions  for the same underlying criminal conduct. However, the rule \nagainst multiple convictions is not violated by s. 320.24(4), as no conviction is \nnecessary for a driving prohibition order to be imposed. As noted in R. v. J.F. , 2008 \nSCC 60, [2008] 3 S.C.R. 215, at para. 14: “The rule against multiple convictions \napplies, of course, only to multiple convictions  — which is not our case” (emphasis in \noriginal). Accordingly, duplicate punishments do not result from our concl usion that a \ndriving prohibition order can be granted where there is a conviction under ss. 220 and \n221.  \n[129]  My colleague questions whether an offender could be subject to both a \ndiscretionary driving prohibition order plus the entire prison term for one offe nce as \nwell as a mandatory driving prohibition order plus the entire prison term for another \noffence (majority reasons, at para. 65). However, the Kienapple  principle ensures that \nthe offender is not punished twice for essentially the same criminal conduct .  \n[130]  In summary, a finding of guilt for a lesser included offence is necessitated \nby a finding of guilt for its principal offence. Given that s. 662(5) makes dangerous \noperation under s. 320.13 a lesser included offence of criminal negligence under ss.  220 \nand 221, s. 320.24(4) is sufficient for a conviction for criminal negligence arising out \nof the operation of a conveyance to authorize an order under s. 320.24(4). Parliament’s \napproach of indirectly incorporating principal offences of criminal negligence b y \nreference to the lesser offence of dangerous operation under s. 320.13 is both consistent \n2024 SCC 34 (CanLII)\n\n--- Page 80 ---\n \n with how lesser included offences operate in our legal system and Parliament’s \nobjective of achieving simplicity in its approach to driving -related offences.  \nC. Conse quences of Competing Interpretations of Section 320.24(4)  \n[131]  An interpretation of s. 320.24(4) that does not authorize driving prohibition \norders as a penalty for criminal negligence under ss. 220 and 221 where the negligence \narose through the operation of a  conveyance produces an absurd consequence. An \ninterpretation may be considered absurd if it, for example, creates irrational \ndistinctions, defeats the purpose of the legislation, leads to incoherence, undermines \nthe efficient administration of justice, or  violates important norms of justice or fairness \n(Sullivan (2003), at p. 64; La Presse , at para. 54).  \n[132]  The appellant’s interpretation creates an irrational distinction by making a \nsanction for a lesser included offence, but not the more serious principal o ffence, and \nis inconsistent with Parliament’s stated purposes for enacting Part VIII.1 of the \nCriminal Code . The appellant’s interpretation produces an absurd consequence because \nit authorizes the imposition of driving prohibition orders for the lesser inc luded offence \nof dangerous operation, but not for the more serious principal offence of criminal \nnegligence, and subverts Parliament’s policy aim to reduce the significant number of \ndeaths and injuries caused by impaired driving.  \n[133]  The interpretation that pe rmits driving prohibition orders to be imposed in \nsuch circumstances should be preferred because it avoids the absurdity raised by the \n2024 SCC 34 (CanLII)\n\n--- Page 81 ---\n \n majority’s interpretation (see Sullivan (2022), at §  10.01). The interpretation that \npermits driving prohibition orders w here an offender has been convicted under ss. 220 \nor 221 for an offence arising from the operation of a conveyance should be preferred \nin part because it is consistent with the purpose of s.  320.24(4) and the scheme in which \nit operates. I reiterate that t his interpretation is supported by the text of s. 320.24(4), in \n",
    "token_count": 1000,
    "start_token": 34200,
    "end_token": 35200,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 39,
    "source_file": "2024scc34.txt",
    "text": " §  10.01). The interpretation that \npermits driving prohibition orders w here an offender has been convicted under ss. 220 \nor 221 for an offence arising from the operation of a conveyance should be preferred \nin part because it is consistent with the purpose of s.  320.24(4) and the scheme in which \nit operates. I reiterate that t his interpretation is supported by the text of s. 320.24(4), in \nlight of the text of s. 662(5) and the distinction between a finding of guilt and a \nconviction or discharge.  \n(1) The Availability of a Driving Prohibition Order as a Punishment for \nCriminal Negli gence Is Consistent With the Stated Purposes of Section \n320.24(4)  \n[134]  The availability of driving prohibition orders for criminal negligence where \nit arose through the operation of a conveyance is consistent with the purposes of Bill \nC-46. The purpose and obje ct of the 2018 amendments, as described by the Honourable \nJody Wilson -Raybould, then Minister of Justice, as she introduced Bill C -46 in \nParliament, was to “reduc[e] the significant number of deaths and injuries caused by \nimpaired driving” ( House of Common s Debates , vol. 148, No. 181, 1st Sess., 42nd \nParl., May 19, 2017, at p. 11459). She further stated that the “proposed legislation was \ndrafted with all victims of impaired driving in mind” and that the “hope and expectation \n[of the amendments was] that the  combined effects of the many reforms proposed in \nBill C-46 [would] be enormously effective in deterring drug and alcohol impaired \ndriving” (pp. 11459 and 11461).  \n2024 SCC 34 (CanLII)\n\n--- Page 82 ---\n \n [135]  The preamble to Bill C -46 sets out nine considerations and objectives \nunderlying the amendmen ts, including: “dangerous driving and impaired driving injure \nor kill thousands of people in Canada every year”; “dangerous driving and impaired \ndriving are unacceptable at all times and in all circumstances”; and “the Parliament of \nCanada is committed to . . . deterring the commission of offences relating to the \noperation of conveyances, particularly dangerous driving and impaired driving”.  \n[136]  The Court of Appeal noted that the legislative intent behind Bill C -46 \nreflected two key themes: “.  . . (i) coherenc e, efficiency, simplification, and \nmodernization of the Criminal Code  provisions relating to driving offences; and (ii) \nincreased punishments, with a focus on deterring people from dangerous and impaired \ndriving” (para. 57). The preamble of Bill C -46 is consistent with s.  320.12 of the \nCriminal Code , which states:  \n320.12  It is recognized and declared that  \n \n(a) operating a conveyance is a privilege that is subject to certain limits \nin the interests of public safety that include licensing, the observance of \nrules and sobriety;  \n \n(b) the protection of society is well served by deterring persons from \noperating conveyances dangerously or while their ability to operate \nthem is impaired by alcohol or a drug, because that conduct poses a \nthreat to the life, health and safety of Canadians;  \n \n(c) the analysis of a sample of a person’s breath by means of an \napproved instrument produces reliable and accurate readings of blood \nalcohol concentration; and  \n \n(d) an evaluation conducted by an evaluating officer is a reliable method \nof determining wh ether a person’s ability to operate a conveyance is \nimpaired by a drug or by a combination of alcohol and a drug.  \n2024 SCC 34 (CanLII)\n\n--- Page 83 ---\n \n [137]  Preserving the authority of sentencing judges to impose a driving \nprohibition order where an offender has been convicted, and therefore found guilty, of \ncriminal negligence arising out of the operation of a conveyance is consistent with these \nobjectives of protecting society and achieving coherence of Criminal Code  provisions \nrelating to driving -related offences. This includes the recognition in  s. 320.12(b) that \n“the protection of society is well served by deterring persons from operating \nconveyances dangerously”.  \n[138]  I cannot accept that Parliament intended to exclude criminal negligence \nfrom the scheme for driving -related offences. My colleague no tes that Parliament “has \nbroadly signalled through Bill C -46 that resorting to specific driving -related offences \nis preferable to general criminal",
    "token_count": 1000,
    "start_token": 35100,
    "end_token": 36100,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 40,
    "source_file": "2024scc34.txt",
    "text": " driving -related offences. This includes the recognition in  s. 320.12(b) that \n“the protection of society is well served by deterring persons from operating \nconveyances dangerously”.  \n[138]  I cannot accept that Parliament intended to exclude criminal negligence \nfrom the scheme for driving -related offences. My colleague no tes that Parliament “has \nbroadly signalled through Bill C -46 that resorting to specific driving -related offences \nis preferable to general criminal negligence offences in driving cases” (majority \nreasons, at para. 6). However, Parliament clearly intended to  include criminal \nnegligence within the scope of driving -related offences, having expressly contemplated \ncriminal negligence arising from the operation of a conveyance in s.  662(5). \nParliament, in making sweeping amendments to the scheme for driving -relate d \noffences in the Criminal Code , kept s. 662(5) intact, rather than repealing or qualifying \nthis provision.  \n[139]  With respect, it does not appear sufficiently clear to me that Parliament \nintended to signal through Bill C -46 that the Crown should resort to char ging dangerous \noperation in preference to criminal negligence. One would have expected that if the \nintent of Parliament was to alter the statutory scheme in this way, it would have done \n2024 SCC 34 (CanLII)\n\n--- Page 84 ---\n \n so explicitly and would not have made s. 320.13 a lesser included offe nce of ss. 220 \nand 221.  \n(2) Criminal Negligence Is at Least as Serious an Offence as Dangerous \nOperation of a Conveyance  \n[140]  The availability of a driving prohibition order for the lesser included \noffence of dangerous operation, but not for the principal offence of criminal negligence, \ncreates an irrational situation. While lengthier penalties are available for the offence of \ndangerous operation of a conveyance, the offence of criminal negligence is at least as \nserious as dangerous conveyance. This is for two reas ons. First, s. 662(5) expressly \nmakes dangerous operation a lesser included offence of criminal negligence. Second, \nas the Crown argued during the hearing, the higher mens rea  requirement for criminal \nnegligence makes it a normatively more serious offence.  Sections 220 and 221 have a \nheightened mens rea  element in the form of a “ marked and substantial  departure” from \nthe standard of care of the reasonable person ( R. v. Javanmardi , 2019 SCC 54, [2019] \n4 S.C.R. 3, at para.  23 (emphasis added)). This is in con trast to the mens rea  for \ndangerous operation, which is met through only a marked  departure in the standard of \ncare that a reasonable person would observe ( R. v. Beatty , 2008 SCC 5, [2008] 1 S.C.R. \n49 (applying the former s. 249(4) of the Criminal Code ); see also R. v. Roy , 2012 SCC \n26, [2012] 2 S.C.R. 60, at paras. 33 -36).  \n[141]  In summary, an interpretation of s. 320.24(4) that does not authorize \nsentencing judges to impose driving prohibition orders where an offender is convicted \n2024 SCC 34 (CanLII)\n\n--- Page 85 ---\n \n of criminal negligence under ss. 220 or 221 is absurd because it irrationally bars a \npunishment for the offence with the heightened mens rea  requirement when that \npunishment is clearly available for the offence with a less onerous mens rea element. \nAs noted by Kalmakoff J.A., being co nvicted of criminal negligence “would leave the \noffender subject to less serious consequences than being convicted of a lesser included \noffence. That cannot be what Parliament intended” (C.A. decision, at para.  79). \nFurthermore, it stands in opposition to the purposes of the scheme, including \n“coherence” and “increased punishments”.  \n[142]  Finally, I am not persuaded that the absence of the ss. 220 and 221 offences \namong the listed offences results from a drafting error that creates a legislative gap as \nfound by t he Ontario Court of Appeal in Boily , as this conclusion fails to account for \nthe operation of s. 662(5). I agree with Kalmakoff J.A. that when s. 320.24(4) is \nproperly interpreted, no such gap exists (C.A. decision, at para. 58). Read with",
    "token_count": 1000,
    "start_token": 36000,
    "end_token": 37000,
    "total_tokens_in_source": 37412
  },
  {
    "chunk_id": 41,
    "source_file": "2024scc34.txt",
    "text": " ss. 220 and 221 offences \namong the listed offences results from a drafting error that creates a legislative gap as \nfound by t he Ontario Court of Appeal in Boily , as this conclusion fails to account for \nthe operation of s. 662(5). I agree with Kalmakoff J.A. that when s. 320.24(4) is \nproperly interpreted, no such gap exists (C.A. decision, at para. 58). Read with s. \n662(5), s. 32 0.24(4) vests sentencing judges with the authority to impose driving \nprohibition orders upon those found guilty of criminal negligence causing death or \nbodily harm in the operation of a conveyance.  \nD. Conclusion  \n[143]  The omission of criminal negligence from s. 32 0.24(4) was coupled with \nthe amendment of “convicted or discharged” to “found guilty”, dispensing with a \nrequirement for a conviction or discharge for the imposition of a driving prohibition. \nSection 662(5) makes the offence under s. 320.13 a lesser includ ed offence of criminal \n2024 SCC 34 (CanLII)\n\n--- Page 86 ---\n \n negligence causing death or bodily harm under ss. 220 or 221. A conviction under \nss. 220 or 221 (where that conviction arises from criminal conduct involving the \noperation of a conveyance) necessarily entails a finding of guilt for d angerous operation \ncausing death or bodily harm by operation of s. 662(5), which provides the basis for \nthe imposition of a driving prohibition order under s. 320.24(4). This interpretation is \nmost consistent with a harmonious reading of the text of s. 320 .24(4), its broader \ncontext, and the objects of the law within the legislative scheme as a whole, and avoids \nabsurd consequences that are presumed not to have been intended by Parliament.  \nV. Disposition  \n[144]  For these reasons, I would dismiss the appeal.  \n Appea l allowed, CÔTÉ, KASIRER , JAMAL  and MOREAU JJ. dissenting . \n Solicitors  for the appellant: Littl e & Company , Saskatoon.  \n Solicitor  for the respondent: Office of the Attorney General for \nSaskatchewan, Regina.  \n2024 SCC 34 (CanLII)\n\n",
    "token_count": 512,
    "start_token": 36900,
    "end_token": 37412,
    "total_tokens_in_source": 37412
  }
]