[
  {
    "chunk_id": 0,
    "source_file": "2024scc43.txt",
    "text": "--- Page 1 ---\n \n  \nSUPREME COURT OF CANADA  \n \nCITATION : Quebec (Commission \ndes droits de la personne et des \ndroits de la jeunesse) v. Directrice \nde la protection de la jeunesse du \nCISSS A, 2024 SCC 43    \nAPPEAL HEARD : March 19, 2024  \nJUDGMENT RENDERED : \nDecember 20, 2024  \nDOCKET : 40602  \n \nBETWEEN : \n \nCommission des droits de la personne et des droits de la jeunesse  \nAppellant  \n \nand \n \nDirectrice de la protection de la jeunesse du CISSS A  \nRespondent  \n \n- and - \n \nAttor ney General of Quebec, A, B, X,  \nCanadian Civil Liberties Association and  \nBritish Columbia Civil Liberties Association  \nInterveners  \n \nOFFICIAL ENGLISH TRANSLATION  \n \nCORAM : Wagner C.J. and Karakatsanis, Côté, Rowe, Martin, Kasirer, Jamal, \nO’Bonsawin and Moreau JJ.  \n \nREASONS FOR \nJUDGMENT : \n(paras. 1 to 122)  Wagner C.J. (Karakatsanis, Côté, Rowe, Martin, Kasirer, \nJamal, O’Bonsawin and Moreau JJ. concurring)  \n \n2024 SCC 43 (CanLII)\n\n--- Page 2 ---\n \n NOTE: This document is subject to editorial revision before its reproduction in final \nform in the Canada Supreme Court Reports . \n   \n \n  \n2024 SCC 43 (CanLII)\n\n--- Page 3 ---\n \n Commission des droits de la personne et  \ndes droits de la jeunesse  Appellant  \nv. \nDirectrice de la protection de la jeunesse du CISSS A  Respondent  \nand \nAttorney General of Quebec,  \nA, B, X, Canad ian Civil Liberties Association and  \nBritish Columbia Civil Liberties Association  Interveners  \nIndexed as: Quebec (Commission des droits de la personne et des droits de la \njeunesse) v. Directrice de la protection de la jeunesse du CISSS A  \n2024  SCC  43 \nFile No.: 40602.  \n2024:  March  19; 2024:  December  20. \nPresent: Wagner  C.J. and Karakatsanis, Côté, Rowe, Martin, Kasire r, Jamal, \nO’Bonsawin and Moreau  JJ. \nON APPEAL  FROM  THE  COURT OF APPEAL FOR  QUEBEC  \n2024 SCC 43 (CanLII)\n\n--- Page 4 ---\n \n  Status of persons — Child protection — Encroachment upon child’s rights  \n— Corrective powers of tribunal — Tribunal declaring that young person’s rights had \nbeen encroached upon in context of social intervention — Tribunal ordering corrective \nmeasures — Director of youth protection challenging measures on ground that they \ndid not relate directly to young person’s situation referred to tribunal — Scope of \ncorrective powers conferred on Youth Division of Court of Québec in cases of \nencroachment upo n child’s rights — Youth Protection Act, CQLR, c.  P-34.1, s.  91 \npara.  4. \n In the context of social intervention, a young person and her parents filed \nan application with the Youth Division of the Court of Québec (“tribunal”) for a \ndeclaration of encroachme nt upon rights under s.  91 para.  4 of the Youth Protection Act  \n(“YPA”). That provision states that  where “the tribunal concludes that the rights of a \nchild in difficulty have been wronged by persons, bodies or institutions, it may order \nthe situation to be  corrected”. The tribunal identified four situations that had \nencroached upon the young person’s rights, and it recommended and ordered a series \nof corrective measures. Four of the se measures were challenged by the director of youth \nprotection for the Cent re intégré de santé et de services sociaux A (“DYP”), who took \nthe view that they went beyond the corrective powers conferred on the tribunal by s.  91 \npara.  4 of the YPA because they did not relate directly to the young person’s situation. \nTo begin with, a s regards the first two measures, the tribunal ordered that the youth \nworkers, educators and intervention officers who worked in the individualized \ntreatment units be able to receive specific training on mental health and that these units \n2024 SCC 43 (CanLII)\n\n--- Page 5 ---\n \n be able to obtain  support from a healthcare professional specializing in mental",
    "token_count": 1000,
    "start_token": 0,
    "end_token": 1000,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 1,
    "source_file": "2024scc43.txt",
    "text": ".  4 of the YPA because they did not relate directly to the young person’s situation. \nTo begin with, a s regards the first two measures, the tribunal ordered that the youth \nworkers, educators and intervention officers who worked in the individualized \ntreatment units be able to receive specific training on mental health and that these units \n2024 SCC 43 (CanLII)\n\n--- Page 5 ---\n \n be able to obtain  support from a healthcare professional specializing in mental health. \nNext, as regards the other two measures, the tribunal ordered the Centre intégré de santé \net de services sociaux A (“CISSS A”) to implement a protocol within a reasonable time \nperiod to  set out the steps to be taken when a child spits during an intervention and to \nadapt all isolation rooms so that they were safer and their walls were covered with a \nmaterial that prevented injury.  \n The Superior Court allowed the DYP’s appeal in part, hold ing that the four \nimpugned orders exceeded the powers conferred on the tribunal by the legislature \nbecause they applied to children other than the one whose situation had been referred \nto the tribunal. The Superior Court varied the impugned orders so that they applied \nspecifically to the young person’s situation and they named her expressly. The decision \nwas subsequently appealed by the young person, by her parents and by the Commission \ndes droits de la personne et des droits de la jeunesse. That commission  had intervened \nfor the first time before the Superior Court to argue that s.  91 para.  4 gives the tribunal \nbroad corrective powers allowing it to make general orders not specifically intended to \ncorrect the situation experienced by the child before it. Li ke the Superior Court judge, \nthe majority of the Court of Appeal found that the four impugned orders were general \nin nature, went beyond the situation of the child who was the subject of the proceedings \nand therefore had to be narrowed. However, the majori ty of the Court of Appeal varied \ntwo of the impugned measures, as varied by the Superior Court, so that they were \nordered against the DYP rather than the CISSS A.  \n2024 SCC 43 (CanLII)\n\n--- Page 6 ---\n \n  Held : The appeal should be allowed in part.  \n The legislature intended to confer on the tribunal the corrective powers \nneeded to ensure the fullest protection of the interests and rights of the child whose \nsituation has been referred to it, that is, protection that applies to both the present and \nthe future and that takes account of the circu mstances at the source of the encroachment \nupon rights as well as the impact of the encroachment on the child’s psychological and \nphysical state. The tribunal may order corrective measures whose purpose is to put an \nend to the situation of encroachment whe re it is still encroaching upon the child’s rights, \nto remedy the psychological or physical consequences for the child resulting from the \nencroachment upon rights, and to prevent the recurrence of the situation of \nencroachment for the child. A preventive c orrective measure may be ordered only  if \nthe child whose rights have been encroached upon is at risk of being subjected to the \nsituation of encroachment again, if the corrective measure can effectively help to \nprevent  the recurrence of the situation of enc roachment and if the measure is related to \nthe protection of the interests and rights of the child whose situation has been referred \nto the tribunal.  \n The YPA must be given a large and liberal interpretation that will ensure \nthe attainment of its object an d the carrying out of its provisions according to their true \nintent, meaning and spirit. Every provision of the YPA must also be interpreted in \naccordance with the Charter of human rights and freedoms , while bearing in mind the \nConvention on the Rights of the Child  (“CRC ”). The starting point in any interpretive \n2024 SCC 43 (CanLII)\n\n--- Page 7 ---\n \n exercise is the text of the provision. In the absence of statutory definitions, what should \nbe focused on is the grammatical and ordinary meaning of the text, that is, the natural \nmeaning that appea rs when the provision is simply read through as a whole.  \n In this case, consideration of the grammatical and ordinary meaning of the \nphrase “the situation to be corrected” in s.  91 para.  4 leads to the conclusion that the \nlegislature intended to grant the tribunal corrective powers that allow it to redress a \nsituation, to restore order or the normal state of affairs. However, this consideration \ndoes not make it possible to say with certainty which situation is in question. \nFurthermore, consideration of the grammatical and ordinary meaning of the",
    "token_count": 1000,
    "start_token": 900,
    "end_token": 1900,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 2,
    "source_file": "2024scc43.txt",
    "text": " of the grammatical and ordinary meaning of the \nphrase “the situation to be corrected” in s.  91 para.  4 leads to the conclusion that the \nlegislature intended to grant the tribunal corrective powers that allow it to redress a \nsituation, to restore order or the normal state of affairs. However, this consideration \ndoes not make it possible to say with certainty which situation is in question. \nFurthermore, consideration of the grammatical and ordinary meaning of the phrase is \nof little assistance in determining whether the legislature’s intention in granting the \ntribunal the corrective powers set out in s.  91 para.  4 was that, in exercising them, the \ntribunal concern itself excl usively with protecting the rights and interests of the child \nwhose situation has been referred to it , or whether the legislature also intended that the \ntribunal concern itself with protecting the rights and interests of all other children who, \nthough not the subject of the proceedings, are or may find themselves in the same \nsituation as the child before the tribunal.  \n An analysis of the scheme of the YPA suggests that  the legislature did not \nintend the tribunal to be able to order corrective measures aimed  in whole or in part at \nprotecting the rights and interests of children whose situations have not been referred \nto it but who may find themselves in the same situation of encroachment as the child \nbefore it. The tribunal’s mandate is to render justice in a n individualized and \n2024 SCC 43 (CanLII)\n\n--- Page 8 ---\n \n particularized manner on the basis of the interests and rights of the child whose \nsituation has been referred to it. With a view to ensuring functional complementarity \nbetween social intervention and judicial intervention, the tribunal  must make decisions \nthat are in the interest of the child and that respect the child’s rights, the ultimate goal \nbeing to limit any danger to the child’s security and development, but also to prevent \nabuse.  \n The fact that the tribunal is called upon to re nder justice in an \nindividualized and particularized manner on the basis of a single child’s situation is \nalso clear from all of the provisions relating to the tribunal’s jurisdiction. No provision \nof the YPA reveals an intention to depart from this logic of individualized and \nparticularized justice that runs throughout the YPA when it comes to encroachment \nupon rights. The legislature did not intend to grant the tribunal powers going beyond \nthose required to carry out the mandate assigned to it. This concl usion is also supported \nby the fact that other actors have been given a mandate to examine the system as a \nwhole, to identify its shortcomings and to reform it. The proper functioning of the youth \nprotection system depends on the actions of a range of poli tical, social and legal actors \nthat have been given roles, responsibilities and powers that are both distinct and \ncomplementary. There is nothing to suggest that, under the wide -ranging reform of the \nYPA, the tribunal’s mandate has been broadened to allow it to take a critical look at \nsystemic issues in child protection and to order corrective measures to reform the \nsystem for the benefit of children whose situations have not been referred to it.  \n2024 SCC 43 (CanLII)\n\n--- Page 9 ---\n \n  The legislative history of s.  91 para.  4 and of other relate d provisions \nconcerning encroachment upon rights confirms what the scheme of the YPA already \nreveals: the tribunal can deal with the situation of only one child at a time. Moreover, \nthere is nothing to suggest that the legislature intended to authorize the  tribunal to order \ncorrective measures that would apply to children whose situations have not been \nreferred to it but who may find themselves in the same situation of encroachment as \nthe child before it. The legislature’s decision to omit the words “encroa ching upon the \nrights of the young person” within the phrase “ the situation to be corrected” in s.  91 \npara.  4 should not be interpreted as a broadening of the tribunal’s power to order \ncorrective measures to protect the interests and rights of children who se situations have \nnot been referred to it.  \n The YPA establishes a scheme whose purpose is to protect the interests and \nrights of children whose security or development is in danger, thereby helping to \nimplement Canada’s obligations under the CRC  in domest ic law. T he CRC  weighs in \nfavour of interpreting s. 91 para.  4 in a large and liberal manner so that the tribunal will \nhave all the corrective powers it needs to ensure that the child whose rights have been \nencroached upon has the fullest and most effectiv e",
    "token_count": 1000,
    "start_token": 1800,
    "end_token": 2800,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 3,
    "source_file": "2024scc43.txt",
    "text": " a scheme whose purpose is to protect the interests and \nrights of children whose security or development is in danger, thereby helping to \nimplement Canada’s obligations under the CRC  in domest ic law. T he CRC  weighs in \nfavour of interpreting s. 91 para.  4 in a large and liberal manner so that the tribunal will \nhave all the corrective powers it needs to ensure that the child whose rights have been \nencroached upon has the fullest and most effectiv e protection possible . However, there \nis no indication that, in order to comply with the CRC , provincial and territorial \nlegislatures must, in cases of encroachment upon rights, give courts or tribunals the \nmandate and powers they need to concern themselve s with protecting the interests and \nrights of more than one child at a time. States parties to the CRC  possess a margin of \n2024 SCC 43 (CanLII)\n\n--- Page 10 ---\n \n discretion in determining what measures are appropriate to promote the best interests \nof the child and to protect the child’s rights.  \n In the case of social and judicial intervention, the legislature had in mind \nthat this fundamental purpose of protecting the children who are the most vulnerable in \nsociety would be attained through the cumulative effect of individualized and \nparticulari zed interventions aimed at protecting the interests and rights of one child at \na time. The recourse for a declaration of encroachment upon rights is one of the legal \ntools put in place by the legislature to achieve this purpose. The corrective powers \nconfe rred on the tribunal by s.  91 para.  4 must therefore be interpreted in a large and \nliberal manner to ensure the attainment of this purpose, which is clearly affirmed in the \nCharter of human rights and freedoms . The various types of corrective measures that  \ncan be ordered must be conceived of generously to ensure the fullest possible protection \nfor the child whose rights have been encroached upon. Over and above correcting the \nsituation at the source of the encroachment upon rights, the tribunal must also be  able \nto order preventive corrective measures that will follow the child through the system to \nensure that the child is adequately protected in the future.  \n At least three validity criteria govern the exercise of the tribunal’s power \nto order preventive c orrective measures under s.  91 para.  4. These criteria are based on \nthe limits built into this enabling provision. First, for a preventive corrective measure \nto be ordered, the child whose situation has been referred to the tribunal must be at risk \nof bein g subjected to the situation of encroachment again. This criterion will generally \n2024 SCC 43 (CanLII)\n\n--- Page 11 ---\n \n be met where the child is still the subject of intervention under the YPA. Second, the \npreventive corrective measure ordered must be able to effectively help to prevent the \nrecurrence of the situation of encroachment. Once the source of the encroachment upon \nrights is identified, the tribunal will be able to consider one or more corrective measures \nthat could effectively help to prevent the recurrence of the situation of encro achment. \nThese measures will logically focus on one or more of the circumstances shown by the \nevidence to be at the source of the encroachment. The wide range of corrective \nmeasures that can effectively help to prevent the recurrence of the situation of \nencroachment will , however,  be narrowed once account is taken of an additional \ncriterion: any preventive corrective measure must, third, be related to preventing the \nrecurrence of the situatio n of encroachment for the child whose situation has been \nreferred to the tribunal. This requirement flows from the legislative intent discerned \nfrom s.  91 para.  4 of the YPA. The corrective measure must therefore be primarily \nintended to protect the intere sts and rights of the child whose situation has been referred \nto the tribunal. The corrective measure must be related to events experienced by the \nchild in environments where the child has spent or might spend time, on the basis of \nthe evidence and the con text. The tribunal must confine itself to ordering a corrective \nmeasure that reflects the risk of harm faced by the child, as shown by the evidence . \nThat being said, the order, to be valid, does not necessarily have to expressly name the \nchild whose situat ion has been referred to the tribunal . \n To effectively protect the child whose rights have been encroached upon, \nthe preventive corrective measures will sometimes have to be broad in scope. A t least \n2024 SCC 43 (CanLII)\n\n--- Page 12 ---\n \n two types of measures can be contemplated. First, the tri bunal may order a corrective \nmeasure",
    "token_count": 1000,
    "start_token": 2700,
    "end_token": 3700,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 4,
    "source_file": "2024scc43.txt",
    "text": " being said, the order, to be valid, does not necessarily have to expressly name the \nchild whose situat ion has been referred to the tribunal . \n To effectively protect the child whose rights have been encroached upon, \nthe preventive corrective measures will sometimes have to be broad in scope. A t least \n2024 SCC 43 (CanLII)\n\n--- Page 12 ---\n \n two types of measures can be contemplated. First, the tri bunal may order a corrective \nmeasure specifically directed at persons, bodies or institutions that, in light of the \nevidence,  could potentially contribute to the recurrence of the encroachment upon the \nchild’s rights.  Second, the tribunal may order a measu re that will follow the child \nthrough the system , either as an alternative to or in addition to the first type of measure, \nin light of the evidence in the record, the circumstances of the case and the need to \nprotect the child for the future.  Broad correct ive measures will generally have the \nadvantage of protecting the interests and rights of many other children in an indirect \nand incidental manner, but this is of no relevance in determining whether the measures \nwere validly imposed. A preventive corrective  measure related to the interests and \nrights of the child whose situation has been referred to the tribunal may very well have \npositive indirect and incidental consequences for a large number of children.  There is \nnothing to prevent the tribunal from order ing a corrective measure  to eliminate a \nsystemic or institutional practice, provided that the three validity criteria are met . \nLastly, the magnitude of the budgetary impact of the corrective measure is not in itself \na criterion for the validity of the orde r. Such a validity criterion has no basis in the YPA, \nand its application would entail considerable practical difficulties, adding another \nbarrier to access to justice in the youth protection system.  \n Where rights have been encroached upon, the tribunal ha s a power to make \nrecommendations that it derives from the text, scheme and object of the YPA. When \nthe circumstances do not lend themselves to stating a conclusion in the form of an order, \nthe tribunal can still make a non -binding recommendation anchored in the evidence \n2024 SCC 43 (CanLII)\n\n--- Page 13 ---\n \n concerning the encroachment upon the rights of the child whose situation has been \nreferred to it. This power to make recommendations is to be exercised with caution and \nallows the tribunal to point out the existence of a problem relating to  an encroachment \nupon the child’s rights and to encourage the authorities to address it. The \nrecommendation must be based on the situation of encroachment experienced by the \nchild, as shown by the evidence.  \n In this case, the four corrective measures chal lenged by the DYP were \nordered to prevent abusive or inadequate restraint and isolation measures from being \nused again, where it was established that the young person was at risk of being \nsubjected to the identified situations of encroachment again. As reg ards the first two \norders, the tribunal erred by not limiting the scope of these measures so that they were \nrelated to preventing the recurrence of the situation of encroachment for the young \nperson. Nothing in the evidence adduced supported the conclusion  that such broad \norders were necessary to protect the young person’s interests and rights in the future. \nThe Superior Court properly intervened to narrow the scope of these orders so that they \nwere related to the protection of the young person’s interests and rights. As for the third \norder, the tribunal exceeded its powers by ordering the CISSS A to implement a \nprotocol that set out the steps to be taken when a child spits during an intervention. The \norder as worded was not related to preventing the recurre nce of the situation of \nencroachment for the young person. In light of the findings of fact, the order should \nhave been directed at the rehabilitation centres for young persons with adjustment \nproblems (“RCYPAPs”) of the CISSS A and at any other RCYPAP tha t would be \n2024 SCC 43 (CanLII)\n\n--- Page 14 ---\n \n responsible for the young person. The order should also have been made against the \nDYP. Finally, as regards the fourth order, which required that the isolation rooms be \nmade safer, this corrective measure was not sufficiently anchored in the evi dence and \nthe context. The order should have been varied to direct the DYP, and not the CISSS \nA, to have at least one isolation room, covered with a material that prevented injury, \navailable for the young person at all times in units A and B of the CISSS A  and in the \nother RCYPAP units to which she would be",
    "token_count": 1000,
    "start_token": 3600,
    "end_token": 4600,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 5,
    "source_file": "2024scc43.txt",
    "text": " required that the isolation rooms be \nmade safer, this corrective measure was not sufficiently anchored in the evi dence and \nthe context. The order should have been varied to direct the DYP, and not the CISSS \nA, to have at least one isolation room, covered with a material that prevented injury, \navailable for the young person at all times in units A and B of the CISSS A  and in the \nother RCYPAP units to which she would be entrusted. Other alternative orders were \nalso available and acceptable and could therefore have been made. However, since the \nyoung person is no longer the subject of social intervention under the YPA and never \nwill be again given that she is now an adult, no order will be made.  \nCases Cited  \n Referred to:  Protection de la jeunesse – 123979 , 2012 QCCA 1483, \n[2012] R.J.Q. 1603; Rizzo & Rizzo Shoes Ltd. (Re), [1998] 1 S.C.R. 27; Bell ExpressVu \nLimited Partner ship v. Rex , 2002 SCC 42, [2002] 2 S.C.R. 559; La Presse inc. v. \nQuebec , 2023 SCC 22; R. v. Breault , 2023 SCC 9; MediaQMI inc. v. Kamel , 2021 SCC \n23, [2021] 1 S.C.R. 899; Quebec (Attorney General) v. 9147 -0732 Québec inc. , 2020 \nSCC 32, [2020] 3 S.C.R. 426; Gosselin v. Quebec (Attorney General) , 2002 SCC 84, \n[2002] 4 S.C.R. 429; Quebec (Commission des normes, de l’équité, de la santé et de la \nsécurité du travail) v. Caron , 2018 SCC 3, [2018] 1 S.C.R. 35; Quebec (Commission \ndes droits de la personne et des droits de la jeunesse) v. Communauté urbaine de \nMontréal , 2004 SCC 30, [2004] 1 S.C.R. 789; Society of Composers, Authors and \n2024 SCC 43 (CanLII)\n\n--- Page 15 ---\n \n Music Publishers of Canada v. Entertainment Software Association , 2022 SCC 30; \nKazemi Estate v. I slamic Republic of Iran , 2014 SCC 62, [2014] 3 S.C.R. 176; R. v. \nHape , 2007 SCC 26, [2007] 2 S.C.R. 292; Michel v. Graydon , 2020 SCC 24, [2020] 2 \nS.C.R. 763; Ontario v. Criminal Lawyers’ Association of Ontario , 2013 SCC 43, \n[2013] 3 S.C.R. 3; Canadian Paci fic Air Lines Ltd. v. Canadian Air Line Pilots Assn. , \n[1993] 3 S.C.R. 724; R. v. Audet , [1996] 2 S.C.R. 171; Canada (Minister of Citizenship \nand Immigration) v. Vavilov , 2019 SCC 65, [2019] 4 S.C.R. 653; Lamothe v. Ruffo , \n[1998] R.J.Q. 1815; Gordon v. Goer tz, [1996] 2 S.C.R. 27; A.C. v. Manitoba (Director \nof Child and Family Services) , 2009 SCC 30, [2009] 2 S.C.R. 181; Barendregt v. \nGrebliunas , 2022 SCC 22; B.J.T. v. J.D. , 2022 SCC 24; Quebec (Commission des droits \nde la personne et des droits de la jeuness e) v. Bombardier Inc. (Bombardier Aerospace \nTraining Center) , 2015 SCC 39, [2015] 2 S.C.R. 789; Canadian Council for Refugees \nv. Canada (Citizenship and Immigration) , 2023 SCC 17; R. v. Appulonappa , 2015 SCC \n59, [2015] 3 S.C.R. 754; Protection de la jeunes se – 174220 , 2017 QCCQ 9973; \nProtection de la jeunesse – 175726 , 2017 QCC",
    "token_count": 1000,
    "start_token": 4500,
    "end_token": 5500,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 6,
    "source_file": "2024scc43.txt",
    "text": "5] 2 S.C.R. 789; Canadian Council for Refugees \nv. Canada (Citizenship and Immigration) , 2023 SCC 17; R. v. Appulonappa , 2015 SCC \n59, [2015] 3 S.C.R. 754; Protection de la jeunes se – 174220 , 2017 QCCQ 9973; \nProtection de la jeunesse – 175726 , 2017 QCCQ 10171; Protection de la jeunesse – \n1610815 , 2016 QCCQ 20163; Protection de la jeunesse – 202094 , 2020 QCCQ 1912; \nProtection de la jeunesse – 212922 , 2021 QCCQ 5132; Protection de la  jeunesse – \n2023 , 2020 QCCQ 61; Protection de la jeunesse – 137151 , 2013 QCCQ 17367; \nProtection de la jeunesse – 171278 , 2017 QCCQ 2752; P. (D.) v. S.  (C.), [1993] 4 \nS.C.R. 141; Canadian National Railway Co. v. Canada (Canadian Human Rights \nCommission) , [1987] 1 S.C.R. 1114; Moore v. British Columbia (Education) , 2012 \nSCC 61, [2012] 3 S.C.R. 360; Housen v. Nikolaisen , 2002 SCC 33, [2002] 2 S.C.R. \n235; Canada (Transportation Safety Board) v. Carroll -Byrne , 2022 SCC 48; Hydro -\n2024 SCC 43 (CanLII)\n\n--- Page 16 ---\n \n Québec v. Matta , 2020 SCC 37, [20 20] 3 S.C.R. 595; TELUS Communications Inc. v. \nWellman , 2019 SCC 19, [2019] 2 S.C.R. 144; Québec (Protection de la jeunesse) v. \nC.P., 2000 CanLII 11372; Protection de la jeunesse – 236587 , 2023 QCCQ 12263; \nProtection de la jeunesse – 211624 , 2021 QCCQ 2868; Protection de la jeunesse , \n[1985] AZ -50942189; Protection de la jeunesse – 10174 , 2010 QCCA 1912, [2010] \nR.J.Q. 2291; Protection de la jeunesse – 18935 , 2018 QCCQ 10532; Protection de la \njeunesse – 211323 , 2021 QCCQ 2238.  \nStatutes and Reg ulations Cite d \nAct respecting health services and social services , CQLR, c . S-4.2, s.  118.1.  \nAct to amend the Youth Protection Act and other legislation , S.Q. 1984, c.  4, ss.  10, 12, \n38, 46.  \nAct to amend the Youth Protection Act and other legislative provi sions , S.Q. 2022, \nc. 11. \nAct to modify the organization and governance of the health and social services \nnetwork, in particular by abolishing the regional agencies , CQLR, c.  O-7.2, \nSch. I. \nCharter of human rights and freedoms , CQLR, c.  C-12, ss.  39, 53, 80 . \nCivil Code of Québec , arts.  32, 186, 199.  \nCode of Civil Procedure , CQLR, c.  C-25, art.  5. \nCode of Civil Procedure , CQLR, c.  C-25.01, arts.  17, 50.  \nDécret 1676 -91, (1992) 124 G.O. II, 51.  \nInterpretation Act , CQLR, c.  I-16, ss.  40 para.  1, 41. \nSupreme Court Act , R.S.C. 1985, c.  S-26, s.  45. \nYouth Protection Act , CQLR, c.  P-34.1, preamble [ad. 2022, c.  11, s.  1], ss.  2, 2.3 para. \n1(a), 3, Chapter III, 23 to 27,",
    "token_count": 1000,
    "start_token": 5400,
    "end_token": 6400,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 7,
    "source_file": "2024scc43.txt",
    "text": " 1, 41. \nSupreme Court Act , R.S.C. 1985, c.  S-26, s.  45. \nYouth Protection Act , CQLR, c.  P-34.1, preamble [ad. 2022, c.  11, s.  1], ss.  2, 2.3 para. \n1(a), 3, Chapter III, 23 to 27, 28 to 30.8 [ idem , s. 16] , 47.1, 51 to 51.8, 52 et seq., \n2024 SCC 43 (CanLII)\n\n--- Page 17 ---\n \n Chapter V, 73  para.  1, 73.1, 74.1, 74.2, 90 et seq., 91 , 112, 128, 129, 133 [ idem , \ns. 61], 133.1, 156.1  para.  1, 156.2.  \nYouth Protection Act , S.Q. 1977, c.  20, s.  23(d), (e). \nTreaties and Other International Instruments  \nConvention on the Rights of the Child , Can. T.S. 1992 No.  3, Articles  3, 4. \nAuthors Cited  \nBernheim, Emmanuelle, and Marilyn Coupienne. “Faire valoir ses droits à la Chambre \nde la jeunesse: état des lieux des barrières structurelles à l’accès à la justice des \nfamilles” (2019), 32 Can. J. Fam. L.  237. \nBoulais, Jean -François. Loi sur la protection de la jeunesse, texte annoté , 5th ed. \nMontréal: SOQUIJ, 2003.  \nBrodeur, Catherine. “Chronique — Le non -respect des ordonnances par la direction de \nla protection de la jeunesse: contexte juridique et survol de la jurisprudence”, \nRepères , June 2022 (online: https://www.lareference.editionsyvonblais.com).  \nCostanzo, Valérie  P., and Mona Paré. “Les réponses judiciaires au non -respect des \ndroits de l’enfant dans l’intervention sociale: Utilité ou futilité du recours en \nlésion de droits?” (202 3), 33:2 N.P.S.  135. \nCôté, Pierre -André, and Mathieu Devinat. Interprétation des lois , 5th ed. Montréal: \nThémis, 2021.  \nDictionnaire de l’Académie française , 9th ed. (online: https://www.dictionnaire -\nacademie.fr/), “ situation ”. \nDictionnaire Larousse (online : www.larousse.fr), “ corriger ”, “situation ”. \nGrand Robert de la langue française  (electronic version), “ corriger ”, “situation ”. \nJoyal, Renée, and Mario Provost. “La Loi sur la protection de la jeunesse  de 1977: une \nmaturation laborieuse, un texte porteur”,  in Renée Joyal, ed., L’évolution de la \nprotection de l’enfance au Québec: des origines à nos jours . Sainte -Foy, Que.: \nPresses de l’Université du Québec, 2000, 179.  \n2024 SCC 43 (CanLII)\n\n--- Page 18 ---\n \n Lemonde, Lucie, and Julie Desrosiers. “Le droit à un recours effectif lors de la violation \ndes droits fondamentaux des mineurs privés de liberté” (2002), 62 R. du B.  205. \nMancini, Mark. “The Purpose Error in the Modern Approach to Statutory \nInterpretation” (2022), 59 Alta. L. Rev.  919. \nPapillon, Sophie. “Le jugement en matière de lésion de droit s de la Chambre de la \njeunesse: où en sommes -nous?” (2015), 56 C. de D.  151. \nProvost, Mario. Droit de la protection de la jeunesse , 3rd ed. Montréal: LexisNexis, \n2022.  \nProvost, Mario. “La protection de la jeunesse”, in",
    "token_count": 1000,
    "start_token": 6300,
    "end_token": 7300,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 8,
    "source_file": "2024scc43.txt",
    "text": "illon, Sophie. “Le jugement en matière de lésion de droit s de la Chambre de la \njeunesse: où en sommes -nous?” (2015), 56 C. de D.  151. \nProvost, Mario. Droit de la protection de la jeunesse , 3rd ed. Montréal: LexisNexis, \n2022.  \nProvost, Mario. “La protection de la jeunesse”, in Tommy Gagné -Dubé et al., eds., \nDroit de la famille québécois . Montréal: LexisNexis, 1985 (loose -leaf updated \nAugust  2024, release 513). \nProvost, Mario. Youth Protection Law in Québec . Toronto: LexisNexis, 2023.  \nQuebec. Assemblée nationale. Journal des débats , vol. 27, No.  69, 4th Sess., 32nd \nLeg., March  13, 1984, pp.  5123 -42. \nQuebec. Assemblée nationale. Journal des débats , vol. 46, No.  21, 2nd Sess., 42nd \nLeg., December  8, 2021, pp.  1091 -93. \nQuebec. Assemblée nationale. Journal des débats de la Commission de la santé et des \nservices sociaux , vol. 46, No.  22, 2nd Sess., 42nd Leg., April  5, 2022 . \nQuebec. Assemblée nationale. Commission parlementaire spéciale sur la protection de \nla jeunesse. Proposition législative: annexe IV au rapport de la Commission \nparlementaire spéciale sur la protection d e la jeunesse . Québec, 1982.  \nQuebec. Assemblée nationale. Commission parlementaire spéciale sur la protection de \nla jeunesse. Rapport de la Commission parlementaire spéciale sur la protection \nde la jeunesse . Québec, 1982.  \nQuebec. Assemblée nationale. Commi ssion permanente des affaires sociales. “Étude \ndétaillée du projet de loi 60 — Loi modifiant la Loi sur la protection de la jeunesse \net d’autres dispositions législatives (2)”, Journal des débats: commissions \nparlementaires , No.  3, 4th Sess., 32nd Leg., Ma rch 21, 1984, p.  45. \nQuebec. Assemblée nationale. Commission permanente des affaires sociales. “Étude \ndétaillée du projet de loi 60 — Loi modifiant la Loi sur la protection de la jeunesse \net d’autres dispositions législatives (3)”, Journal des débats: comm issions \nparlementaires , No.  4, 4th Sess., 32nd Leg., March  22, 1984,  pp. 109-10. \n2024 SCC 43 (CanLII)\n\n--- Page 19 ---\n \n Quebec. Commission des droits de la personne et des droits de la jeunesse. Rapport sur \nla mise en œuvre de la Loi sur la protection de la jeunesse (article 156.1 de la \nLPJ) . Montréal, 2020.  \nQuebec. Commission spéciale sur les droits des enfants et la protection de la jeunesse. \nInstaurer une société bienveillante pour nos enfants et nos jeunes: rapport de la \nCommission spéciale sur les droits des enfants et la protection de la j eunesse . \n2021.  \nRicard, Laurence. “Un regard sur la notion de lésion de droits en matière de protection \nde la jeunesse” (2021), 62 C. de D.  605. \nSullivan, Ruth. The Construction of Statutes , 7th ed. Toronto: LexisNexis, 2022.  \nTobin, John. “Article 4. A State’s General Obligation of Implementation”, in John \nTobin, ed., The UN Convention on the Rights of the Child: A Commentary . New \nYork: Oxford University Press, 2019, 108.  \nTrésor de la Langue Française informatisé  (online: http: //atilf.atilf.fr/), “ situation ”. \nUnited Nations. Committee on the Rights of the Child. Concept Note: General \nComment on",
    "token_count": 1000,
    "start_token": 7200,
    "end_token": 8200,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 9,
    "source_file": "2024scc43.txt",
    "text": " 4. A State’s General Obligation of Implementation”, in John \nTobin, ed., The UN Convention on the Rights of the Child: A Commentary . New \nYork: Oxford University Press, 2019, 108.  \nTrésor de la Langue Française informatisé  (online: http: //atilf.atilf.fr/), “ situation ”. \nUnited Nations. Committee on the Rights of the Child. Concept Note: General \nComment on  Children’s Rights to Access to Justice and Effective Remedies , 2024 \n(online: \nhttps://www.ohchr.org/sites/default/files/documents/hrbodie s/crc/gcomments/gc\n27/gc27 -concept -note.pdf; archived version: https://www.scc -csc.ca/cso -\ndce/2024SCC -CSC 43_1_eng.pdf ). \nUnited Nations. Committee on the Rights of the Child. General Comment No. 5 (2003): \nGeneral measures of implementation of the Convention on the Rights of the Child \n(arts.  4, 42 and 44, para.  6), U.N. Doc. CRC/GC/2003/5, November  27, 2003.  \nZinn, Russel  W. The Law of Human Rights in Canada: Practice and Procedure . \nToro nto: Thomson Reuters, 2024 (loose -leaf updated December 2024 , release  3). \n APPEAL from a judgment of the Quebec Cour t of Appeal  (Levesque, \nSchrager and Hogue JJ.A.), 2022 QCCA 1653 , [2022] AZ -51899040, [2022] Q.J. \nNo. 13560 (Lexis), 2022 CarswellQue 21735 (WL), setting aside in part a decision of  \nPoirier  J., 2021 QCCS 2251, [2021] AZ -51770110, [2021] J.Q. no 6108 (Lexis), 2021 \nCarswellQue 8125 (WL), setting aside in part a decision of Roy J.C.Q., 2019 QCCQ \n2024 SCC 43 (CanLII)\n\n--- Page 20 ---\n \n 3916, [2019] AZ -51608758, [2019] J.Q. no 5507 (Lexis), 2019 CarswellQue 7385 \n(WL) . Appeal allowed in part . \n Catherine Gauvreau , Christine Campbell and Stéphanie Fournier , for the \nappellant.  \n Audrey Boctor , Julie Langlois , Vanessa Ntaganda  and Mélanie Poulin , for \nthe respondent.  \n Éric Cantin  and Mario Normandin , for the intervener the Attorney General \nof Quebec.  \n Stéphane Pouliot  and Gabrielle Gallio , for the intervener s A and B . \n Charlotte Vanier Perras , for the intervener X.  \n Karine Joizil  and Simon Bouthillier , for the intervener the Canadian Civil \nLiberties Association.  \n Vincent Larochelle , for the intervener the British Columbia Civil Liberties \nAssociation.  \n English version of the judgment of the Court delivered by  \n2024 SCC 43 (CanLII)\n\n--- Page 21 ---\n \n  THE CHIEF JUSTICE —  \n TABLE OF CONTENTS  \n \nParagraph  \nI. Overview  1 \nII. Factual Background  5 \nIII. Procedural and Judicial History  6 \nA. Court of Québec, 2019 QCCQ 3916  6 \nB. Quebec Superior Court, 2021 QCCS 2251  9 \nC. Quebec Court of Appeal, 2022 QCCA 1653  11 \n Majority Reasons  11 \n Concurring Reasons 14 \nIV. Issues  17 \nV. Analysis  23 \nA. Judicial Intervention in Cases of Encroachment Upon Rights: Scope of the \nCorrective Powers Conferred on the Tribunal Under Section  91 Paragraph 4 of the \nYPA 23 \n Principles That Must Guide the Interpretive Exercise  23 \n Interpretation of Section 91 Paragraph 4 of the YPA 28 \n Text 30 \n The Verb “Correct” (“ Corriger ”) 30 \n The Words “the Situation” (“ la Situation ”) 33 \n Conclusion 36 \n Scheme of the YPA 37 \n The Tribunal’s Mandate Is To Render Justice in an Individualized and \nParticularized Manner on the Basis of the Interests and Rights of the Child \nWhose Situation Has Been Referred to It38",
    "token_count": 1000,
    "start_token": 8100,
    "end_token": 9100,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 10,
    "source_file": "2024scc43.txt",
    "text": " of Section 91 Paragraph 4 of the YPA 28 \n Text 30 \n The Verb “Correct” (“ Corriger ”) 30 \n The Words “the Situation” (“ la Situation ”) 33 \n Conclusion 36 \n Scheme of the YPA 37 \n The Tribunal’s Mandate Is To Render Justice in an Individualized and \nParticularized Manner on the Basis of the Interests and Rights of the Child \nWhose Situation Has Been Referred to It38 \n Other Actors Are Responsible for Looking at the System as a Whole and \nReforming It43 \n Conclusion on the Tribunal’s Role 50 \n Legislative History 52 \n2024 SCC 43 (CanLII)\n\n--- Page 22 ---\n \n \n CRC 61 \n Object of the Provision 64 \n Conclusion 71 \n Criteria for the Validity  of Corrective Measures Ordered for Preventive \nPurposes78 \n The Child Must Be at Risk of Being Subjected to the Situation of Encroachment \nAgain79 \n The Corrective Measures Must Be Able to Effectively Help to Prevent the \nRecurrence of the Situation of Encroachment81 \n The Corrective Measures Ordered Must Be Related to the Protection of the \nInterests and Rights of the Child Whose Situation Has Been Referred to the \nTribunal87 \n The Budgetary Impact of the Corrective Measure Is Not a Criterion f or the \nValidity of the Order93 \n Conclusion 95 \n Review of the Orders 98 \n Orders Directed at the Individualized Treatment Units 101 \n Orders Directed at the CISSS A 105 \n Tribunal’s Power To Make Recommendations 111 \nB. Right of the CISSS A To Be Heard or Duly Called  117 \nVI. Disposition  122 \nI. Overview  \n[1] The very idea of a child’s rights being encroached upon in the context of \nsocial intervention under the Youth Protection Act , CQLR, c.  P-34.1 (“YPA”),1 \nprovokes indignation. At such a time, the child is in an extremely vulnerable position. \nThe child may have been sexually, physically or psychologically abused, have been \n                                                 \n1 Unless otherwise indicated, any reference to the  statute is a reference to the version in force on the \ndate the Court of Québec’s judgment was ren dered, July  2, 2019.  \n2024 SCC 43 (CanLII)\n\n--- Page 23 ---\n \n neglected or abandoned, or have serious mental health or behavioural disorders. As \nauthor Laurence Ricard notes, encroachment upon the rights of such a child in the \ncourse of social intervention seems, in this context, [ TRANSLATION ] “like twisting a \nknife in the wound”: How can it be explained that intervention by the youth protection \nsystem may add to the harm already suffered by a child even though the primary \nmission of this system is to protect them? (“Un regard sur la notion de lésion de droits \nen matière de protection de la jeunesse” (2021), 62 C. de D.  605, at p.  608; see also \nYPA, s. 2). This case illustrates, however, how difficult it can be for those involved \nwith a child in the course of intervention under the YPA to prevent such encroachments \nupon rights from happening or recurring, given that the causes of these encroachments \nare often numerous and complex.  \n[2] This appeal provides an opportunity for this Court to consider the \ncorrective powers conferred by the legislature on the Youth Division of the Court of \nQuébec (“tribunal”) where persons, bodies or institutions have encroached upon a \nchild’s rights in the course of social intervention. The tribunal’s power to intervene in \nthis regard derives from s.  91 para.  4 of the YPA, which states that  where “the tribunal \nconcludes that the rights of a child in difficulty have been wronged b y persons, bodies \nor institutions, it may order the situation to be corrected ”. \n[3] This laconic provision gives the tribunal broad powers that have at times \nbeen compared to superintending and reforming powers in the interest of the child and \nat times been likened to the remedial powers of courts where there has been a violation \n2024 SCC 43 (CanLII)\n\n--- Page 24 ---\n \n of fundamental rights. However, the exact contours of these powers remain unclear and \nare a subject of debate. The present case therefore affords an occasion to circumscribe \ntheir sc ope. \n[4] First, the Court must interpret the passage in s.  91 para.  4 stating that the \ntribunal may order “the situation to be corrected”. More",
    "token_count": 1000,
    "start_token": 9000,
    "end_token": 10000,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 11,
    "source_file": "2024scc43.txt",
    "text": " has been a violation \n2024 SCC 43 (CanLII)\n\n--- Page 24 ---\n \n of fundamental rights. However, the exact contours of these powers remain unclear and \nare a subject of debate. The present case therefore affords an occasion to circumscribe \ntheir sc ope. \n[4] First, the Court must interpret the passage in s.  91 para.  4 stating that the \ntribunal may order “the situation to be corrected”. More specifically, it must be \ndetermined whether the legislature intended that the tribunal be able to order corrective \nmeasures only to prevent the recurrence of a situation of encroachment for the child \nwhose rights were encroached upon, or whether it intended that the tribunal also be \nable to order corrective measures to prevent the same situation of encroachment from \noccurring for any other child who might be faced with it. Second, the Court must \nconsider a question relating to respect for the right of the Centre intégré de santé et de \nservices sociaux A (“CISSS A”) to be heard or duly called. The Court is being asked \nto determine whether, in the circumstances, the tribunal could make orders against the \nCISSS A.  \nII. Factual Background  \n[5] On January  17, 2018, the tribunal ordered that a young person, the \nintervener X, be placed in a rehabilitation centre for young persons with adj ustment \nproblems (“RCYPAP”) because her security and development were in danger within \nthe meaning of the YPA (2018 QCCQ 10492). Pursuant to that order, the young person \nwas placed in various RCYPAP units and was also hospitalized for certain periods. \nDuring her stays in the units, the young person’s rights were repeatedly encroached \n2024 SCC 43 (CanLII)\n\n--- Page 25 ---\n \n upon, a fact not disputed by the respondent, the director of youth protection for the \nCISSS A (“DYP”). Since the tribunal’s judgment summarized below clearly lays out \nthe facts  that led to the encroachments upon rights and since these facts are not in \ndispute, I see no need to recount them again here in detail.  \nIII. Procedural and Judicial History  \nA. Court of Québec, 2019 QCCQ 3916  \n[6] The issue of encroachment upon rights arose before the tribunal in the \ncontext of an application by the DYP for the review and extension of the order made \nin January 2018. In connection with that application, the young person and her parents, \nrespectively, filed an application for a declaration of encroachment  upon rights under \ns. 91 para.  4 of the YPA. \n[7] The tribunal allowed in part the application for the review and extension of \nthe order of January 2018, after finding that the young person’s security and \ndevelopment were still in danger. In deciding the applic ations for a declaration of \nencroachment upon rights, the tribunal identified four situations that had encroached \nupon the young person’s rights: the unjustified and unduly long suspension of \npsychological counselling, in violation of an order made on Janu ary 17, 2018; an \neducator’s unjustified refusal to allow the young person, who had run away from her \nfamily home, to take refuge at the RCYPAP to which she had been entrusted, and the \ninadequate support subsequently offered to her when she reported that sh e had been \n2024 SCC 43 (CanLII)\n\n--- Page 26 ---\n \n sexually assaulted after running away; the fact that the young person’s medical record \nwas poorly kept, and the lack of care and follow -up for more than two weeks when she \nhad injuries to her hands; and the imposition of abusive or inadequate re straint and \nisolation measures.  \n[8] The tribunal recommended and ordered a series of corrective measures. \nFour of them were later challenged by the DYP, who took the view that they went \nbeyond the corrective powers conferred on the tribunal by s.  91 para.  4 of the YPA \nbecause they did not relate directly to the young person’s situation. The four corrective \nmeasures in question were worded as follows:  \n [TRANSLATION ] \n AS CORRECTIVE MEASURES:  \n [340]  ORDERS  that the youth workers, educators and intervention \nofficer s who work in the individualized treatment units be able to receive \nspecific training on mental health and report back to the Commission des \ndroits de la personne et des droits de la jeunesse;  \n [341]  ORDERS  that the individualized treatment units",
    "token_count": 1000,
    "start_token": 9900,
    "end_token": 10900,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 12,
    "source_file": "2024scc43.txt",
    "text": " corrective \nmeasures in question were worded as follows:  \n [TRANSLATION ] \n AS CORRECTIVE MEASURES:  \n [340]  ORDERS  that the youth workers, educators and intervention \nofficer s who work in the individualized treatment units be able to receive \nspecific training on mental health and report back to the Commission des \ndroits de la personne et des droits de la jeunesse;  \n [341]  ORDERS  that the individualized treatment units be able to \nobtain support from a healthcare professional specializing in mental health \nand report back to the Commission des droits de la personne et des droits \nde la jeunesse;  \n . . . \n [345]  ORDERS  that the Centre i ntégré de santé et de services \nsociaux  A implement a protocol within a reasonable time period that sets \nout the steps to be taken when a child spits during an intervention and \nreport back to the Commission des droits de la personne et des droits de la \njeunesse;  \n [346]  ORDERS  that the Centre intégré de santé et de services \nsociaux  A adapt all isolation rooms so that they are safer and their walls \nare covered with a material that prevents injury;  \n2024 SCC 43 (CanLII)\n\n--- Page 27 ---\n \n B. Quebec Superior Court, 2021 QCCS 2251  \n[9] The appellant, the Commis sion des droits de la personne et des droits de la \njeunesse (“CDPDJ”), intervened for the first time before the Superior Court to argue \nthat s.  91 para.  4 of the YPA gives the tribunal broad corrective powers allowing it \n[TRANSLATION ] “to make general orde rs . . . not specifically intended to correct the \nsituation experienced by the child, but rather by children who may experience the same \nsituation” (para.  19). \n[10] The Superior Court judge allowed the DYP’s appeal in part. With regard \nto the applicable standar d for intervention, he found that the question at issue was a \nquestion of law, in respect of which the court could intervene unreservedly if an error \nhad been made. Relying mainly on the Quebec Court of Appeal’s decision in Protection \nde la jeunesse – 1239 79, 2012 QCCA 1483, [2012] R.J.Q. 1603, he then held that the \nfour impugned orders exceeded the powers conferred on the tribunal by the legislature \nbecause they applied to children other than the one whose situation had been referred \nto the tribunal. On co mpleting his analysis, he decided to vary the impugned orders so \nthat they applied specifically to the young person’s situation and they named her \nexpressly. The Superior Court judge’s decision was subsequently appealed by the \nCDPDJ, by the young person an d by her parents, the interveners A and B.  \nC. Quebec Court of Appeal, 2022 QCCA 1653  \n(1) Majority Reasons  \n2024 SCC 43 (CanLII)\n\n--- Page 28 ---\n \n [11] Like the Superior Court judge, the majority of the Court of Appeal found \nthat the four impugned orders were [ TRANSLATION ] “general in nature” (para.  78), went \n“beyond [the] situation” of the child who was the subject of the proceedings (para.  80) \nand therefore had to be narrowed. However, the majority was of the view that the orders \nset out at paras.  345-46 could not be made against the CISSS A because the latter was \nnot formally a party to the proceedings at first instance. The majority accordingly \nallowed the appeal in part for the sole purpose of correcting the orders set out at \nparas.  345-46 of the tribunal’s judgment, which had previously been varied by  the \nSuperior Court judge, so that the orders were directed at the DYP and not the CISSS A \n(paras.  2 and 82 -83). \n[12] According to the majority, the issue was [ TRANSLATION ] “[w]hether \nsection  91 in fine  allows [the tribunal] to order institutions or public bodi es to take \nmeasures that require assigning a portion of their available funds to a specific purpose” \n(para.  70). This was therefore a question of law that the majority answered in the \nnegative. In the majority’s view, only a [ TRANSLATION ] “clear and explic it” legal rule \nallows courts to order an allocation of public funds for specific purposes, and s.  91 \nin fine of the",
    "token_count": 1000,
    "start_token": 10800,
    "end_token": 11800,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 13,
    "source_file": "2024scc43.txt",
    "text": " [the tribunal] to order institutions or public bodi es to take \nmeasures that require assigning a portion of their available funds to a specific purpose” \n(para.  70). This was therefore a question of law that the majority answered in the \nnegative. In the majority’s view, only a [ TRANSLATION ] “clear and explic it” legal rule \nallows courts to order an allocation of public funds for specific purposes, and s.  91 \nin fine of the YPA does not fit this definition (para.  67; see also para.  68). This means \nthat the tribunal does not have, under this section, a [ TRANSLATI ON] “general power of \nintervention or review of the decisions that institutions or bodies are required to make \nabout their operations, organization, or premises” (para.  75). \n2024 SCC 43 (CanLII)\n\n--- Page 29 ---\n \n [13] It follows from the above that a corrective measure may be ordered only if \nit is [ TRANSLATION ] “limited to that which is necessary to correct the situation or \nprevent its recurrence with respect to [the] child in particular” (para.  76). Moreover, \nsuch an order must not [ TRANSLATION ] “interfere in the management of the resources \navailabl e to the institutions or bodies concerned” (para.  77). The majority thus found \nthat even where a corrective measure addresses the situation that encroached upon the \nchild’s rights and is limited solely to what is necessary to prevent the recurrence of that  \nsituation, the order imposing the measure might still be invalid if its budgetary impact \nis too significant. According to the majority, the financial impact of an order determines \n[TRANSLATION ] “whether the court is allowed to make it” (para.  81). \n(2) Concurr ing Reasons  \n[14] The concurring judge would have allowed the appeals in part and restored \nthe orders made at paras.  345-46 of the tribunal’s judgment while indicating that they \nshould be directed against the DYP rather than the CISSS A. He would also have \nspeci fied that only the isolation rooms in units A and B of the RCYPAPs of the \nCISSS  A had to be made safer (paras.  3 and 56 -59). \n[15] In his view, while it is true that there [ TRANSLATION ] “must .  . . be a \nconnection between the corrective order and the child whose  rights were wronged”, it \nis not “necessary that the remedial measure apply only to the child who has been a \nvictim of the wrong” (para.  36). Everything depends on what is revealed by the \nevidence. More specifically, [ TRANSLATION ] “[w]hen it is proven .  . . that the source of \n2024 SCC 43 (CanLII)\n\n--- Page 30 ---\n \n the problem that led to the wrong is institutional or systemic in nature and that the \nwrong may have been caused by multiple people or multiple institutions or by the state \nof the premises, Court of Québec judges may make orders to rem edy the wrongful \nsituation at its source” (para.  38). \n[16] It follows from the above that the tribunal may order a corrective measure \nof general application as long as the evidence shows that the encroachment experienced \nby the child resulted from [ TRANSLATION ] “a generalized practice or situation” \n(para.  39). The financial impact of such a measure on the DYP should not prevent the \ntribunal from making corrective orders that are permitted by the YPA and required by \nthe circumstances of a case.  \nIV. Issues  \n[17] The appeal raises the following question: What is the scope of the \ncorrective powers that the legislature intended to confer on the tribunal in s.  91 para.  4 \nof the YPA? More specifically, did the legislature intend that the tribunal only be able \nto order corrective measures to prevent the recurrence of a situation of encroachment \nfor the child whose rights were encroached upon, or did it intend that the tribunal also \nbe able to order corrective measures to prevent the same situation of encroachment \nfrom occurring for  any other child who might be faced with it?  \n[18] The appeal also raises a secondary question regarding whether, in the \ncircumstances, it was possible for the tribunal to make orders against the CISSS A in \n2024 SCC 43 (CanLII)\n\n--- Page 31 ---\n \n view of its right to be “heard” or “duly called” pursua nt to art",
    "token_count": 1000,
    "start_token": 11700,
    "end_token": 12700,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 14,
    "source_file": "2024scc43.txt",
    "text": " corrective measures to prevent the same situation of encroachment \nfrom occurring for  any other child who might be faced with it?  \n[18] The appeal also raises a secondary question regarding whether, in the \ncircumstances, it was possible for the tribunal to make orders against the CISSS A in \n2024 SCC 43 (CanLII)\n\n--- Page 31 ---\n \n view of its right to be “heard” or “duly called” pursua nt to art.  17 para.  1 of the Code \nof Civil Procedure , CQLR, c.  C-25.01 (“ C.C.P. ”). \n[19] On the basis of my analysis, I conclude that the legislature intended to \nconfer on the tribunal the corrective powers needed to ensure the fullest protection of \nthe interest s and rights of the child before it. In practical terms, this means that the \ntribunal may order corrective measures whose purpose is (1)  to put an end to the \nsituation of encroachment where it is still encroaching upon the child’s rights; (2)  to \nremedy the  psychological or physical consequences for the child resulting from the \nencroachment upon rights; and (3)  to prevent the recurrence of the situation of \nencroachment for the child.  \n[20] In my view, any corrective measure that is ordered must protect the \ninteres ts and rights of the child whose situation has been referred to the tribunal. This \nmeans that a preventive corrective measure may be ordered only if the child whose \nrights have been encroached upon is at risk of being subjected to the situation of \nencroach ment again. Where this is the case, the tribunal may order any corrective \nmeasure that can effectively help to prevent the recurrence of the situation of \nencroachment, provided that the measure is related to the protection of the child’s \ninterests and righ ts. The budgetary impact of the corrective measure has no bearing on \nits validity.  \n[21] Contrary to what is suggested by the DYP, the Superior Court judge and \nthe majority of the Court of Appeal, it is not necessary for corrective measures to \n2024 SCC 43 (CanLII)\n\n--- Page 32 ---\n \n specifically menti on the child’s name in order for the measures to be related to the \nprotection of the child’s interests and rights. Moreover, depending on the circumstances \nand the evidence adduced, it is possible for a broad corrective measure — that corrects, \nfor example , an institutional factor at the source of the situation of encroachment — to \nbe a measure related to the protection of the child’s interests and rights. Such corrective \nmeasures will generally have the advantage of protecting the interests and rights of \nmany other children in an indirect and incidental manner.  \n[22] With regard to the question of the CISSS A’s right to be heard or duly \ncalled (art.  17 para.  1 C.C.P. ), the appellant has not satisfied me that there is reason to \nintervene to restore the orders so a s to direct them, as the tribunal did, against the CISSS \nA. \nV. Analysis  \nA. Judicial Intervention in Cases of Encroachment Upon Rights: Scope of the \nCorrective Powers Conferred on the Tribunal Under Section 91 Paragraph 4 of \nthe YPA  \n(1) Principles That Must Guide the  Interpretive Exercise  \n[23] It is well settled that “the words of an Act are to be read in their entire \ncontext and in their grammatical and ordinary sense harmoniously with the scheme of \nthe Act, the object of the Act, and the intention of Parliament” (E.  A. Driedger, \nConstruction of Statutes  (2nd ed. 1983), at p.  87, quoted in Rizzo & Rizzo Shoes Ltd. \n2024 SCC 43 (CanLII)\n\n--- Page 33 ---\n \n (Re), [1998] 1 S.C.R. 27, at para.  21; Bell ExpressVu Limited Partnership v. Rex , 2002 \nSCC 42, [2002] 2 S.C.R. 559, at para.  26; La Presse inc. v. Quebec , 2023 S CC 22, at \npara.  22). \n[24] In this case, it is important to highlight a few principles that guide the \ninterpretation of s.  91 para.  4 of the YPA. First, the YPA must be given a large and \nliberal interpretation that will ensure the attainment of its object and th e carrying out of \nits provisions according to their true",
    "token_count": 1000,
    "start_token": 12600,
    "end_token": 13600,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 15,
    "source_file": "2024scc43.txt",
    "text": "; La Presse inc. v. Quebec , 2023 S CC 22, at \npara.  22). \n[24] In this case, it is important to highlight a few principles that guide the \ninterpretation of s.  91 para.  4 of the YPA. First, the YPA must be given a large and \nliberal interpretation that will ensure the attainment of its object and th e carrying out of \nits provisions according to their true intent, meaning and spirit (see Interpretation Act , \nCQLR, c.  I-16, s.  41; Protection de la jeunesse – 123979 , at para.  21). However, just \nas the text must be considered in light of the context and ob ject, the object of a statute \nand that of a provision must be considered with close attention always being paid to \nthe text of the statute, which remains the anchor of the interpretive exercise. The text \nspecifies, among other things, the means chosen by t he legislature to achieve its \npurposes. These means “may disclose qualifications to primary purposes, and this is \nwhy the text remains the focus of interpretation” (M.  Mancini, “The Purpose Error in \nthe Modern Approach to Statutory Interpretation” (2022), 59 Alta. L. Rev.  919, at \np. 927; see also pp.  930-31). In other words, they may “tell an interpreter just how far \na legislature wanted to go in achieving some more abstract goal” (p.  927). As this Court \nrecently noted, an interpreter must “interpret the ‘t ext through which the legislature \nseeks to achieve [its] objective’, because ‘the goal of the interpretative exercise is to \nfind harmony between the words of the statute and the intended objective  . . .’” (R. v. \nBreault , 2023 SCC 9, at para.  26, quoting MediaQMI inc. v. Kamel , 2021 SCC 23, \n2024 SCC 43 (CanLII)\n\n--- Page 34 ---\n \n [2021] 1 S.C.R. 899, at para.  39; see also Quebec (Attorney General) v. 9147 -0732 \nQuébec inc. , 2020 SCC 32, [2020] 3 S.C.R. 426, at para.  10). \n[25] Second, every provision of the YPA must be interpreted in accordance with \nthe Charter of human rights and freedoms , CQLR, c.  C-12 (“ Quebec Charter ”), which \nis a source of fundamental law. It is especially important to bear in mind s.  39 of the \nQuebec Charter , which enshrines the right of every child “to the protection, security \nand attention that his parents or the persons acting in their stead are capable of \nproviding”. While this Court has already stated in  obiter , in a case that concerned \nneither the YPA nor the normative scope of s.  39, that this provision “do[es] not directly \nimplicate the state at all” ( Gosselin v. Quebec (Attorney General) , 2002 SCC 84, [2002] \n4 S.C.R. 429, at para.  89), it is clear that this section applies when the state, through a \ndirector of youth protection, exercises attributes of parental authority (se e, e.g., YPA, \ns. 91 para.  1(n); Civil Code of Québec , arts.  186 and 199). There is also no doubt that \nthis section is relevant in interpreting the YPA’s provisions, including provisions like \ns. 91 para.  4 that may affect the state’s rights and obligations.  Indeed, since 2022, the \nlegislature has expressly referred to s.  39 of the Quebec Charter  in the preamble to the \nYPA, which only confirms the interpretive value of this provision in explaining the \nobject and purport of any provision of the YPA (see Interp retation Act , s. 40 para.  1; \nQuebec Charter , s. 53; Quebec (Commission des normes, de l’équité, de la santé et de \nla sécurité du travail) v. Caron , 2018 SCC 3, [2018] 1 S.C.R. 35, at paras.  32-33, \nquoting Quebec (Commission des droits de la personne et des  droits de la jeunesse) v. \nComm",
    "token_count": 1000,
    "start_token": 13500,
    "end_token": 14500,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 16,
    "source_file": "2024scc43.txt",
    "text": " 40 para.  1; \nQuebec Charter , s. 53; Quebec (Commission des normes, de l’équité, de la santé et de \nla sécurité du travail) v. Caron , 2018 SCC 3, [2018] 1 S.C.R. 35, at paras.  32-33, \nquoting Quebec (Commission des droits de la personne et des  droits de la jeunesse) v. \nCommunauté urbaine de Montréal , 2004 SCC 30, [2004] 1 S.C.R. 789, at para.  20). \n2024 SCC 43 (CanLII)\n\n--- Page 35 ---\n \n [26] Third, in the interpretation of any provision of the YPA, it is important to \nbear in mind the Convention on the Rights of the Child , Can. T.S. 1992 N o. 3 (“CRC ”), \nwhich was ratified by Canada on December  13, 1991, and by which Quebec declared \nitself to be bound through an order in council (see Décret  1676 -91, (1992) 124 G.O. II, \n51; YPA, preamble (ad. 2022, c.  11, s.  1)). In keeping with the presumptio n of \nconformity, the YPA must be interpreted in a manner consistent with Canada’s \nobligations under the CRC , insofar as the text allows. While the interpretive weight of \nthis international instrument is undeniable, I note that the analysis must remain focu sed \non the legislature’s intention and not on the obligational content of the treaty. It is \nimperative to interpret first and foremost “what the legislature (federally and \nprovincially) has enacted” rather than subordinating the result of this exercise to what \nthe federal executive has agreed to internationally or to the international treaties by \nwhich a provincial executive has declared its intention to be bound through an order in \ncouncil. This is a matter of respect for the principle of separation of pow ers (Society of \nComposers, Authors and Music Publishers of Canada v. Entertainment Software \nAssociation , 2022 SCC 30, at para.  48; see also paras.  45-47; Kazemi Estate v. Islamic \nRepublic of Iran , 2014 SCC 62, [2014] 3 S.C.R. 176, at para.  60; R. v. Hape , 2007 SCC \n26, [2007] 2 S.C.R. 292, at paras.  53-54; Michel v. Graydon , 2020 SCC 24, [2020] 2 \nS.C.R. 763, at para.  103, per Martin  J., concurring; P. -A. Côté and M.  Devinat, \nInterprétation des lois  (5th ed. 2021), at paras.  1301 -7). \n[27] Finally, I note that, in the interpretation of a provision like s.  91 para.  4, \nwhich authorizes a statutory tribunal to exercise certain powers, the principle of \n2024 SCC 43 (CanLII)\n\n--- Page 36 ---\n \n separation of powers does not automatically limit the scope of the powers conferred on \nthat tr ibunal by the legislature. Rather, the principle of separation of powers requires \nthat full effect be given to the legislature’s intention as revealed by the interpretation \nof this enabling provision under the modern approach to interpretation. There is no  rule \nwhereby the legislature is presumed to intend to limit the powers it confers on a \nstatutory tribunal on the basis of the magnitude of the budgetary impact of their exercise \n(see Ontario v. Criminal Lawyers’ Association of Ontario , 2013 SCC 43, [2013]  3 \nS.C.R. 3, at paras.  15 and 28). To the extent that the reasons of the majority of the \nQuebec Court of Appeal suggest otherwise, they are wrong in law.  \n(2) Interpretation of Section 91 Paragraph 4 of the YPA \n[28] The starting point in any interpretive exercise is  the text of the provision. \nIn the absence of statutory definitions, what should be focused on is the grammatical \nand ordinary meaning of the text, that is, “the natural meaning” that appears when the \nprovision is simply read through as a whole ( Canadian P acific Air Lines Ltd. v. \nCanadian Air Line Pilots Assn. , [1993] 3",
    "token_count": 1000,
    "start_token": 14400,
    "end_token": 15400,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 17,
    "source_file": "2024scc43.txt",
    "text": " 4 of the YPA \n[28] The starting point in any interpretive exercise is  the text of the provision. \nIn the absence of statutory definitions, what should be focused on is the grammatical \nand ordinary meaning of the text, that is, “the natural meaning” that appears when the \nprovision is simply read through as a whole ( Canadian P acific Air Lines Ltd. v. \nCanadian Air Line Pilots Assn. , [1993] 3 S.C.R. 724, at p.  735, quoted in R.  Sullivan, \nThe Construction of Statutes  (7th ed. 2022), at §  3.02[1]; see also R. v. Audet , [1996] 2 \nS.C.R. 171, at para.  34). For ease of reference, I wil l reproduce the text of s.  91 here:  \n 91. Where the tribunal concludes that the security or development of the \nchild is in danger, it may, for the period it determines, order the \nimplementation of one or more of the following measures:  \n  (a) that the child remain with his family or be entrusted to one of his \nparents and that the child’s parents report periodically to the director on \nthe measures they apply in their own regard or in their child’s regard to put \n2024 SCC 43 (CanLII)\n\n--- Page 37 ---\n \n an end to the situation in which the security or development of the child is \nin danger;  \n  (b) that the child and the child’s parents take an active part in the \napplication of any of the measures ordered by the tribunal;  \n  (c) that certain persons designated by the tribunal not come into contact \nwith the child;  \n  (d) that the child not come into contact with certain persons designated \nby the tribunal;  \n  (e) that the child be entrusted to other persons;  \n  (e.1) that the child be entrusted to a kinship foster family chosen by the \ninstitution operating a chil d and youth protection centre;  \n  (f) that a person working for an institution or body provide aid, \ncounselling or assistance to the child and the child’s family;  \n  (g) that the child be entrusted to an institution operating a hospital centre \nor local commu nity service centre or to another body so that he may receive \nthe care and assistance he needs;  \n  (h) that the child or the child’s parents report in person, at regular \nintervals, to the director to inform him of the current situation;  \n  (i) that the child  receive specific health care and health services;  \n  (j) that the child be entrusted to an institution operating a rehabilitation \ncentre or to a foster family, chosen by the institution operating a child and \nyouth protection centre;  \n  (k) that the child at tend a school or another place of learning or \nparticipates in a program geared to developing skills and autonomy;  \n  (l) that the child attend a childcare establishment;  \n  (l.1) that specific information not be disclosed to one or both of the \nparents or any  other person designated by the tribunal;  \n  (m) that a person ensure that the child and his parents comply with the \nconditions imposed on them and that that person periodically report to the \ndirector;  \n  (n) that the exercise of certain attributes of parent al authority be \nwithdrawn from the parents and granted to the director or any other person \ndesignated by the tribunal;  \n2024 SCC 43 (CanLII)\n\n--- Page 38 ---\n \n   (o) that a period over which the child will be gradually returned to his \nfamily or social environment be determined.  \n  The tribunal may  make any recommendation it considers to be in the \ninterest of the child.  \n  The tribunal may include several measures in the same order, provided \nthose measures are consistent with each other and in the interest of the \nchild. It may thus authorize that per sonal relations between the child and \nthe child’s parents, grandparents or another person be maintained, in the \nmanner determined by the tribunal; it may also provide for more than one \nenvironment to which the child may be entrusted and state how long the \nchild is to stay in each of those environments.  \n  Where the tribunal concludes that the rights of a child  in difficulty have \nbeen wronged by persons, bodies or institutions, it may order the situation \nto be corrected . \n[29] In this case, special attention should  be paid to the fourth paragraph, \nparticularly the passage stating that the tribunal may order “the situation to be \ncorrected”.  \n(a) Text \n",
    "token_count": 1000,
    "start_token": 15300,
    "end_token": 16300,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 18,
    "source_file": "2024scc43.txt",
    "text": " child may be entrusted and state how long the \nchild is to stay in each of those environments.  \n  Where the tribunal concludes that the rights of a child  in difficulty have \nbeen wronged by persons, bodies or institutions, it may order the situation \nto be corrected . \n[29] In this case, special attention should  be paid to the fourth paragraph, \nparticularly the passage stating that the tribunal may order “the situation to be \ncorrected”.  \n(a) Text \n(i) The Verb “Correct” (“ Corriger ”) \n[30] The verb “correct” (“ corriger ” in the French version) is not defined in the \nYPA. It is an open -ended term with a high level of generality, especially when \ncompared with the exhaustive and detailed list of the powers that the tribunal has where \nit concludes that a child’s security or development is in danger (s.  91 para.  1). Indeed, \na comparativ e reading of the words used by the legislature to describe the tribunal’s \npowers where a child’s security or development is in danger (s.  91 paras.  1 to 3) and its \n2024 SCC 43 (CanLII)\n\n--- Page 39 ---\n \n powers where a child’s rights have been encroached upon (s.  91 para.  4) suggests that \nthe le gislature has deliberately allowed the tribunal some latitude and creativity in cases \nof encroachment upon rights as regards the corrective measures that may be ordered \n(see Canada (Minister of Citizenship and Immigration) v. Vavilov , 2019 SCC 65, \n[2019] 4  S.C.R. 653, at para.  110; Ricard, at p.  632).  \n[31] When the provision is read as a whole, the verb “correct” evokes the idea \nof “redressing”, “rectifying” or “remedying” the situation. This ordinary meaning also \nfinds support in some of the dictionary definiti ons of the equivalent French verb \n“corriger ”. For example, Le Grand Robert de la langue française  (electronic version) \nstates that the verb “ corriger ” may mean [ TRANSLATION ] “[t]o bring back to a moral or \nsocietal norm (that which departs from it)” or “[t]o bring back into line (something \nexcessive) through opposite action.” Similarly, the Dictionnaire Larousse  (online) \nstates that “ corriger ” may mean [ TRANSLATION ] “to recti fy that which is deficient” or \nto re-establish “what is right, proper, correct”.  \n[32] It is important to note that the ordinary meaning of the verb “correct” or \n“corriger ” that appears when s.  91 is read is consistent with the meaning that emerges \nfrom a readin g of the other two provisions that use the verb “ corriger ” in French with \n“remedy” as the English equivalent. First, s.  23(c) states that the CDPDJ “shall take the \nlegal means it considers necessary to remedy  any situation where the rights of a child \nare b eing encroached upon”. Second, s.  25.2 provides that the CDPDJ “may \nrecommend the cessation of the alleged act or the carrying out, within the time it may \n2024 SCC 43 (CanLII)\n\n--- Page 40 ---\n \n fix, of any measure designed to remedy  the situation”. In these two provisions, the verb \n“corriger ” or “remedy” is also used in relation to “ la situation ” (“any situation” or “the \nsituation” in English) in the context of encroachment upon rights. As in s.  91 para.  4, \nthe verb “ corriger ” evokes the idea of bringing back into line or back to normal that \nwhich is not.  \n(ii) The Words “the Situation” (“ la Situation ”) \n[33] The word “ situation ” (“situation ” in the French version) is not defined in \nthe YPA and has a high level of generality as well. Moreover, when the provision is \nread as a whole, its ordinary meaning is am biguous in the context. Does it refer to “the \nsituation at the source of  the encroachment upon rights ”, “the situation of the child \nwhose rights have been or are being encroached upon ”, or both?  \n[34] On the one hand, the use of the definite determiner “ la” in s . 91 para.  4 (“la \nsituation ”",
    "token_count": 1000,
    "start_token": 16200,
    "end_token": 17200,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 19,
    "source_file": "2024scc43.txt",
    "text": " the provision is \nread as a whole, its ordinary meaning is am biguous in the context. Does it refer to “the \nsituation at the source of  the encroachment upon rights ”, “the situation of the child \nwhose rights have been or are being encroached upon ”, or both?  \n[34] On the one hand, the use of the definite determiner “ la” in s . 91 para.  4 (“la \nsituation ”, or “ the situation” in English) rather than the possessive “ sa” (“sa situation ”, \nor “his situation” in English) may suggest that it is the situation of encroachment in \nquestion, that is, the situation at the source of the encro achment upon rights. This \ninterpretation would thus be consistent with one of the common meanings of the French \nword “ situation ”, that is, [ TRANSLATION ] “[a]ll of the circumstances” that a person or \nthing is in, or “all of the relations” linking a person t o a social environment ( Le Grand \nRobert de la langue française ; see also Dictionnaire Larousse ). Similarly, the \nDictionnaire de l’Académie française  (9th ed. (online)) indicates that the word \n“situation ” may mean [ TRANSLATION ] “all of the conditions in which [a person] finds \n2024 SCC 43 (CanLII)\n\n--- Page 41 ---\n \n themself”. The fact that the words “ la situation ” or “the situation” refer to the situation \nof encroachment is also supported by other provisions of the YPA that deal with \nencroachment upon rights and refer to “ la situation ” in Frenc h, including s.  23(c), \nwhich in English states that the CDPDJ “shall take the legal means it considers \nnecessary to remedy any situation where the rights of a child are being encroached \nupon ” (see also YPA, s. 74.1 para.  2). \n[35] On the other hand, what is evid ent from reading s.  91 as a whole is that, in \nthe case of both danger to security or development and encroachment upon rights, the \ntribunal has been given a series of powers to protect a vulnerable child whose situation \nhas been referred to it. With this i n mind, it therefore seems entirely plausible that the \nFrench word “ situation ” refers here to the state, both psychological and physical, of the \nchild whose rights have been encroached upon. This meaning, which appears when the \nprovision is read as a whole , also finds support in the dictionaries. Le Grand Robert de \nla langue française  indicates that the word “ situation ” may refer to a person’s \n[TRANSLATION ] “[m]ental disposition” or “psychological state”. The  Dictionnaire de \nl’Académie française  indicates t hat the word “ situation ” may mean the [ TRANSLATION ] \n“[s]tate of a person, of a thing at a particular time”. Moreover, one of the definitions of \nthe term “ situation ” given by the Trésor de la Langue Française informatisé  (online) \nis also to the same effect:  [TRANSLATION ] “All of the physical or mental conditions in \nwhich a person finds themself”.  \n(iii) Conclusion  \n2024 SCC 43 (CanLII)\n\n--- Page 42 ---\n \n [36] Consideration of the grammatical and ordinary meaning of the phrase “the \nsituation to be corrected” leads to the conclusion that the legislature intended  to grant \nthe tribunal corrective powers that allow it to redress a situation, to restore order or the \nnormal state of affairs. However, this consideration does not make it possible to say \nwith certainty which situation is in question. Is it the circumstan ces at the source of the \nencroachment upon rights? Is it the child’s psychological and physical state? Or is it \nboth? Furthermore, consideration of the grammatical and ordinary meaning of the \nphrase is of little assistance in determining whether the legisl ature’s intention in \ngranting the tribunal the corrective powers set out in s.  91 para.  4 was that, in exercising \nthem, the tribunal concern itself exclusively with protecting the rights and interests of \nthe child whose situation has been referred to it, o r whether the legislature also intended \nthat the tribunal concern itself with protecting the rights and interests of all other \nchildren who, though not the subject of the proceedings, are or may find themselves in \nthe same situation of encroachment as the child before the tribunal.  \n(b) Scheme of the YPA",
    "token_count": 1000,
    "start_token": 17100,
    "end_token": 18100,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 20,
    "source_file": "2024scc43.txt",
    "text": "91 para.  4 was that, in exercising \nthem, the tribunal concern itself exclusively with protecting the rights and interests of \nthe child whose situation has been referred to it, o r whether the legislature also intended \nthat the tribunal concern itself with protecting the rights and interests of all other \nchildren who, though not the subject of the proceedings, are or may find themselves in \nthe same situation of encroachment as the child before the tribunal.  \n(b) Scheme of the YPA  \n[37] An analysis of the scheme of the YPA sheds helpful light on the question \nat the centre of the disagreement between the parties, that is, whether the legislature \nintended that the tribunal be able to order correc tive measures aimed in whole or in part \nat protecting the rights and interests of children whose situations have not been referred \nto it but who may find themselves in the same situation of encroachment as the child \nbefore it. The analysis suggests that th is is not the case.  \n2024 SCC 43 (CanLII)\n\n--- Page 43 ---\n \n (i) The Tribunal’s Mandate Is To Render Justice in an Individualized and \nParticularized Manner on the Basis of the Interests and Rights of the Child \nWhose Situation Has Been Referred to It  \n[38] Judicial intervention under the YPA is generally co nceived of as an avenue \nof last resort, unless there are particular circumstances that justify prioritizing the \njudicial process over voluntary measures. To the extent possible, clinical teams \nrepresenting the youth protection directors seek to intervene i n the life of a child in \ndifficulty and of the child’s family on a consensual basis, in accordance with the logic \nof de -judicialization that informs the youth protection system. However, where \nconsensus is not possible, the YPA provides for intervention by  the tribunal (see, e.g., \nss. 47.1, 51 to 51.8, 52 et seq., and Chapter V “Judicial Intervention”; see also Ricard, \nat pp.  612-13; R.  Joyal and M.  Provost, “La Loi sur la protection de la jeunesse  de \n1977: une maturation laborieuse, un texte porteur”, in R . Joyal, ed., L’évolution de la \nprotection de l’enfance au Québec: des origines à nos jours  (2000), 179, at p.  181).  \n[39] The scheme of the YPA shows that the legislature intended the tribunal’s \nintervention to be guided by the logic of individualized and particularized justice based \non the interests and rights of the particular child whose situation has been referred to \nit. With a view to ensuri ng functional complementarity between social intervention and \njudicial intervention, the tribunal, like the representatives of the youth protection \ndirectors, must make decisions that are “in the interest of the child and respect his \nrights” (s.  3 para.  1), the ultimate goal being [ TRANSLATION ] “to limit any danger to the \nchild’s security and development, but also to prevent abuse” (E.  Bernheim and \n2024 SCC 43 (CanLII)\n\n--- Page 44 ---\n \n M. Coupienne, “Faire valoir ses droits à la Chambre de la jeunesse: état des lieux des \nbarrières structurelles  à l’accès à la justice des familles” (2019), 32 Can. J. Fam. L.  \n237, at pp.  262-63, citing L.  Mercier, “Contexte d’autorité et judiciarisation: régression \nou redéfinition novatrice de la pratique sociale professionnelle?” (1991), 40:2 Service  \nsocial  43, a t p. 49; see also YPA, ss. 47.1, 51 to 51.8 and 52 et seq.; R.F., at paras.  41 \nand 59, citing Lamothe v. Ruffo , [1998] R.J.Q. 1815 (Sup. Ct.), at p.  1822; Ricard, at \npp. 612-13 and 636). Since every child is unique, these matters are considered on a \ncase-by-case basis. This is an intrinsically contextual analysis that must take into \naccount, “[i]n addition to the moral, intellectual, emotional and material needs of the \nchild, his age, health, personality and family environment and the other aspects of his \nsituation” (s.  3 para.  2; see also Gordon",
    "token_count": 1000,
    "start_token": 18000,
    "end_token": 19000,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 21,
    "source_file": "2024scc43.txt",
    "text": ", at \npp. 612-13 and 636). Since every child is unique, these matters are considered on a \ncase-by-case basis. This is an intrinsically contextual analysis that must take into \naccount, “[i]n addition to the moral, intellectual, emotional and material needs of the \nchild, his age, health, personality and family environment and the other aspects of his \nsituation” (s.  3 para.  2; see also Gordon v. Goertz , [1996] 2 S.C.R. 27, at paras.  38 and \n44; A.C. v. Manitoba (Director of Child and Family Services) , 2009 SCC 30, [2009] 2 \nS.C.R. 181, at paras.  89-90; Barendregt v. Grebliunas , 2022 SCC 22, at para.  97; B.J.T. \nv. J.D. , 2022 SCC 24, at para.  53). \n[40] The fact that the tribunal is called upon to render justice in an \nindividualized and particularized manner on the basis of a single child’s situation is \nalso clear from all of the provisions relating to the tribunal ’s jurisdiction, including \nthose in Chapter V of the YPA, which delineates the scope of judicial intervention. For \nexample, s.  73 para.  1 provides that the tribunal “shall hear the case of a child ”. Section \n74.1 para.  1 states that the director or the CDPD J “may refer to the tribunal the case of \na child  whose security or development is considered to be in danger”. In addition, with \nregard to encroachment upon rights, the YPA provides that the CDPDJ “shall take the \n2024 SCC 43 (CanLII)\n\n--- Page 45 ---\n \n legal means it considers necessary to remed y any situation where the rights of a child  \nare being encroached upon” (s.  23(c)). For this purpose, it may “refer to the tribunal \nany situation where it has reason to believe that the rights of the child  have been \nwronged by persons, bodies or institution s” (s.  74.1 para.  2; see also s.  25.3). Similarly, \n“[a] child  or his parents  may apply to the tribunal where they disagree” with a decision \nmade in their case (s.  74.2). The legislature has expressly provided for just one \nexception to this rule. After taki ng into consideration the opinions of the parties, the \ntribunal may deal with the individual situations of several children at the same time if \nthey have the same parent and if, in doing so, there is no risk of prejudice to any of \nthem. However, even in su ch circumstances, in keeping with the individualized and \nparticularized conception of judicial intervention that imbues the entire YPA, the \ntribunal must make “separate orders for each child in accordance with section \n91”(s.  73.1).  \n[41] I note that no provision  of the YPA reveals an intention to depart from this \nlogic of individualized and particularized justice that runs throughout the YPA when it \ncomes to encroachment upon rights.  To give the tribunal the power to order preventive \ncorrective measures to protec t the interests and rights of children whose situations have \nnot been referred to it, the legislature could have granted the CDPDJ the power to apply \nto the tribunal for corrective measures in the public interest, as the legislature did for \nthe Human Right s Tribunal in cases of discrimination (see Quebec Charter , s. 80; \nQuebec (Commission des droits de la personne et des droits de la jeunesse) v. \nBombardier Inc. (Bombardier Aerospace Training Center) , 2015 SCC 39, [2015] 2 \n2024 SCC 43 (CanLII)\n\n--- Page 46 ---\n \n S.C.R. 789, at paras.  102-5). Simi larly, it could have indicated that the tribunal, in its \ndecisions, must concern itself with the “interests of children”, as it did in describing the \nresponsibilities of the Minister of Health and Social Services (see, e.g., YPA, s. 28 (ad. \n2022, c.  11, s.  16)). But it did not do so. In short, it appears that the legislature did not \nintend to grant the tribunal the power to order corrective measures “that transcend the \ncase",
    "token_count": 1000,
    "start_token": 18900,
    "end_token": 19900,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 22,
    "source_file": "2024scc43.txt",
    "text": " \ndecisions, must concern itself with the “interests of children”, as it did in describing the \nresponsibilities of the Minister of Health and Social Services (see, e.g., YPA, s. 28 (ad. \n2022, c.  11, s.  16)). But it did not do so. In short, it appears that the legislature did not \nintend to grant the tribunal the power to order corrective measures “that transcend the \ncase before it” ( Bombardier , at para.  102).  \n[42] Finally, even if it were to be concluded, as the CDPDJ suggests (A.F., at \npara.  50; transcript, at pp.  21-22), that the combined effect of ss.  23(b), 25.2 and 25.3 \nis to depart from this logic of individualized and particularized justice by allowing the \ntribunal to make broad orders to protect the in terests and rights of children whose \nsituations have not been referred to it but have been investigated by the CDPDJ, this \nwould be of only limited relevance in this case. This is because the tribunal was dealing \nin the present case with a single child’s s ituation, which had not been investigated by \nthe CDPDJ. This is a very different scenario, which it is important to distinguish.  \n(ii) Other Actors Are Responsible for Looking at the System as a Whole and \nReforming It  \n[43] The conclusion that the tribunal must render  justice in an individualized \nand particularized manner on the basis of the interests and rights of the child whose \nsituation has been referred to it is also supported by the fact that other actors have been \ngiven a mandate to examine the system as a whole , to identify its shortcomings and to \nreform it, taking into consideration the interests of children who are the subject of \n2024 SCC 43 (CanLII)\n\n--- Page 47 ---\n \n intervention under the YPA. In this context, it is all the more plausible that the \nlegislature intended to limit the tribunal’s role. \n[44] Consideration of the scheme of the YPA shows that the Quebec legislature \nviews the protection of the province’s young people as a collective responsibility. It \nhas created a youth protection system whose proper functioning depends on the actions \nof a range of political, social and legal actors that have been given roles, responsibilities \nand powers that are both distinct and complementary.  \n[45] The first actor responsible for looking at the system as a whole and \nreforming it is the Minister of Health and S ocial Services. The Minister may, with the \ngovernment’s prior approval, give binding directives to institutions to ensure that the \nobjectives of social intervention are achieved (s.  133.1). These directives may be based \non, among other things, recommendati ons issued by the CDPDJ (s.  23(e)). The \nMinister is also tasked with laying before the National Assembly, every five years, a \nstudy measuring the impact of the YPA on the stability and living conditions of children \nand, if necessary, recommending amendment s to the YPA (s. 156.2). In addition, the \nMinister may request that the CDPDJ carry out studies and research on any question \nrelated to its competence, including the promotion and protection of the rights of \nchildren (s.  23(a) and (f)). \n[46] Next, there is the CDPDJ, a central aspect of whose statutory mandate is to \nexamine the youth protection system and collaborate with political actors in reforming \nit. For example, every five years, the CDPDJ must “report to the Government on the \n2024 SCC 43 (CanLII)\n\n--- Page 48 ---\n \n carrying out of this Act and on the advisability of amending it” (s.  156.1 para.  1; see, \ne.g., CDPDJ, Rapport sur la mise en œuvre de la Loi sur la protection de la jeunesse \n(article 156.1 de la LPJ)  (2020)). The CDPDJ may also, of its own motion, carry out \nstudies and research on any  question related to its competence by taking an overall look \nat the youth protection system and make recommendations accordingly to various \ngovernment departments that have an influence on the system (s.  23(e) and (f); see \nRicard, at pp.  633-35; L.  Lemond e and J.  Desrosiers, “Le droit à un recours effectif lors \nde la violation des droits fondamentaux des mineurs privés",
    "token_count": 1000,
    "start_token": 19800,
    "end_token": 20800,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 23,
    "source_file": "2024scc43.txt",
    "text": " on any  question related to its competence by taking an overall look \nat the youth protection system and make recommendations accordingly to various \ngovernment departments that have an influence on the system (s.  23(e) and (f); see \nRicard, at pp.  633-35; L.  Lemond e and J.  Desrosiers, “Le droit à un recours effectif lors \nde la violation des droits fondamentaux des mineurs privés de liberté” (2002), 62 R. du \nB. 205, at pp.  215-16). \n[47] It is worth noting that a recent legislative reform carried out partly in \nresponse to the recommendations of the Special Commission on the Rights of the Child \nand Youth Protection  (Laurent Commission) is consistent in every respect with this \ncollaborative approach among various actors, some of whom primarily have \n[TRANSLATION ] “their attent ion focused on the system”, while others have their \nattention “focused on the child” in question whose situation has been referred to them \n(R.F., at para.  43; see An Act to amend the Youth Protection Act and other legislative \nprovisions , S.Q. 2022, c.  11; National Assembly, Journal des débats , vol.  46, No.  21, \n2nd Sess., 42nd Leg., December  8, 2021, at pp.  1091 -93 (L. Carmant)).  \n[48] Among other measures in that reform, the legislature clarified and \nexpanded the powers of the Minister of Health and Social Servic es so that the Minister \ncan look critically at the system and contribute to the development of public policies \n2024 SCC 43 (CanLII)\n\n--- Page 49 ---\n \n for reforming it. In Chapter III, entitled “Body and Persons Entrusted With Youth \nProtection”, there is now a division devoted to the Minister’s role. It states that the \nMinister is “by virtue of office the Government’s adviser on all issues relating to youth \nprotection or to children and families in vulnerable situations” and that the Minister \n“must be consulted whenever a ministerial decision is made involving the interests of \nchildren or the respect of their rights in relation to youth protection” ( YPA, s. 28). In \naddition, with “a view to studying, improving or defining standards and obligations \napplicable to the responsibilities or to the socia l intervention of the director in order to, \namong other things, reduce response times”, the Minister may now, by regulation, \nimplement a pilot project on a range of matters ( YPA, s. 133 (ad. 2022, c.  11, s.  61); see \nNational Assembly, Journal des débats de  la Commission de la santé et des services \nsociaux , vol.  46, No.  22, 2nd Sess., 42nd Leg., April  5, 2022 , 15 h (L.  Carmant)).  \n[49] The tribunal’s corrective powers with respect to encroachments upon rights \nhave remained unchanged, as has the tribunal’s jurisdic tion. Under this wide -ranging \nreform of the YPA, the tribunal’s role is limited to rendering justice in an individualized \nand particularized manner. There is nothing to suggest that the tribunal’s mandate has \nbeen broadened to allow it to take [ TRANSLATION ] “a critical look at systemic issues in \nchild protection” (Ricard, at p.  635) and to order corrective measures to reform the \nsystem for the benefit of children whose situations have not been referred to it. The \nactors responsible for focusing their attent ion on the system are the Minister of Health \nand Social Services and, in certain cases, the CDPDJ. Further, the Minister and the \nCDPDJ are now supported in this role by new actors, including the National Director \n2024 SCC 43 (CanLII)\n\n--- Page 50 ---\n \n of Youth Protection and the panel of direct ors chaired by the National Director ( YPA, \nss. 23 to 27 and 28 to 30.8 (ad. 2022, c.  11, s.  16); Instaurer une société bienveillante \npour nos enfants et nos jeunes: rapport de la Commission spéciale sur les droits des \nenfants et la protection de la jeuness e (2021), at pp.  379-81; Journal des débats , \nDecember  8, 2021, at pp.  1091 -93",
    "token_count": 1000,
    "start_token": 20700,
    "end_token": 21700,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 24,
    "source_file": "2024scc43.txt",
    "text": "30.8 (ad. 2022, c.  11, s.  16); Instaurer une société bienveillante \npour nos enfants et nos jeunes: rapport de la Commission spéciale sur les droits des \nenfants et la protection de la jeuness e (2021), at pp.  379-81; Journal des débats , \nDecember  8, 2021, at pp.  1091 -93 (L.  Carmant)).  \n(iii) Conclusion on the Tribunal’s Role  \n[50] In light of the scheme of the YPA, the tribunal’s mandate is to render justice \nin an individualized and particularized manner on the basis of the interests and rights \nof the child whose situation has been referred to it. The tribunal is not the actor chosen \nby the legislature to look critically at the youth protection system as a whole and to \nreform it. That role is instead entruste d to others: the Minister of Health and Social \nServices, the CDPDJ and especially, since 2022, the National Director of Youth \nProtection.  \n[51] It must be recognized that the legislature did not intend to grant the tribunal \npowers going beyond those required to carry out the mandate assigned to it. If the \nlegislature’s intention, in matters of encroachment upon rights, had been to distance \nitself from this vision of individualized and particularized judicial intervention that \nimbues the entire YPA and to authoriz e the tribunal to make orders that apply to children \nwhose situations have not been referred to it, the legislature would have done so in \nexplicit terms. For example, it could have clearly conferred on the tribunal the power \nto make orders in the public in terest, or it could have expressly stated that the tribunal, \n2024 SCC 43 (CanLII)\n\n--- Page 51 ---\n \n in making its decisions, must take into account not only the interests of the child before \nit but also the interests of children . It did not so, however.  \n(c) Legislative History  \n[52] Section 91 para.  4 (formerly s.  91 para.  2) was added to the YPA in 1984 as \npart of a legislative reform enacted in response to the report of the Special \nParliamentary Commission on Youth Protection chaired by Jean -Pierre Charbonneau \n(see An Act to amend the Youth Protection Act and other legislation , S.Q. 1984, c.  4 \n(“Act to amend the YPA  (1984)”), s.  46). That commission had a mandate to study the \nnew youth protection system that had been in place since the coming into force of the \nYouth Protection Act , S.Q. 1977, c.  20. It was to recommend [ TRANSLATION ] \n“legislative and regulatory amendments” to address difficulties in the implementation \nof the 1977 YPA and, from an overall perspective, to improve the functioning of the \nyouth protection system ( Rapport de la Commission parle mentaire spéciale sur la \nprotection de la jeunesse (1982), at p.  xiii; see also p.  9; National Assembly, Journal \ndes débats , vol.  27, No.  69, 4th Sess., 32nd Leg., March  13, 1984, at pp.  5123 -42 \n(P.-M. Johnson, C.  Sirros and J. -P. Charbonneau); Ricard, at pp. 614-15). \n[53] Section 91 para.  4 was incorporated into the YPA at the same time as s.  74.1 \npara.  2, which provided that the CDPDJ’s predecessor, the Comité de la protection de \nla jeunesse (“Committee”), could also refer to the tribunal (formerly the Youth C ourt) \n“any situation where it has reason to believe that the rights of the child have been \nwronged by persons, bodies or establishments”. These two provisions were part of the \n2024 SCC 43 (CanLII)\n\n--- Page 52 ---\n \n legislative response to the Special Parliamentary Commission’s recommendation to  \ngrant powers to the Committee so that it could [ TRANSLATION ] “apply to the Court on \nthe basis of rights being encroached upon, and not only where security or development \nis in danger” ( Rapport de la Commission parlementaire spéciale , at p.  544). In its \nreport, the Special Parliamentary Commission criticized the fact that the 1977 YPA \ngave the Committee a power to investigate",
    "token_count": 1000,
    "start_token": 21600,
    "end_token": 22600,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 25,
    "source_file": "2024scc43.txt",
    "text": " response to the Special Parliamentary Commission’s recommendation to  \ngrant powers to the Committee so that it could [ TRANSLATION ] “apply to the Court on \nthe basis of rights being encroached upon, and not only where security or development \nis in danger” ( Rapport de la Commission parlementaire spéciale , at p.  544). In its \nreport, the Special Parliamentary Commission criticized the fact that the 1977 YPA \ngave the Committee a power to investigate encroachments upon rights (s.  23(b) \n(formerly s.  23(d))) and made it responsible for taking “the legal means it considers \nnecessary t o remedy any situation where the rights of a child are being encroached \nupon ” (s.  23(c) (formerly s.  23(e))) without adequately equipping it, from a legal \nstandpoint, to perform its role. In short, the Commission found it deplorable that the \n1977 YPA did n ot provide for referral to the tribunal in cases of encroachment upon a \nchild’s rights. In enacting ss.  91 para.  4 and 74.1 para.  2, the legislature was thus \nattempting to [ TRANSLATION ] “fil[l] a gap” in the articulation of the powers of the \nCommittee and the tribunal to deal with encroachments upon rights (Ricard, at p.  615).  \n[54] With regard to s.  91 para.  4 specifically, the Special Parliamentary \nCommission had recommended adding the following paragraph at the end of s.  91: \n  [TRANSLATION ] Where the Court con cludes that the rights of a young \nperson  in difficulty have been encroached upon by persons, bodies or \ninstitutions acting pursuant to the Act respecting assistance to children and \nyouth in difficulty, it may, in the judgment determining that rights have \nbeen encroached upon, order that the situation encroaching upon the rights \nof the young person be corrected . [Emphasis added.]  \n (National Assembly, Proposition législative: annexe IV au rapport de la \nCommission parlementaire spéciale sur la protection de la  jeunesse  \n(1982), s.  1085)  \n2024 SCC 43 (CanLII)\n\n--- Page 53 ---\n \n The legislature followed that recommendation but decided to omit the words \n“encroaching upon the rights of the young person” in the wording of s.  91 para.  4. \n[55] Therefore, what the members of the Special Parliamentary Commission \nhad in mind was that the tribunal would correct the situation at the source of the \nencroachment upon rights. Moreover, the wording of the recommendation suggests that \nthe tribunal must con cern itself with the interests and “the rights of the young person ” \nwhose situation has been referred to it, rather than the interests and rights of other \nchildren who are not before it. The question that naturally then arises is whether the \nlegislature’s decision to omit the words “encroaching upon the rights of the young \nperson” in the wording of s.  91 para.  4 reflects its intention to broaden the tribunal’s \ncorrective powers so that it can order corrective measures to protect the interests and \nrights of children whose situations have not been referred to it.  \n[56] The legislative debates surrounding the enactment of the new version of \ns. 91 in 1984 shed no light on the question, since s.  91 para.  4 was not specifically \ndiscussed during those debates (see Natio nal Assembly, Standing Committee on Social \nAffairs, “Étude détaillée du projet de loi 60 — Loi modifiant la Loi sur la protection de \nla jeunesse et d’autres dispositions législatives (3)”, Journal des débats: commissions \nparlementaires , No.  4, 4th Sess., 3 2nd Leg., March  22, 1984, at pp.  109-10). That \nbeing said, it can be seen from the context surrounding the addition of s.  91 para.  4 that \nthe legislature probably considered it unnecessary to specify that “the situation” the \ntribunal may order to be correc ted is “the situation encroaching upon the rights of the \n2024 SCC 43 (CanLII)\n\n--- Page 54 ---\n \n young person”. It was reasonable for the legislature to think that this could be inferred, \nby necessary implication, from ss.  23(c) and 74.1 para.  2. These",
    "token_count": 1000,
    "start_token": 22500,
    "end_token": 23500,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 26,
    "source_file": "2024scc43.txt",
    "text": "  4 that \nthe legislature probably considered it unnecessary to specify that “the situation” the \ntribunal may order to be correc ted is “the situation encroaching upon the rights of the \n2024 SCC 43 (CanLII)\n\n--- Page 54 ---\n \n young person”. It was reasonable for the legislature to think that this could be inferred, \nby necessary implication, from ss.  23(c) and 74.1 para.  2. These provisions stated, \nrespectively, that the C ommittee had to take “the legal means it considers necessary to \nremedy any situation where the rights of a child are being encroached upon ” and that \nit could “refer to the Court any situation where  it has reason to believe that the rights \nof the child have  been wronged ”. In my view, the legislature’s decision to omit the \nwords “encroaching upon the rights of the young person” should not be interpreted as \na broadening of the tribunal’s power to order corrective measures to protect the interests \nand rights of  children whose situations have not been referred to it.  \n[57] I pause here to elaborate on this last point and respond to an argument made \nby the CDPDJ. Sections 91 para.  4 and 74.1 para.  2 were inserted into the YPA at the \nsame time as the provisions broadenin g the Committee’s power to investigate \nencroachments upon rights so that it could do so in respect of a group of children \n(s. 23(b)), granting the Committee the power to make recommendations following an \ninvestigation into an encroachment upon rights (s.  25.2), and specifying that the \nCommittee could refer the matter to the Youth Court if its recommendation was not \nimplemented within the time fixed (s.  25.3) (see Act to amend the YPA  (1984) , ss. 10, \n12, 38 and 46). These additions addressed the Special Parl iamentary Commission’s \nrecommendation that the Committee’s investigative powers be strengthened and \nclarified by drawing inspiration from the investigative powers already granted to \nQuebec’s Commission des droits et libertés de la personne ( Rapport de la C ommission \nparlementaire spéciale , at pp.  544 and 547; Proposition législative , ss. 113, 129 and \n2024 SCC 43 (CanLII)\n\n--- Page 55 ---\n \n 130). It was hoped that the Committee, in exercising its powers to investigate and make \nrecommendations, could deal with [ TRANSLATION ] “collective problems” rat her than \nstrictly individual situations. In short, the legislature wanted the Committee’s \ninvestigative role to relate to [ TRANSLATION ] “group problem[s]” as well, such as those \naffecting “a group of children in a given reception centre in a given situatio n” (see \nNational Assembly, Standing Committee on Social Affairs, “Étude détaillée du projet \nde loi 60 — Loi modifiant la Loi sur la protection de la jeunesse et d’autres dispositions \nlégislatives (2)”, Journal des débats: commissions parlementaires , No.  3, 4th Sess., \n32nd Leg., March  21, 1984, at p.  45 (P. -M. Johnson)).  \n[58] The CDPDJ argues that the combined effect of ss.  23(b), 25.2 and 25.3 is \nto authorize the tribunal to make broad orders to protect the interests and rights of a \ngroup of children whose situa tion has not been referred to it but has been investigated \nby the CDPDJ, and who may find themselves in the same situation of encroachment as \nthe child before the tribunal. The legislative history shows that this is not the case. The \nCDPDJ’s interpretation  of ss.  23(b), 25.2 and 25.3 cannot be reconciled with the \nlanguage of ss.  23(c), 74.1 para.  2 and 91 para.  4, which clearly indicates that only the \nsituation of a single child is referred to the tribunal in a case involving encroachment \nupon rights. Presumably, if the legislature had intended to extend the tribunal’s \njurisdiction or corrective powers to the situation of a group of children in respect of \nwhich the CDPDJ had investigated, it would have indicated this explicitly in the YPA’s \nprovisions on judicial intervention (Chapter V). In particular, it would have specified \nthis in s s. ",
    "token_count": 1000,
    "start_token": 23400,
    "end_token": 24400,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 27,
    "source_file": "2024scc43.txt",
    "text": " that only the \nsituation of a single child is referred to the tribunal in a case involving encroachment \nupon rights. Presumably, if the legislature had intended to extend the tribunal’s \njurisdiction or corrective powers to the situation of a group of children in respect of \nwhich the CDPDJ had investigated, it would have indicated this explicitly in the YPA’s \nprovisions on judicial intervention (Chapter V). In particular, it would have specified \nthis in s s. 74.1 and 91 para.  4, which were examined by a parliamentary committee and \n2024 SCC 43 (CanLII)\n\n--- Page 56 ---\n \n then incorporated into the YPA at the same time as ss.  23(b), 25.2 and 25.3. But it did \nnot do so.  \n[59] In this context, it must be concluded that the provisions relied upon by the \nCDP DJ are not intended to authorize the tribunal to deal with the situation of a group \nof children or to order corrective measures to protect the interests and rights of a group \nof children whose situation has not been referred to it but has been investigated  by the \nCDPDJ. On the contrary, these provisions describe the steps that the CDPDJ must take \nbefore applying to the tribunal, after having investigated (s.  23(b)) and decided to make \na recommendation subject to a time limit  (ss. 25.2 and 25.3). In any even t, I reiterate \nthat even if the CDPDJ’s interpretation were to be accepted, this would be of very \nlimited assistance in this appeal, because the tribunal was dealing in this case with a \nsingle child’s situation, which had not been investigated by the CDPDJ . This is a very \ndifferent scenario, which it is important to distinguish.  \n[60] In short, I am of the view that the legislative history of s.  91 para.  4 and of \nother related provisions concerning encroachment upon rights confirms what the \nscheme of the YPA already reveals: the tribunal can deal with the situation of only one \nchild at a time. Moreover, there is nothing to suggest that the legislature intended to \nauthorize the tribunal to order corrective measures that would apply to children whose \nsituations have  not been referred to it but who may find themselves in the same situation \nof encroachment as the child before it. Lastly, the tribunal must correct the situation at \nthe source of the encroachment upon the child’s rights, but the legislative history does \n2024 SCC 43 (CanLII)\n\n--- Page 57 ---\n \n not indicate whether the tribunal can also seek to remedy the impact of the \nencroachment on the child’s psychological or physical state.  \n(d) CRC  \n[61] Article 3 of the CRC  makes it clear that the best interests of the child must \nbe a primary consideration in “all act ions concerning children”  (Article 3(1)). Its aim \nis also for states parties to undertake “to ensure the child such protection and care as is \nnecessary for his or her well -being” (Article 3(2)). To this end, states must ensure that \n“the institutions, servi ces and facilities responsible for the care or protection of children \nshall conform with the standards established by competent authorities, particularly in \nthe areas of safety, health, in the number and suitability of their staff, as well as \ncompetent sup ervision” (Article  3(3)).  \n[62] The CDPDJ is correct in stating that the CRC  weighs in favour of \ninterpreting s. 91 para.  4 in a large and liberal manner so that the tribunal will have all \nthe corrective powers it needs to ensure that the child whose rights have  been \nencroached upon has the fullest and most effective protection possible (see United \nNations, Committee on the Rights of the Child, General Comment No.  5 (2003): \nGeneral measures of implementation of the Convention on the Rights of the Child \n(arts.  4, 42 and 44, para.  6), U.N. Doc. CRC/GC/2003/5, November  27, 2003, at \npara.  24; United Nations, Committee on the Rights of the Child, Concept Note: General \nComment on Children’s Rights to Access to Justice and Effective Remedies , 2024 \n(online) , at paras.  4-7 and 16).  \n2024 SCC 43 (CanLII)\n\n--- Page 58 ---\n \n [63] That being said, it is undeniable that states parties to the CRC  possess a \nmargin of discretion in determining what",
    "token_count": 1000,
    "start_token": 24300,
    "end_token": 25300,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 28,
    "source_file": "2024scc43.txt",
    "text": " \npara.  24; United Nations, Committee on the Rights of the Child, Concept Note: General \nComment on Children’s Rights to Access to Justice and Effective Remedies , 2024 \n(online) , at paras.  4-7 and 16).  \n2024 SCC 43 (CanLII)\n\n--- Page 58 ---\n \n [63] That being said, it is undeniable that states parties to the CRC  possess a \nmargin of discretion in determining what measures are appropriate to promote the best \ninterests of the child and to protect the child’s rights (see CRC , Article 4; J.  Tobi n, \n“Article 4. A State’s General Obligation of Implementation”, in J.  Tobin, ed., The UN \nConvention on the Rights of the Child: A Commentary  (2019) , 108, at pp.  111-12). I \nagree with the DYP that there is no indication that, in order to comply with the CRC , \nprovincial and territorial legislatures must, in cases of encroachment upon rights, give \ncourts or tribunals the mandate and powers they need to concern themselves with \nprotecting the interests and rights of more than one child at a time (see R.F., at pa ra. 39, \nquoting United Nations, Committee on the Rights of the Child, General comment \nNo. 14 (2013) on the right of the child to have his or her best interests taken as a \nprimary consideration (art.  3, para.  1), U.N. Doc. CRC/C/GC/14 , May  29, 2013, at \npara.  32). \n(e) Object of the Provision  \n[64] The YPA establishes a scheme whose purpose is to protect any child whose \nsecurity or development is or may be in danger  (s. 2 para.  1). As the CDPDJ noted, in \ndoing so, the YPA [TRANSLATION ] “gives life” to s.  39 of the Quebec Charter  \n(transcript, at p.  27). It also helps to implement Canada’s obligations under the CRC  in \ndomestic law.  \n[65] The recourse for a declaration of encroachment upon rights is one of the \nlegal tools put in place by the legislature to achieve this funda mental purpose of the \n2024 SCC 43 (CanLII)\n\n--- Page 59 ---\n \n YPA of protecting the interests and rights of children whose security or development is \nin danger. In establishing this recourse and granting corrective powers to the tribunal, \nthe legislature had the objective [ TRANSLATION ] “of ensur ing that any state intervention \nin relation to a child [covered by the YPA] is carried out in a manner that respects the \nchild’s rights” (Ricard, at pp.  616-17; see also p.  609; YPA, s. 3). The legislature was \ntherefore seeking to provide additional protec tion to a vulnerable child whose right to \nprotection had already been encroached upon by their parents or by the persons acting \nin their stead at the time of the intervention by the director of youth protection in the \nchild’s life (Ricard, at pp.  616 and 6 19). Through this oversight and judicial review \nmechanism, the legislature also sought to ensure that the director of youth protection \nand the other persons, bodies or institutions called upon to interact with the child in the \ncourse of social intervention  could be held accountable (see V.  P. Costanzo and \nM. Paré, “Les réponses judiciaires au non -respect des droits de l’enfant dans \nl’intervention sociale: Utilité ou futilité du recours en lésion de droits?”  (2023), 33:2 \nN.P.S.  135, at pp.  153 and 156; C.  Brodeur, “ Chronique — Le non -respect des \nordonnances par la direction de la protection de la jeunesse: contexte juridique et survol \nde la jurisprudence ”, Repères , June 2022 (online), at pp. 7-8). \n[66] The corrective powers conferred on the tribunal by s.  91 para.  4 must be \ninterpreted in a large and liberal manner to ensure the attainment of this purpose of \nprotecting children, which is clearly affirmed in the Quebec Charter  and the CRC  \n(Quebec Charter , s. 39; CRC , Article 3; see also Civil Code of Québec , art.  32; \n",
    "token_count": 1000,
    "start_token": 25200,
    "end_token": 26200,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 29,
    "source_file": "2024scc43.txt",
    "text": "2 (online), at pp. 7-8). \n[66] The corrective powers conferred on the tribunal by s.  91 para.  4 must be \ninterpreted in a large and liberal manner to ensure the attainment of this purpose of \nprotecting children, which is clearly affirmed in the Quebec Charter  and the CRC  \n(Quebec Charter , s. 39; CRC , Article 3; see also Civil Code of Québec , art.  32; \nInterpretation Act , s. 41; Protection de la jeunesse – 123979 , at para.  21). The various \n2024 SCC 43 (CanLII)\n\n--- Page 60 ---\n \n types of corrective measures that can be ordered must be conceived of generously to \nensure the fullest possible protection for the child whose rights have been encroached \nupon. By “full protection”, I mean protection that applies to both the present and the \nfuture and that takes into account the circumstances at the source of the encroachment \nupon the child’s rights as well as the impact of the encroachment on th e child’s \npsychological and physical state.  \n[67] In this regard, I am of the view that the interpretation proposed by the \nCDPDJ — to the extent that it focuses exclusively on rectifying the circumstances at \nthe source of the encroachment upon rights — undermine s the tribunal’s ability to \nprotect the interests and rights of the child before it in a given case. Indeed, such an \ninterpretation is incompatible with the possibility of ordering corrective measures to \nremedy the negative impact of an encroachment upon r ights on the child’s \npsychological or physical state. In some respects, the CDPDJ’s interpretation also \nseems to limit the type of preventive corrective measures that may be ordered. Over \nand above correcting the situation at the source of the encroachment  upon rights, the \ntribunal must also, in my opinion, be able to order preventive corrective measures that \nwill follow the child through the system to ensure that the child is adequately protected \nin the future.  \n[68] With regard to the question at the centre of the disagreement between the \nparties — that is, whether the tribunal may order corrective measures to prevent \nchildren whose situations have not been referred to it from finding themselves in the \n2024 SCC 43 (CanLII)\n\n--- Page 61 ---\n \n same situation of encroachment as the one that encroached up on the rights of the child \nbefore it — I am of the view that the purpose clause in the French version of the YPA \nallows this question to be answered in the negative. Its first paragraph states that the \nYPA “a pour objet la protection de l’enfant  dont la sé curité ou le développement est ou \npeut être considéré comme compromis ” (“[t]he purpose .  . . is to protect children whose \nsecurity or development is or may be considered to be in danger”) (s.  2). Since 2022, \nthe purpose clause has stated as well — relying on the wording of s.  2.3 para.  1(a) of \nthe version of the YPA in force at the relevant time — that the YPA “a aussi pour objet \nde mettre fin à la situation  qui compromet la sécurité ou le développement de l’enfant  \net d’éviter qu’ elle ne se reproduise ” (“al so aims to put an end to and prevent the \nrecurrence of situations in which the security or the development of a child is in \ndanger”) (s.  2 para.  1). \n[69] Section 3 provides as follows:  \n 3. Decisions made under this Act must be in the interest of the child  and \nrespect his rights . \n In addition to the moral, intellectual, emotional and material needs of the \nchild , his age, health, personality and family environment and the other \naspects of his situation  must be taken into account.  \n[70] It is true that the YPA establishe s a youth protection system whose \nfundamental mission, as the appellant states, is to protect vulnerable children in Quebec \n(A.F., at para.  58). That being said, the wording of s.  2, namely the YPA’s purpose \nclause, and that of s.  3 lead to the conclusion that, in the case of social and judicial \n2024 SCC 43 (CanLII)\n\n--- Page 62 ---\n \n intervention, the legislature had in mind that this goal would be attained through \ninterventions aimed at protecting the interests and rights of one child at a time. It is \nthrough the cumulative effect of individual ized and",
    "token_count": 1000,
    "start_token": 26100,
    "end_token": 27100,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 30,
    "source_file": "2024scc43.txt",
    "text": " the wording of s.  2, namely the YPA’s purpose \nclause, and that of s.  3 lead to the conclusion that, in the case of social and judicial \n2024 SCC 43 (CanLII)\n\n--- Page 62 ---\n \n intervention, the legislature had in mind that this goal would be attained through \ninterventions aimed at protecting the interests and rights of one child at a time. It is \nthrough the cumulative effect of individual ized and particularized interventions that the \nlegislature hopes to achieve the fundamental purpose of Quebec’s youth protection \nsystem, which is to protect “the children” who are the most vulnerable in society. This \nobservation is important given the fact  that purpose statements in a statute are the “first, \n‘most direct and authoritative evidence’ of the legislative purpose ” (Canadian  Council  \nfor Refugees  v. Canada  (Citizenship  and Immigration) , 2023  SCC  17, at para.  130, \nquoting  R. v. Appulonappa , 2015  SCC  59, [2015] 3 S.C.R. 754, at para.  49) and also \ngiven the fact that, in an interpretive exercise, it is important to consider the general \npurpose of both the provision and the statute while bearing in mind the means chosen \nby the legislature to achieve these general objectives (see  Breault , at para.  26, quoting \nMediaQMI inc. , at para.  39; see also 9147 -0732 Québec inc. , at para.  10; Mancini, at \npp. 927 and 930 -31). \n(f) Conclusion  \n[71] A large and liberal interpretation of s.  91 para.  4, which ensures the \nattainme nt of the general purpose of protecting children while taking into consideration \nthe text, the statutory scheme and the context, leads me to conclude that the legislature \nintended to confer on the tribunal the powers needed to ensure full protection of the  \ninterests and rights of the child whose situation has been referred to it. By this I mean \nprotection that applies to both the present and the future and that takes account of the \n2024 SCC 43 (CanLII)\n\n--- Page 63 ---\n \n circumstances at the source of the encroachment upon rights as well as the i mpact of \nthe encroachment on the child’s psychological and physical state. What this means in \npractical terms, in my view, is that the tribunal may order corrective measures with the \nfollowing purposes: (1)  to put an end to the situation of encroachment wh ere it is still \nencroaching upon the child’s rights; (2)  to remedy the psychological or physical \nconsequences for the child resulting from the encroachment upon rights; and (3)  to \nprevent the recurrence of the situation of encroachment for the child.  The t ribunal can \nthus order a wide range of corrective measures so as to render justice in a flexible and \ncreative manner in each case.  \n[72] It follows from the above that a preventive corrective measure may be \nordered only if the child whose rights have been encroa ched upon is at risk of being \nsubjected to the situation of encroachment again. The fact that other children whose \nsituations have not been referred to the tribunal might benefit from the preventive \ncorrective measure is not sufficient, on its own, to allo w the tribunal to order it.  \n[73] Contrary to what the CDPDJ argues, this conclusion is not absurd, \nunreasonable or incompatible with the general purpose of protecting vulnerable \nchildren that infuses the YPA (A.F., at paras.  57-58). Rather, it accurately reflec ts the \nmeans chosen by the legislature to guarantee the protection of the interests and rights \nof children who are the subject of social intervention under the YPA. In the case of the \ntribunal, these means are centred around individualized and particulariz ed justice. The \nfact that the CDPDJ would prefer other means that it considers more effective for \n2024 SCC 43 (CanLII)\n\n--- Page 64 ---\n \n achieving this general purpose of protecting vulnerable children in Quebec — for \nexample, granting the tribunal the power to make orders in the public interes t or in the \ninterest of children  who are the subject of intervention under the YPA — is not \nsufficient to characterize as absurd or unreasonable the interpretation that is called for \nwhen the text of the provision, the statutory scheme, the context and the  object are \nconsidered . \n[74] Moreover, as we will see",
    "token_count": 1000,
    "start_token": 27000,
    "end_token": 28000,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 31,
    "source_file": "2024scc43.txt",
    "text": "64 ---\n \n achieving this general purpose of protecting vulnerable children in Quebec — for \nexample, granting the tribunal the power to make orders in the public interes t or in the \ninterest of children  who are the subject of intervention under the YPA — is not \nsufficient to characterize as absurd or unreasonable the interpretation that is called for \nwhen the text of the provision, the statutory scheme, the context and the  object are \nconsidered . \n[74] Moreover, as we will see in greater detail in the next section, the fact that \nthe tribunal may order corrective measures only to protect the interests and rights of \nthe child whose situation has been referred to it does not mean tha t the order, to be \nvalid, necessarily has to name that child expressly. To hold otherwise would be an error \nof law. Nor does it mean that a corrective measure cannot have the indirect and \nincidental effect of protecting the interests and rights of other ch ildren who may find \nthemselves in the same situation of encroachment as the child whose situation has been \nreferred to the tribunal. Finally, it also does not mean that the tribunal cannot order \ncorrective measures to eliminate a systemic or institutional practice. Indeed, there is \nnothing to prevent the tribunal from ordering such a corrective measure, provided that \nthe child whose rights have been encroached upon is at risk of being subjected to the \nsituation of encroachment again, that the corrective mea sure can effectively help to \nprevent  the recurrence of the situation of encroachment and that the measure is related \nto the protection of the interests and rights of the child whose situation has been referred \nto the tribunal. I will come back to this . \n2024 SCC 43 (CanLII)\n\n--- Page 65 ---\n \n [75] I would note here that my proposed interpretation of s.  91 para.  4 is \nconsistent  with the judicial interpretations of s.  91 para.  4 that have been adopted thus \nfar. There are already instances where the tribunal will order corrective measures to put \nan end to  a situation of encroachment that is still ongoing at the time a declaration of \nencroachment upon rights is made. This will be the case, for example, where the \nsituation of encroachment results from an absence of psychological counselling that the \nchild’s state makes necessary and where this absence of counselling continues at the \ntime of the hearing. In such a case, the tribunal will order the corrective measures \nneeded to put an end to the absence of counselling (see, e.g., Protection de la jeunesse \n– 174220, 2017 QCCQ 9973, at paras.  41-51 and 68 -69). \n[76] Similarly, if the encroachment upon rights has had negative physical or \npsychological consequences for the child, the tribunal may sometimes order measures \nthat can remedy those consequences or improve the c hild’s state. For example, the \ntribunal will occasionally order the provision of social services that have become \nnecessary because of the negative consequences of the encroachment upon rights for \nthe child, or it will order the director of youth protectio n to cover the costs of therapy \nthat has become necessary as a result of a situation of encroachment caused by the \ndirector of youth protection  (see, e.g., Protection de la jeunesse – 175726 , 2017 QCCQ \n10171, at paras.  111, 113 and 135;  Protection de la jeunesse – 1610815 , 2016 QCCQ \n20163, at paras.  17-18, 67 -75 and 105; Protection de la jeunesse – 202094 , 2020 \nQCCQ 1912, at paras.  109-18, 123 -24 and 130 -31; M. Provost, Youth Protection Law \nin Québec (2023) , at pp.  287-89). Similarly, there may be grounds  for ordering the \n2024 SCC 43 (CanLII)\n\n--- Page 66 ---\n \n person, body or institution that encroached upon the child’s rights to apologize in \nwriting to the child and their family with a view to offering some form of solace and \nrestoring the relationship of trust with the youth protection system  (see Protection de \nla jeunesse – 212922 , 2021 QCCQ 5132, at paras.  701-2). \n[77] Finally, it is also common for the tribunal to order corrective measures to \nprevent the recurrence of the situation of encroachment for the child whose rights have \nbeen encroached upon. It is recognized in the jurispr",
    "token_count": 1000,
    "start_token": 27900,
    "end_token": 28900,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 32,
    "source_file": "2024scc43.txt",
    "text": " some form of solace and \nrestoring the relationship of trust with the youth protection system  (see Protection de \nla jeunesse – 212922 , 2021 QCCQ 5132, at paras.  701-2). \n[77] Finally, it is also common for the tribunal to order corrective measures to \nprevent the recurrence of the situation of encroachment for the child whose rights have \nbeen encroached upon. It is recognized in the jurisprudence that even where the \nsituation of encroachment has ended by the time of the hearing, this does not preclude \nthe tribunal from making preventive orders to ensure that the situation of encroachment \ndoes not recur fo r the child whose situation has been referred to it ( Protection de la \njeunesse – 123979 , at paras.  20-26; Ricard, at p.  632). For example, the tribunal may \norder, as a corrective measure, that training be given to a youth worker to impress upon \nthem the im portance of respecting certain fundamental principles governing social \nintervention under the YPA to ensure that, in the future, the worker will be better able \nto establish and maintain a relationship of trust with the child and the child’s parents \n(Protec tion de la jeunesse – 123979 , at para.  21; S.  Papillon, “Le jugement en matière \nde lésion de droits de la Chambre de la jeunesse: où en sommes -nous?” (2015), 56 C. \nde D.  151, at p.  176). Similarly, the tribunal may order that its judgment be served on \nactors responsible for taking an overall look at the system and participating in its reform \n(see, e.g., Protection de la jeunesse – 2023 , 2020 QCCQ 61, at paras.  331 and 456; \nProtection de la jeunesse – 137151 , 2013 QCCQ 17367, at paras.  85-87 and 93) or may \nrecommend that the CDPDJ investigate a problematic situation with a view to making \n2024 SCC 43 (CanLII)\n\n--- Page 67 ---\n \n the necessary recommendations to the Minister of Health and Social Services (see, e.g., \nProtection de la jeunesse – 171278 , 2017 QCCQ 2752, at paras.  73-74 and 80).  \n(3) Criteria for the Validity of Corrective Measures Ordered for Preventive \nPurposes  \n[78] In light of the disagreement that exists on this question between the parties \nand between the judges of the Court of Appeal, I believe it is essential to set out three \ncriteria for det ermining the validity of corrective measures ordered for preventive \npurposes. These criteria are based on the limits built into s.  91 para.  4 of the YPA by \nthe legislature. Without purporting to be exhaustive, they will serve in the future both \nto guide th e tribunal when it contemplates ordering such corrective measures and to \nsupport the appellate courts called upon to review the validity of these measures.  \n(a) The Child Must Be at Risk of Being Subjected to the Situation of \nEncroachment Again  \n[79] First, for a pre ventive corrective measure to be ordered, the child whose \nsituation has been referred to the tribunal must be at risk of being subjected to the \nsituation of encroachment again. To hold otherwise would amount to recognizing that \nthe tribunal has the power t o make orders in the public interest or in the interest of \nchildren who are the subject of social intervention under the YPA. However, this is not \nwhat the legislature intended.  \n2024 SCC 43 (CanLII)\n\n--- Page 68 ---\n \n [80] I note that this criterion is flexible and easily met, in view of the imperati ve \nof protecting children from any risk of harm that infuses the YPA (see Bernheim and \nCoupienne, at p.  262, citing P. (D.) v. S.  (C.), [1993] 4 S.C.R. 141, at pp.  176-78). \nWhile mere conjecture unsupported by the evidence is not enough to conclude that th e \nchild is at risk of being subjected to the situation of encroachment again, this criterion \nwill generally be met where the child is still the subject of intervention under the YPA. \nHowever, if the child is no longer the subject of intervention at the tim e the tribunal \ndecides the application for a declaration of encroachment upon rights and if nothing in \nthe evidence",
    "token_count": 1000,
    "start_token": 28800,
    "end_token": 29800,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 33,
    "source_file": "2024scc43.txt",
    "text": " 176-78). \nWhile mere conjecture unsupported by the evidence is not enough to conclude that th e \nchild is at risk of being subjected to the situation of encroachment again, this criterion \nwill generally be met where the child is still the subject of intervention under the YPA. \nHowever, if the child is no longer the subject of intervention at the tim e the tribunal \ndecides the application for a declaration of encroachment upon rights and if nothing in \nthe evidence suggests that the child might be so again before reaching the age of \nmajority, the criterion will not be met. No preventive corrective measu re can then be \nordered. In every case, the question of whether a child is at risk of being subjected to \nthe same situation of encroachment in the future is a contextual determination that will \ndepend on the tribunal’s assessment of the evidence . \n(b) The Correc tive Measures Must Be Able to Effectively Help to Prevent the \nRecurrence of the Situation of Encroachment  \n[81] Second, the preventive corrective measure or measures ordered must be \nable to effectively help to prevent the recurrence of the situation of encroachm ent. \n[82] To this end, the tribunal must begin by focusing increased attention on the \ncircumstances that gave rise to the encroachment upon rights, the number and nature \nof which will vary from case to case. As Dickson  C.J. stated in another context, the \ntribunal sh ould look first to the past so that it can then make preventive orders that can \n2024 SCC 43 (CanLII)\n\n--- Page 69 ---\n \n effectively prevent a situation from recurring in the future (see Canadian National \nRailway Co.  v. Canada (Canadian Human Rights Commission) , [1987] 1 S.C.R. 1114 \n(“CN”), at p. 1145; see also Ricard, at p.  620). At this stage, the tribunal must \n[TRANSLATION ] “try to understand the source of the encroachment” (Ricard, at p.  620). \nAgain, this is a highly factual determination that will depend on the evidence adduced.  \n[83] Understandi ng the source of an encroachment upon rights will be easy in \ncases where the encroachment results from only one act or omission by an individual. \nFor example, in the case at bar, it was easy for the tribunal to determine the source of \nthe encroachment upon  the young person’s right to security and protection on July  27, \n2018. The encroachment was caused by a CISSS A educator who unjustly refused to \nallow the young person, who had run away, to take refuge at the RCYPAP to which \nshe had been entrusted.  \n[84] In othe r cases, understanding the source of an encroachment will be more \ndifficult, especially when institutional and individual factors are present. This will be \nthe case where the act or omission by an individual that contributed to an encroachment \nupon rights is closely linked to institutional factors (Ricard, at p.  632). By “institutional \nfactor”, I mean any factor that relates primarily to the functioning of a legal person, \ninstitution or body, such as training, a protocol or an internal practice (see, by ana logy, \nCN, at pp.  1139 and 1143; R.  W. Zinn, The Law of Human Rights in Canada: Practice \nand Procedure  (loose -leaf), at §  1:6). The infringement of the young person’s right to \nreceive health care with continuity and in a personalized manner is a good exampl e. \n2024 SCC 43 (CanLII)\n\n--- Page 70 ---\n \n The tribunal noted that the encroachment upon this right originated both in a series of \nindividual acts or omissions by health care personnel and youth workers and in \ninstitutional factors, primarily the institution’s poor medical record -keeping.  \n[85] Once t he source of the encroachment upon rights is identified, the tribunal \nwill be able to consider one or more corrective measures that could effectively help to \nprevent the recurrence of the situation of encroachment. These measures will logically \nfocus on on e or more of the circumstances shown by the evidence to be at the source \nof the encroachment. In this regard, I emphasize that, at the stage of presenting \ntestimonial and documentary evidence, the parties play an important role in assisting \nthe tribunal to  determine innovative corrective measures based on best practices.  \n[86] Finally, I note that the aim here is not to determine the corrective measure \nthat will be the most  effective",
    "token_count": 1000,
    "start_token": 29700,
    "end_token": 30700,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 34,
    "source_file": "2024scc43.txt",
    "text": "achment. These measures will logically \nfocus on on e or more of the circumstances shown by the evidence to be at the source \nof the encroachment. In this regard, I emphasize that, at the stage of presenting \ntestimonial and documentary evidence, the parties play an important role in assisting \nthe tribunal to  determine innovative corrective measures based on best practices.  \n[86] Finally, I note that the aim here is not to determine the corrective measure \nthat will be the most  effective in preventing the recurrence of the situation of \nencroachment for the child. Rat her, it is to identify the corrective measures that can be \nexpected to be effective in helping to prevent the recurrence of the situation of \nencroachment. It is not uncommon for a wide range of corrective measures to be \navailable to the tribunal. However, this range of measures will be narrowed once \naccount is taken of an additional criterion: the corrective measures must be related to \nthe protection of the interests and rights of the child whose situation has been referred \nto the tribunal.  \n2024 SCC 43 (CanLII)\n\n--- Page 71 ---\n \n (c) The Corrective M easures Ordered Must Be Related to the Protection of the \nInterests and Rights of the Child Whose Situation Has Been Referred to the \nTribunal  \n[87] Third, any preventive corrective measure must not only be effective but \nalso be related to preventing the recurrenc e of the situation of encroachment for the \nchild whose situation has been referred to the tribunal. This requirement flows from the \nlegislative intent discerned from s.  91 para.  4 of the YPA, which is that the tribunal be \nable to order corrective measures only to protect the interests and right of the child \nwhose situation has been referred to it. Its effect is to limit the range of preventive \ncorrective measures deemed effective by the tribunal to those that seek first and \nforemost to protect the interests  and rights of the child before it, so as to provide a \npractical remedy for the encroachment upon the child’s rights (see Protection de la \njeunesse – 123979 , at para.  25). The corrective measure must be primarily intended to \nprotect the interests and right s of the child whose situation has been referred to the \ntribunal (see C.A. reasons, at para.  76). It must be related to events experienced by the \nchild whose situation has been referred to the tribunal in environments where the child \nhas spent or might spe nd time, on the basis of the evidence and the context.  \n[88] At this stage, to order a corrective measure whose scope is related to the \nprotection of the child’s interests and rights, the tribunal must confine itself to ordering \na corrective measure that reflect s the risk of harm faced by the child, as shown by the \nevidence . As the concurring judge of the Court of Appeal noted, the tribunal must avoid \nthe trap of intellectual shortcuts and generalizations not supported by the evidence. For \n2024 SCC 43 (CanLII)\n\n--- Page 72 ---\n \n example, if the tribuna l wishes its order to be directed specifically at persons, bodies or \ninstitutions, it must limit itself to naming those that, in light of the evidence, could \npotentially contribute to the recurrence of the encroachment upon the child’s rights. \nMoreover, if  the tribunal is of the view that there is a risk that other persons, bodies or \ninstitutions may expose the child to the same situation of encroachment in the future, \nbut that the evidence does not allow it to identify them, it may make an order that will \nfollow the child through the system. However, it may not make an order directed at all \npersons, bodies or institutions in the judicial district concerned or in Quebec.  \n[89] To effectively protect the child whose rights have been encroached upon, \nthe preventive corrective measures will sometimes have to be broad in scope. This will \nbe the case where the evidence shows that a corrective measure directed strictly at one \nor more identifiable individuals would not serve to protect the child effectively in the \nfuture.  \n[90] When broad corrective measures are required, at least two types of \nmeasures can be contemplated. First, the tribunal may order a corrective measure \nspecifically directed at persons, bodies or institutions that, in light of the evidence,  \ncould potentially contribute to the recurrence of the encroachment upon the child’s \nrights. This will include the persons, bodies and institutions that, according to the \nevidence, were at the source of the situation of encroachment experienced by the child \nand that the chil d might interact with or spend time at in the future. Second, the tribunal \nmay order a",
    "token_count": 1000,
    "start_token": 30600,
    "end_token": 31600,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 35,
    "source_file": "2024scc43.txt",
    "text": " order a corrective measure \nspecifically directed at persons, bodies or institutions that, in light of the evidence,  \ncould potentially contribute to the recurrence of the encroachment upon the child’s \nrights. This will include the persons, bodies and institutions that, according to the \nevidence, were at the source of the situation of encroachment experienced by the child \nand that the chil d might interact with or spend time at in the future. Second, the tribunal \nmay order a measure that will follow the child through the system. Such a corrective \n2024 SCC 43 (CanLII)\n\n--- Page 73 ---\n \n measure may be ordered either as an alternative to or in addition to the first type of \nmeasure, in light of the evidence in the record, the circumstances of the case and the \nneed to protect the child for the future. While everything is a question of context, it can \nbe expected that, in many cases, a hybrid corrective measure — combining the two \ntypes  of measures — will be what  guarantees the fullest and most effective protection \nfor the child in the future.  \n[91] It follows from the above that the wording of a corrective measure does not \nnecessarily have to name the child whose rights have been encroached u pon for that \norder to be sufficiently related to the protection of the child’s interests and rights. To \nhold otherwise would be an error of law. To verify whether an order has been validly \nmade under s.  91 para.  4, one must “look to the substance of the or der and not merely \nto its wording” ( CN, at p.  1145). Therefore, although the concurring judge of the Court \nof Appeal was correct in stating that a measure can [ TRANSLATION ] “relat[e] to the child \nwhose rights were wronged, even if her name is not included in the order” (para.  46), \nsuch a measure must, to be valid, be directed only at persons, bodies or institutions that, \nin light of the evidence, could potentially contribute to the recurrence of the \nencroachment upon the child’s rights.  \n[92] Moreover, the fact t hat a preventive corrective measure benefits a large \nnumber of children because of the way it is worded is of no relevance in determining \nwhether the measure was validly imposed. A preventive corrective measure related to \nthe interests and rights of the ch ild whose situation has been referred to the tribunal \n2024 SCC 43 (CanLII)\n\n--- Page 74 ---\n \n may very well have positive indirect and incidental consequences for a large number \nof children (see Moore v. British Columbia (Education) , 2012 SCC 61, [2012] 3 S.C.R. \n360, at para.  63). I would add th at this is particularly true where the corrective measure \nmust be broad in scope in order to effectively help to prevent the recurrence of the \nsituation of encroachment for the child.  \n(d) The Budgetary Impact of the Corrective Measure Is Not a Criterion for th e \nValidity of the Order  \n[93] Lastly, I am of the view that the magnitude of the budgetary impact of the \ncorrective measure is not in itself a criterion for the validity of the order. I agree with \nthe concurring judge of the Court of Appeal that the majority err ed in stating that a \ncorrective measure that was necessary to prevent a child from being subjected to a \nsituation of encroachment again would nonetheless be invalid if the budgetary impact \nof the measure were too significant. The majority also noted [ TRANS LATION ] “the \nimportance of raising the issue of approximate costs for those seeking or contesting \n[preventive] orders [made under s.  91 para.  4] so that the court hearing such \napplications may assess the impact of the order and, accordingly, whether the co urt is \nallowed to make it” (para.  81). \n[94] In addition to the fact that such a validity criterion has no basis in the YPA, \nits application to preventive orders made under s.  91 para.  4 would entail considerable \npractical difficulties. Indeed, it would be undul y burdensome to ask the parties to deal \nwith the issue of the approximate costs of the orders being debated. This could well \n2024 SCC 43 (CanLII)\n\n--- Page 75 ---\n \n lengthen and complicate the proceedings, whether by encouraging the parties to \nproduce expert evidence on the issue or by prompting  speculative debates on it. In every \ncase, it would only add another barrier to access to justice in the youth protection \nsystem, a situation that would be contrary to the protection",
    "token_count": 1000,
    "start_token": 31500,
    "end_token": 32500,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 36,
    "source_file": "2024scc43.txt",
    "text": " ask the parties to deal \nwith the issue of the approximate costs of the orders being debated. This could well \n2024 SCC 43 (CanLII)\n\n--- Page 75 ---\n \n lengthen and complicate the proceedings, whether by encouraging the parties to \nproduce expert evidence on the issue or by prompting  speculative debates on it. In every \ncase, it would only add another barrier to access to justice in the youth protection \nsystem, a situation that would be contrary to the protection of the interests and rights \nof vulnerable children and their families (se e Bernheim and Coupienne, at pp.  276-78). \n(e) Conclusion  \n[95] In summary, at least three validity criteria govern the exercise of the \ntribunal’s power to order preventive corrective measures under s.  91 para.  4 of the YPA. \nThese criteria are based on the limits bui lt into this enabling provision. For a preventive \ncorrective measure to be ordered, the child whose situation has been referred to the \ntribunal must be at risk of being subjected to the situation of encroachment again. If \nthis is the case, the corrective m easure chosen by the tribunal must be among the limited \nrange of measures that can effectively help to prevent the recurrence of the situation of \nencroachment and that are also related to the protection of the interests and rights of \nthe child whose situat ion has been referred to the tribunal. The magnitude of the \nbudgetary impact of the corrective measure is not in itself a criterion for the validity of \nthe order.  \n[96] Where a broad preventive measure is necessary, it may take a variety of \nforms. For example, i t may be limited to the  persons, bodies and institutions that, \naccording to the evidence, could potentially contribute to the recurrence of the \n2024 SCC 43 (CanLII)\n\n--- Page 76 ---\n \n encroachment upon the child’s rights;  it may follow the child through the system; or it \nmay be a hybrid of these  two forms of measures.  \n[97] It can be expected that, in many cases, a relatively wide range of preventive \ncorrective measures will be available to the tribunal. If so, it will be up to the tribunal \nto choose the corrective measure or measures it considers to b e the most appropriate to \nprotect the interests and rights of the child whose situation has been referred to it, \nhaving regard to the evidence in the record and the submissions of the parties \nconcerned. Such a discretionary decision is generally entitled t o deference. Unless the \ntribunal made a palpable and overriding error in assessing the evidence or it is shown \nthat the tribunal did not exercise the discretion conferred by s.  91 para.  4 judiciously, \nthe preventive measure ordered by the tribunal must be upheld and an appellate court \ncannot intervene (see Housen v. Nikolaisen , 2002 SCC 33, [2002] 2 S.C.R. 235, at \nparas.  10 and 36; Barendregt , at paras.  100-104; Canada (Transportation Safety \nBoard) v. Carroll -Byrne , 2022 SCC 48, at para.  41; Hydro -Québec v.  Matta , 2020 SCC \n37, [2020] 3 S.C.R. 595, at para.  33). On the other hand, where the appellate court finds \nan error in the tribunal’s interpretation of s.  91 para.  4, the error must be reviewed on a \nstandard of correctness. For example, if the tribunal err ed by clearly seeking to make \norders that would benefit children other than the one whose situation had been referred \nto it, this would constitute an error of law (see Housen , at para.  8; Vavilov , at para.  37; \nTELUS Communications Inc. v. Wellman , 2019 SCC  19, [2019] 2 S.C.R. 144 , at \npara.  30; Carroll -Byrne , at para.  41). \n2024 SCC 43 (CanLII)\n\n--- Page 77 ---\n \n (4) Review of the Orders  \n[98] The four corrective measures challenged by the DYP were ordered to \nprevent abusive or inadequate restraint and isolation measures from being used again. \nIn the tribun al’s view, those restraint and isolation measures infringed the young \nperson’s right to have any use of control measures against her be minimal, exceptional \nand guided by a procedure ( Act respecting health services and social services , CQLR, \nc. S-4.2,",
    "token_count": 1000,
    "start_token": 32400,
    "end_token": 33400,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 37,
    "source_file": "2024scc43.txt",
    "text": " (4) Review of the Orders  \n[98] The four corrective measures challenged by the DYP were ordered to \nprevent abusive or inadequate restraint and isolation measures from being used again. \nIn the tribun al’s view, those restraint and isolation measures infringed the young \nperson’s right to have any use of control measures against her be minimal, exceptional \nand guided by a procedure ( Act respecting health services and social services , CQLR, \nc. S-4.2, s. 118.1).  \n[99] With regard to the abusive or inadequate restraint and isolation measures, \nthe tribunal found, among other things, that the young person — who was dealing with \nsignificant mental health disorders — had been subjected to more than a hundred \nrestraint measures over a period of about five months because of acts that were \ndangerous to her or others, and that she had suffered injuries as a result of those restraint \nmeasures. On one occasion in particular, her head was completely covered with a \nsweater  to prevent her from spitting in the intervention officers’ faces, which caused \nher to hyperventilate. The tribunal stated that, during the same period, more than a \nhundred withdrawal measures, lasting from less than a minute to more than seven \nhours, had also been used against the young person. The tribunal noted that she had \n[TRANSLATION ] “spent an unreasonable amount of time isolated in a tiny, often dingy, \nconcrete room” (para.  302), in which she had sometimes beat her head against the \nwalls. These are facts that the DYP does not dispute, as she limits the debate to the \nlawfulness of the corrective measures ordered.  \n2024 SCC 43 (CanLII)\n\n--- Page 78 ---\n \n [100]  At the time the tribunal decided the applications for a declaration of \nencroachment upon rights, it was established that the young person wa s at risk of being \nsubjected again to the situations of encroachment identified by the tribunal. At that \ntime, the tribunal declared that the young person’s security and development were still \nin danger (at para.  330), extended the order of January  17, 201 8, requiring that she be \nplaced at an RCYPAP (at para.  331), and entrusted her situation to the DYP (para.  338). \nIn reviewing the four impugned orders, I will therefore focus special attention on the \nother two validity criteria set out above.  \n(a) Orders Direct ed at the Individualized Treatment Units  \n[101]  The tribunal ordered that “the youth workers, educators and intervention \nofficers who work in the individualized treatment units be able to receive specific \ntraining on mental health” (para.  340) and that these unit s “be able to obtain support \nfrom a healthcare professional specializing in mental health” (para.  341). Finding that \nthese orders were not sufficiently related to the protection of the young person’s \ninterests and rights, the Superior Court judge varied th eir wording. He narrowed the \nscope of the first order by specifying that only the youth workers, educators and \nintervention officers [ TRANSLATION ] “who will be responsible for X in the \nindividualized treatment units” could receive the mental health trainin g (paras.  65 and \n76). He narrowed the second order by specifying that only the individualized treatment \nunits [ TRANSLATION ] “that will be responsible for X” could obtain support from a \nhealthcare professional specializing in mental health (para.  76; see al so paras.  65-66). \n2024 SCC 43 (CanLII)\n\n--- Page 79 ---\n \n The judges of the Court of Appeal unanimously affirmed the Superior Court’s decision. \nI agree with their decision, apart from endorsing the suggestion that the order, to be \nvalid, necessarily had to name the child expressly.  \n[102]  The young per son stayed in just one individualized treatment unit (“ITU”), \nITU B, which is a rehabilitation unit for young people with mental health and \nbehavioural disorders. A minimum of three educators are in the unit during the day to \nlook after the young people. T he tribunal concluded that, in that unit, the young person \nhad not received all the supervision and support needed from the youth workers \n[TRANSLATION ] “because the unit was then very ‘lively’ and the various youth workers \nwere overwhelmed” (para.  301). Th e tribunal also found that when restraint measures \nwere necessary, they were implemented by security guards from a private company \nwho had very little experience and were not trained to meet the specific needs of young \npeople with mental health disorders.",
    "token_count": 1000,
    "start_token": 33300,
    "end_token": 34300,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 38,
    "source_file": "2024scc43.txt",
    "text": " that unit, the young person \nhad not received all the supervision and support needed from the youth workers \n[TRANSLATION ] “because the unit was then very ‘lively’ and the various youth workers \nwere overwhelmed” (para.  301). Th e tribunal also found that when restraint measures \nwere necessary, they were implemented by security guards from a private company \nwho had very little experience and were not trained to meet the specific needs of young \npeople with mental health disorders. When the educators left the unit around 11:00 \np.m., security guards took over for the night. Their mandate was to supervise the young \npeople and ensure their safety. Further, the tribunal noted that the turnover of security \nguards was high, since most of t hem were police technology students who were only \nthere on a short -term basis. However, nothing in the judgment suggests that these \nfindings of fact concerning ITU B could be generalized to other identifiable ITUs where \nthe young person might spend time in  the future.  \n[103]  In that context, while it was reasonable to believe that, by targeting all \n“individualized treatment units”, the corrective measures ordered would both be able \n2024 SCC 43 (CanLII)\n\n--- Page 80 ---\n \n to effectively help to prevent the recurrence of the situation of encroachment, the  \ntribunal nonetheless erred by not limiting their scope so that they were related to \npreventing the recurrence of the situation of encroachment for the young person. \nNothing in the evidence adduced supported the conclusion that such broad orders were \nneces sary to protect the young person’s interests and rights in the future. In this sense, \nthe orders exceeded the tribunal’s powers.  \n[104]  I agree with the judges of the Court of Appeal that the Superior Court \nproperly intervened to narrow the scope of these orders so that they were related to the \nprotection of the young person’s interests and rights. I would note, however, that there \nwas no reason why the Superior Court could not also have achieved this objective by \nvarying the wording of the two orders in another w ay. I will provide two examples that \nillustrate the range of preventive corrective measures available. First, the Superior \nCourt judge could have transformed the order for mental health training into a hybrid \ncorrective measure directed specifically at the  youth workers, educators and \nintervention officers from ITU B, as well as any other youth worker, educator and \nintervention officer from any other ITU that would be responsible for the young person \nin the future. Second, the judge could also have ordered that, in the event of a transfer \nto another ITU (other than ITU B), the young person could be taken charge of only by \nan ITU (1)  where the youth workers, educators and intervention officers responsible \nfor the young person would have mental health training , and (2)  that would have \nsupport from a health professional specializing in mental health.  \n2024 SCC 43 (CanLII)\n\n--- Page 81 ---\n \n (b) Orders Directed at the CISSS A  \n[105]  The tribunal ordered the CISSS A to implement a protocol within a \nreasonable time period to set out the steps to be taken when a chil d spits during an \nintervention. The tribunal also ordered the CISSS A to adapt all isolation rooms so that \nthey were safer and their walls were covered with a material that prevented injury. \nFinding that these orders were also not sufficiently related to t he protection of the \nyoung person’s interests and rights, the Superior Court judge varied them to make them \nrelate specifically to the young person. The majority of the Court of Appeal upheld the \nSuperior Court judge’s decision to expressly limit the order s to the young person’s \nsituation. The concurring judge of the Court of Appeal held that the Superior Court \njudge should not have intervened to narrow in this way the scope of the order to \nimplement a protocol setting out the steps to be taken when a child  spits. He also held, \nwith regard to the order requiring that the isolation rooms be made safer, that it should \nhave been limited to the isolation rooms in units A and B. For my part, I cannot agree \nwith the reasons of either the majority or the concurring  judge of the Court of Appeal.  \n[106]  With regard to the order to implement a protocol establishing the steps to \nbe taken when a child spits during an intervention, this is a corrective measure that was \nordered in connection with an incident experienced by the yo ung person when she \nresided in an intensive supervision unit (“ISU”), ISU A. While she was in a state of \npersonality disorganization, restraint measures were used to",
    "token_count": 1000,
    "start_token": 34200,
    "end_token": 35200,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 39,
    "source_file": "2024scc43.txt",
    "text": " the majority or the concurring  judge of the Court of Appeal.  \n[106]  With regard to the order to implement a protocol establishing the steps to \nbe taken when a child spits during an intervention, this is a corrective measure that was \nordered in connection with an incident experienced by the yo ung person when she \nresided in an intensive supervision unit (“ISU”), ISU A. While she was in a state of \npersonality disorganization, restraint measures were used to take her to the withdrawal \nblock. While being moved, the young person refused to cooperate  and spat in the face \n2024 SCC 43 (CanLII)\n\n--- Page 82 ---\n \n of one of the officers. The educator on site then used an article of clothing to completely \ncover the young person’s head and thus prevent her from spitting on the officers. The \ntribunal noted that, at the time, the head of ISU A beli eved that the officers had \n[TRANSLATION ] “the right to cover a young person’s head during transport to avoid \nbeing spit on” (para.  215). The tribunal found that none of the intervention units of the \nRCYPAPs of the CISSS A — including the RCYPAPs where the young person had \nspent time in the past and those where she might spend time in the future — had a \nprotocol establishing the steps to be taken when a child spits. In this case, the young \nperson spent time in four different RCYPAP units over a period of abo ut 14 months \n(one ISU, one ITU, one regular rehabilitation unit and one intensive supervision \nrehabilitation unit) (para.  2); she exhibited self -destructive and difficult behaviour at \neach of those RCYPAPs (paras.  23, 26, 89, 95 and 110); and there may hav e been \nobstacles to her spending time at certain RCYPAPs (paras.  52 and 99). There was \ntherefore a real risk that she would spend time at one or more of those RCYPAPs. \nHowever, certain variables undermined the foreseeability and consistency of such \nstays. The tribunal also found that the internal memos that prohibited covering a child’s \nhead were not complied with by everyone. Moreover, similar incidents had occurred in \nother RCYPAP units of the CISSS A where the young person had spent time in the past \nand/or might spend time in the future. The DYP testified that this was an unacceptable \npractice that should not be used again (para.  223). The tribunal noted that, months after \nthe incident, alternative measures to protect the security guards were still not in  place.  \n2024 SCC 43 (CanLII)\n\n--- Page 83 ---\n \n [107]  In that context, the tribunal exceeded its powers by ordering the CISSS A \nto implement a protocol that set out the steps to be taken when a child spits during an \nintervention. It is certainly possible that such a corrective measure would effectivel y \nhelp to prevent the recurrence of the situation of encroachment. However, the order as \nworded was not related to preventing the recurrence of the situation of encroachment \nfor the young person. The measure should have been more specific and circumscribed  \nby reference to the evidence and the context. The tribunal did not confine itself to \nordering a measure that reflected the risk of harm faced by the young person, because \nthat measure would apply to all CISSS A service centres, including: local community \nservice centres; hospital centres; child and youth protection centres; residential and \nlong-term care centres; and rehabilitation centres (see An Act to modify the organization \nand governance of the health and social services network, in particular by abol ishing \nthe regional agencies , CQLR, c.  O-7.2, Sch.  I). Yet it is clear from the tribunal’s \nfindings of fact that only the RCYPAPs where the young person had spent time and \nwhere she might spend time in the future could potentially contribute to the recurre nce \nof the encroachment upon her rights. As an appellate court, the Superior Court owed \ndeference to those findings of fact made by the tribunal ( Québec (Protection de la \njeunesse) v. C.P. , 2000 CanLII 11372 (Que. C.A.)). It was not out of the question tha t \nthe young person might spit when receiving services from a local community service \ncentre or a hospital centre. However, there was nothing to indicate that the young \nperson was at risk of having her rights encroached upon again in those other service",
    "token_count": 1000,
    "start_token": 35100,
    "end_token": 36100,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 40,
    "source_file": "2024scc43.txt",
    "text": " to those findings of fact made by the tribunal ( Québec (Protection de la \njeunesse) v. C.P. , 2000 CanLII 11372 (Que. C.A.)). It was not out of the question tha t \nthe young person might spit when receiving services from a local community service \ncentre or a hospital centre. However, there was nothing to indicate that the young \nperson was at risk of having her rights encroached upon again in those other service \ncentres. Consequently, in light of the evidence and the context, the scope of the order \n2024 SCC 43 (CanLII)\n\n--- Page 84 ---\n \n made by the tribunal went beyond protecting the interests and rights of the young \nperson whose situation had been referred to it.  \n[108]  It was therefore appropriate to vary the order made by the tribunal. As the \njudges of the Court of Appeal wrote, the Superior Court judge was clearly correct in \nintervening to narrow the scope of the order. However, the proposed variation missed \nthe mark. The order made by the Superior Court judg e had the same problem as the one \nmade by the tribunal: it was overbroad. Even with the more specific words \n[TRANSLATION ] “when X spits”, the order failed to recognize that, according to the \nfindings of fact, the situation of encroachment and its recurrenc e were tied — and \nlimited — to the RCYPAPs where the young person had spent time and might spend \ntime in the future. In light of the findings of fact, the order should have been directed \nat the RCYPAPs of the CISSS A and at any other RCYPAP that would be r esponsible \nfor the young person. It would have been a hybrid order. By being directed at “any \nother RCYPAP that would be responsible for the young person”, the order would have \nfollowed the young person through the system if she spent time at other RCYPAPs  that \nwere part of other CISSSs (other than the CISSS A). Of course, the evidence and the \ncontext did not provide a basis for ordering all Quebec CISSSs outright to implement \na protocol. However, an RCYPAP would have had to implement a protocol if two \ncond itions were met: (1)  the young person had to spend time at that RCYPAP, and \n(2) the RCYPAP did not already have a protocol in place. Alternatively, I note that, \namong the range of available measures, it would also have been acceptable for the \n2024 SCC 43 (CanLII)\n\n--- Page 85 ---\n \n tribunal to o rder that, in the event of a transfer, the young person could be transferred \nonly to an RCYPAP where a protocol was already in place.  \n[109]  With regard to the order requiring that the isolation rooms be made safer, \nthis corrective measure was ordered in response  to the injuries suffered by the young \nperson during periods of isolation. The tribunal judge visited the withdrawal blocks in \nISU A and ITU B. Further to that visit, she noted that the rooms in both units were \n[TRANSLATION ] “small” and that there were “ba re floors and bare walls”, which were \n“made of concrete” (para.  184). She noted that in ITU B, the walls were [ TRANSLATION ] \n“in a sorry state” and the paint on them was “dingy” (para.  184). She observed that the \nisolation rooms were so small that [ TRANSLAT ION] “[a] child who is in there can only \nsit or lie on the floor” (para.  184). Moreover, the tribunal found that during the young \nperson’s many periods of isolation in ISU A and ITU B, she had injured herself by \nbanging her head against the concrete walls or hitting them with her hands hard enough \nto require medical care. However, nothing in the judgment supports the conclusion that \nthese findings of fact could be generalized to all rehabilitation units at all RCYPAPs of \nthe CISSS A — which the concurring j udge of the Court of Appeal properly noted.  \n[110]  In that context, while the corrective measure ordering the CISSS A to make \nall of the isolation rooms safer would undoubtedly have helped to prevent the \nrecurrence of the situation of encroachment, it nevertheles s exceeded the tribunal’s \npowers because it was not sufficiently anchored in the evidence and the context. As \nregards the order that should have been made, the one proposed by the Superior Court \n2024 SCC 43 (CanLII)\n\n--- Page",
    "token_count": 1000,
    "start_token": 36000,
    "end_token": 37000,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 41,
    "source_file": "2024scc43.txt",
    "text": "110]  In that context, while the corrective measure ordering the CISSS A to make \nall of the isolation rooms safer would undoubtedly have helped to prevent the \nrecurrence of the situation of encroachment, it nevertheles s exceeded the tribunal’s \npowers because it was not sufficiently anchored in the evidence and the context. As \nregards the order that should have been made, the one proposed by the Superior Court \n2024 SCC 43 (CanLII)\n\n--- Page 86 ---\n \n judge and affirmed by the majority of the Court of Appeal can not be upheld, because \nit is imprecise. As for the order suggested by the concurring judge of the Court of \nAppeal, it is not sufficiently anchored in the tribunal’s findings of fact. While in the \nabstract there was nothing to prevent the tribunal from orde ring the CISSS A to make \nall of the isolation rooms in units A and B safer, here the findings of fact do not indicate \nthat all of the isolation rooms in those units had to be made safer to ensure that the \nyoung person had access to a safe isolation room at  all times. Indeed, the tribunal made \nno finding of fact concerning the number of isolation rooms per unit or their occupancy \nlevel. Similarly, there is no finding of fact from which inferences on this point can be \ndrawn. I am therefore of the view that th e tribunal’s order should have been varied to \ndirect the CISSS A to have at least one isolation room, covered with a material that \nprevented injury, available for the young person at all times in units A and B and in the \nother units that would become respo nsible for her. The DYP and the CISSS A would \nthen have had to assess whether, to comply with that order, it was necessary to make \nmore than one, or even all, of the isolation rooms in the units in question safer. \nAlternatively, I note that, among the rang e of available measures, it would also have \nbeen acceptable for the tribunal to order that, in the event of a transfer, the young person \ncould be transferred only to an RCYPAP where at least one safe isolation room — \nwhose walls were covered with a materia l that prevented injury — was available.  \n(5) Tribunal’s Power To Make Recommendations  \n2024 SCC 43 (CanLII)\n\n--- Page 87 ---\n \n [111]  Where the tribunal concludes that the rights of a child in difficulty have \nbeen encroached upon by persons, bodies or institutions, it may intervene to prevent \nthe recurrence  of the situation of encroachment (see Protection de la jeunesse – \n123979 , at para.  22). In such circumstances, it may be appropriate for the tribunal to \nmake a non -binding recommendation if it considers this to be warranted in light of the \nevidence. I wil l explain.  \n[112]  It is true that the Court of Québec is a statutory tribunal and that, in cases \ninvolving encroachment upon rights, it can make only decisions or orders that are \nprovided for by statute (see YPA, ss. 90 et seq.). It cannot, of course, exceed that  \njurisdiction. However, its power to make recommendations is anchored in the YPA: it \nflows from the text, scheme and object of that statute. Its existence is expressly \ncontemplated by s.  91 para.  2 of the YPA. While a power of this kind is not referred to \nin s. 91 para.  4, which deals specifically with encroachment upon rights, a large and \nliberal interpretation of the provision, in keeping with the proper approach to remedial \nlegislation, leads me to conclude that the power nevertheless applies in circumst ances \nwhere rights have been encroached upon. Support for the existence of this power can \nalso be found in a practice that is well established in the Quebec jurisprudence on \nencroachment upon rights (see, e.g., Protection de la jeunesse – 236587 , 2023 QCCQ  \n12263, at paras.  8 et seq.; Protection de la jeunesse – 211624 , 2021 QCCQ 2868, at \npara.  96; see also Protection de la jeunesse – 123979 , at para.  26). Indeed, in this case, \nthe Superior Court judge expressed the view that [ TRANSLATION ] “the conclusions o f a \ngeneral nature” arrived at by the tribunal “could be stated as recommendations” \n2024 SCC 43 (CanLII)\n\n--- Page 88 ---\n \n (para.  8). Moreover, although this Court is not bound by a party’s",
    "token_count": 1000,
    "start_token": 36900,
    "end_token": 37900,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 42,
    "source_file": "2024scc43.txt",
    "text": " 96; see also Protection de la jeunesse – 123979 , at para.  26). Indeed, in this case, \nthe Superior Court judge expressed the view that [ TRANSLATION ] “the conclusions o f a \ngeneral nature” arrived at by the tribunal “could be stated as recommendations” \n2024 SCC 43 (CanLII)\n\n--- Page 88 ---\n \n (para.  8). Moreover, although this Court is not bound by a party’s admissions on a \nquestion of law, I take note of two admissions. First, counsel for the respondent admits \nthat the tribunal [ TRANSLATION ] “can make recommendations” in a case involving \nencroachment upon rights (transcript, at pp.  94-95). Before the Superior Court, the \nrespondent had herself asked that recommendations be substituted for the impugned \norders, tha t is, the ones set out at paras.  340-41 and 345 -46 of the tribunal’s judgment \n(Sup. Ct. reasons, at para.  11). Second, the intervener the Attorney General of Quebec \nadmits that the tribunal is not precluded from [ TRANSLATION ] “making \nrecommendations” in a case involving encroachment upon rights (I.F., at para.  60). \nThese two admissions corroborate what the jurisprudence already tells us: where rights \nhave been encroached upon, the tribunal has a power to make recommendations that it \nderives from the text, s cheme and object of the YPA. \n[113]  The tribunal’s power to make recommendations is particularly useful \nwhere the circumstances do not lend themselves to stating a conclusion in the form of \nan order under s.  91 para.  4 of the YPA. According to author Mario Provos t, \n[TRANSLATION ] “the validity of orders that are broader in scope is open to question.  . . . \nSince the Act has not expanded the power of this statutory tribunal, some argue that \nconclusions of a general nature should be ‘recommended’ rather than ‘ordered’ ” (Droit \nde la protection de la jeunesse  (3rd ed. 2022), at p.  289; M.  Provost, “La protection de \nla jeunesse”, in T.  Gagné -Dubé et  al., eds., Droit de la famille québécois  (loose -leaf), \nat ¶54 -310). This is correct. Where the three criteria for the validi ty of a corrective \nmeasure ordered for preventive purposes are not all met, the tribunal still has the power \n2024 SCC 43 (CanLII)\n\n--- Page 89 ---\n \n to make a recommendation anchored in the evidence concerning the encroachment \nupon rights. This power to make a recommendation thus allows the trib unal to point \nout the existence of a problem relating to an encroachment upon the child’s rights and \nto encourage the authorities to address it.  \n[114]  It is obviously preferable for the tribunal to be cautious in exercising its \npower to make recommendations. As author Jean -François Boulais correctly observes, \n[TRANSLATION ] “if the recommendation is not followed, it is the judge’s moral \nauthority that is undermined” ( Loi sur la protection de la jeunesse, texte annoté  (5th \ned. 2003), at p.  445). Indeed, when the au thority named in the recommendation \n[TRANSLATION ] “disregards the recommendation[,] .  . . the Court’s credibility is \naffected” ( Protection de la jeunesse , [1985] AZ -50942189 (Que. Y.C.), at p.  2). That \nbeing said, the tribunal has all the discretion it needs to develop a recommendation \nbased on the situation of encroachment experienced by the child whose situation has \nbeen referred to it, as shown by the evidence. Because the Youth Division of the Court \nof Québec is the judicial tribunal that has the mos t intimate knowledge of the youth \nprotection system and that participates in its implementation on a daily basis, it is \nparticularly well placed to exercise this power to make recommendations (see Costanzo \nand Paré, at pp.  151 and 153 -54). \n[115]  It is therefore true, in this case, that the tribunal’s concerns as reflected at \nparas.  340-41 and 345 -46 of its judgment could have been expressed as \nrecommendations. At the time it rendered its judgment, the tribunal did have the power \n2024 SCC 43 (CanLII)\n\n--- Page 90 ---\n \n to make non -binding recommendation",
    "token_count": 1000,
    "start_token": 37800,
    "end_token": 38800,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 43,
    "source_file": "2024scc43.txt",
    "text": " Paré, at pp.  151 and 153 -54). \n[115]  It is therefore true, in this case, that the tribunal’s concerns as reflected at \nparas.  340-41 and 345 -46 of its judgment could have been expressed as \nrecommendations. At the time it rendered its judgment, the tribunal did have the power \n2024 SCC 43 (CanLII)\n\n--- Page 90 ---\n \n to make non -binding recommendation s based on those concerns, provided that these \nrecommendations were anchored in the evidence. This was an available and acceptable \noption at the time.  \n[116]  I add that the tribunal was clearly concerned about the situation \nexperienced by the young person during her time in various CISSS A units. After \nhaving an opportunity to hear the parties, various professionals from the rehabilitation, \nsecurity and psychosocial services sectors, as well as the DYP, the tribunal concluded \nthat some of the encroachments upon th e young person’s rights resulted from \ninstitutional or systemic problems that affected other children in Quebec’s youth \nprotection system. The authorities concerned — in keeping with the mission assigned \nto them by the YPA of protecting children whose secu rity or development is or may be \nin danger — would be well advised to take note of the tribunal’s conclusions and to \nconsider what action they can take to ensure that the encroachments upon rights \nexperienced by the young person are not experienced by othe rs. \nB. Right of the CISSS A To Be Heard or Duly Called  \n[117]  A secondary question arises with respect to art.  17 C.C.P. , which gives the \nCISSS A the right to be heard or duly called. Like its predecessor, art.  5 of the former \nCode of Civil Procedure , CQLR, c.  C-25, art. 17 C.C.P. codifies a fundamental \nprinciple of natural justice: the maxim audi alteram partem . The first paragraph states \nthat “[t] he court cannot rule on an application, or take a measure on its own initiative, \nwhich affects the rights of a party unless the party has been heard or duly called .” \n2024 SCC 43 (CanLII)\n\n--- Page 91 ---\n \n [118]  After raising the question themselves while the case was under advisement \nand requesting submissions from the parties, the judges of the Court of Appeal all \nexpressed the view that the orders could not be made against the CISSS A because it \nwas not [TRANSLATION ] “formally party to the proceedings ” at first instance (para.  50; \nsee also para.  82). In their opinion, to hold otherwise would violate the [TRANSLATION ] \n“principle that courts make orders against properl y summoned parties” and would be \nan error of law (para.  52; see also para.  82). The Court of Appeal therefore found that \nthe guiding principle of art.  17 para.  1 C.C.P. had been violated. On that basis, it varied \nthe two orders so that they were made again st the DYP rather than the CISSS A \n(paras.  54 and 83).  \n[119]  The CDPDJ does not agree. It asks this Court to restore the orders against \nthe CISSS A. According to it , even if the Court were to find that the CISSS A should \nhave been joined to the proceedings as a party or impleaded party, the Court of Appeal \nstill erred in intervening because, it says, the CISSS A was not significantly prejudiced \nby that omission. The intervener X agrees with the CDPDJ’s argument. As for the \ninterveners A and B, they also maintain that the Court of Appeal erred in intervening, \nbut for different reasons: they take the view that the CISSS A was a party to the \nproceedings through the DYP and that the expression “director of youth protection” \nwas sufficient to clearly identify and desig nate the CISSS A.  \n[120]  The DYP has not made any argument on this question. That being said, she \nasks that we dismiss the appeal and thus that we not vary the Court of Appeal’s \n2024 SCC 43 (CanLII)\n\n--- Page 92 ---\n \n disposition. It should be noted, however, that  before the Court of Appeal, the DYP, l ike \nthe CDPDJ, requested that the orders be maintained against the CISSS A (C.A. reasons, \nat para.  51: [ TRANSLATION",
    "token_count": 1000,
    "start_token": 38700,
    "end_token": 39700,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 44,
    "source_file": "2024scc43.txt",
    "text": " That being said, she \nasks that we dismiss the appeal and thus that we not vary the Court of Appeal’s \n2024 SCC 43 (CanLII)\n\n--- Page 92 ---\n \n disposition. It should be noted, however, that  before the Court of Appeal, the DYP, l ike \nthe CDPDJ, requested that the orders be maintained against the CISSS A (C.A. reasons, \nat para.  51: [ TRANSLATION ] “All the parties requested that the orders be maintained \nagainst the [CISSS A]” (emphasis added)).  \n[121]  I cannot accept the position put forward  by the CDPDJ. Even if it is \nassumed that a breach of the right to be heard or duly called (and therefore of art.  17 \npara.  1 C.C.P. ) can be remedied by showing an absence of prejudice — a question that \nshould be left for another day — I am unable to infer that the CISSS  A was not \nprejudiced. The appeal record as it stands is rather scanty on this point. First, it does \nnot allow us to address the legal question of whether absence of prejudice may be a \nrelevant consideration where a court of law is determinin g whether there has been a \nbreach of the audi alteram partem  rule and, if so, what remedy it should grant (if any). \nSecond, the appeal record also does not allow us to address the question of whether the \nCISSS A was prejudiced. The Court does not have full  submissions on these questions \nor even a complete picture of the proceedings at first instance. In the circumstances, it \nis enough to say that the CDPDJ has not satisfied me that the CISSS A was not \nprejudiced. I would therefore affirm the Court of Appeal ’s choice to intervene so that \nthe orders were made against the DYP (paras.  54 and 83). That being said, while I agree \nwith the result reached by the Court of Appeal, I do not fully endorse its reasons. \nAccording to that court, [ TRANSLATION ] “[i]t  is an er ror of law to make orders against \na person who is not [formally] party to the matter”  (para.  52; see also paras.  50 and 82). \nIn my view, it should instead have been found that it is an error of law to make orders \n2024 SCC 43 (CanLII)\n\n--- Page 93 ---\n \n against a person “unless the party has been heard or duly called” (art.  17 para.  1 \nC.C.P. ). Finally, because this was a case in which a young person’s interests were at \nstake and because the decision rendered would affect the interests of the CISSS A, the \ntribunal could have required the attendance of the CISSS A and heard it after it was \ncalled (art.  50 C.C.P. ). \nVI. Disposition  \n[122]  I woul d allow the appeal in part. If not for the fact that the young person \nreached the age of majority during the appeal proceedings, I would have restored the \norder made at para.  345 of the tribunal’s judgment, with two exceptions: first, the order \nwould have been directed at the DYP rather than the CISSS A, and second, the scope \nof the order would have been limited to the RCYPAPs of the CISSS A and the other \nRCYPAPs to which the young person would be entrusted. I would also have varied the \nwording of the order  made at para.  346 to direct the DYP, and not the CISSS A, to have \nat least one isolation room, covered with a material that prevented injury, available for \nthe young person at all times in units A and B of the CISSS A and in the other RCYPAP \nunits to whic h she would be entrusted. These are the orders “that the tribunal should \nhave made” at paras.  345-46 of its judgment, although I recognize that other alternative \norders were available and acceptable and could therefore have been made ( YPA, s. 112; \nsee also  ss. 128 and 129; Supreme Court Act , R.S.C. 1985, c.  S-26, s.  45; Protection de \nla jeunesse – 123979 , at para.  27). However, since the young person is no longer the \nsubject of social intervention under the YPA and never will be again given that she is \n2024",
    "token_count": 1000,
    "start_token": 39600,
    "end_token": 40600,
    "total_tokens_in_source": 40982
  },
  {
    "chunk_id": 45,
    "source_file": "2024scc43.txt",
    "text": " could therefore have been made ( YPA, s. 112; \nsee also  ss. 128 and 129; Supreme Court Act , R.S.C. 1985, c.  S-26, s.  45; Protection de \nla jeunesse – 123979 , at para.  27). However, since the young person is no longer the \nsubject of social intervention under the YPA and never will be again given that she is \n2024 SCC 43 (CanLII)\n\n--- Page 94 ---\n \n now an adult, no order will be made ( Protection de la jeunesse – 10174 , 2010 QCCA \n1912, [2010] R.J.Q. 2291, at para.  94 in limine ; Protection de la jeunesse – 18935 , 2018 \nQCCQ 10532, at paras.  22-23; Protection de la jeunesse – 211323 , 2021 QCCQ 2238, \nat para.  24; Protection de la jeunesse – 211624 , at para.  79). No recommendation will \nbe made either. Given the circumstances of this appeal, no costs should be awarded.  \n Appeal  allowed in part , without costs . \n Solicitor s for the appellant : Bitzakidis, Clément -Major, Fournier , \nMontréal.  \n Solicitor s for the respondent : IMK, Montréal; Ét ude légale du CISSS A . \n Solicitors for the intervener the Attorney General of Quebec : Bernard, Roy \n(Justice -Québec), Direction du contentieux , Montréal . \n Solicitors  for the interve ners A and B : Pringle & Associés , Laval.  \n Solicitor  for the intervener X : Centre communautaire juridique de la Rive -\nSud, Longueuil.  \n Solicitors  for the intervener the Canadian Civil Liberties \nAssociation : McCarthy Tétrault , Montréal.  \n2024 SCC 43 (CanLII)\n\n--- Page 95 ---\n \n  Solicitor  for the intervener the British Columbia Civil Liberties \nAssociation : Larochelle Law, Whitehorse.  \n2024 SCC 43 (CanLII)\n\n",
    "token_count": 482,
    "start_token": 40500,
    "end_token": 40982,
    "total_tokens_in_source": 40982
  }
]