[
  {
    "chunk_id": 0,
    "source_file": "2024scc37.txt",
    "text": "--- Page 1 ---\n \n  \nSUPREME COURT OF CANADA  \n \nCITATION : TransAlta Generation \nPartnership v. Alberta, 2024 \nSCC  37   \nAPPEAL HEARD : April  25, 2024  \nJUDGMENT RENDERED : \nNovember 8, 2024  \nDOCKET : 40570  \n \nBETWEEN : \n \nTransAlta Generation Partnership and  \nTransAlta Generation (Keephills 3)  \nAppellants  \n \nand \n \nHis Majesty The King in Right of the Province of Alberta and  \nMinister of Municipal Affairs for the Province of Alberta  \nRespondents  \n \n- and - \n \nAttorney General of Ontario,  \nAttorney General of Quebec,  \nAttorney General of British Columbia,  \nAttorney General of Saskatchewan,  \nTrial Lawyers Association of British Columbia,  \nHIV & AIDS Legal Clinic Ontario, Health Justice Program,  \nChicken Farmers of Canada, Egg Farmers of Canada,  \nTurkey Farmers of Canada, Canadian Hatching Egg Producers,  \nWorkers’ Compensation Board of British Columbia,  \nCanadian Association of Refugee Lawyers,  \nAssociation québécoise des avocats et avocates en droit de l’immigration,  \nAdvocates for the Rule of Law and   \nNational Association of Pharmacy Regulatory Authorities  \nInterveners  \n2024 SCC 37 (CanLII)\n\n--- Page 2 ---\n \n  \n \n \nCORAM : Wagner C.J. and Karakatsanis, Côté, Rowe, Martin, Kasirer, Jamal, \nO’Bonsawin and Moreau JJ.  \n \nREASONS FOR \nJUDGMENT :  \n(paras. 1 to 65)  Côté J. (Wagner C.J. and Karakatsanis, Rowe, Martin, \nKasirer, Jamal, O’Bonsawin and Moreau JJ. concurring)  \n \n \nNOTE: This document is subject to editorial revision before its reproduction in final \nform in the Canada Supreme Court Reports . \n   \n \n  \n2024 SCC 37 (CanLII)\n\n--- Page 3 ---\n \n TransAlta Generation Partnership  and \nTransAlta Generation (Keephills 3)  Appellants  \nv. \nHis Majesty The King in R ight of the Province of Alberta and  \nMinister of Municipal Affairs for the Province of Alberta  Respondents  \nand \nAttorney General of Ontario,  \nAttorney General  of Quebec,  \nAttorney General of British Columbia,  \nAttorney General of Saskatchewan,  \nTrial Lawyers Association of British Columbia,  \nHIV & AIDS Legal Clinic Ontario , Health Justice Program,  \nChicken Farmers of Canada, Egg Farmers of Canada,  \nTurkey Farmers of  Canada,  Canadian Hatching Egg Producers,  \nWorkers ’ Compensation Board of British Columbia,  \nCanadian Association of Refugee Lawyers,  \nAssociation québécoise des avocats et avocates en droit de l ’immigration,  \nAdvocates for the Rule of Law and  \nNational Associa tion of Pharmacy Regulatory Authorities  Interveners  \nIndexed as: TransAlta Generation Partnership  v. Alberta  \n2024  SCC  37 \nFile No.: 40570.  \n2024:  April  25; 2024:  November  8. \n2024 SCC 37 (CanLII)\n\n--- Page 4 ---\n \n Present: Wagner  C.J. and Karakatsanis, Côté, Rowe, Martin, Kasirer, Jamal, \nO’Bonsawin  and Moreau  JJ. \nON APPEAL  FROM  THE  COUR T OF APPEAL FOR  ALBERTA  \n Administrative law — Judicial review — Standard of review — \nSubordinate legislation — Vires — Administrative discrimination — Property \nassessment guidelines challenged as ultra vires provincia l minister — Standard of \nreview applicable to review of vires of subordinate legislation — Whether guidelines \nwithin scope of authority delegated to minister by enabling statute  — Whether \nguidelines violate common law rule against administrative discrimina tion — \nMunicipal Government Act, R.S.A. 2000, c.  M-26, ss.  322, 322.1 — 2017 Alberta \nLinear Property Assessment Minister’s Guidelines, ss.  1.003, 2.003.  \n TransAlta owns coal -fired electric power generation facilities in Alberta. \nIn 2016, TransAlta entered into an off -coal agreement with Alberta. Under that \nagreement, TransAlta agreed to cease coal -fired emissions on or before December  31, \n2030, in exchange for substantial transition payments from Alberta for 14 years to \ncompensate TransAlta for the loss res ulting from the reduced life of its coal -f",
    "token_count": 1000,
    "start_token": 0,
    "end_token": 1000,
    "total_tokens_in_source": 14089
  },
  {
    "chunk_id": 1,
    "source_file": "2024scc37.txt",
    "text": ".  \n TransAlta owns coal -fired electric power generation facilities in Alberta. \nIn 2016, TransAlta entered into an off -coal agreement with Alberta. Under that \nagreement, TransAlta agreed to cease coal -fired emissions on or before December  31, \n2030, in exchange for substantial transition payments from Alberta for 14 years to \ncompensate TransAlta for the loss res ulting from the reduced life of its coal -fired \nfacilities. TransAlta’s coal -fired facilities are assessed as linear property for municipal \ntaxation purposes. Sections 322 and 322.1 of Alberta’s Municipal Government Act \n(“MGA ”) authorize the province’s Mini ster of Municipal Affairs to establish guidelines \nfor assessing the value of linear property.  \n2024 SCC 37 (CanLII)\n\n--- Page 5 ---\n \n  In 2017, the Minister established the 2017 Alberta Linear Property \nAssessment Minister’s Guidelines  (“Linear Guidelines ”) under the MGA . Sections \n1.003 and 2.003  of the Linear Guidelines  deprive TransAlta of the ability to claim \nadditional depreciation on the basis of the reduction in its facilities’ lifespan arising \nfrom the off -coal agreement. TransAlta challenged the vires of the Linear Guidelines  \non two bases:  (1) they violate the common law rule against administrative \ndiscrimination; and (2)  they are inconsistent with the purposes of the MGA . \n The chambers judge upheld the validity of the Linear Guidelines  and found \nthat the Linear Guidelines  did not discrimin ate against TransAlta. The Court of Appeal \ndetermined that the Linear Guidelines  did not discriminate against TransAlta and held \nthat the chambers judge did not err in finding that they  were within the Minister’s \nauthority.  \n Held : The appeal should be dis missed.  \n As set out in the companion case Auer v. Auer , 2024 SCC 36, the \nreasonableness standard under Canada (Minister of Citizenship and Immigration) v. \nVavilov , 2019 SCC 65, [2019] 4 S.C.R. 653, presumptively applies when reviewing the \nvires of subordinate legislation. In addition, certain principles from Katz Group  \nCanada Inc. v. Ontario (Health and Long -Term Care) , 2013 SCC 64, [2013] 3 S.C.R. \n810, continue to inform reasonableness review, but  the threshold from Katz Group used \nto determine whether subordinate legislation is ultra vires  on the basis that it is \ninconsistent with the purpose of the enabling statute — that it be irrelevant, extraneous \n2024 SCC 37 (CanLII)\n\n--- Page 6 ---\n \n or completely unrelated to that statutory purpose — is no longer applicable to this \nanalysis.  As well, the governing statutory scheme, other applicable statutory or \ncommon law, and the principles of statutory interpretation are particularly relevant \nconstraints when determining whether subordinate legislation falls reasonably within \nthe scope of the  delegate’s authority. In the instant case, no exception to the \npresumption of reasonableness review applies and thus the reasonableness standard \napplies when reviewing the vires  of the Linear Guidelines . Having regard to the \ngoverning statutory scheme, th e principles of statutory interpretation, and the common \nlaw rule against administrative discrimination, the Linear Guidelines  are intra vires  the \nMinister.  \n Administrative discrimination arises when subordinate legislation \nexpressly distinguishes among th e persons to whom its enabling legislation applies.  \nAdministrative discrimination is different than discrimination in the context of the \nCanadian Charter of Rights and Freedoms  or human rights legislation. It relates to the \ndrawing of distinctions between persons or classes that are discriminatory in a non -\npejorative sense, in that they simply do not apply equally to all those engaged in the \nactivity that is the subject of the enactment.  The common law rule against \nadministrative discrimination provides tha t subordinate legislation that discriminates \nin the administrative law sense is invalid unless the discrimination is authorized — \neither expressly or by necessary implication — by the enabling statute. It is concerned \nwith ensuring that statutory delegates  act within the scope of their authority when they \ndistinguish between the persons to whom the enabling legislation applies. The question \n2024 SCC 37 (CanLII)\n\n--- Page 7 ---\n \n of statutory authorization to discriminate falls within the reasonableness review to be \nconducted in a vires  challenge  to subordinate legislation, unless the legislature has \nindicated otherwise or a question relating to the rule of law arises which should be \nreviewed for correctness.  \n In the instant case, the Linear Guidelines  discriminate against TransAlta \nand other",
    "token_count": 1000,
    "start_token": 900,
    "end_token": 1900,
    "total_tokens_in_source": 14089
  },
  {
    "chunk_id": 2,
    "source_file": "2024scc37.txt",
    "text": " persons to whom the enabling legislation applies. The question \n2024 SCC 37 (CanLII)\n\n--- Page 7 ---\n \n of statutory authorization to discriminate falls within the reasonableness review to be \nconducted in a vires  challenge  to subordinate legislation, unless the legislature has \nindicated otherwise or a question relating to the rule of law arises which should be \nreviewed for correctness.  \n In the instant case, the Linear Guidelines  discriminate against TransAlta \nand other part ies to off -coal agreements by singling them out as being ineligible to \nclaim additional depreciation on the basis of the off -coal agreements. The fact that the \nLinear Guidelines  treat all parties to off -coal agreements in the same way does not \nmean that th ey are not discriminatory; they treat all parties to off -coal agreements in \nthe same discriminatory way, as compared with owners of linear property who are not \nparties to off -coal agreements and expressly distinguish between owners of linear \nproperty who a re parties to off -coal agreements and those who are not parties to such \nagreements, though both are subject to the MGA . \n The MGA  does not expressly authorize the Minister to discriminate against \nTransAlta; however, that discrimination is statutorily author ized by necessary \nimplication. To ensure that the assessment of TransAlta’s coal -fired facilities was \ncurrent, correct, fair and equitable in accordance with the purpose of the MGA , it falls \nwithin a reasonable interpretation of the Minister’s statutory gr ant of power to conclude \nthat he was authorized t o deprive TransAlta of the ability to claim additional \ndepreciation. Transition payments under the off -coal agreement account for some loss \nof value to TransAlta’s coal -fired facilities due to their reduced life and the existence \n2024 SCC 37 (CanLII)\n\n--- Page 8 ---\n \n of the off -coal agreement is a specification or characteristic of TransAlta’s coal -fired \nfacilities that the Minister was authorized to consider in establishing valuation \nstandards for those facilities. The Linear Guidelines  are cons istent with the purposes \nof the MGA  and do not violate the common law rule against administrative \ndiscrimination; they are therefore intra vires  the Minister.  \nCases Cited  \n Applied:  Auer v. Auer , 2024 SCC 36; referred to:  Canada (Minister of \nCitizenship and  Immigration) v. Vavilov , 2019 SCC 65, [2019] 4 S.C.R. 653; Edmonton \n(City) v. Edmonton East (Capilano) Shopping Centres Ltd. , 2016 SCC 47 , [2016] 2 \nS.C.R. 293; Katz Group Canada Inc. v. Ontario (Health and Long -Term Care) , 2013 \nSCC 64 , [2013] 3 S.C.R. 810 ; References re Greenhouse Gas Pollution Pricing Act , \n2021 SCC 11, [2021] 1 S.C.R. 175; Reference re  Impact Assessment Act , 2023 SCC \n23; Canadian Council for Refugees v. Canada (Citizenship and Immigration) , 2023 \nSCC 17; Green v. Law Society of Manitoba , 2017 SCC 20, [2017] 1 S.C.R. 360; West \nFraser Mills Ltd. v. British Columbia (Workers’ Compensation Appeal Tribunal) , 2018 \nSCC 22, [2018] 1 S.C.R. 635; La Rose v. Canada , 2023 FCA 241, 488 D.L.R. (4th) \n340; Rizzo & Rizzo Shoes Ltd. (Re) , [1998] 1 S.C.R. 27; Fédération des producteurs de \nfruits et légumes du Québec v. Conserverie canadienne Ltée , [1990] R.J.Q. 2866; \nSunshine Village Corp. v. Canada (Parks) , 2004 FCA 166, [2004] 3 F.C.R. 600; \nMontréal (City of) v. Arcade Amusements Inc. , [1985] 1 S.C.R. 368 ; Forget v. Quebec \n(Attorney General) , [1988] 2 S.C.R. 90; Shell Canada Products Ltd. v. Vancouver \n2024 SCC 37 (CanLII)\n\n--- Page 9 ---\n \n (City) , [1994] 1 S.C.R. 231 ; Edmonton (City) v. Army & Navy Department Stores Ltd. , \n[2002]",
    "token_count": 1000,
    "start_token": 1800,
    "end_token": 2800,
    "total_tokens_in_source": 14089
  },
  {
    "chunk_id": 3,
    "source_file": "2024scc37.txt",
    "text": ". , [1985] 1 S.C.R. 368 ; Forget v. Quebec \n(Attorney General) , [1988] 2 S.C.R. 90; Shell Canada Products Ltd. v. Vancouver \n2024 SCC 37 (CanLII)\n\n--- Page 9 ---\n \n (City) , [1994] 1 S.C.R. 231 ; Edmonton (City) v. Army & Navy Department Stores Ltd. , \n[2002] A.M.G.B.O. No. 126 (QL) . \nStatutes and Regulations Cite d \nCanadian Charter  of Rights and Freedoms . \nMatters Relating to Assessment and Taxation Regulation , Alta. Reg. 220/2004, s.  8(2).  \nMinisterial Order No. MAG:021/17, December  19, 2017.  \nMunicipal Government Act , R.S.A. 2000, c.  M-26, ss. 1(1)(n), 284(1) (c), (f.01) , (k), \n292(1), (2) , 322, 322.1 . \nAuthors Cited  \nAlberta. 2017  Alberta Linear Property Assessment Minister’s Guidelines . Edmonton, \n2018.  \nAlberta Municipal Affairs . Guide to Property Assessment and Taxation in Alberta . \nEdmonton, 2018.  \nKeyes, John Mark. Executive Legislation , 3rd ed. Toronto: LexisNexis, 2021.  \nMancini, Mark  P. “One Rule to Rule Them All: Subordinate Legislation and the Law \nof Judicial Review” (2024), 55 Ottawa L. Rev.  245. \nSalembier, Paul. Regulatory Law and Practice , 3rd ed. Toronto: LexisNexis, 2021. \n APPEAL from a judgment of the Alberta Cour t of Appeal ( Martin, Hughes \nand Kirker  JJ.A.), 2022 ABCA 381 , [2022] A.J. No. 1393 (Lexis), 2022 CarswellAlta \n3387 (WL), affirming a decision of Price  J., 2021 ABQB 3 7, [2021] A.J. No. 115 \n(Lexis), 2021 CarswellAlta 174 (WL) . Appeal dismissed . \n2024 SCC 37 (CanLII)\n\n--- Page 10 ---\n \n  Michael  J. Donaldson , K.C., Michael Sobkin , Andrea Sam and Katie Sykes , \nfor the appellant s. \n Greg  G. Plester , Rebecca  L. Kos  and Alvin  R. Kosak , for the respondent.  \n Judie Im and Michele Valentini , for the intervener the Attorney General of \nOntario.  \n Stéphane Rochette  and Francesca Boucher , for the intervener the Attorney \nGeneral of Quebec.  \n Emily Lapper  and Christine Bant , for the intervener the Attorney General \nof British Columbia.  \n Kyle McCreary  and Jared Biden , for the intervener the Attorney General \nfor Saskatchewan.  \n Aubin  P. Calvert  and Devin Eeg , for the intervener the Trial Lawyers \nAssociation of British Columbia.  \n Mannu Chowdhury , for the intervener HIV & AIDS Legal  Clinic Ontario \nand the Health Justice Program.  \n2024 SCC 37 (CanLII)\n\n--- Page 11 ---\n \n  Alyssa Holland , David Wilson  and Julie Mouris , for the intervener s the \nChicken Farmers of Canada, the Egg Farmers of Canada, the Turkey Farmers of \nCanada and the Canadian Hatching Egg Producers.  \n Johanna Goosen , for the intervener the Workers ’ Compensation Board of \nBritish Columbia.  \n Andrew  J. Brouwer  and Erin V. Simpson , for the intervener the Canadian \nAssociation of Refugee Lawyers.  \n Lawrence David  and Gjergji Hasa , for the intervener Association \nquébéco ise des avocats et avocates en droit de l ’immigration.  \n Ewa Krajewska , Peter Henein  and Brandon Chung , for the intervener the \nAdvocates for the Rule of Law.  \n William  W. Shores , K.C., and Annabritt  N. Chisholm , for the intervener the \nNational Association of  Pharmacy Regulatory Authorities.   \n The judgment of the Court was delivered by  \n CÔTÉ J. —  \n TABLE OF CONTENTS  \n \n2024 SCC 37 (CanLII)\n\n--- Page 12 ---\n \n Paragraph  \nI. Overview  1 \nII. Facts  8 \nIII",
    "token_count": 1000,
    "start_token": 2700,
    "end_token": 3700,
    "total_tokens_in_source": 14089
  },
  {
    "chunk_id": 4,
    "source_file": "2024scc37.txt",
    "text": " the Rule of Law.  \n William  W. Shores , K.C., and Annabritt  N. Chisholm , for the intervener the \nNational Association of  Pharmacy Regulatory Authorities.   \n The judgment of the Court was delivered by  \n CÔTÉ J. —  \n TABLE OF CONTENTS  \n \n2024 SCC 37 (CanLII)\n\n--- Page 12 ---\n \n Paragraph  \nI. Overview  1 \nII. Facts  8 \nIII. Judicial History  9 \nA. Court of Queen’s Bench of Alberta, 2021 ABQB 37  9 \nB. Court of Appeal of Alberta, 2022 ABCA 381  11 \nIV. Issues  13 \nV. Standard of Review  14 \nVI. Overview of the Off -Coal Agreement, the MGA  and the Linear Guidelines  19 \nA. The Off -Coal Agreement  19 \nB. The Municipal Government Act  22 \nC. The Linear Guidelines  30 \nVII. Analysis  37 \nA. The Common Law Rule Against Administrative Discrimination  40 \nB. The Linear Guidelines Discriminate Against Parties to Off -Coal Agreements  45 \nC. The Minister Is Statutorily Authorized To Discriminate Against Parties to Off -Coal \nAgreements  50 \nD. The Linear Guidelines Are Consistent With the Scheme and Purposes of the MGA  54 \nVIII.  Conclusion  61 \nI. Overview  \n[1] TransAlta Generation Partnership and TransAlta Generation (Keephills  3) \n(collectively, “TransAlta”) own coal -fired electric power generation facilities in \nAlberta. In 2016, TransAlta entered into an agreement with the Crown in Right of \nAlberta entitled “Off -Coal Agreement”. Under that agreement, TransAlta agreed to \ncease coal -fired emissions by December  31, 2030, in exchange for substantial \n2024 SCC 37 (CanLII)\n\n--- Page 13 ---\n \n “transition payments” from Alberta for 14  years to compensate TransAlta for the loss \nresulting from the reduced life of its coal -fired facilities.  \n[2] TransAlta challenges the vires of the 2017  Alberta Linear Property \nAssessment Minister’s Guidelines (2018)  (“Linear Guidelines ”) issued by the Minister \nof Municipal Affairs under the Municipal Government Act , R.S.A. 2000, c.  M-26 \n(“MGA ”). Th e Linear Guidelines  set out the procedures for assessing all “linear \nproperty” for municipal taxation purposes. TransAlta’s coal-fired facilities are \nconsidered “linear property”. The Linear Guidelines  provide that TransAlta and other \nparties to off -coal agreements are ineligible to claim additional depreciation to account \nfor the reduced life of their coal -fired facilities.  \n[3] TransAlta submits that the Linear Guidelines are ultra vires the Minister \non two bases: (1) they violate the common law rule against administrative \ndiscrimination by discriminating, without statutory authorization, against parties who \nhave entered into off -coal agreements with Alberta; and (2) they are inconsistent with \nthe purposes of the MGA . \n[4] In the companion case, Auer v. Auer , 2024 SCC 36, our Court holds that, \nas established in Canada (Minister of Citizenship and Immigration) v. Vavilov , 2019 \nSCC 65, [20 19] 4 S.C.R. 653,  the reasonableness standard presumptively applies when \nreviewing the vires of subordinate legislation. Given that no exception to that \npresumption applies here, this appeal provides our Court with an opportunity to \nillustrate how the reas onableness standard of review  applies to a vires review of \n2024 SCC 37 (CanLII)\n\n--- Page 14 ---\n \n subordinate legislation when the challenger invokes the common law rule against \nadministrative discrimination.  \n[5] As I will explain, the Linear Guidelines discriminate against TransAlta and \nother part ies to off -coal agreements by depriving them of the ability to claim additional \ndepreciation reflecting the reduced lifespan of their coal -fired facilities. However, that \ndiscrimination is statutorily authorized by necessary implication. To ensure that the  \nassessment of TransAlta’s coal -fired facilities was “current, correct, fair and equitable” \nin accordance with the purposes of the MGA (Edmonton (City) v. Edmonton East \n(Capilano) Shopping Centres Ltd. , 2016 SCC 47 , [2016",
    "token_count": 1000,
    "start_token": 3600,
    "end_token": 4600,
    "total_tokens_in_source": 14089
  },
  {
    "chunk_id": 5,
    "source_file": "2024scc37.txt",
    "text": " \ndepreciation reflecting the reduced lifespan of their coal -fired facilities. However, that \ndiscrimination is statutorily authorized by necessary implication. To ensure that the  \nassessment of TransAlta’s coal -fired facilities was “current, correct, fair and equitable” \nin accordance with the purposes of the MGA (Edmonton (City) v. Edmonton East \n(Capilano) Shopping Centres Ltd. , 2016 SCC 47 , [2016] 2 S.C.R. 293, at para.  46), it \nfalls within a reasonable interpretation of the Minister’s statutory grant of power to \nconclude that he was authorized t o deprive TransAlta of the ability to claim additional \ndepreciation. This is because the transition payments from Alberta to TransAlta und er \nthe Off -Coal Agreement already account for at least some loss of value to TransAlta’s \ncoal-fired facilities due to their reduced life. Further, the existence of the Off -Coal \nAgreement is a “specification” or “characteristic” of TransAlta’s coal -fired fa cilities \nthat the Minister was authorized to consider in establishing valuation standards for \nthose facilities.  \n[6] Given my conclusion that it is a reasonable interpretation of the Minister’s \nstatutory grant of power to conclude that discrimination is statuto rily authorized by \nnecessary implication, it follows that the Linear Guidelines are consistent with the \npurposes of the MGA . To reiterate, the Linear Guidelines  serve to ensure that tax \n2024 SCC 37 (CanLII)\n\n--- Page 15 ---\n \n assessments are “current, correct, fair and equitable” in accordance w ith the purposes \nof the MGA . \n[7] Thus, having regard to the governing statutory scheme, the principles of \nstatutory interpretation, and the common law rule against administrative \ndiscrimination, I conclude that the Linear Guidelines are intra vires the Ministe r. \nII. Facts  \n[8] TransAlta’s coal -fired facilities are assessed as “linear property” for \nmunicipal taxation purposes. Section 284(1)(k) of the MGA  defines “linear property”, \nand ss.  322 and 322.1 authorize the Minister of Municipal Affairs to establish \nguidelines for assessing the value of linear property. In 2017, the Minister established \nthe Linear Guidelines , which provide that “[t]here will be n o recognition [of] or \nadjustment [to depreciation] in Schedule  C or Schedule  D as a result of the cessation \nor reduction of coal -fired emissions on or before December  31, 2030 arising from an \nOff-Coal Agreement or Provincial or Federal legislation” (s.  1.003(d)). TransAlta \nbrought an application for judicial review challenging the vires of the Linear \nGuidelines on several bases, including that they discriminate against TransAlta by \ndepriving it, without statutory authorization, of the right to claim a form of depreciation \nthat is available to linear property that is not subject to an off -coal agreement.  \nIII. Judicial History  \n2024 SCC 37 (CanLII)\n\n--- Page 16 ---\n \n A. Court of Queen’s Bench of Alberta , 2021 ABQB 37  \n[9] The chambers judge upheld the validity of the Linear Guidelines . She noted \nthat, following Vavilov , the reasonableness standard applies when assessing the vires \nof subordinate legislation. However, her application of the reasonableness standard was \nlargely informed by Katz Group Canada Inc . v. Ontario (Health and Long -Term Care) , \n2013 SCC 64, [20 13] 3 S.C.R. 810. In her view, the Linear Guidelines  were not \n“irrelevant”, “extraneous” or “completely unrelated” to the purposes of the MGA \n(para.  57, referring to Katz Group , at para.  28). The MGA  granted the Minister broad \nauthority to establish valuat ion standards for regulated property, such as TransAlta’s \ncoal-fired facilities. The Minister was not limited to adopting the market value \nstandard.  \n[10] The chambers judge found that the Linear Guidelines did not discriminate \nagainst TransAlta for two reasons.  First, they did not deprive TransAlta of a form of \ndepreciation to which it was previously entitled. Second, they did not deprive TransAlta \nof a form of depreciation applicable to other types of linear property. However, she \nexplained that even if the Linear Guidelines  were discriminatory, the Minister was \nauthorized by the MGA to discriminate against TransAlta because “the creation and \nimplementation of",
    "token_count": 1000,
    "start_token": 4500,
    "end_token": 5500,
    "total_tokens_in_source": 14089
  },
  {
    "chunk_id": 6,
    "source_file": "2024scc37.txt",
    "text": " did not discriminate \nagainst TransAlta for two reasons.  First, they did not deprive TransAlta of a form of \ndepreciation to which it was previously entitled. Second, they did not deprive TransAlta \nof a form of depreciation applicable to other types of linear property. However, she \nexplained that even if the Linear Guidelines  were discriminatory, the Minister was \nauthorized by the MGA to discriminate against TransAlta because “the creation and \nimplementation of an assessment regime necessarily includes drawing distinctions \namong various types of properties” (para . 73). \nB. Court of Appeal of Alberta , 2022 ABCA 381  \n2024 SCC 37 (CanLII)\n\n--- Page 17 ---\n \n [11] The Court of Appeal unanimously dismissed TransAlta’s appeal. \nRegarding the standard of review, the court held that the principles articulated in Katz \nGroup  were not overtaken or modified by Vavilov . Applyin g Katz Group , the court \nheld that the chambers judge did not err in finding that the Linear Guidelines were \nwithin the Minister’s authority.  \n[12] The court determined that the Linear Guidelines  did not discriminate \nagainst TransAlta since the impugned provisions applied to all coal -fired facilities \nsubject to off -coal agreements, not just to those owned by TransAlta. In the court’s \nview, the Minister was authorized to distinguish between coal -fired facilities and other \ntypes of electric power generation properties because the Minister was generally \nauthorized to make regulations respecting “any .  . . matter considered necessary to \ncarry out the intent of” the MGA , and drawing distinctions between  different classes of \nproperties was a “necessary incident” of the authority to establish a property valuation \nregime (paras.  84-85). \nIV. Issues  \n[13] The issues on appeal are as follows:  \n1. What is the applicable standard of review when reviewing the vires  of \nsubordinate legislation?  \n2. Are the Linear Guidelines ultra vires  the Minister under the MGA ? \n2024 SCC 37 (CanLII)\n\n--- Page 18 ---\n \n V. Standard of Review  \n[14] As set out in the companion case, Auer , the reasonableness standard under \nVavilov presumptively applies when reviewing the vires of subordinat e legislation. No \nexception to the presumption of reasonableness review applies in this case. Indeed, the \nlegislature has not indicated that the Linear Guidelines must be reviewed on a different \nstandard, and the rule of law does not require that the corre ctness standard apply. Thus, \nthe reasonableness standard applies when reviewing the vires of the Linear Guidelines . \n[15] As explained in Auer , Katz Group  continues to provide helpful guidance \nand inform reasonableness review. In particular, the following princi ples from Katz \nGroup continue to apply:  \n Subordinate legislation “must be consistent both with specific \nprovisions of the enabling statute and with its overriding purpose or \nobject” ( References re Greenhouse Gas Pollution Pricing Act , 2021 \nSCC 11, [2021] 1 S.C.R. 175 (“ GGPPA ”), at para.  87; see also Vavilov , \nat paras.  108 and 110; Reference re  Impact Assessment Act , 2023 SCC \n23, at para.  283, per Karakatsanis and Jamal  JJ., dissenting in part, but \nnot on this point).  \n Subordinate legislation continues to bene fit from a presumption of \nvalidity ( Canadian Council for Refugees v. Canada (Citizenship and \nImmigration) , 2023 SCC 17, at para.  54). \n2024 SCC 37 (CanLII)\n\n--- Page 19 ---\n \n  The challenged subordinate legislation and the enabling statute are to \nbe interpreted using a broad and purposive approach  to statutory \ninterpretation (see Green v. Law Society of Manitoba , 2017 SCC 20, \n[2017] 1 S.C.R. 360, at para.  28; West Fraser Mills Ltd. v. British \nColumbia (Workers’ Compensation Appeal Tribunal) , 2018 SCC 22, \n[2018] 1 S.C.R. 635, at para.  12). \n A review of the vires of subordinate legislation does not involve \nassessing policy merits. Courts are to review only the legality or \nvalidity of subordinate legislation ( West Fraser Mills , at para.  59, per \nCôté  J., dissenting, but not on this point; La Rose v",
    "token_count": 1000,
    "start_token": 5400,
    "end_token": 6400,
    "total_tokens_in_source": 14089
  },
  {
    "chunk_id": 7,
    "source_file": "2024scc37.txt",
    "text": " Appeal Tribunal) , 2018 SCC 22, \n[2018] 1 S.C.R. 635, at para.  12). \n A review of the vires of subordinate legislation does not involve \nassessing policy merits. Courts are to review only the legality or \nvalidity of subordinate legislation ( West Fraser Mills , at para.  59, per \nCôté  J., dissenting, but not on this point; La Rose v. Cana da, 2023 FCA \n241, 488 D.L.R. (4th) 340, at para.  28). \n[16] At the same time, for subordinate legislation to be ultra vires on the basis \nthat it is inconsistent with the purpose of the enabling statute, it no longer needs to be \n“irrelevant”, “extraneous” or “completely unrelated” to that statutory purpose (see \nAuer , at paras.  4, 41 and 49; see also Katz Group , at para.  28). Con tinuing to maintain \nthis threshold from Katz Group would be inconsistent with the robust reasonableness \nreview  introduced by Vavilov and would undermine Vavilov ’s promise of simplicity, \ncoherence and predictability.  \n[17] Reviewing the vires of subordinate legis lation is fundamentally an exercise \nof statutory interpretation to ensure that the delegate has acted within the scope of their \n2024 SCC 37 (CanLII)\n\n--- Page 20 ---\n \n lawful authority under the enabling statute ( Vavilov , at para.  108; M.  P. Mancini, “One \nRule to Rule Them All: Subordinate Legis lation and the Law of Judicial Review” \n(2024), 55 Ottawa L. Rev.  245, at pp.  274-75; see, e.g., West Fraser Mills , at para.  23). \nThis exercise must be carried out in accordance with the modern principle of statutory \ninterpretation ( Vavilov , at paras.  120-21; Rizzo & Rizzo Shoes Ltd. (Re) , [1998] 1 \nS.C.R. 27, at para.  21). The governing statutory scheme, other applicable statutory or \ncommon law, and the principles of statutory interpretation are particularly relevant \nconstraints  when determining whether the subordinate legislation at issue falls \nreasonably within the scope of the delegate’s authority  (J. M. Keyes, Executive \nLegislation  (3rd ed. 2021), at p.  175).  \n[18] Before I begin this analysis, I provide an overview of the Off -Coal \nAgreement and the relevant le gislation.  \nVI. Overview of the Off -Coal Agreement, the MGA  and the Linear Guidelines  \nA. The Off -Coal Agreement  \n[19] TransAlta entered into the Off -Coal Agreement with Alberta on \nNovember  24, 2016. TransAlta agreed to cease coal -fired emissions on or before \nDecember  31, 2030 (Off -Coal Agreement, s.  2, reproduced in A.R., at p.  151). In \nexchange, Alberta agreed to make 14  annual transition payments of $39,851,704.60 to \nTransAlta (s.  3(a)).  \n2024 SCC 37 (CanLII)\n\n--- Page 21 ---\n \n [20] The Off -Coal Agreement does not expressly refer to property taxes or \ndepreciation.  However, the amount of the transition payments was calculated by taking \nthe net book value of the coal -fired facilities as provided by TransAlta, “[p]ro -rated by \npercentage of life remaining after 2030 to give proxy for 2030 [net book value]: divided \nby remaining years under federal end -of-life as of November  2016, then multiplied by \nyears stranded” (Sch.  A). This formula demonstrates that the transition payments \naccount for at least some loss of value to TransAlta’s coal -fired facilities arising from \ntheir reduced lifespan under the Off -Coal Agreement. As the Court of Appeal noted, \n“[i]t is evident on the face of the Off -Coal Agreements that the Province sought to \naddress some loss of value arising from the reduced life of the appellants’ coal -fired \nelectr icity generation plants and to treat affected companies equivalently” (para.  23). \n[21] Further, it is noteworthy that the Off -Coal Agreement provides that it runs \nwith the facilities. Indeed, TransAlta may transfer title to or ownership interest in its \n",
    "token_count": 1000,
    "start_token": 6300,
    "end_token": 7300,
    "total_tokens_in_source": 14089
  },
  {
    "chunk_id": 8,
    "source_file": "2024scc37.txt",
    "text": "]t is evident on the face of the Off -Coal Agreements that the Province sought to \naddress some loss of value arising from the reduced life of the appellants’ coal -fired \nelectr icity generation plants and to treat affected companies equivalently” (para.  23). \n[21] Further, it is noteworthy that the Off -Coal Agreement provides that it runs \nwith the facilities. Indeed, TransAlta may transfer title to or ownership interest in its \nfaciliti es with Alberta’s consent, but only if any new owner agrees to be bound by the \nterms of the Off -Coal Agreement (s.  11(n)).  \nB. The Municipal Government Act  \n[22] The MGA regulates property assessment and taxation in Alberta ( Capilano , \nat para.  9; Alberta Municipal A ffairs, Guide to Property Assessment and Taxation in \nAlberta (2018)  (“Guide ”), at p.  2). Property assessment is the process of estimating a \nproperty’s dollar value for taxation purposes ( Guide , at p.  3). Under the MGA , \n“assessment” means “a value of property determined in accordance with this Part [( i.e., \n2024 SCC 37 (CanLII)\n\n--- Page 22 ---\n \n Part 9 ‘Assessment of Property’)] and the regulations” (s.  284(1)(c)). Property taxation \nis the process of applying a tax rate to a property’s assessed value to determine the tax \npayable ( Guide , at p . 3). \n[23] The MGA sets out two types of valuation standards: the market value \nstandard and the regulated standard ( Guide , at p.  3). Most properties are assessed using \nthe market value standard. The market value of a property is “the price a property might \nreasonably be expected to sell for if sold by a willing seller to a willing buyer after \nappropriate time and exposure in an open market” (p.  5; see also MGA , s. 1(1)(n)).  \n[24] There are three approaches to determining the market value of a property: \nthe sales compa rison approach, the cost approach, and the income approach ( Guide , at \np. 6). Under the sales comparison approach, the market value of a property is \ndetermined by considering the sale price of similar properties. Under the cost approach, \nthe market value of  a property is determined by aggregating the market value of the \nland and the net cost of improvements. This approach assumes that a buyer would not \npay more to purchase a property than what it would cost to buy the land and rebuild the \nsame improvements. Under the income approach, the market value of a property is \ndetermined on the basis of its income -earning potential. This approach is used to assess \nthe value of rental properties (p.  7). \n[25] The regulated standard is a property assessment standard based on r ates \nand procedures prescribed by the Ministry of Municipal Affairs ( Guide , at p.  29). It is \nused to assess properties that are difficult to assess under the market value standard \n2024 SCC 37 (CanLII)\n\n--- Page 23 ---\n \n because they seldom trade in the marketplace, they cross municipalities and municipal \nboundaries or they are of a unique nature (p.  7). \n[26] Under s.  284(1)(k) of the MGA , TransAlta’s coal -fired facilities are \nconsidered “linear property” , which is a subset of “designated industrial property” \nunder s.  284(1)(f.01).  Sections 322 and 322 .1 of the MGA authorize the Minister to \nestablish guidelines for assessing the value of linear property. TransAlta’s facilities are \nthus assessed using the regulated standard. As noted by the Court of Appeal, “market \nvalue is not intended to be the standar d for determining the value of [TransAlta’s] linear \nproperties. .  . . [T]here is no mention of ‘market value’ in any of the linear property \nassessment provisions of the MGA ” (para.  59). \n[27] Assessments of linear property must be prepared by the provincial asse ssor \n(MGA , s. 292(1)). Each assessment must reflect the valuation standard as well as the \nspecifications and characteristics of the linear property as specified in the regulations \n(s. 292(2)). In preparing an assessment of linear property, the assessor mus t follow the \nprocedures set out in the Minister’s guidelines ( Matters Relating to Assessment and \nTaxation Regulation , Alta. Reg. 220/",
    "token_count": 1000,
    "start_token": 7200,
    "end_token": 8200,
    "total_tokens_in_source": 14089
  },
  {
    "chunk_id": 9,
    "source_file": "2024scc37.txt",
    "text": " linear property must be prepared by the provincial asse ssor \n(MGA , s. 292(1)). Each assessment must reflect the valuation standard as well as the \nspecifications and characteristics of the linear property as specified in the regulations \n(s. 292(2)). In preparing an assessment of linear property, the assessor mus t follow the \nprocedures set out in the Minister’s guidelines ( Matters Relating to Assessment and \nTaxation Regulation , Alta. Reg. 220/2004, s.  8(2)).  \n[28] Section 322(1) of the MGA  delegates regulation -making power to the \nMinister. More specifically, it authoriz es the Minister to make regulations “establishing \nvaluation standards for property”, “respecting the assessment of linear property”, \n“respecting designated industrial property, including, without limitation, regulations \nrespecting the specifications and ch aracteristics of designated industrial property”, \n2024 SCC 37 (CanLII)\n\n--- Page 24 ---\n \n “respecting processes and procedures for preparing assessments”, and “respecting any \nother matter considered necessary to carry out the intent of [the MGA ]”. Under \ns. 322(2), the Minister may make an order establishing guidelines respecting any matter \nfor which the Minister may make a regulation under s.  322(1). The Linear Guidelines \nare deemed to be guidelines established under s.  322(2) (s.  322.1(1) and (3)) . \n[29] As the Court of Appeal recognized, “[t]he language used in s.  322(1) to \ndescribe the Minister’s regulation -making power in relation to property assessment is \nindisputably broad” (para.  57). The question is whether ss.  1.003 and 2.003 of the \nLinear Guidelines are reasonably within the scope of the Minister’s authority.  \nC. The Linear Guidelines  \n[30] On December  19, 2017, the Minister made Ministerial Order \nNo. MAG:021/17 establishing the  Linear Guidelines . They became effective for \ntaxation in 2018 and subsequent years.  \n[31] The Linear Guidelines  set out the proc edures for calculating all linear \nproperty assessments. They require assessors to multiply the values determined under \nfour schedules. TransAlta’s challenge focuses on ss.  1.003 and 2.003 of the Linear \nGuidelines . \n2024 SCC 37 (CanLII)\n\n--- Page 25 ---\n \n [32] Section 1.003 of the Linear Guidelines describes the schedules used in the \nassessment of linear property. Schedules  C and D are the schedules relevant to this \nappeal.  \n[33] Schedule  C provides the process for determining depreciation or lists the \napplicable depreciation factors. Section  1.003(c) states that “[t]he depreciation factors \nprescribed in Schedule  C are fixed and certain and must be applied as listed in the \napplicable Schedule  C depreciation table, without adjustment or modification” \n(emphasis deleted).  \n[34] Schedule  D provides the process for deter mining additional depreciation or \nlists the applicable additional depreciation factors. Under Sch.  D, “the assessor may \nallow additional depreciation (Schedule  D) on a case -by-case basis and only if the \noperator provides acceptable evidence to the assessor ” (s. 2.004(e)). However, the \nLinear Guidelines specify that “[t]here will be no recognition or adjustment in \nSchedule  C or Schedule  D as a result of the cessation or reduction of coal -fired \nemissions on or before December  31, 2030 arising from an Off -Coal  Agreement or \nProvincial or Federal legislation” (s.  1.003(d)).  \n[35] Section  2.003 of the Linear Guidelines addresses Schs.  C and D \ndepreciation as it applies to TransAlta. It too provides that “[t]here will be no \nrecognition or adjustment in Schedule  C or Schedule  D as a result of the cessation or \nreduction of coal -fired emissions on or before December  31, 2030 arising from an \nOff-Coal Agreement or Provincial or Federal legislation.”  \n2024 SCC 37 (CanLII)\n\n--- Page 26 ---\n \n [36] The practical effect of these provisions is that an assessor cannot allow \nTransAlta additional depreciation for its coal -fired facilities on the basis that those \nfacilities are subject to the Off -Coal Agreement (see Linear Guidelines , ss. 1.003(d) \nand 2.004(e)).  \nVII. Analysis  \n[37",
    "token_count": 1000,
    "start_token": 8100,
    "end_token": 9100,
    "total_tokens_in_source": 14089
  },
  {
    "chunk_id": 10,
    "source_file": "2024scc37.txt",
    "text": "-Coal Agreement or Provincial or Federal legislation.”  \n2024 SCC 37 (CanLII)\n\n--- Page 26 ---\n \n [36] The practical effect of these provisions is that an assessor cannot allow \nTransAlta additional depreciation for its coal -fired facilities on the basis that those \nfacilities are subject to the Off -Coal Agreement (see Linear Guidelines , ss. 1.003(d) \nand 2.004(e)).  \nVII. Analysis  \n[37] TransAlta challenges the validity of the Linear Guidelines  on two bases. \nFirst, it invokes the common law principle that a statutory delegate has no authority to \nmake discriminatory distinctions unless the statute either expressly, or by necessary \nimplication, grants them such authority. TransAlta argues that the  Linear Guidelines \ndiscriminate against it by denying it the ability to seek additional depreciation for its \ncoal-fired facilities and that the Minister did not have the statutory authority to establish \nguidelines that discriminate in this manner. Second, it asserts that the Linear Guidelines \nare inconsistent with the overarching purposes of the assessment and taxation regime \nunder the MGA . \n[38] In what follows, I will assess whether the Linear Guidelines fall reasonably \nwithin the scope of the Minister’s author ity under the MGA , having regard to the \nrelevant constraints: (1) the common law rule against administrative discrimination; (2) \nthe MGA , which is the governing statutory scheme; and (3) the principles of statutory \ninterpretation. I will begin by outlining  the common law rule against administrative \ndiscrimination. I will then consider whether the Linear Guidelines violate this rule.  \n2024 SCC 37 (CanLII)\n\n--- Page 27 ---\n \n [39] As I will explain, the Linear Guidelines do not violate the common law \nrule against administrative discrimination. This is bec ause the MGA authorizes the \nMinister, by necessary implication, to discriminate against TransAlta and other parties \nto off -coal agreements by depriving them of the ability to claim additional depreciation. \nIt follows that the Linear Guidelines are consiste nt with the purposes of the MGA . As \nwill become clear, the Linear Guidelines  serve to ensure that tax assessments are \n“current, correct, fair and equitable” in accordance with the purposes of the MGA . \nA. The Common Law Rule Against Administrative Discriminati on \n[40] Administrative discrimination “arises when [subordinate] legislation \nexpressly distinguishes among the persons to whom its enabling legislation applies” \n(Keyes , at pp.  370-71, citing L. -P. Pigeon, Drafting and Interpreting Legislation \n(1988) , at p. 42; Fédération des producteurs de fruits et légumes du Québec v. \nConserverie canadienne Ltée, [1990] R.J.Q. 2866  (Sup. Ct.) , at p. 2871; Sunshine \nVillage Corp. v. Canada (Parks) , 2004 FCA 166 , [2004] 3 F.C.R. 600, at para.  13). \n[41] Administrative discrimination is different than discrimination in the \ncontext of the Canadian Charter of Rights and Freedoms or human rights legislation: \n“When we speak of administrative discrimination, we are not speaking of \ndiscrimination based on person al characteristics, such as sex, race or religion, that is \nproscribed by many human rights statutes” (P.  Salembier, Regulatory Law and \nPractice  (3rd ed. 2021), at p.  303). Rather, administrative discrimination “relates to the \ndrawing of distinctions betwee n persons or classes that are discriminatory in a \n2024 SCC 37 (CanLII)\n\n--- Page 28 ---\n \n ‘non-pejorative but most neutral sense of the word’, in that they simply ‘do not apply \nequally to all those engaged in the activity that is the subject of the enactment’” (p.  303, \nquoting Montréal (City of)  v. Arcade Amusements Inc. , [1985] 1 S.C.R. 368, at p.  406, \nand Sunshine Village Corp. , at para.  13, citing D.  J. M. Brown and J.  M. Evans, \nJudicial Review of Administrative Action in Canada  (looseleaf), at para.  15:3212).  \n[42] The common law rule against admin istrative discrimination provides that \nsubordinate legislation that discriminates in the administrative law sense is invalid \nunless the discrimination is authorized by the enabling statute ( Arcade Amusements , at \np. 404; Forget v.",
    "token_count": 1000,
    "start_token": 9000,
    "end_token": 10000,
    "total_tokens_in_source": 14089
  },
  {
    "chunk_id": 11,
    "source_file": "2024scc37.txt",
    "text": "13, citing D.  J. M. Brown and J.  M. Evans, \nJudicial Review of Administrative Action in Canada  (looseleaf), at para.  15:3212).  \n[42] The common law rule against admin istrative discrimination provides that \nsubordinate legislation that discriminates in the administrative law sense is invalid \nunless the discrimination is authorized by the enabling statute ( Arcade Amusements , at \np. 404; Forget v. Quebec (Attorney General) , [1988] 2 S.C.R. 90, at pp.  105-6; Katz \nGroup , at para.  47; Keyes, at p.  371; Salembier, at pp.  307-8). The enabling statute may \nauthorize administrative discrimination, either expressly or by necessary implication \n(Arcade Amusements , at p.  413; Forget , at pp. 105-6; Katz Group , at para.  47). \n[43] As McLachlin  J. (as she then was), dissenting, but not on this point, \nexplained when reviewing the validity of a municipal bylaw in Shell Canada Products \nLtd. v. Vancouver (City) , [1994] 1 S.C.R. 231, at p.  259, the ru le against administrative \ndiscrimination is concerned with ensuring that statutory delegates act within the scope \nof their authority when they distinguish between the persons to whom the enabling \nlegislation applies:  \nThe rule pertaining to municipal discri mination is essentially concerned \nwith the municipality’s power. Municipalities must operate within the \npowers conferred on them under the statutes which create and empower \nthem. Discrimination itself is not forbidden. What is forbidden is \ndiscrimination w hich is beyond the municipality’s powers as defined by its \n2024 SCC 37 (CanLII)\n\n--- Page 29 ---\n \n empowering statute. Discrimination in this municipal sense is conceptually \ndifferent from discrimination in the human rights sense; discrimination in \nthe sense of the municipal rule is concerned on ly with the ambit of \ndelegated power.  \n[44] With this in mind, I turn to the question of whether the Linear Guidelines  \ndiscriminate against TransAlta.  \nB. The Linear Guidelines Discriminate Against Parties to Off -Coal Agreements  \n[45] The chambers judge found that the Linear Guidelines  did not discriminate \nagainst TransAlta because they did not deprive TransAlta of a form of depreciation to \nwhich it was previously entitled or which applied to other types of linear property \n(para.  72). The Court of Appeal also held that the  Linear Guidelines  did not \ndiscriminate against TransAlta. It held so on the basis that the impugned provisions \napply to all coal -fired facilities subject to off -coal agreements, not just to those owned \nby TransAlta (para.  86). \n[46] I disagree with the courts b elow. The  Linear Guidelines  discriminate \nagainst TransAlta and other parties to off -coal agreements by singling them out as being \nineligible to claim additional depreciation on the basis of the off -coal agreements and \nto have the assessor consider that cla im (see ss.  1.003(d) and 2.004(e)). Owners of \nlinear property who are not parties to off -coal agreements are eligible to make claims \nfor additional depreciation and to have those claims considered by the assessor without \nexclusion.  \n2024 SCC 37 (CanLII)\n\n--- Page 30 ---\n \n [47] The chambers judge was c orrect in stating that TransAlta was not entitled \nto additional depreciation. However, but for the impugned provisions of the Linear \nGuidelines , TransAlta would have been eligible to claim additional depreciation and to \nhave that claim considered by the as sessor. Section  2.004(e) of the Linear Guidelines  \nprovides that “[s]ubject to section  1.003(d) and section  2.003(b), the assessor may \nallow additional depreciation (Schedule  D) on a case -by-case basis and only if the \noperator provides acceptable evidence t o the assessor.” TransAlta is not eligible to \nadvance a claim for additional depreciation for consideration by the assessor on the \nbasis of the reduction in its facilities’ lifespan arising from the Off -Coal Agreement \nbecause s.  1.003(d) states that “[t]he re will be no recognition or adjustment in \nSchedule  C or Schedule  D as a result of the cessation or reduction of coal -fired \nemissions .  . . arising from an Off -Coal",
    "token_count": 1000,
    "start_token": 9900,
    "end_token": 10900,
    "total_tokens_in_source": 14089
  },
  {
    "chunk_id": 12,
    "source_file": "2024scc37.txt",
    "text": "essor.” TransAlta is not eligible to \nadvance a claim for additional depreciation for consideration by the assessor on the \nbasis of the reduction in its facilities’ lifespan arising from the Off -Coal Agreement \nbecause s.  1.003(d) states that “[t]he re will be no recognition or adjustment in \nSchedule  C or Schedule  D as a result of the cessation or reduction of coal -fired \nemissions .  . . arising from an Off -Coal Agreement”.  \n[48] The fact that the Linear Guidelines treat all parties to off -coal agreements \nin the same way does not mean that they are not discriminatory. The Linear Guidelines  \ntreat all parties to off -coal agreements in the same discriminatory  way, as compared \nwith owners of linear property who are not parties to off -coal agreem ents. As explained, \nadministrative discrimination arises when subordinate legislation expressly \ndistinguishes among the persons to whom its enabling legislation applies (Keyes , at \npp. 370-71). The Linear Guidelines expressly distinguish between owners of l inear \nproperty who are parties to off -coal agreements and those who are not parties to such \nagreements, though both are subject to the MGA . \n2024 SCC 37 (CanLII)\n\n--- Page 31 ---\n \n [49] The next question is whether the MGA authorizes the Minister to \ndiscriminate against TransAlta on the basis of the O ff-Coal Agreement, having regard \nto the purposes of the MGA and the principles of statutory interpretation. If the MGA \ndoes so, either expressly or by necessary implication, the Linear Guidelines  will not be  \ninvalid  for being discriminatory.  \nC. The Minister Is Statutorily Authorized To Discriminate Against Parties to \nOff-Coal Agreements  \n[50] The question of statutory authorization to discriminate falls within the \nreasonableness review to be conducted in a vires  challenge to subordinate legislation, \nunless the legi slature has indicated otherwise or a question relating to the rule of law \narises which should be reviewed for correctness ( Vavilov , at para.  53). \n[51] The MGA does not expressly authorize the Minister to discriminate against \nTransAlta by distinguishing between parties who have entered into off -coal agreements \nwith Alberta and those who have not. However, the MGA , by necessary implication,  \nauthorizes the Minister to draw this distinction.  \n[52] When a court reviews the vires of subordinate legislation, the challenged \nlegislation and the enabling statute must be interpreted using a broad and purposive \napproach ( Katz Group , at para.  26). TransAlta’s coal -fired facilities are deemed to be \nlinear property ( MGA , s. 284(1)(k)). The Minister has broad authority to make \nregulat ions establishing valuation standards for linear property, respecting the \n2024 SCC 37 (CanLII)\n\n--- Page 32 ---\n \n assessment of linear property, respecting the processes and procedures for preparing \nassessments and respecting any matter considered necessary to carry out the intent of \nthe MGA (s. 322(1)(c.1), (d), (e) and (i)). The legislation is clear: the valuation standard \nfor linear property is the one established by the Minister (ss.  322 and 322.1; Matters \nRelating to Assessment and Taxation Regulation , s. 8(2)).  \n[53] In establishing a valuation s tandard for linear property, the Minister is \nauthorized to make regulations “respecting designated industrial property, including, \nwithout limitation, regulations respecting the specifications and characteristics of \ndesignated industrial property” ( MGA , s. 322(1)(d.3)). The “specifications and \ncharacteristics” that the Minister sets out must be taken into account by the assessor \nwhen assessing the value of the property for taxation purposes (s.  292(2)(b)). This grant \nof authority is articulated in very broa d terms  — “without limitation”  — and \nspecifically empowers the Minister to identify and make regulations respecting the \n“specifications and characteristics” of industrial property. It is not possible to construe \ns. 322(1)(d.3) without contemplating the dra wing of distinctions between types of \nproperties on the basis of their specifications and characteristics.  \n[54] Additionally, it follows from the MGA ’s purpose of ensuring “that \nassessments are ‘current, correct, fair and equitable’” ( Capilano , at para.  46, quo ting \nEdmonton (City) v. Army & Navy Department Stores Ltd. , [2002] A.M.G.B.O. No.  126",
    "token_count": 1000,
    "start_token": 10800,
    "end_token": 11800,
    "total_tokens_in_source": 14089
  },
  {
    "chunk_id": 13,
    "source_file": "2024scc37.txt",
    "text": " without contemplating the dra wing of distinctions between types of \nproperties on the basis of their specifications and characteristics.  \n[54] Additionally, it follows from the MGA ’s purpose of ensuring “that \nassessments are ‘current, correct, fair and equitable’” ( Capilano , at para.  46, quo ting \nEdmonton (City) v. Army & Navy Department Stores Ltd. , [2002] A.M.G.B.O. No.  126 \n(QL), at para.  114) that the Minister has the authority to draw distinctions on the basis \nof the specifications and characteristics of properties where ignoring them woul d create \n2024 SCC 37 (CanLII)\n\n--- Page 33 ---\n \n a risk of inappropriate assessments. The inverse is also true: where appropriate, the \nMinister must have authority to pronounce that certain specifications and \ncharacteristics are not relevant to an assessment, as he did in this case. The statute,  by \nnecessary implication, grants the Minister the authority to discriminate in the manner \nthat he did.  \nD. The Linear Guidelines Are Consistent With the Scheme and Purposes of the MGA  \n[55] Since I have found that the Minister had the authority to discriminate \nbetw een different types of property, the next question is whether he exercised that \nauthority in a manner that is consistent with the scheme and purposes of the MGA . The \nMGA  has two purposes: (1) “to establish and maintain a property assessment system \nthat fai rly and equitably distributes taxes, and promotes transparency, predictability and \nstability for municipalities and taxpayers” ( Guide , at p.  2); and (2) “to ensure that \nassessments are ‘current, correct, fair and equitable’” ( Capilano , at para.  46, quoting  \nArmy & Navy , at para.  114). \n[56] TransAlta submits that the discrimination against it resulted in a valuation \nof its coal -fired facilities that was both incorrect and unfair (A.F., at paras.  49, 68, 77 \nand 85; transcript, at pp.  57, 67, 70 -71 and 159). It submits that the Off -Coal Agreement \ndoes not account for depreciation, which is essential to an accurate valuation of its \nproperty. In its view, the transition payments compensate it purely for loss of profits \n(transcript, at p.  57). TransAlta also submits  that the Minister was not entitled to \ndistinguish between parties to off -coal agreements and others because being a party to \n2024 SCC 37 (CanLII)\n\n--- Page 34 ---\n \n an off -coal agreement is a characteristic of the owner, not of the property itself. In other \nwords, it is not a “specification” or  “characteristic” of the linear property as \ncontemplated in ss.  292(2)(b) and 322(1)(d.3) of the MGA  (A.F., at para.  68). \n[57] I disagree. As I will explain, ss.  1.003 and 2.003 of the Linear Guidelines , \nwhich deprive TransAlta of the ability to claim additiona l depreciation on the basis of \nthe reduction in its facilities’ lifespan arising from the Off -Coal Agreement, are \nconsistent with the purpose of ensuring “current, correct, fair and equitable” \nassessments and accord with the language in ss.  292(2)(b) and 3 22(1)(d.3) of the MGA . \n[58] The formula used to calculate the transition payments in the Off -Coal \nAgreement accounts for at least some loss of value arising from the reduced life of \nTransAlta’s coal -fired facilities. It does so by prorating the net book value o f the \nfacilities by the percentage of life remaining after 2030 (Off -Coal Agreement, Sch.  A). \nEven if the payments are characterized as compensation for loss of profits, because the \npayments promise additional revenues that run with the assets, their effec t is to offset \nthe decrease in value caused by the facilities’ reduced lifespan. To be current and \ncorrect, an assessment of TransAlta’s coal -fired facilities must consider the fact that \nthe transition payments mitigate at least some depreciation that woul d otherwise result \nfrom the early retirement of the facilities. Therefore, in light of the MGA ’s purpose of \nensuring that assessments are current and correct, it was reasonable for the Minister to \ninterpret his statutory grant of power as authorizing him t o deprive TransAlta of the \n",
    "token_count": 1000,
    "start_token": 11700,
    "end_token": 12700,
    "total_tokens_in_source": 14089
  },
  {
    "chunk_id": 14,
    "source_file": "2024scc37.txt",
    "text": " lifespan. To be current and \ncorrect, an assessment of TransAlta’s coal -fired facilities must consider the fact that \nthe transition payments mitigate at least some depreciation that woul d otherwise result \nfrom the early retirement of the facilities. Therefore, in light of the MGA ’s purpose of \nensuring that assessments are current and correct, it was reasonable for the Minister to \ninterpret his statutory grant of power as authorizing him t o deprive TransAlta of the \nability to claim additional depreciation under the Linear Guidelines . \n2024 SCC 37 (CanLII)\n\n--- Page 35 ---\n \n [59] To deprive TransAlta of the ability to claim additional depreciation is also \nconsistent with the MGA ’s purpose of ensuring that assessments are fair and equita ble. \nSince the transition payments already account for at least some loss of value resulting \nfrom the reduced life of TransAlta’s coal -fired facilities, there would be a real risk of \n“double dipping” if TransAlta were able to receive additional depreciatio n for that same \nloss of value under the Linear Guidelines . That would not be fair or equitable.  \n[60] TransAlta’s assertion that the existence of the Off -Coal Agreement is a \ncharacteristic of the owner  — not of the property itself  — is inaccurate. The Off -Coal \nAgreement runs with the facilities. A transfer of title to or ownership interest in the \nfacilities requires Alberta’s consent and requires the new owner to agree to be bound \nby the terms of the Off -Coal Agreement:  \nTransfer of Ownership of Plants. The Compan y or the Plant Owners \nmay transfer title to or ownership interest in all the Plants with the consent \nof the Province, not to be unreasonably withheld, provided that the new \nowner agrees to be bound by the terms of this Agreement, in which case \nthe Company and the Plant Owners shall be released from their obligations \nhereunder. [s.  11(n)]  \n[61] While TransAlta, as the owner, entered into the Off -Coal Agreement, being \nsubject to the Off -Coal Agreement is not merely a “characteristic” of TransAlta. \nRather, because a ny subsequent owner of TransAlta’s coal -fired facilities must agree \nto be bound by the terms of the Off -Coal Agreement, being subject to the Off -Coal \nAgreement is also properly considered a “specification” or “characteristic” of those \nfacilities. Under s.  322(1)(d.3) of the MGA , the Minister may make regulations \n2024 SCC 37 (CanLII)\n\n--- Page 36 ---\n \n “respecting designated industrial property, including, without limitation, regulations \nrespecting the specifications and characteristics of designated industrial property”. \nSince TransAlta’s coal -fired facilities are deemed “designated industrial property” \nunder s.  284(1)(f.01)(ii) of the MGA , the Minister was authorized to make regulations \ndesignating an off -coal agreement as a “specification” or “characteristic” of those \nfacilities to ensure that a ssessments thereof would be “current, correct, fair and \nequitable”.  \nVIII. Conclusion  \n[62] TransAlta has not met its burden of proving that the Linear Guidelines are \nultra vires the Minister ( Vavilov , at para.  100; Katz Group , at para.  25; Canadian \nCouncil for Refugee s, at para.  54). \n[63] The Minister is authorized under the MGA , by necessary implication, to \ndiscriminate against TransAlta. The Minister has indisputably broad authority to \nestablish valuation standards for linear property under s.  322(1) of the MGA . This \nincludes the authority to determine the “specifications and characteristics” of the \nproperty that an assessment must reflect in order to be “current, correct, fair and \nequitable” ( Capilano , at para.  46). To properly make regulations respecting \n“specifications and characteristics”, the Minister must therefore have the authority to \ncontemplate the drawing of distinctions as between types of properties.  \n2024 SCC 37 (CanLII)\n\n--- Page 37 ---\n \n [64] Accordingly, the Linear Guidelines  fall within a reasonable interpretation \nof the enabling statute having regard  to the relevant constraints, and are intra vires the \nMinister. They are “consistent both with specific provisions of the enabling statute and \nwith its overriding purpose or object” ( GGPPA , at para.  87). They also do not \ncontravene the common law rule agai nst administrative discrimination.  \n[65] The appeal",
    "token_count": 1000,
    "start_token": 12600,
    "end_token": 13600,
    "total_tokens_in_source": 14089
  },
  {
    "chunk_id": 15,
    "source_file": "2024scc37.txt",
    "text": " Page 37 ---\n \n [64] Accordingly, the Linear Guidelines  fall within a reasonable interpretation \nof the enabling statute having regard  to the relevant constraints, and are intra vires the \nMinister. They are “consistent both with specific provisions of the enabling statute and \nwith its overriding purpose or object” ( GGPPA , at para.  87). They also do not \ncontravene the common law rule agai nst administrative discrimination.  \n[65] The appeal is dismissed with costs.  \n Appeal  dismissed with costs.  \n Solicitors for the appellant s: Lawson Lundell, Calgary ; Michael Sobkin, \nOttawa; TransAlta Corporation, Calgary . \n Solicitor s for the respondent s: Brownlee,  Edmonton.  \n Solicitor for the intervener the Attorney General of Ontario:  Ministry of \nthe Attorney General, Crown Law Office — Civil , Toronto.  \n Solicitor  for the intervener  the Attorney Ge neral of Quebec:  Ministère de \nla Justice du Québec , Québec.  \n Solicitor for the intervener the Attorn ey General of British \nColumbia:  Ministry of Attorney General of British Columbia, Legal Services Branch , \nVancouver.  \n2024 SCC 37 (CanLII)\n\n--- Page 38 ---\n \n  Solicitor  for the intervener the Attorney General for \nSaskatchewan:  Saskatchewan Ministry of Justice  and Attorney General , Regina.  \n Solicitors for the intervener  the Trial Lawyers A ssociation of British \nColumbia:  Hunter Litigation Chambers, Vancouver.  \n Solicitors for the intervener HIV & AIDS Legal Clinic Ontario and the \nHealth Justice Program:  Palia re Roland Rosenberg Rothstein , Toronto.  \n Solicitors for the intervener s the Chicken Farmers of Canada, the Egg \nFarmers of Canada, the Turkey Farmers of Canada and the Canadian Hatching Egg \nProducers:  Conway Baxter Wilson, Ottawa.  \n Solicitor for the intervener the Workers ’ Compensa tion Board of British \nColumbia:  Workers ’ Compensation Board of British Columbia, Richmond.  \n Solicitors for the intervener the Canadian Association of Refugee \nLawyers:  Refugee Law Office, Toronto ; Landings, Toronto . \n Solicitor s for the intervener Association québécoise des avocats et \navocates en droit de l ’immigration:  Hasa Avocats Inc., Montréal.  \n Solicitors  for the intervener  the Advocates for the Rule of Law:  Henein \nHutchison Robitaille, Toronto.  \n2024 SCC 37 (CanLII)\n\n--- Page 39 ---\n \n  Solicitors  for the intervener the National Association of P harmacy \nRegulatory Authorities:  Shores Jardine, Edmonton.  \n2024 SCC 37 (CanLII)\n\n",
    "token_count": 589,
    "start_token": 13500,
    "end_token": 14089,
    "total_tokens_in_source": 14089
  }
]