[
  {
    "chunk_id": 0,
    "source_file": "2024scc38.txt",
    "text": "--- Page 1 ---\n \n  \nSUPREME COURT OF CANADA  \n \nCITATION : R. v. T.J.F., 2024 SCC \n38 \n   \nAPPEAL HEARD : March 27, 2024  \nJUDGMENT RENDERED : \nNovember 15, 2024  \nDOCKET : 40749  \n \nBETWEEN : \n \nHis Majesty The King  \nAppellant  \n \nand \n \nT.J.F.  \nRespondent  \n \n \nCORAM : Wagner C.J. and Karakatsanis, Côté, Rowe, Martin, Kasirer, Jamal, \nO’Bonsawin and Moreau JJ.  \n \nREASONS FOR \nJUDGMENT : \n(paras. 1 to 120)  O’Bonsawin J. (Wagner C.J. and Karakatsanis, Martin, \nKasirer, Jamal and Moreau JJ. concurring)  \n  \nJOINT DISSENTING \nREASONS : \n(paras. 121 to 160)  Côté and Rowe JJ.  \n \nNOTE: This document is subject to editorial revision before its reproduction in final \nform in the Canada Supreme Court Reports . \n   \n2024 SCC 38 (CanLII)\n\n--- Page 2 ---\n \n His Majesty T he King  Appellant  \nv. \nT.J.F.  Respondent  \nIndexed as: R. v. T.J.F.  \n2024  SCC  38 \nFile No.: 40749.  \n2024:  March  27; 2024: November 15 . \nPresent: Wagner  C.J. and Karakatsanis, Côté, Rowe, Martin, Kasire r, Jamal, \nO’Bonsawin and Moreau  JJ. \nON APPEAL FROM THE C OURT OF APPEAL FOR N OVA SCOTIA  \n Criminal law — Trafficking in persons — Receiving a material benefit \nfrom trafficking in persons — Exploitation — Accused charged with trafficking \ncomplainant and receiving material benefit — Complainant alleging she provided \nsexual services for mo ney under threat of violence by accused intimate partner — \nComplainant’s friends and family testifying to violent relationship but not sexual \nservices — Trial judge finding complainant’s evidence not credible except as \n2024 SCC 38 (CanLII)\n\n--- Page 3 ---\n \n corroborated by other witnesses and a cquitting accused — Whether trial judge erred \nin holding that evidence of violent relationship did not directly address elements of \noffences — If so, whether error may have had material bearing on acquittal — Criminal \nCode , R.S.C. 1985, c.  C-46, ss.  279.01 , 279.02, 279.04.  \n Criminal law — Evidence — Assessment — Past discreditable conduct — \nAccused charged with trafficking complainant and receiving material benefit — \nComplainant alleging she provided sexual services for money under threat of violence \nby acc used intimate partner — Complainant’s friends and family testifying to violent \nrelationship but not sexual services — Trial judge finding complainant’s evidence not \ncredible except as corroborated by other witnesses and acquitting accused — Whether \ntrial j udge erred by characterizing evidence of violent relationship as past \ndiscreditable conduct evidence — If so, whether error may have had material bearing \non acquittal.  \n The complainant and the accused were in a  common law relationship that \nspanned from 200 4 to 2012. The relationship was plagued by violence and financial \ndifficulties. According to  the complainant, the accused suggested they have sex on a \nwebcam for money, and she was unwilling to do this but agreed to avoid the accused’s \nviolence . She claime d that the accused persuaded her to dance for men and to offer \nsexual services for money, and that she participated because of the accused’s violence.  \nShe also claimed that  the accused was involved in posting ads offering sexual services \nand controlled a ll proceeds, and that this continued until she left the accused in 2012.  \n2024 SCC 38 (CanLII)\n\n--- Page 4 ---\n \n  The accused was charged with trafficking the complainant and receiving a \nmaterial benefit from it, contrary to ss.  279.01(1) and 279.02(1) of the Criminal Code . \nAt trial, in addition to the complainant, five other witnesses testified: the complainant’s \nbrother, mother and daughter, and two of her friends. These other witnesses did not \nprovide evidence of sexual services, but did provide evidence of the accused’s  violence \ntowards the complainant. The trial judge acquitted the accused. While he",
    "token_count": 1000,
    "start_token": 0,
    "end_token": 1000,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 1,
    "source_file": "2024scc38.txt",
    "text": " from it, contrary to ss.  279.01(1) and 279.02(1) of the Criminal Code . \nAt trial, in addition to the complainant, five other witnesses testified: the complainant’s \nbrother, mother and daughter, and two of her friends. These other witnesses did not \nprovide evidence of sexual services, but did provide evidence of the accused’s  violence \ntowards the complainant. The trial judge acquitted the accused. While he accepted that \nthe complainant found herself in a violent relationship with the accused, he found her \ntestimony lacking in credibility, and had a reasonable doubt about the a ccused’s ties to \nany prostitution enterprise. The majority of the Court of Appeal upheld the acquittals. \nIt held that the trial judge assessed some of the evidence based on a wrong legal \nprinciple by ruling that the accused’s violence was past discreditabl e conduct but that \nthe error had no material bearing on the acquittals. The majority also concluded that \nthe trial judge did not fail to consider all the evidence. The dissenting judge would have \nordered a new trial, finding that the trial judge failed to consider all the evidence, and \nthat treating the accused’s violence as past discreditable conduct misapprehended its \nnature and relevance to the actus reus and mens rea  of both offences.  \n Held  (Côté and Rowe JJ. dissenting): The appeal should be allowed, the \nacquittals set aside, and a new trial ordered.  \n Per Wagner C.J. and Karakatsanis, Martin, Kasirer, Jamal, O’Bonsawin  \nand Moreau JJ.: The trial judge assessed the evidence based on a wrong l egal principle \nby determining that the evidence of violence and threats of violence by the accused \n2024 SCC 38 (CanLII)\n\n--- Page 5 ---\n \n towards the complainant was evidence of past discreditable conduct. This error of law \nhindered his assessment of the evidence and considerably diminished the  evidentiary \nfoundation relevant to the essential elements  of the trafficking in persons offence and \nthe definition of exploitation set out in s.  279.04 of the Criminal Code . The trial judge’s \nerror might have had a material bearing on the acquittals.  \n The object of the offence of trafficking in persons in s.  279.01(1) is to \ncomprehensively respond to all forms of trafficking. This means criminalizing a wide \nrange of conduct carried out for the purpose of exploitation. The phrase “control, \ndirection or infl uence” in s.  279.01(1)  is disjunctive, and the actus reus can be satisfied \nif the movements of the victim have only been subject to one of the elements . These \nelements represent a spectrum of power that the accused exerts ov er the victim’s \nmovements. “Cont rol” will regulate or govern the victim such that they will be left with \nlittle choice over their movements. “Influence” alters, sways, or affects the victim’s  \nwill when they decide how to exercise their freedom. “Direction” speaks less to the \ndegree of po wer the accused exerts over the victim’s movements than to the way the \naccused exerts that power; it means management, guidance, advice, or instruction, and \nsometimes an authoritative command. It is not enough that the accused has acquired \nthe power or the  ability to control, direct, or influence the victim’s movements; they \nmust have actualized it in one way or another. The Crown may establish the actus reus  \nthrough evidence of violence and threats of violence by an accused towards a victim \nand, more gener ally, a violent relationship between the two, if the effect of that violence \nis such that the victim’s movements have been controlled, directed, or influenced.  \n2024 SCC 38 (CanLII)\n\n--- Page 6 ---\n \n  The mens rea for trafficking in persons requires that the accused engaged \nin the actus reus  for the purpose of exploiting the victim or facilitating their \nexploitation. Those words do not require that actual exploitation occur, but people are \nusually able to foresee the consequences of their acts, and if the accused is found to \nhave knowingly exploi ted the victim, then it could be reasonable to infer that the \naccused acted with the intent to do so. The Crown must nevertheless prove that the \naccused subjectively intended to exploit the complainant. Exploitation, which is \ndefined in s.  279.04, occurs w hen the accused engages in any conduct, including \nregular violence and threats of violence, that both causes the victim to provide or offer \nlabour or a service,",
    "token_count": 1000,
    "start_token": 900,
    "end_token": 1900,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 2,
    "source_file": "2024scc38.txt",
    "text": " \nhave knowingly exploi ted the victim, then it could be reasonable to infer that the \naccused acted with the intent to do so. The Crown must nevertheless prove that the \naccused subjectively intended to exploit the complainant. Exploitation, which is \ndefined in s.  279.04, occurs w hen the accused engages in any conduct, including \nregular violence and threats of violence, that both causes the victim to provide or offer \nlabour or a service, and could reasonably be expected to cause the victim to believe that \ntheir safety would be thre atened if they failed to provide that labour or service. The \nlatter must be assessed using an objective test, having regard to all the circumstances, \nincluding the victim’s vulnerabilities.  \n Past discreditable conduct evidence is evidence of the accused’s \nmisconduct beyond what is alleged in the indictment, and is generally inadmissible. \nHowever, if it is covered by the indictment, the Crown can prove the conduct no matter \nhow badly it may reflect on the character of the accused. In the instant case, the tr ial \njudge committed an error of law when he held that the evidence of regular violence and \nthreats of violence by the accused against the complainant was past discreditable \nconduct evidence. Even though the trial judge admitted the evidence, this \nmischarac terization meant he did not assess it properly. That evidence could have been \nrelevant to the essential elements of the offence. It could have formed the basis of a \n2024 SCC 38 (CanLII)\n\n--- Page 7 ---\n \n finding that the accused controlled, directed, or influenced the movements of the \ncomplaina nt during the time period specified in the indictment, and a contributing cause \nof the complainant’s engagement in sexual services. The trial judge’s incorrect \nassessment of this critical evidence seriously undermined his credibility assessment of \nthe comp lainant, which he used as the rationale for acquittal.  \n Acquittals are not set aside lightly. Even where an error of law is made,  the \nCrown must demonstrate that the error might have had a materia l bearing on the \nacquittal. Appellate courts should only set  aside an acquittal when the verdict would \nnot necessarily have been the same had the error not occurred. In the instant case, the \ntrial judge’s error of law undermines the foundation of the acquittals, and the possibility \nof a different verdict having bee n reached is more than abstract or purely hypothetical. \nThe acquittals should be set aside and a new trial ordered.  \n With respect to the issue of whether the trial judge considered all of the \nevidence, an appellate court must presume that a trial judge kno ws the law and deals \ncompetently with issues of fact, and must read the reasons as a whole, in the context of \nthe evidence, the arguments and the trial, with an appreciation of the purposes or \nfunctions for which they are delivered. In the present matter, the reasons show that the \ntrial judge considered the complainant’s evidence in light of the exhibits and the \nevidence of other witnesses . No error warrants intervention on this issue.  \n Per Côté  and Rowe  JJ. (dissenting ): The appeal should be dismissed. \nThere is agreement with the majority that the trial judge made a legal error in \n2024 SCC 38 (CanLII)\n\n--- Page 8 ---\n \n characterizing certain evidence as past discreditable conduct evidence, as it was \nrelevant to the actus reus  of the offence. There is disagre ement regarding the effect of \nthis error, which did not have a material bearing on the acquittals. The Crown’s burden \nis a very heavy one that reflects the restricted nature of the Crown’s ability to appeal \nand the double jeopardy associated with a new tri al. \n To obtain a conviction for trafficking in persons under s.  279.01(1), the \nCrown must establish the mens rea of the offence: that the accused exercised control \nover the complainant for the purpose of exploiting her. In the instant case,  the only \neviden ce relevant to the mens rea  came from the complainant herself . The trial judge \nwas not persuaded beyond a reasonable doubt by the complainant’s testimony. Even if \nthe evidence of the five witnesses was assessed as part of the elements of the offence, \ntheir testimony does not link the accused’s violent behaviour to the complainant’s \nprovision of sexual services. The testimony accepted as credible did not address \nwhether the accused exercised control over the complainant for the purpose of \nexploiting her.  \n The trial judge also made detailed credibility findings that shaped his \nassessment of the evidence of the other witnesses. Credibility findings by trial judges \nare",
    "token_count": 1000,
    "start_token": 1800,
    "end_token": 2800,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 3,
    "source_file": "2024scc38.txt",
    "text": " if \nthe evidence of the five witnesses was assessed as part of the elements of the offence, \ntheir testimony does not link the accused’s violent behaviour to the complainant’s \nprovision of sexual services. The testimony accepted as credible did not address \nwhether the accused exercised control over the complainant for the purpose of \nexploiting her.  \n The trial judge also made detailed credibility findings that shaped his \nassessment of the evidence of the other witnesses. Credibility findings by trial judges \nare owed deference on appeal.  Though the trial judge mischaracterized the evidence of \nthe other wi tnesses as past discreditable conduct evidence, he admitted all of it, and \ntested the complainant’s credibility and evidence against it. The trial judge’s credibility \nfindings were the basis on which his reasonable doubt rested, and on which the accused \n2024 SCC 38 (CanLII)\n\n--- Page 9 ---\n \n was acquitted. There is no proper basis in law to set aside this conclusion. The \nmajority’s reasoning comes perilously close to a ground of app eal of unreasonable \nacquittal, which is unavailable to the Crown, and may encourage courts to collapse the \ndistinct ion between the actus reus and mens rea  of the offence.  \nCases Cited  \nBy O’Bonsawin  J. \n Referred to:  R. v. J.M.H ., 2011 SCC 45, [2011] 3 S.C.R. 197;  R. v. Morin , \n[1992] 3 S.C.R. 286; R. v. B. (G.) , [1990] 2 S.C.R. 57;  R. v. Sutton , 2000 SCC 50, \n[2000] 2 S.C.R. 595; Vézeau v. The Queen , [1977] 2 S.C.R. 277; R. v. Graveline , 2006 \nSCC 16, [2006] 1 S.C.R. 609;  R. v. Hodgson , 2024 SCC 25; R. v. G.F. , 2021 SCC 20, \n[2021] 1 S.C.R. 801 ; R. v. Sheppard , 2002 SCC 26, [2002] 1 S.C.R. 869 ; R. v. R.E.M. , \n2008 SCC 51, [2008] 3 S.C.R. 3 ; R. v. Gerrard , 2022 SCC 13; R. v. Kruk , 2024 SCC \n7; R. v. George , 2017 SCC 38, [2017] 1 S.C.R. 1021;  R. v. Morrissey  (1995), 97 C.C.C. \n(3d) 193 ; R. v. Stanton , 2021 NSCA 57;  Rizzo & Rizzo Shoes Ltd. (Re) , [1998] 1  S.C.R. \n27; R. v. Hutchinson , 2014 SCC 19, [2014] 1 S.C.R. 346; R. v. Hasselwander , [1993] \n2 S.C.R. 398; Urizar v. R. , 2013 QCCA 46;  R. v. Friesen , 2020 SCC 9, [2020] 1 S.C.R. \n424; R. v. Barton , 2019 SCC 33, [2019] 2 S.C.R. 579; R. v. Gallone , 2019 ONCA  663, \n147 O.R. (3d) 225; R. v. Perreault  (1996) , 113 C.C.C. (3d) 573;  R. v. Bazinet  (1986) , \n25 C.C.C. (3d) 273 ; R. v. Goldfinch , 2019 SCC 38, [2019] 3 S.C.R. 3 ; R. v. Robertson , \n[1987] 1 S.C.R. 918; R. v. Arp , [1998] 3 S.C.R. 339;  R. v. White , 2011 SCC 13,  [2011] \n1 S.C.R. 433;  R. v. Schneider , 2022 SCC 34;  R. v. Watson  (1996) , 50 C.R. (4th) 245;  \n2024 SCC 38 (CanL",
    "token_count": 1000,
    "start_token": 2700,
    "end_token": 3700,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 4,
    "source_file": "2024scc38.txt",
    "text": ".R. 918; R. v. Arp , [1998] 3 S.C.R. 339;  R. v. White , 2011 SCC 13,  [2011] \n1 S.C.R. 433;  R. v. Schneider , 2022 SCC 34;  R. v. Watson  (1996) , 50 C.R. (4th) 245;  \n2024 SCC 38 (CanLII)\n\n--- Page 10 ---\n \n R. v. Handy , 2002 SCC 56, [2002] 2 S.C.R. 908;  R. v. B. (C.R.) , [1990] 1 S.C.R. 717;  \nR. v. D. (L.E.) , [1989] 2 S.C.R. 111;  Makin v. Attorney -General for New South Wales , \n[1894] A.C. 57;  R. v. A. (A.), 2015 ONCA 558, 327 C.C.C. (3d) 377; Chahinian v. R. , \n2022 QCCA 499;  R. v. Sinclair , 2020 ONCA 61, 384 C.C.C. (3d) 484;  R. v. Buzzanga \n(1979) , 49 C.C.C. (2d) 369; R. v. Chartrand , [1994] 2 S.C.R. 864;  R. v. Evans , [1993] \n2 S.C.R. 629 . \nBy Côté  and Rowe  JJ. (dissenting)  \n R. v. Graveline , 2006 SCC 16, [2006] 1 S.C.R. 609; R. v. Hodgson , 2024 \nSCC 25; R. v. Kruk , 2024 SCC 7; R. v. Gagnon , 2006 SCC 17, [2006] 1 S.C.R. 621; \nF.H. v. McDou gall, 2008 SCC 53, [2008] 3 S.C.R. 41;  R. v. George , 2017 SCC 38, \n[2017] 1 S.C.R. 1021; R. v. Chung , 2020 SCC 8, [2020] 1 S.C.R. 405; R. v. J.M.H. , \n2011 SCC 45 , [2011] 3 S.C.R. 197 ; R. v. Stanton , 2021 NSCA 57 . \nStatutes and Regulations Cite d \nAct to amend the Criminal Code (minimum sentence for offences involving trafficking \nof persons under the age of eighteen years) , S.C. 2010, c.  3, s. 2. \nAct to amend the Criminal Code (trafficking in persons) , S.C. 2005, c.  43. \nAct to amend the Criminal Code (traffickin g in persons) , S.C. 2012, c.  15, s.  2. \nBill C -268, An Act to amend the Criminal Code (minimum sentence for offences \ninvolving trafficking of persons under the age of eighteen years) , 3rd Sess., 40th  \nParl., 2010.  \nBill C -49, An Act to amend the Criminal Code  (trafficking in persons) , 1st Sess., \n38th Parl., 2004 -2005.  \n2024 SCC 38 (CanLII)\n\n--- Page 11 ---\n \n Criminal Code , R.S.C. 1985, c.  C‐46, ss.  279.01 (1) [ad. 2005, c.  43, s.  3], (3) \n[ad. 2015, c.  16, s.  1], 279.011 (1), 279.02  [ad. 2005, c.  43, s.  3], 279.03  [idem ], \n279.04  [idem ], 676(1)(a), 693(1)(a) . \nImmigration and Refugee Protection Act , S.C. 2001, c.  27, s. 118. \nInterpretation Act , R.S.C. 1985, c.  I-21, s.  12. \nTreaties and Other International Instruments  \nProtocol",
    "token_count": 1000,
    "start_token": 3600,
    "end_token": 4600,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 5,
    "source_file": "2024scc38.txt",
    "text": "  3], 279.03  [idem ], \n279.04  [idem ], 676(1)(a), 693(1)(a) . \nImmigration and Refugee Protection Act , S.C. 2001, c.  27, s. 118. \nInterpretation Act , R.S.C. 1985, c.  I-21, s.  12. \nTreaties and Other International Instruments  \nProtocol to Prevent, Suppress and Punish Trafficking in Persons, Especially Women \nand Children, supplementing the United Nations Convention against Transnational \nOrganized Crime , 2237 U.N.T.S. 319, preamble, Article s 2(a), 3. \nUnited Nations Convention against Transnational Organized Crime , 2225 U.N.T.S. \n209. \nAuthors Cited  \nBlack’s Law Dictionary , 12th ed. , by Bryan A. Garner. St. Pa ul, Minn.: Thomson \nReuters, 2024 , “control”,  “direct”,  “exercise” , “influence” . \nCanada. House of Commons. House of Commons Debates , vol. 140, No.  125, 1st  Sess., \n38th Parl., September 26, 2005, pp. 7988 , 7990 . \nCanada. House of Commons . House of Commons Debates , vol.  140, No.  135, 1st  Sess., \n38th Parl., October 17, 2005, p p. 8619 -20, 8631.  \nCanada. National Inquiry into Missing and Murdered Indigenous Women and Girls. \nReclaiming Power and Place: The Final Report  of the National Inquiry into \nMissing and Murdered Indigenous Women and Girls . Vancouver , 2019.  \nCanada. St atistics Canada. Canadian Centre for Justice and Community Safety \nStatistics. Violent victimization and perceptions of safety: Experiences of First \nNations, Métis and Inuit women in Canada , by Loanna Heidinger. Ottawa, April \n2022.  \nCanada. Statistics Canada. Gender -based violence and unwanted sexual behaviour in \nCanada, 2018: Initial findings from the Survey of Safety in Public and Private \nSpaces , by Ada m Cotter and Laura Savage . Ottawa,  December 2019.  \n2024 SCC 38 (CanLII)\n\n--- Page 12 ---\n \n Canada. Truth and Reconciliation Commission. Honouring the Truth, Reconciling for \nthe Future: Summary of the Final Report of the Truth and Reconciliation \nCommission of Canada . Winnipeg, 2015.  \nGluzman , Helena. “Human Trafficking and Prostitution in Canada — Intersections and \nChallenges” (2018), 66 C.L.Q.  109. \nGourlay, Matthew, et al. Modern Criminal Evidence . Toronto: Emond Montgomery, \n2022.  \nMcCormack, Nancy. The Dictionary of Canadian Law , 5th ed. Toronto: Thomson \nReuters, 2020, “direction”.  \nOxman -Martinez,  Jacqueline, Marie Lacroix and Jill Hanley.  Victims of Trafficking in \nPersons: Perspectives from the Canadian Community Sector . Ottawa: \nDepartment of Justice Canada, 2005 . \nPaciocco, Davi d M., Palma Paciocco and L ee Stuesser . The Law of Evidence , 8th ed. \nToronto: Irwin Law, 2020. \nPlouffe -Malette, Kristine. “L’interprétation de la criminalisation de la traite des êtres \nhumains en droit pénal canadien à l’aune du Protocole de Palerme : analyse de \nl’arrêt  Urizar  de la Cour d’appel du Québec” (2014), 44 R.D.U.S.  1. \nQuebec. Public Inquiry Commission on relations between Indigenous Peoples and \ncertain public services. Public Inquiry Commission on relations between \nIndigenous Peoples and certain public service s in Québec: listening, \nreconciliation and progress  — Final report . Val-d’Or , 2019. \nRoach, Kent. Criminal Law , 8th ed. Toronto: Irwin Law, 2022.  \nSnyder, Emily, Val Napoleon and John Borrows. “Gender and Violence: Drawing on \nIndigenous Legal Resources” (2015), 48 U.B.C. L. Rev.  593. \nVauclair, Martin, Tristan Desjardins and Pauline Lachance. Traité général de pre uve \net de procédure pénales 2024 , ",
    "token_count": 1000,
    "start_token": 4500,
    "end_token": 5500,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 6,
    "source_file": "2024scc38.txt",
    "text": " , 8th ed. Toronto: Irwin Law, 2022.  \nSnyder, Emily, Val Napoleon and John Borrows. “Gender and Violence: Drawing on \nIndigenous Legal Resources” (2015), 48 U.B.C. L. Rev.  593. \nVauclair, Martin, Tristan Desjardins and Pauline Lachance. Traité général de pre uve \net de procédure pénales 2024 , 31st ed. Montréal: Yvon Blais, 2024 . \nWatt, David. Watt’s Manual of Criminal Evidence . Toronto: Thomson Reuters, 2024.  \n APPEAL from a judgment of the Nova Scotia Court of Appeal  (Farrar, \nBryson and Van den Eynden  JJ.A.), 2023 NSCA 28 , 425 C.C.C. (3d) 475, 88 C.R. (7th) \n172, [2023] N.S.J. No.  148 (Lexis), 2023 CarswellNS 315 (WL), affirming a decision \n2024 SCC 38 (CanLII)\n\n--- Page 13 ---\n \n of Coady  J., 2021 NSSC 290, [2021] N.S.J. No.  437 (Lexis), 2021 CarswellNS 792 \n(WL). Appe al allowed , Côté and Rowe  JJ. dissenting.  \n Mark A. Scott , K.C., and Glenn Hubbard , for the appellant.  \n David J. Mahoney , K.C., and Michelle James , for the respondent.  \n The judgment of Wagner C.J. and Karakatsanis, Martin, Kasirer, Jamal, \nO’Bonsawin and Moreau JJ. was delivered by  \n O’B ONSAWIN J. —  \nI. Overview  \n Between 2004 and 2012, T.J.F. (the “accused”) and J.D. (the \n“complainant”) were in a common law relationship marked by violence, evictions, and \nfinancial difficulties. The couple relocated from Halifax, Nova Scotia, to Fort \nSaskatchewan, Alberta, then to Edmonton, Alberta, and eventually returned to Halifax. \nWhile in Fort Saskatchewan, they started engaging in sexual se rvices for compensation, \ninitially by having sex on a webcam, which then evolved to the provision of sexual \nservices by the complainant.  \n2024 SCC 38 (CanLII)\n\n--- Page 14 ---\n \n \n The accused was charged with trafficking in persons, between November \n1, 2006, and December 31, 2011, and receiving a material benefit from it, contrary to \nss. 279.01(1) and 279.02(1) of the Criminal Code , R.S.C. 1985, c. C -46 (“ Cr. C. ”). \n A six -day trial was held in September 2021 during which the Crown called \nthe complainant and  seven other witnesses, and tendered six ex hibits. The accused \nelected not to testify. He was acquitted of both charges.  \n For the reasons that follow, I conclude that the trial judge assessed the \nevidence based on a wrong legal principle by determining that the evidence of violence \nand threats of v iolence by the accused towards the complainant was evidence of past \ndiscreditable conduct, leading to a misapprehension of the evidence. This error of law \nhindered his overall assessment of the evidence and considerably diminished the \nevidentiary foundatio n relevant to the essential elements  of the trafficking in persons \noffence and the definition of exploitation set out in s. 279.04 Cr. C . I am satisfied, to a \nreasonable degree of certainty, that the verdicts of acquittal would not necessarily have \nbeen th e same had this error not occurred.  \n I would allow the appeal, set aside the verdicts of acquittal, and order a \nnew trial.  \nII. Factual Context  \n2024 SCC 38 (CanLII)\n\n--- Page 15 ---\n \n \n The following summarizes key elements of the evidence of the complainant \nand the five civilian witnesses (the “five other witnesses” or the “other witnesses”), and \nexhibits, as detailed by the trial judge in his reasons.  \nA. The Evidence of the Complainant  \n The trial judge acknowledged that the complainant’s testimony “ paints a \ndisturbing case of human exploitation on a gran d scale” but cautioned that “[t]his \nnarrative does not represent findings of fact” ( 2021 NSSC 290,  at para. 12).  \n The complainant and the",
    "token_count": 1000,
    "start_token": 5400,
    "end_token": 6400,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 7,
    "source_file": "2024scc38.txt",
    "text": " or the “other witnesses”), and \nexhibits, as detailed by the trial judge in his reasons.  \nA. The Evidence of the Complainant  \n The trial judge acknowledged that the complainant’s testimony “ paints a \ndisturbing case of human exploitation on a gran d scale” but cautioned that “[t]his \nnarrative does not represent findings of fact” ( 2021 NSSC 290,  at para. 12).  \n The complainant and the accused met in Halifax. They were in a common \nlaw relationship from 2004 to 2012, during which time they cared for two  children and \nrelocated from Halifax to Fort Saskatchewan, then to Edmonton, before returning to \nHalifax.  \n The complainant testified that her relationship with the accused was \nplagued by violence, evictions, and financial difficulties.  She worked in various bars, \nwhile the accused was rarely employed. The couple was “financially strapped” and \nwere frequently evicted. The accused was also prone to bursts of anger and violence \nagainst the complainant (para. 3).  \n While in Fort Saskatchewan , the complainant was working in a bar while \nthe accused chose not to work. Their financial difficulties were ongoing, and the \naccused’s violence escalated to a level that was “twice as bad as in Halifax” (para. 4). \n2024 SCC 38 (CanLII)\n\n--- Page 16 ---\n \n Soon after the complainant secured a bet ter-paying job at a strip bar in Edmonton, the \naccused suggested they have sex on a webcam for money. The complainant was \nunwilling to do this but agreed to avoid the accused’s violence.  \n Unsatisfied with their financial earnings, the accused persuaded the  \ncomplainant to dance for men, and eventually, to offer sexual services for money. The \ncomplainant did not want to offer sex for money but participated because of the \naccused’s violence and threats towards her.  \n The complainant testified that the physical abuse she endured “was a daily \noccurrence” (para. 6). At one point, the accused broke her finger because she refused \nhis request for her to have sex with a woman. The complainant also testified that the \naccused persuaded her to use cocaine and other hard d rugs by threatening  her and her \nchildren .  \n The complainant testified that the accused was deeply involved in the \nsexual services. He posted ads offering sexual services and accompanied her to clients’ \nlocations to either watch or listen to the sexual acts requested by clients. All proceeds \nwent to the accused, while the complainant “only received enough to pay a few bills” \n(para. 8).   \n The sexual services and violence continued until the complainant left the \naccused in 2012. Fearing she could lose her childr en, the complainant never disclosed \nto anyone what was happening while it was occurring.  \n2024 SCC 38 (CanLII)\n\n--- Page 17 ---\n \n B. The Evidence of the Five Other Witnesses  \n The Crown called five other witnesses: the complainant’s brother, mother, \nand daughter, and two of her friends, J.K. and K.L.   \n The complainant’s brother testified that the accused and the complainant \nfought and that the accused “was always screaming at [the complainant] and broke all \nkinds of things around him” (trial reasons, at para. 18). He recalled seeing both going \nout at n ight, and that the accused had lots of cash.  \n The complainant’s mother did not provide evidence of sexual services or \ndirect evidence of family violence, although parts of her testimony implied a violent \nhome.  \n The complainant’s daughter lived with the comp lainant and the accused. \nShe testified that the couple fought and that the accused “would break things” in \nHalifax (para. 28). Once they moved to Alberta, the fighting intensified to a point where \nthe accused and the complainant “fought all the time” ( ibid.). She recalled seeing her \nmother’s lip “split open” ( ibid.), and hearing threats to kill and screams. Upon their \nreturn to Halifax, she testified seeing the accused “forcefully push [the complainant] \ninto a wall” (para. 30). When asked about the accused and the complainant’s late -night \noutings, the daughter explained that she thought they went out to work.  \n2024 SCC 38 (CanLII)\n\n--- Page 18 ---\n \n \n In addition to family witnesses, the Crown called two of the complainant’s \nfriends to testify. The complainant’s friend, J.K., lived with the couple w hen they \nreturned to Halifax from Edmonton. He described the relationship between the",
    "token_count": 1000,
    "start_token": 6300,
    "end_token": 7300,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 8,
    "source_file": "2024scc38.txt",
    "text": "para. 30). When asked about the accused and the complainant’s late -night \noutings, the daughter explained that she thought they went out to work.  \n2024 SCC 38 (CanLII)\n\n--- Page 18 ---\n \n \n In addition to family witnesses, the Crown called two of the complainant’s \nfriends to testify. The complainant’s friend, J.K., lived with the couple w hen they \nreturned to Halifax from Edmonton. He described the relationship between the accused \nand the complainant as “nothing out of the ordinary” and testified hearing “a lot of \nyelling and occasional loud banging” (para. 32). He assumed that when both we re out \ntogether, which happened a few times per week, they were grocery shopping.  \n The complainant’s other friend, K.L., testified that she saw many disputes \nand injuries suffered by the complainant. She testified that she drove the couple to \nhotels and nig htclubs, and that she would sometimes pick them up at night. She also \nlent them her computer regularly. K.L. later discovered the sexual services ads on \nCraigslist, and confronted the complainant about it, who hung up the phone upset and \ncrying. Shortly af ter, she received a call from the accused who stated that “if she went \nto the police, he would have her charged and she would lose her job” (para. 37).  \nC. The Exhibits  \n The Crown also tendered six exhibits, four of which are relevant for the \npurposes of this a ppeal:  \n Medical reports from the Royal Alexandra Hospital in Edmonton, \nAlberta, detailing that the complainant attended on August 12, 2009, \nwith an “upper extremity injury right finger” with a “possible open \ndislocation” (trial reasons, at para. 13);  \n2024 SCC 38 (CanLII)\n\n--- Page 19 ---\n \n  Medica l reports from the Fort Saskatchewan Health Centre, detailing \nthat the complainant attended on January 16, 2008, with a “cut [right] \nangle of the mouth” (para. 14);  \n A Craigslist affidavit enclosing two ads for sexual services, one dated \nMarch 31, 2009, and  the other dated May 29, 2009, both with a phone \nnumber; and  \n A Rogers Communications affidavit confirming that the two phone \nnumbers on both Craigslist ads belonged to the accused. The affidavit \nalso confirms that the authorized user phone above the second  ad \nbelonged to the complainant.  \nIII. Judicial History  \nA. Supreme Court of Nova Scotia, 2021 NSSC 290 (Coady J.)  \n The trial judge acquitted the accused. He reasoned that while there was \nmuch to suggest that the accused was part of a “prostitution business”, there was not \nenough to establish proof beyond reasonable doubt (para. 70).  \n The trial judge found the complainant’s testimony lacking in credibility. \nAs for the evidence of the five other witnesses, he held that they did not directly address \n2024 SCC 38 (CanLII)\n\n--- Page 20 ---\n \n the essential elemen ts of the offences, resting the onus on the complainant to provide \ndirect evidence of such elements .  \n The trial judge noted that the complainant “was often prone to exaggeration \nand hyperbole” during her testimony, and sometimes directed her answers at the  \naccused (para. 58). He found that the complainant’s cross -examination further altered \nher testimony, highlighting numerous incoherencies, inconsistencies, and \ncontradictions with earlier statements.  \n As for the other witnesses, the trial judge set aside p art of their evidence. \nHe held that they “related to [the accused]’s bad character which, usually, is \npresumptively inadmissible” (para. 42). He still admitted the evidence, given that they \n“assist[ed] the Court in understanding the relationship between th e parties and the \ncontext in which the alleged abuse occurred” (para. 44). The trial judge held that the \ncharacter evidence “establishe[d] a pattern of dominant behaviour by the accused which \nallows the criminal conduct to exist in that environment; in thi s case the exploitation \nof [the complainant]” (para. 43). The character evidence was “a backdrop in which \nsuch exploitation could thrive” (para. 57).  \n While the trial judge accepted that the complainant “found herself trapped \nin a violent, unhappy, and lov eless relationship” with the accused who subjected her to \n“threats, intimidation, and injury”, he remained troubled by a reasonable doubt about",
    "token_count": 1000,
    "start_token": 7200,
    "end_token": 8200,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 9,
    "source_file": "2024scc38.txt",
    "text": " conduct to exist in that environment; in thi s case the exploitation \nof [the complainant]” (para. 43). The character evidence was “a backdrop in which \nsuch exploitation could thrive” (para. 57).  \n While the trial judge accepted that the complainant “found herself trapped \nin a violent, unhappy, and lov eless relationship” with the accused who subjected her to \n“threats, intimidation, and injury”, he remained troubled by a reasonable doubt about \nthe accused’s ties to any prostitution enterprise ( ibid.). He acquitted the accused on all \ncharges.  \n2024 SCC 38 (CanLII)\n\n--- Page 21 ---\n \n B. Nova Scotia Court of Appeal, 2023 NSCA 28, 425 C.C.C. (3d) 475  \n The Crown appealed the acquittals, alleging that the trial judge committed \nthree errors of law:  \n(a) he assessed the evidence based on a wrong legal principle;  \n \n(b) he failed to consider all relevant evide nce; and  \n \n(c) he erred with respect to the legal effect of factual findings made.  \n \n(A.F., at para. 2)  \n(1) The Majority (Bryson J.A., Farrar J.A. Concurring)  \n The majority of the Court of Appeal dismissed the appeal and upheld the \nacquittals.  \n First, the majori ty held that the trial judge assessed some of the evidence \nbased on a wrong legal principle by ruling that the accused’s threats, intimidation and \nviolence were past discreditable conduct. However, the error had no material bearing \non the acquittals, since  the judge still held a reasonable doubt on the essential elements \nof the offences, namely, that the accused “exploited [the complainant] or benefited \nfrom any alleged exploitation of her” ( ibid.; see also para.  31). The majority opined \nthat evidence of vi olence alone did not prove exploitation, and, as such, the evidence \nof the other witnesses, limited to violence, could not establish exploitation. In the \n2024 SCC 38 (CanLII)\n\n--- Page 22 ---\n \n majority’s view, only the complainant provided evidence of exploitation, but the trial \njudge found tha t she lacked credibility.  \n Second, the majority concluded that the trial judge did not fail to consider \nall the evidence. In its view, he did not piecemeal the evidence by treating the \ncomplainant’s credibility as determinative of the entire case. According  to the majority, \nsince the other witnesses’ evidence “was reviewed, but did not establish actual or \nintended exploitation” (para. 48), it could only corroborate the complainant’s \ndescription of domestic violence. It was therefore adequate for the trial ju dge to treat \nthe complainant’s credibility on the element of exploitation as determinative.  \n The majority also held that the trial judge adequately grappled with all the \nevidence even though he did not address the two Craigslist ads and their associated \nphone numbers in his reasons. The majority opined that the trial judge was alive to this \ninculpatory evidence “because he recited the evidence describing those numbers” (para. \n54). The trial judge simply found the evidence insufficient “to resuscitate [the \ncomplainant]’s credibility” ( ibid.; see also para.  57).  \n Finally, the majority held that the trial judge did not fail to appreciate the \nlegal effect of his factual findings since none established exploitation. The majority \nfurther held that the presumption o f s. 279.01(3) Cr. C.  does not establish exploitation.  \n(2) The Dissent (Van den Eynden J.A.)  \n2024 SCC 38 (CanLII)\n\n--- Page 23 ---\n \n \n The dissenting judge, Van den Eynden J.A., would have allowed the appeal \nand ordered a new trial. In her view, all three errors raised by the Crown might have \nhad a m aterial bearing on the acquittals.  \n First, the dissenting judge agreed with the majority that the trial judge \nassessed the evidence of the accused’s violence based on a wrong legal principle by \ntreating it as evidence of past discreditable conduct (paras. 9 0-96 and 99).  \n However, contrary to the majority, the dissenting judge ruled that the trial \njudge “misapprehended the nature and relevance of the violent acts the [accused] \ninflicted on the complainant” (para. 94), as they were relevant to establishing \nexploitation, and the actus reus  and mens rea  of both offences.  \n Second, the",
    "token_count": 1000,
    "start_token": 8100,
    "end_token": 9100,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 10,
    "source_file": "2024scc38.txt",
    "text": " of past discreditable conduct (paras. 9 0-96 and 99).  \n However, contrary to the majority, the dissenting judge ruled that the trial \njudge “misapprehended the nature and relevance of the violent acts the [accused] \ninflicted on the complainant” (para. 94), as they were relevant to establishing \nexploitation, and the actus reus  and mens rea  of both offences.  \n Second, the dissenting judge found that the trial judge failed to consider all \nthe evidence. In her view, the evidence of the other witnesses on the accused’s violent \nacts could have “strengthen [ed] the credibility and reliability of the complainant’s \nevidence” (para. 104). She also held that the trial judge failed to grapple with the \npresence of the accused’s phone number in the sexual services ads.  \n Finally, the dissenting judge opined that the trial judge erred regarding the \nlegal effect of his factual findings. She determined that, had the trial judge applied the \nproper legal framework, “the actus reus may well have been established and the \npresumption [found in s.  279.01(3) Cr. C. ] would there fore have applied” (para. 111).  \n2024 SCC 38 (CanLII)\n\n--- Page 24 ---\n \n IV. Issues  \n This is an appeal as of right and is therefore limited to questions of law on \nwhich the judge of the Nova Scotia Court of Appeal dissented (s. 693(1)(a) Cr. C. ).  \n The Crown raised  two questions in its notice of appea l: (i) whether the trial \njudge failed to consider all the evidence, and (ii) whether the trial judge erred regarding \nthe legal effect of his factual findings.   \n Shortly before the hearing, the Crown withdrew its arguments supporting \nthe second question regarding the legal effect of the trial judge’s factual findings, \nleaving only the first question to be decided.  \n However, a closer reading of the reasons of the Co urt of Appeal reveals \nthat the dissenting judge disagreed with the majority on whether the \nmischaracterization of part of the evidence as evidence of past discreditable conduct \namounted to a misapprehension of the evidence (paras. 8, 67, 90 -96 and 99). Whi le the \nmajority ruled that this error “did not taint [the trial judge’s] legal analysis of the \nelements of the offence” (para. 35), the dissenting judge opined that the trial judge’s \nreasons demonstrated a “lack of understanding” of the concept of past dis creditable \nconduct, which led him to “misapprehen[d] the nature and relevance of the violent acts \nthe [accused] inflicted on the complainant” (para. 94). This is a question of law that \nrequires us to determine whether the trial judge’s mischaracterization of the evidence \nof the other witnesses tainted his analysis of the evidence (see R. v. J.M.H ., 2011 SCC \n2024 SCC 38 (CanLII)\n\n--- Page 25 ---\n \n 45, [2011] 3 S.C.R. 197, at para. 29,  citing R. v. Morin , [1992] 3 S.C.R. 286, at p.  295, \nand R. v. B. (G.) , [1990] 2 S.C.R. 57, at p.  75). \n Lastly, in a  criminal legal system built on the presumption of innocence, \nacquittals are not set aside lightly. Even when errors of law are made, appellate courts \nshould only set aside an acquittal when “the verdict would not necessarily have been \nthe same had the err ors not occurred” ( R. v. Sutton , 2000 SCC 50, [2000] 2 S.C.R. 595, \nat para. 2, citing Vézeau v. The Queen , [1977] 2 S.C.R. 277, at pp. 291 -92; R. v. \nGraveline , 2006 SCC 16, [2006] 1 S.C.R. 609, at para. 14). Our Court will thus have \nto determine if the all eged error(s) of law might have had a material bearing on the \nverdicts of acquittal ( R. v. Hodgson , 2024 SCC 25, at para. 36).  \n In sum, three questions are raised by this appeal:  \n1. Did the trial judge fail",
    "token_count": 1000,
    "start_token": 9000,
    "end_token": 10000,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 11,
    "source_file": "2024scc38.txt",
    "text": " 2006 SCC 16, [2006] 1 S.C.R. 609, at para. 14). Our Court will thus have \nto determine if the all eged error(s) of law might have had a material bearing on the \nverdicts of acquittal ( R. v. Hodgson , 2024 SCC 25, at para. 36).  \n In sum, three questions are raised by this appeal:  \n1. Did the trial judge fail to consider all the evidence?  \n2. Did the trial judge mis apprehend the evidence?  \n3. Might the error(s) of law, if any, have had a material bearing on the \nacquittals?  \nV. Analysis  \n My analysis is divided into three parts. First, I will demonstrate that the \ntrial judge considered all the evidence. Second, I will explain that the trial judge \n2024 SCC 38 (CanLII)\n\n--- Page 26 ---\n \n assessed the evidence based on a wrong legal principle, leading to a misapprehension \nof the evidence. Finally, I will conclude that the error of law the trial judge committed \nmight have had a material bearing on the acquittals.  \nA. Did th e Trial Judge Fail To Consider All the Evidence?  \n The Crown argues that the trial judge failed to consider all the evidence \nbecause he “piecemealed” the evidence by subjecting the complainant’s testimony to \nthe criminal standard of proof (A.F., at para. 127 ), and also ignored the Craigslist ads \n(para. 130).  \n The accused responds that the trial judge properly considered the evidence \nof the other witnesses as well as all documentary evidence (R.F., at para. 83; see also \npara.  91). I agree.  \n When an appellate c ourt reviews reasons for errors of law, it must be \n“rigorous in its assessment”, approaching the review in the same way it would approach \nallegations of insufficient reasons ( R. v. G.F. , 2021 SCC 20, [2021] 1 S.C.R. 801, at \npara. 79). It must presume that a trial judge “know[s] the law .  . . and deal[s] \ncompetently with the issues of fact” ( R. v. Sheppard , 2002 SCC 26, [2002] 1 S.C.R. \n869, at paras. 32 and 55; R. v. R.E.M. , 2008 SCC 51, [2008] 3 S.C.R. 3, at para. 54; \nG.F., at para. 74; R. v. Gerrard , 2022 SCC 13, at para. 2; R. v. Kruk , 2024 SCC 7, at \npara. 84). It is not enough to suspect the trial judge erred in law; the appellate court \nmust be satisfied that the trial court erred having given its reasons “a fair reading” \n2024 SCC 38 (CanLII)\n\n--- Page 27 ---\n \n (J.M.H. , at paras. 20, 23 and 31) . That is, having read them “as a whole, in the context \nof the evidence, the arguments and the trial, with an appreciation of the purposes or \nfunctions for which they are delivered” ( R.E.M. , at para. 16; see, in the context of an \nappeal from an acquittal, R. v. George , 2017 SCC 38, [2017] 1 S.C.R. 1021, at para.  18, \nciting R. v. Morrissey  (1995), 97 C.C.C. (3d) 193 (Ont. C.A.), at pp. 203 -4). \n Applying these principles to the present matter, the trial judge devoted five \nparagraphs to the framework through wh ich he would assess the credibility and \nreliability of the complainant (paras. 52 -56). Within this framework, he wrote explicitly \nthat “[w]here the Crown’s case is wholly dependent on the testimony of the \ncomplainant it is essential the credibility and rel iability of the complainant’s evidence \nbe tested in the context of all the rest of the evidence” (para. 53, citing R. v. Stanton , \n2021 NSCA 57, at para. 67). He did just that. The reasons show that the trial judge \nconsidered the complainant’s evidence in l ight of the exhibits and the evidence of other \nwitnesses.  \n I see no error that warrants our intervention on this issue. The trial judge \n",
    "token_count": 1000,
    "start_token": 9900,
    "end_token": 10900,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 12,
    "source_file": "2024scc38.txt",
    "text": " the complainant’s evidence \nbe tested in the context of all the rest of the evidence” (para. 53, citing R. v. Stanton , \n2021 NSCA 57, at para. 67). He did just that. The reasons show that the trial judge \nconsidered the complainant’s evidence in l ight of the exhibits and the evidence of other \nwitnesses.  \n I see no error that warrants our intervention on this issue. The trial judge \nconsidered all the evidence. The fact that he did not discuss in greater detail the \ninfluence that specific evidence had on his reasoning is not an error of law. The trial \njudge was not required to “set out every finding or conclusion in the process of arriving \nat the verdict”, nor did he have to detail his finding on each piece of evidence before \nhim ( R.E.M. , at paras. 18 a nd 20).  \n2024 SCC 38 (CanLII)\n\n--- Page 28 ---\n \n \n Crucially, however, the consideration of evidence must not be confused \nwith the assessment of evidence. As I will explain below, even if the trial judge \nconsidered all the evidence in his reasons, he assessed the evidence of the other \nwitnesses ba sed on a wrong legal principle. This error of law hindered his overall \nassessment of the evidence.  \nB. Did the Trial Judge Misapprehend the Evidence?   \n Before addressing the trial judge’s assessment of the evidence based on a \nwrong legal principle, I will interpret s. 279.01 Cr. C.  This provision establishes the \noffence of trafficking in persons.  \n(1) Interpretation of Section 279.01 Cr. C.   \n Criminal law is no  exception to the basic rule of statutory interpretation \nthat “the words of an Act are to be read in their entire context and in their grammatical \nand ordinary sense harmoniously with the scheme of the Act, the object of the Act, and \nthe intention of Parli ament” ( Rizzo & Rizzo Shoes Ltd. (Re) , [1998] 1  S.C.R.  27, at para. \n21, citing E. A. Driedger, Construction of Statutes  (2nd ed. 1983), at p. 87 ; see also R. \nv. Hutchinson , 2014 SCC 19, [2014] 1 S.C.R. 346, at para. 16, citing R. Sullivan, \nSullivan on the Construction of Statutes  (5th ed. 2008), at p. 1; Interpretation Act , \nR.S.C. 1985, c.  I-21, s. 12;  R. v. Hasselwander , [1993] 2 S.C.R. 398, at pp. 411 -14).  \n2024 SCC 38 (CanLII)\n\n--- Page 29 ---\n \n \n Bill C -49, An Act to amend the Criminal Code  (trafficking in persons ), 1st \nSess., 38th Parl., 2004 -2005, came into force on November 25, 2005 ( An Act to amend \nthe Criminal Code (trafficking in persons) , S.C. 2005, c. 43). Bill C -49 created the \noffences of trafficking in persons (s. 279.01 Cr. C. ), material benefit (s. 279.02 Cr. C. ), \nand withholding or destroying documents (s. 279.03 Cr. C. ). It also defined \n“exploitation” (s. 279.04 Cr. C. ). To this date, our Court has never had the opportunity \nto interpret those provisions.1 \n For ease of reference, ss. 279.01, 279.02, and 279.04 Cr. C. are reproduced \nbelow as they read during the time period specified in the indictment at issue:  \n279.01 (1)  Every person who recruits, transports, transfers, receives, holds, \nconceals or harbours a person, or exercises control, direction or influence \nover the movements of a person, for the purpose of exploiting them or \nfacilitating their exploitation is guilty of an indictable offence and liable  \n \n(a) to imprisonment for life if they kidnap, commit an aggravated assault \nor aggravated sexual assault against, or cause death to, the victim during \nthe commission of the offence; or  \n \n(b) to imprisonment for a term of not more than fourteen years in any \nother case.  \n \n(2) No consent to the activity that forms the subject -matter of a charge \nunder subsection (1) is valid.  \n \n279",
    "token_count": 1000,
    "start_token": 10800,
    "end_token": 11800,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 13,
    "source_file": "2024scc38.txt",
    "text": " guilty of an indictable offence and liable  \n \n(a) to imprisonment for life if they kidnap, commit an aggravated assault \nor aggravated sexual assault against, or cause death to, the victim during \nthe commission of the offence; or  \n \n(b) to imprisonment for a term of not more than fourteen years in any \nother case.  \n \n(2) No consent to the activity that forms the subject -matter of a charge \nunder subsection (1) is valid.  \n \n279.02  Every person who receives a financial or other material benefit, \nknowing that it results from t he commission of an offence under subsection \n279.01(1), is guilty of an indictable offence and liable to imprisonment for \na term of not more than ten years.  \n \n                                                 \n1 I note that Parliament has since enacted a presumption under s. 279.01(3)  Cr. C.  that was not in force \nduring the period of time covered by the indictment.  \n \n2024 SCC 38 (CanLII)\n\n--- Page 30 ---\n \n 279.04  For the purposes of sections 279.01 to 279.03, a person exploits \nanother person if they  \n \n(a) cause them to provide, or offer to provide, labour or a service by \nengaging in conduct that, in all the circumstances, could reasonably be \nexpected to cause the other person to believe that their safety or the \nsafety of a person known to them would be th reatened if they failed to \nprovide, or offer to provide, the labour or service; or  \n \n(b) cause them, by means of deception or the use or threat of force or of \nany other form of coercion, to have an organ or tissue removed.  \n(a) Object of Section 279.01 Cr. C.  \n When Bill C -49 was enacted, the RCMP estimated that approximately 600 \nwomen and children were trafficked into Canada each year for sexual exploitation \nalone, and at least 800 women and children for all domestic markets, including drug \ntrade, domestic work, and labour for garment or other industries (J. Oxman -Martinez, \nM. Lacroix and J. Hanley, Victims of Trafficking in Persons: Perspectives from the \nCanadian Community Sector  (2005), at p. 2; see also House of Commons Debates , \nvol. 140, No.  125, 1st Sess., 38 th Parl., September 26, 2005, at p. 7990 (Vic Toews); \nHouse of Commons Debates , vol.  140, No.  135, 1st Sess., 38th Parl., October 17, 2005, \nat p. 8631 (Hon. Judy Sgro)).  \n There was, at the time, an existing prohibition on trafficking in the \nimmigration con text ( Immigration and Refugee Protection Act , S.C. 2001, c. 27  \n(“IRPA ”), s. 118). Bill C -49 aimed to “broaden the reach of our existing prohibition to \ncomprehensively respond to all forms of human trafficking, whether they occur wholly \nwithin Canada or whe ther they involve some cross -border or international dimension” \n2024 SCC 38 (CanLII)\n\n--- Page 31 ---\n \n (House of Commons Debates , October 17, 2005, at p.  8620 (Hon. Irwin Cotler); United \nNations Convention against Transnational Organized Crime , 2225 U.N.T.S. 209; \nProtocol to Prevent, Suppress a nd Punish Trafficking in Persons, Especially Women \nand Children, supplementing the United Nations Convention against Transnational \nOrganized Crime , 2237 U.N.T.S. 319, Article 3).  \n Section  279.01(1) Cr. C . broadens the existing prohibition in two ways. \nFirst, it criminalizes trafficking in persons beyond the immigration context (s. 118 of \nthe IRPA ; Urizar v. R. , 2013 QCCA 46 , at paras.  68, 73 and 77; see also K. Plouffe -\nMalette, “L’interprétation de la crim inalisation de la traite des êtres humains en droit \npénal canadien à l’aune du Protocole de Palerme : analyse de l’arrêt Urizar  de la Cour \nd’appel du Québec” (2014), 44 R.D.U.S.  1, at p. 17; H. Gluzman, “Human Trafficking  \nand Prostitution in Canada – Intersections and Challenges",
    "token_count": 1000,
    "start_token": 11700,
    "end_token": 12700,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 14,
    "source_file": "2024scc38.txt",
    "text": "étation de la crim inalisation de la traite des êtres humains en droit \npénal canadien à l’aune du Protocole de Palerme : analyse de l’arrêt Urizar  de la Cour \nd’appel du Québec” (2014), 44 R.D.U.S.  1, at p. 17; H. Gluzman, “Human Trafficking  \nand Prostitution in Canada – Intersections and Challenges” (2018), 66 C.L.Q.  109, at \np. 123).  \n Second, s. 279.01(1) Cr. C.  captures a wide range of conduct under the \nactus reus  (see Article  3(a) of the Protocol ). The broad scope of the actus reus  is \ncount erbalanced by the requirement that it be carried out “for the purpose of exploiting \n[the victim] or facilitating their exploitation”. This tailors the offence to conduct that \ngoes to the heart of trafficking in persons while maintaining the flexibility nec essary to \nrespond to all its forms.  \n Underlying Bill C -49’s object of capturing all forms of trafficking in \npersons is the concern for the protection of women and children, who are especially \n2024 SCC 38 (CanLII)\n\n--- Page 32 ---\n \n vulnerable to trafficking in persons (see House of Commons Debate s, September 26, \n2005, at p. 7988 (Hon. Paul Harold Macklin); House of Commons Debates , October \n17, 2005, at p. 8619 (Hon. Irwin Cotler); see also the preamble and Article 2(a) of the \nProtocol ).  \n Our Court’s jurisprudence, national commissions and inquirie s, and \nresearch echo this concern and recognize that women and children, including \nIndigenous women and girls, are “disproportionately subjected to sexual violence” ( R. \nv. Friesen , 2020  SCC  9, [2020] 1 S.C.R. 424, at paras. 68 and 70; see also R. v. Barton , \n2019 SCC 33, [2019] 2 S.C.R. 579, at para.  198; Statistics Canada, Gender -based \nviolence and unwanted sexual behaviour in Canada, 2018: Initial findings from the \nSurvey of Safety in Public and Private Spaces (December 2019); Statistics Canada, \nViolent vi ctimization and perceptions of safety: Experiences of First Nations, M étis and \nInuit  women in Canada  (April 2022); Public Inquiry Commission on relations between \nIndigenous Peoples and certain public services,  Public Inquiry Commission on \nrelations between  Indigenous Peoples and certain public services in Qu ébec: listening, \nreconciliation and progress – Final report (2019), at pp. 120-21; Honouring the Truth, \nReconciling for the Future: Summary of the Final Report of the Truth and \nReconciliation Commission of Canada  (2015), at pp. 226 -27; National Inquiry into \nMissing and Murdered Indigenous Women and Girls,  Reclaiming Power and Place: \nThe Final Report of the National Inquiry into Missing and Murdered Indigenous \nWomen and Girls (2019); E. Snyder, V. Napoleon  and J. Borrows, “Gender and \nViolence: Drawing on Indigenous Legal Resources” (2015), 48 U.B.C. L. Rev. 593). \n2024 SCC 38 (CanLII)\n\n--- Page 33 ---\n \n \n Five years after the enactment of Bill C -49, Bill C -268, An Act to amend \nthe Criminal Code (minimum sentence for offences involving trafficking of  persons \nunder the age of eighteen years) , 3rd Sess., 40th Parl., 2010 (enacted as S.C. 2010, c.  3, \ns. 2), created a new offence criminalizing the trafficking of persons under the age of \n18, punishable by mandatory minimum sentences, and increased the maxi mum \nsentence to life imprisonment where especially violent acts have been committed \nagainst a child victim (s.  279.011(1) Cr. C. ).  \n In sum, the object of s.  279.01(1) Cr. C.  is to comprehensively respond to \nall forms of trafficking in persons with a focus on women and children, who are more \ncommonly affected. This means criminalizing a wide range of conduct carried out with \nthe purpose of exploiting or facilitating the exploitation of one or many victims. \nUndoubtedly, regular violence and threats of violenc e by an",
    "token_count": 1000,
    "start_token": 12600,
    "end_token": 13600,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 15,
    "source_file": "2024scc38.txt",
    "text": "(1) Cr. C. ).  \n In sum, the object of s.  279.01(1) Cr. C.  is to comprehensively respond to \nall forms of trafficking in persons with a focus on women and children, who are more \ncommonly affected. This means criminalizing a wide range of conduct carried out with \nthe purpose of exploiting or facilitating the exploitation of one or many victims. \nUndoubtedly, regular violence and threats of violenc e by an accused towards a victim \nand, more generally, a violent relationship with a victim, can be the means of \nperpetuating such conduct.  \n(b) Text and Context of Section 279.01 Cr. C.  \n Our Court has not yet had the opportunity to interpret the meaning of the \nphrase “control, direction or influence”. Both the Court of Appeal of Quebec in Urizar  \nand the Court of Appeal for Ontario in R. v. Gallone , 2019 ONCA 663, 147 O.R. (3d) \n225, relied on R. v. Perreault  (1996), 113 C.C.C. (3d) 573 (Que. C.A.), to discern its  \nmeaning. There, the Court of Appeal of Quebec interpreted the meaning of the phrase \n“exercises control, direction or influence over the movements of a person” in the \n2024 SCC 38 (CanLII)\n\n--- Page 34 ---\n \n context of the procuring offence codified at s.  286.3(1) Cr. C. (formerly s.  212(1)(h) \nCr. C.) to mean that:  \nThe element of control refers to invasive behaviour, to ascendancy \nwhich leaves little choice to the person controlled. This therefore includes \nacts of direction and influence. There is the exercise of direction over the \nmovements of a  person when rules or behaviours are imposed. The exercise \nof direction does not exclude the person being directed from having a \ncertain latitude or margin for initiative. The exercise of influence includes \nless constricting actions. Any action exercised o ver a person with a view \nto aiding, abetting or compelling that person to engage in or carry on \nprostitution would be considered influence. [Emphasis deleted; pp. 575 -\n76.] \n The Court of Appeal for Ontario summarizes exercising control as being \n“like giving an order that the person has little choice but to obey, and exercising \ndirection is like imposing a rule that the person should follow, then exercising influence \nis like proposing an idea and persuading the person to adopt it” ( Gallone , at para. 47).  \n What first emerges from those interpretations is a spectrum of power that \nthe accused exerts over the victim’s ability to move freely and their actual movements. \nOn one end of the spectrum, the accused will exercise “control” over the victim’s \nmovements; the fo rmer will “regulate or govern” the latter ( Black’s Law Dictionary \n(12th ed. 2024), at p.  418), such that the victim will be left with little choice over their \nmovements. On the other end, the accused will exercise “influence” over the victim’s \nmovements wh en they will, at minimum, “induce action or change the decisions or acts \nof [the victim]” about their movements (p.  928). This means that the victim is free to \n2024 SCC 38 (CanLII)\n\n--- Page 35 ---\n \n move wherever they like, but that when they decide how to exercise their freedom, the \naccused “a lter[s], sway [s], or affect[s] [their] will” (p.  928).  \n Contrary to “control” and “influence”, “direction” speaks less to the degree \nof power the accused exerts over the victim’s movements than to the way the accused \nexerts that power. “Direction” means “[ m]anagement, guidance, advice or instruction”, \nand can sometimes refer to an “authoritative command” ( The Dictionary of Canadian \nLaw (5th ed. 2020), at p.  319, citing R. v. Bazinet (1986) , 25 C.C.C. (3d) 273 (Ont. \nC.A.), at p.  284), and the verb “to direct ” is defined as “[t]o guide”, “to govern”, and \n“[t]o instruct (someone) with authority” ( Black’s Law Dictionary , at p. 576). While \ndirection will often overlap with control or influence, it can be found to have occurred \neven where the victim’s movements ha ve not been controlled or influenced. Since the \n",
    "token_count": 1000,
    "start_token": 13500,
    "end_token": 14500,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 16,
    "source_file": "2024scc38.txt",
    "text": "d) 273 (Ont. \nC.A.), at p.  284), and the verb “to direct ” is defined as “[t]o guide”, “to govern”, and \n“[t]o instruct (someone) with authority” ( Black’s Law Dictionary , at p. 576). While \ndirection will often overlap with control or influence, it can be found to have occurred \neven where the victim’s movements ha ve not been controlled or influenced. Since the \nenumeration “control, direction or influence” is disjunctive, the actus reus can be \nsatisfied if the movements of the victims have only been subject to the accused’s \ndirection.  \n Section  279.01(1) Cr. C. specif ies that control, direction, or influence must \nbe “exercise[d]”.  According to the Black’s Law Dictionary , the verb “exercise” (in \nFrench, “ exercer ”) implies the realization of something: “1. To make use of; to put into \naction <exercise the right to vote>. 2. To implement the terms of; to execute <exercise \nthe option to buy the commodities>” (p.  716). It is then not enough that the accused \nhas acquired the power or the ability to control, direct, or influence the victim’s \n2024 SCC 38 (CanLII)\n\n--- Page 36 ---\n \n movements. They must have actualized  it in one way or another, such that the victim’s \nmovements have been controlled, directed, or influenced by the accused.  \n It follows that nothing in the text of the provision bars the Crown from \nestablishing the actus reus  through evidence of violence and threats of violence by an \naccused towards a victim and, more generally, a violent relationship between the two, \nif the effect of that violence is such that the victim’s movements have been controlled, \ndirected, or influenced.  \n Control, direction, or influe nce exercised by the accused over the victim’s \nmovements can persist over time, thus creating a situation or a relationship throughout \nwhich the victim’s movements are being controlled, directed, or influenced regularly.  \n(c) Conclusion  \n The text, context, and purpose of s.  279.01 Cr. C. all support the position \nthat the Crown can adduce evidence showing an accused’s violent relationship with a \nvictim, or regular violence and threats of violence against the victim, in an effort to \nestablish the actus reus  of the  trafficking in persons offence. Such conduct can amount \nto exercising control, direction, or influence over their movements during a period of \ntime, provided that the effect of that violence is that the victim’s movements have been \neffectively controlled,  directed, or influenced during that time.  \n2024 SCC 38 (CanLII)\n\n--- Page 37 ---\n \n \n With this in mind, I will explain how the trial judge assessed the evidence \nbased on a wrong legal principle, leading to a misapprehension of the evidence.  \n(2) The Trial Judge Assessed the Evidence Based on a Wrong Legal Principle  \n The accused, the Crown, and the Nova Scotia Court of Appeal agree that \nthe trial judge mischaracterized some of the evidence of the other witnesses as evidence \nof the accused’s past discreditable conduct (A.F., at para. 75; R.F., at para. 8 ; C.A. \nreasons, at paras. 8 and  86). However, they disagree on whether this \nmischaracterization amounted to a misapprehension of the evidence.  \n When facing Crown appeals of acquittals, appellate courts have an \nobligation to “articulate with precision how t he trial judge erred in law” ( Hodgson , at \npara. 40). To articulate with precision the trial judge’s error of law, I will first define \npast discreditable conduct evidence, then identify what conduct the trial judge \ncharacterized as past discreditable conduc t, and finally, assess whether the trial judge \nwas correct to characterize it as such.  \n(a) Past Discreditable Conduct Evidence and Its Exclusionary Rule  \n Generally, when judging whether an accused is guilty of an offence, all \nrelevant evidence is admissible un less it is barred by a specific exclusionary rule ( R. v. \nGoldfinch , 2019  SCC  38, [2019] 3 S.C.R. 3, at para. 30; R. v. Robertson , [1987] \n1 S.C.R.  918, at p. 941; R. v. Arp , [1998] 3  S.C.R.  339, at para. 38",
    "token_count": 1000,
    "start_token": 14400,
    "end_token": 15400,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 17,
    "source_file": "2024scc38.txt",
    "text": " it is barred by a specific exclusionary rule ( R. v. \nGoldfinch , 2019  SCC  38, [2019] 3 S.C.R. 3, at para. 30; R. v. Robertson , [1987] \n1 S.C.R.  918, at p. 941; R. v. Arp , [1998] 3  S.C.R.  339, at para. 38). Relevant evidence \n2024 SCC 38 (CanLII)\n\n--- Page 38 ---\n \n is evidence that has “some tendency as a matter of logic and human experience ” to \nmake the fact in issue for which it is advanced more likely than it would be in the \nabsence of that evidence (R. v. White , 2011 SCC 13, [2011] 1 S.C.R. 433, at para.  36, \nciting D. M. Paciocco and L. St uesser, The Law of Evidence  (5th ed. 2008), at p.  31; \nsee also R. v. Schneider , 2022 SCC 34, at para. 39; R. v. Watson , 50 C.R. (4th) 245 \n(Ont. C.A.), at para.  33). \n Past discreditable conduct evidence is evidence of the accused’s \nmisconduct beyond what is alleged in the indictment ( R. v. Handy , 2002 SCC 56, \n[2002] 2 S.C.R. 908, at para. 31). It can be subsumed under the general category of \nevidence that reflects badly on the accused’s character (D. M. Paciocco, P. Paciocco \nand L. Stuesser, The Law of Eviden ce (8th ed. 2020), at p. 66; see also M. Vauclair, T. \nDesjardins and P. Lachance, Traité général de preuve et de procédure pénales 2024  \n(31st ed. 2024), at paras. 40.50 -40.52).  \n Bad character evidence is generally inadmissible ( R. v. B. (C.R.) , [1990] 1 \nS.C.R. 717, at p.  732), because it risks triggering general propensity inferences, which \nare impermissible (p.  744, per Sopinka J., dissenting; Vauclair, Desjardins and \nLachance, at para. 40.51). This exclusionary rule also seeks to guard against a related \nhuman tendency to “punish the accused for past misconduct by finding that accused \nguilty of the offence charged”, and to avoid deflecting the attention of the trier of fact \n“from the main purpose of their deliberations which is the transaction charged” ( R. v. \nD. (L.E.) , [1989] 2 S.C.R. 111, at p.  128).  \n2024 SCC 38 (CanLII)\n\n--- Page 39 ---\n \n \n Not all discreditable conduct evidence is subject to the exclusionary rule. \nBad character evidence, and especially discreditable conduct evidence, must go beyond \nwhat is alleged in the indictment to be presump tively inadmissible ( Handy , at para. 31;  \nsee also Makin v. Attorney -General for New South Wales , [1894] A.C. 57 (P.C.), at \np. 65; M. Gourlay et al., Modern Criminal Evidence  (2022), at p.  282). If it is covered \nby the indictment, the Crown can prove it “no  matter how badly this may reflect on the \ncharacter of the accused” (Paciocco, Paciocco and Stuesser, at p.  66).  \n Based on these principles, I will review the trial judge’s characterization of \nsome of the accused’s conduct as past discreditable conduct.  \n(b) The Trial Judge’s Characterization of the Accused’s Conduct as Past \nDiscreditable Conduct  \n The trial judge did not explicitly mention what conduct he characterized as \npast discreditable conduct, but a fair reading of his reasons shows it was the regular \nviolence and threats of violence by the accused towards the complainant and, more \ngenerally, their violent relationship. Both paras. 42 and 57 of his reasons are revealing:  \nMuch of the testimony  of the above four witnesses related to events that, \nfor the mos t part, did not directly address the charges before this Court. \n",
    "token_count": 1000,
    "start_token": 15300,
    "end_token": 16300,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 18,
    "source_file": "2024scc38.txt",
    "text": " not explicitly mention what conduct he characterized as \npast discreditable conduct, but a fair reading of his reasons shows it was the regular \nviolence and threats of violence by the accused towards the complainant and, more \ngenerally, their violent relationship. Both paras. 42 and 57 of his reasons are revealing:  \nMuch of the testimony  of the above four witnesses related to events that, \nfor the mos t part, did not directly address the charges before this Court. \nThat testimony related to [the accused]’s bad character  which, usually, is \npresumptively inadmissible. It can trigger propensity reasoning and \namount to oath -helping. Such evidence must be con sidered through the \nprobative/prejudicial effect lens. .  . .  \n \n. . . \n \n2024 SCC 38 (CanLII)\n\n--- Page 40 ---\n \n I am satisfied from all of the evidence that [the complainant] found \nherself trapped in a violent, unhappy, and loveless relationship with [the \naccused] . However, the charges before this  Court do not directly address \nthe threats, intimidation, and injury that I accept as proven facts . The \nquestion before me is whether the Crown has proven these charges beyond \na reasonable doubt. The past discreditable evidence  certainly creates a \nbackdrop  in which such exploitation could thrive. [Emphasis added.]  \n When the trial judge writes “[t]he past discreditable evidence”, he refers to \nthe evidence establishing that the complainant had “found herself trapped in a violent, \nunhappy, and loveless relation ship with [the accused]” and that she was subjected to \n“threats, intimidation, and injury”.  \n The trial judge also concluded that such evidence does not “directly \naddress” (paras. 42 and 57) or “directly support” (para. 31) the charges, and that \nevidence ab out the relationship between the accused and the complainant “offered little \nconcerning the charges” (para. 41). I disagree.  \n In the following subsection, I will explain why the evidence of the other \nwitnesses about the accused’s violence towards the compl ainant, while certainly \ndiscreditable to the accused, was covered by the indictment and could not, in this case, \nbe characterized as evidence of past discreditable conduct.  \n(c) Regular Violence and Threats of Violence by the Accused Were Covered \nby the Indictm ent \n2024 SCC 38 (CanLII)\n\n--- Page 41 ---\n \n \n The Crown filed a two -count indictment. Since the two counts are linked, \nand the trial judge acquitted the accused on the second count based on the same reasons \nhe acquitted the accused on the first count, my reasons will focus exclusively on the \ntrafficking in persons count:  \n[T]hat he between the 1st day of November, 2006 and the 31st day of \nDecember, 2011, at and near Fort Saskatchewan and Edmonton, Alberta, \nand Halifax, Nova Scotia, did unlawfully recruit, exercise control or \ndirection or influence o ver the movements of [the complainant], for the \npurpose of exploiting them or facilitating their exploitation, contrary to \nSection 279.01(1) of the Criminal Code . \n \n(A.R., vol. I, at p. 5)  \n The time period spans over five years between November 1, 2006, when  \nthe accused and the complainant first moved to Fort Saskatchewan (A.R., vol. III, at \npp. 197-98 and 202), and December 31, 2011, not long before they separated. During \nthat time period, the accused and the complainant moved from Fort Saskatchewan to \nEdmon ton and then back to Halifax, all of which are covered by the indictment (trial \nreasons, at paras. 4, 7 and 10).  \n The trial judge could not ignore that the regular violence and threats of \nviolence as provided in the evidence by the other witnesses took plac e within the \nspecified time period, at the specified locations, and was directed towards the \ncomplainant.  \n2024 SCC 38 (CanLII)\n\n--- Page 42 ---\n \n \n The trial judge did not conclude that the accused’s regular violence and \nthreats of violence against the complainant fell outside the factual paramet ers of the \nindictment. Rather, he held, as a matter of law, that the regular violence and threats of \nviolence by the accused towards the complainant was not an element of the actus reus \nof the trafficking in persons offence, nor the definition of exploitat ion. This is why it \n“fell to” the",
    "token_count": 1000,
    "start_token": 16200,
    "end_token": 17200,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 19,
    "source_file": "2024scc38.txt",
    "text": " The trial judge did not conclude that the accused’s regular violence and \nthreats of violence against the complainant fell outside the factual paramet ers of the \nindictment. Rather, he held, as a matter of law, that the regular violence and threats of \nviolence by the accused towards the complainant was not an element of the actus reus \nof the trafficking in persons offence, nor the definition of exploitat ion. This is why it \n“fell to” the complainant to provide that evidence.  \n This interpretation finds support in para.  45 of the trial judge’s reasons:  \nGiven that the .  . . prior witnesses could not provide direct evidence of the \nelements of these offences, it  fell to [the complainant] to provide that \ntestimony. Consequently, her credibility comes into play.  \n Read in isolation, this sentence reveals an error of law. Evidence can be \ndirect or circumstantial, and both types of evidence can satisfy a judge beyond \nreasonable doubt that a fact in issue is true (D. Watt, Watt’s Manual of Criminal \nEvidence  (2024), at §§ 1:17 -1:18). Read contextually, this sentence reflects the trial \njudge’s concern that the evidence of the other witnesses on the accused’s violence did \nnot “directly address” (paras. 42 and 57), or “directly support” (para. 31) the charges.  \n At trial, al though the accused never argued that the other witnesses’ \nevidence was past discreditable conduct evidence, he argued that very little evidence \nrelated to the actual substance of the allegation, and referred to evidence of the \naccused’s violence as evidenc e of surrounding circumstances evidence that only “takes \nyou so far” (A.R., vol.  III, at p.  405). Later in oral submissions, defence counsel argued \n2024 SCC 38 (CanLII)\n\n--- Page 43 ---\n \n that the complainant was “the only one who can speak to several of the essential \nelements in terms of the co ntrol and the alleged forcing into the sex trade”, and who \ncan tell the trial judge that the accused exploited her (p.  431; see also pp.  406 and  432).  \n The trial judge’s conclusion thus rejects the Crown’s theory of the case, \nwhich sought to establish that the accused had controlled, directed, or influenced the \nmovements of the complainant “through the overwhelming evidence that [the \ncomplainant] was in a relationship that was physically and psychologically abusive and \ncontrolling” (A.R., vol.  III, at pp.  393-94).  \n(d) Regular Violence and Threats of Violence by an Accused Can Be Relevant \nand Material to the Actus Reus  \n Regular violence and threats of violence by an accused against a victim \nand, more generally, their violent relationship, can amount to exercising control, \ndirection, or influence over their movements during a period of time, provided that the \neffect of tha t violence is that the victim’s movements have been effectively controlled, \ndirected, or influenced during that time. Violence is also relevant and material to the \ndefinition of exploitation, as this definition is met when the accused engages in any \nconduc t, including regular violence and threats of violence, that both causes the victim \nto provide (or offer to provide) labour or a service, and could be reasonably expected \nto cause the victim to believe that their safety (or the safety of a person known to t hem) \nwould be threatened if they failed to provide that labour or service.  \n2024 SCC 38 (CanLII)\n\n--- Page 44 ---\n \n \n As I stated earlier, the range of conduct captured under s.  279.01(1) Cr. C. \nis broad. It  captures “[e]very person who recruits, transports, transfers, receives, holds, \nconceals or harbours a person, or exercises control, direction or influence over the \nmovements of a person, for the purpose of exploiting them or facilitating their \nexploitation”. The use of the word “or” indicates that the actus reus  is disjunctive. This \nelement of the offence is made out if the Crown establishes that the accused engaged \nin any conduct set out in the provision ( R. v. A. (A.) , 2015  ONCA  558, 327 C.C.C. (3d) \n377, at para. 80;  Gallone , at para. 33; Urizar , at para. 72).  \n Section 279.01(1) Cr. C.  capture s two clusters of conduct. The first \nincludes specific actions: “.",
    "token_count": 1000,
    "start_token": 17100,
    "end_token": 18100,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 20,
    "source_file": "2024scc38.txt",
    "text": " accused engaged \nin any conduct set out in the provision ( R. v. A. (A.) , 2015  ONCA  558, 327 C.C.C. (3d) \n377, at para. 80;  Gallone , at para. 33; Urizar , at para. 72).  \n Section 279.01(1) Cr. C.  capture s two clusters of conduct. The first \nincludes specific actions: “. . . recruits, transports, transfers, receives, holds, conceals \nor harbours . . . .” The second captures accused who “exercise control, direction or \ninfluence over the movements of a person” . In the present case, the Crown relies on \nthis second cluster of conduct to demonstrate that the accused committed the actus reus . \nIt submits that regular violence and threats of violence by an accused against a victim, \nand their violent relationship, can  amount to exercising control, direction, or influence \nover their movements over a period of time. I agree.  \n As detailed earlier, s. 279.01(1) aims to broaden the prior existing \nprohibition and respond to all forms of trafficking in persons, with a focus o n protecting \nwomen and children who are “disproportionately subjected to sexual violence” \n(Friesen , at paras. 68 and 70; see also Barton , at para.  198). This provision prohibits a \nperson from preventing another person from moving freely through the exercis e of \n2024 SCC 38 (CanLII)\n\n--- Page 45 ---\n \n control, influence or direction. The Crown can establish the actus reus  through \nevidence of regular violence and threats of violence by an accused towards a victim \nand, more generally, a violent relationship between the two, that prevents the victim’s  \nmovements because they are controlled, directed, or influenced.  \n Whether regular violence and threats of violence by an accused against a \nvictim and, more generally, their violent relationship, can be relevant and material to \nboth the actus reus of the tra fficking in persons offence and the definition of \nexploitation is a question of law that must be answered in the affirmative .  \n(e) The Mens Rea Can Be Inferred From a Finding of Exploitation and \nRegular Violence and Threats of Violence  by an Accused  Against a Victim \nCan Be Relevant and Material to the Definition of Exploitation  \n The trial judge’s characterization of regular violence and threats of \nviolence by the accused against the complainant as past discreditable conduct also \nsuggests that he concluded that t his type of conduct could not meet the definition of \nexploitation set out in s.  279.04 Cr. C.  At trial, the Crown argued that accused’s mens \nrea could be inferred from a finding of exploitation (A.R., vol.  III, at pp.  394-95). The \nCrown further submitted t hat the complainant was exploited by the accused in part \nthrough evidence showing “the presence of physical violence and threats of violence \n. . . testified to by multiple witnesses” (p. 399).  \n Before this Court, the Crown also argues that a finding that th e accused \nexploited the complainant pursuant to s.  279.04 Cr. C. , while not required under \n2024 SCC 38 (CanLII)\n\n--- Page 46 ---\n \n s. 279.01(1) Cr. C. , can lead to a finding that the accused “must have acted with the \npurpose of exploiting the complainant” (A.F., at para. 108 (emphasis in origina l), citing \nA. (A.) , at para . 87). Building on this, the Crown submits that regular violence and \nthreats of violence by the accused against the complainant is relevant to establishing \nthat the accused exploited the complainant . I agree.  \n The accused’s purpose to exploit or facilitate the exploitation of a victim, \ndepending on the circumstances, can be inferred from a finding that the accused \nexploited the victim in the first place.  Further, evidence of regular violence and threats \nof violence by the acc used against the victim, when paired with other evidence \nestablishing that the victim engaged in labour or offered labor during the time they were \nsubjected to the accused’s regular violence, can be relevant to establishing exploitation. \nI explain each con clusion in the paragraphs that follow.  \n To secure a conviction under s.  279.01(1) Cr. C. , the Crown must establish \nthat the accused engaged in the actus reus  “for the purpose of exploiting [the person] \nor facilitating their exploitation”. Those words do not  require that actual exploitation",
    "token_count": 1000,
    "start_token": 18000,
    "end_token": 19000,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 21,
    "source_file": "2024scc38.txt",
    "text": " or offered labor during the time they were \nsubjected to the accused’s regular violence, can be relevant to establishing exploitation. \nI explain each con clusion in the paragraphs that follow.  \n To secure a conviction under s.  279.01(1) Cr. C. , the Crown must establish \nthat the accused engaged in the actus reus  “for the purpose of exploiting [the person] \nor facilitating their exploitation”. Those words do not  require that actual exploitation \noccurs. Exploitation is not an essential element of the offence; only the intention to \nexploit or facilitate exploitation is an element of the offence (see A. (A .), at para.  85, \nciting Urizar , at para.  69; see also Chahini an v. R. , 2022 QCCA 499, at para.  82). \n However, the Court of Appeal for Ontario has suggested that the mens rea  \ncan sometimes be inferred from a finding that exploitation occurred ( A. (A .), at para. \n87, cited with approval in Gallone , at para.  54, and R. v. Sinclair , 2020 ONCA 61, 384 \n2024 SCC 38 (CanLII)\n\n--- Page 47 ---\n \n C.C.C. (3d) 484, at para.  12). I agree. A finding of actual exploitation could, depending \non the evidence, be relevant and material to the key question of whether the accused \nacted for the purpose of exploiting the complainant . \n This inference is grounded in the assumption that “people are usually able \nto foresee the consequences of their acts” ( R. v. Buzzanga  (1979), 49 C.C.C. (2d) 369 \n(Ont. C.A.), at p. 387, cited with approval in R. v. Chartrand , [1994] 2 S.C.R. 864, at \np. 89 0; Barton , at para.  167; see also K. Roach, Criminal Law (8th ed. 2022), at pp. \n214-15). If the accused is found to have knowingly exploited the victim, such that the \naccused knows that exploitation would result from their conduct, then it could, \ndepending  on the circumstances, be reasonable to infer that the accused acted with the \nintent to exploit the victim. Nonetheless, when looking at evidence as a whole, courts \nshould pay careful attention to evidence that would contradict, even refute, the \ninference.   \n Regular violence and threats of violence by an accused against a victim is \nalso captured by the definition of exploitation set out in s.  279.04 Cr. C. :  \n279.04  For the purposes of sections 279.01 to 279.03, a person exploits \nanother person if they  \n \n(a) cause them to provide, or offer to provide, labour or a service by \nengaging in conduct that, in all the circumstances, could reasonably be \nexpected to cause the other person to believe that their safety or the \nsafety of a person known to them would be threa tened if they failed to \nprovide, or offer to provide, the labour or service;  \n2024 SCC 38 (CanLII)\n\n--- Page 48 ---\n \n \n We can extract from this definition  two requirements that must be satisfied \nfor exploitation to occur. Exploitation involves conduct that both (i) causes the victim \nto provide (or  offer to provide) labour or a service and (ii) a reasonable expectation that \nthe victim could believe that their safety (or the safety of a person known to them) \nwould be threatened if they failed to provide that labour or service.  \n The definition does not  specify the term “conduct”, which can take many \nforms, including regular violence and threats of violence towards a victim and, more \ngenerally, a violent relationship between the two. This aligns with the object of \ns. 279.01(1) Cr. C.  and An Act to amend the Criminal Code (trafficking in persons) , \nS.C. 2012, c.  15, s. 2, which added a list of factors that the courts may consider in \ndetermining whether an accused exploits another person:  \n(a) used or threatened to use force or another form of coercion ; \n \n(b) used deception; or  \n \n(c) abused a position of trust, power or authority.  \n In determining whether the accused’s conduct could reasonably be \nexpected to cause the belief, the judge must have regard to all circumstances, which \ninclude the victim’s personal characteristics and vulnerabilities, such as their lack of \neducation, prior victim",
    "token_count": 1000,
    "start_token": 18900,
    "end_token": 19900,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 22,
    "source_file": "2024scc38.txt",
    "text": " the courts may consider in \ndetermining whether an accused exploits another person:  \n(a) used or threatened to use force or another form of coercion ; \n \n(b) used deception; or  \n \n(c) abused a position of trust, power or authority.  \n In determining whether the accused’s conduct could reasonably be \nexpected to cause the belief, the judge must have regard to all circumstances, which \ninclude the victim’s personal characteristics and vulnerabilities, such as their lack of \neducation, prior victimization, socio -economic disadvantage, and social and family \nisolation, among others. In Sinclair , the Court of Appeal for Ontario listed \ncircumstances that might be relevant in the analysis (at para. 15):  \n2024 SCC 38 (CanLII)\n\n--- Page 49 ---\n \n  the presence or absence of violence or threat s \n coercion, including physical, emotional or psychological  \n deception  \n abuse of trust, power, or authority  \n vulnerability due to age or personal circumstances, such as social or \neconomic disadvantage and victimization from other sources  \n isolation of the compl ainant  \n the nature of the relationship between the accused and the complainant  \n directive behaviour  \n influence exercised over the nature and location services provided  \n control over advertising of services  \n limitations on the complainant’s movement  \n control of f inances  \n financial benefit to the accused, and  \n use of social media to assert control or monitor communications with \nothers.  \n In sum, exploitation occurs when the accused engages in any conduct, \nincluding regular violence and threats of violence, that both ca uses the victim to \nprovide (or offer to provide) labour or a service and could be reasonably expected to \ncause the victim to believe that their safety (or the safety of a person known to them) \nwould be threatened if they failed to provide that labour or se rvice. The latter must be \nassessed using an objective test, having regard to all the circumstances, including the \nvictim’s vulnerabilities.  \n If the victim is known to have provided labour (or to have offered to \nprovide labour) during a specified time perio d, the fact that they were regularly \nsubjected to violence and threats of violence during that time can be the cause of the \nvictim’s decision to provide said labour. It could also be inferred from the regular \nviolence that the victim could be reasonably ex pected, in all the circumstances, to \nbelieve that their safety would be threatened if they failed to provide said labour.  \n2024 SCC 38 (CanLII)\n\n--- Page 50 ---\n \n \n Nevertheless, even where the trial judge accepts that actual exploitation \noccurred, the Crown must still prove beyond a reasonable dou bt that the accused \nsubjectively intended to exploit the complainant.  \n(3) Conclusion and Precise Articulation of the Trial Judge’s Error of Law  \n I conclude that the trial judge committed an error of law when he held that \nthe evidence of regular violence and th reats of violence by the accused against the \ncomplainant provided by the other witnesses was evidence of past discreditable \nconduct. To the contrary, this evidence could have been relevant to the essential \nelements of the offence and could have formed the basis of a finding that the accused \ncontrolled, directed, or influenced the movements of the complainant during the time \nperiod specified in the indictment. It could also have been found to be a contributing \ncause of the complainant’s provision of sexual s ervices.  \n(4) The Trial Judge’s Mischaracterization of the Evidence Tainted His Legal \nAnalysis  \n The accused and the majority of the Nova Scotia Court of Appeal suggest \nthat the trial judge’s mischaracterization of the evidence did not taint the trial judge’s \nlegal analysis (R.F., at paras. 55 and  73; C.A. reasons, at para. 35). They note that \ndespite his error of law, the trial judge admitted the evidence of the other witnesses, \nincluding the accused’s regular violence towards the complainant and, more generally , \ntheir violent relationship. The trial judge concluded that:  \n2024 SCC 38 (CanLII)\n\n--- Page 51 ---\n \n In this case, as in R. v. B. (F.F.) , [[1993] 1 S.C.R. 697], this type of \nevidence is admissible in that it establishes a pattern of dominant behaviour  \nby the accused which allows the criminal co nduct  to exist in that \nenvironment; in this case the exploitation of [the complainant] . [Emphasis \nadded; para. 43.]  \n Based on the above -noted paragraph, the accused submits that the trial \njudge’s error of law “did not affect",
    "token_count": 1000,
    "start_token": 19800,
    "end_token": 20800,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 23,
    "source_file": "2024scc38.txt",
    "text": " , [[1993] 1 S.C.R. 697], this type of \nevidence is admissible in that it establishes a pattern of dominant behaviour  \nby the accused which allows the criminal co nduct  to exist in that \nenvironment; in this case the exploitation of [the complainant] . [Emphasis \nadded; para. 43.]  \n Based on the above -noted paragraph, the accused submits that the trial \njudge’s error of law “did not affect his legal analysis respecting the actus reus of the \noffence” because the trial judge accepted that the evidence of violence “was admissible \n. . . an d was relevant to the conduct element of the actus reus ” (R.F., at paras. 55 \n(emphasis deleted) and 61; see also para.  56). I disagree.  \n From the moment the trial judge considered the regular violence and threats \nof violence by the accused towards the compl ainant as past discreditable conduct, his \nanalysis of the evidence was tainted regarding both the actus reus and the mens rea . \nThis characterization, in and of itself, indicates that the trial judge dismissed the \nCrown’s theory of the case as implicating i mpermissible propensity reasoning when it \ndid not. The fact that he nevertheless admitted the evidence cannot cure this \nmisapprehension.  \n The trial judge found the evidence admissible “in that it establishes a \npattern of dominant behaviour by the accused w hich allow[ed] the criminal conduct to \nexist in that environment; in this case the exploitation of [the complainant]” (para. 43). \nThis past discreditable conduct evidence “create[d] a backdrop in which such \nexploitation could thrive” (para. 57). The trial judge thus considered regular violence \nby the accused towards the complainant (i.e., the “pattern of dominant behaviour”) as \n2024 SCC 38 (CanLII)\n\n--- Page 52 ---\n \n distinct from the criminal conduct and exploitation. Such violence merely “allowed” \nthat conduct to “exist” and “thrive”. This inte rpretation finds further support in the trial \njudge’s use of the words “environment” (para. 43), “backdrop” (para. 57), and \n“context” (paras. 44 and  57) to describe the violence. Even though the trial judge \nadmitted that evidence, his mischaracterization m eant he could not, and did not, assess \nit as a possible contributing cause in the complainant’s provision of sexual services.  \n Having found that the trial judge misapprehended the evidence, I will \nexplain how that error might have had a material bearing on the verdicts of acquittal.  \nC. Might the Error of Law Have Had a Material Bearing on the Acquittals?  \n Acquittals are not set aside lightly. At the material bearing stage of the \nanalysis, courts are asked to “make a careful judgment as to [the error of law’s] ef fect” \non the trial judge’s reasoning supporting his reasonable doubt ( Graveline , at para. 29, \nper LeBel J., dissenting). The burden is a very heavy one and lies on the Crown ( R. v. \nEvans , [1993] 2 S.C.R. 629, at p.  645), who must demonstrate that “the verd ict would \nnot necessarily have been the same had the errors [of law] not occurred” ( Sutton , at \npara. 2, citing Vézeau , at p. 292). This standard demands more than “an abstract or \npurely hypothetical possibility that the accused would have been convicted bu t for the \nerror of law”, but not that “the verdict would necessarily have been different” \n(Graveline , at para. 14; see also George , at para.  27; Hodgson , at para. 36).  \n2024 SCC 38 (CanLII)\n\n--- Page 53 ---\n \n \n I conclude that the Crown has established that the trial judge’s reasonable \ndoubts could  have been resolved had the error of law not occurred.  As I have explained, \nthe trial judge assessed the evidence of regular violence and threats of violence by the \naccused towards the complainant and, more generally, their violent relationship, based \non a  wrong legal principle. Having done so, the trial judge could not assess that \nevidence as conduct by the accused relevant to the essential elements of the offence  \nand the definition of exploitation. The fact that he nevertheless admitted the evidence \ncould  not and did not cure his error.  \n I consequently agree with the dissenting judge of the Court of Appeal that \n",
    "token_count": 1000,
    "start_token": 20700,
    "end_token": 21700,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 24,
    "source_file": "2024scc38.txt",
    "text": " and threats of violence by the \naccused towards the complainant and, more generally, their violent relationship, based \non a  wrong legal principle. Having done so, the trial judge could not assess that \nevidence as conduct by the accused relevant to the essential elements of the offence  \nand the definition of exploitation. The fact that he nevertheless admitted the evidence \ncould  not and did not cure his error.  \n I consequently agree with the dissenting judge of the Court of Appeal that \n“the judge’s incorrect assessment of this critical evidence seriously undermined his \ncredibility assessment of the complainant, which he used as th e rationale for acquittal” \n(para. 99). In other words, his assessment of the other witnesses’ evidence undermined \nhis assessment of the complainant’s evidence as it failed to appreciate the \ninterconnectedness between both . \n Contrary to my colleagues’ assert ions, I am not suggesting that the only \nconclusion that would have been available to the trial judge is that the accused intended \nto exploit the complainant (para. 159). Rather, had the trial judge not misapprehended \nthe evidence, he could have reached a d ifferent conclusion with respect to the essential \nelements of the offence. I am satisfied with a reasonable degree of certainty that this \npossibility is more than abstract or purely hypothetical. While I am not persuaded that \n2024 SCC 38 (CanLII)\n\n--- Page 54 ---\n \n the verdict would necessarily have been different, this is not the applicable threshold \n(Graveline , at para. 14; see also  George , at para.  27; Hodgson , at para. 36).  \n For these reasons, I am of the view that the trial judge’s error of law \nundermines the foundation of the acquittals. Thi s error can reasonably be thought, in \nthe concrete reality of the case at hand, to have had a material bearing on the acquittals \n(Graveline , at para. 14).  \nVI. Conclusion  \n The trial judge made an error of law in his assessment of the evidence, \nleading to a misap prehension of the evidence. I am satisfied that the possibility of \nreaching a different verdict is more than abstract or purely hypothetical. For the \nforegoing reasons, I would allow the appeal, set aside the verdicts of acquittal, and \norder a new trial.  \n The following are the reasons delivered by  \n CÔTÉ  AND ROWE JJ. —  \n To succeed on appeal, the Crown must show that the trial judge made one \nor more legal errors that “ might reasonably be thought, in the concrete reality of the \ncase at hand, to have had a mate rial bearing on the acquittal” ( R. v. Graveline , 2006 \nSCC 16, [2006] 1 S.C.R. 609, at para.  14). The Crown’s “burden in this respect is a \n2024 SCC 38 (CanLII)\n\n--- Page 55 ---\n \n very heavy one” that reflects “[t]he restricted nature of the Crown’s ability to appeal” \nand “the double jeopardy asso ciated with a new trial” ( R. v. Hodgson , 2024 SCC 25, at \nparas.  22, 30 and 36).  \n We agree with our colleague that the Crown has shown that the trial judge \nmade a legal error in characterizing evidence offered by five witnesses at trial as \nevidence of “past discreditable conduct”. However, despite the trial judge’s \nmischaracterization of the evidence, there is no basis for this Court to disturb his \ncredibility findings in this Crown appeal.  And because we conclude that the Crown has \nnot shown that the error i n question had a material bearing on the acquittal, as required \nby Graveline , we would dismiss the appeal.  \nI. Defining the Error of Law in the Present Appeal  \n We begin by precisely identifying the error of law ( Hodgson , at para.  40). \nOur colleague frames the e rror in the present case as follows, at para.  109 of her \nreasons:  \n I conclude that the trial judge committed an error of law when he held \nthat the evidence of regular violence and threats of violence by the \n[respondent] against the complainant provided by the other witnesses was \nevidence of past discreditable conduct. To the contrary, this evidence could \nhave been relevant to the essential elements of the offence and could have \nformed the basis of a finding that the [respondent] controlled, directed, or \ninfluenced the movements of the complainant during the time period \nspecified in the indictment. It could also",
    "token_count": 1000,
    "start_token": 21600,
    "end_token": 22600,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 25,
    "source_file": "2024scc38.txt",
    "text": " \nthat the evidence of regular violence and threats of violence by the \n[respondent] against the complainant provided by the other witnesses was \nevidence of past discreditable conduct. To the contrary, this evidence could \nhave been relevant to the essential elements of the offence and could have \nformed the basis of a finding that the [respondent] controlled, directed, or \ninfluenced the movements of the complainant during the time period \nspecified in the indictment. It could also have been found to be a \ncontributing cause of the complainant’s provision of sexual services.  \n2024 SCC 38 (CanLII)\n\n--- Page 56 ---\n \n \n Shortly after articulating this error of law, our colle ague adds that “ [f]rom \nthe moment the trial judge considered the [respondent’s] regular violence and threats \nof violence .  . . towards the complainant as past discreditable conduct, his analysis of \nthe evidence was tainted regarding both the actus reus and the mens rea ” (para.  112).  \n While we agree that the trial judge erroneously characterized the evidence \nprovided by the other witnesses as propensity evidence, we respectfully disagree \nregarding the effect of this error; it does not follow that his entire a ssessment of the \nevidence was “tainted” by such a legal error. Indeed, and importantly, our Court has \nrepeatedly emphasized that credibility findings by trial judges are owed deference on \nappeal (see, e.g., R. v. Kruk , 2024 SCC 7, at para.  82; R. v. Gagnon , 2006 SCC 17, \n[2006] 1 S.C.R. 621, at para.  10). “Assessing credibility is clearly in the bailiwick of \nthe trial judge and thus heightened deference must be accorded to the trial judge on \nmatters of credibility” ( F.H. v. McDougall , 2008 SCC 53, [2008] 3 S .C.R. 41, at \npara.  72). \n Credibility findings typically do not engage errors of law, as, at their core, \nthey relate to the extent to which a judge has relied on a factor, and how closely that \nfactor is tied to the evidence ( Kruk , at para.  82). An  appellate court cannot “translat[e] \nits strong opposition to the trial judge’s factual inferences .  . . into supposed legal \nerrors” ( R. v. George , 2017 SCC 38, [2017] 1 S.C.R. 1021, at para.  17). To do otherwise \nwould risk “expanding the Crown’s right of appeal beyond its proper scope” and \n“would have a profound impact on the interests of accused persons, especially due to \n2024 SCC 38 (CanLII)\n\n--- Page 57 ---\n \n the considerable anxiety created by the prospect of a new trial after a person has been \nacquitted” ( Hodgson , at para.  31). \n Indeed, a ch allenge to the trial judge’s credibility findings is not a proper \nground of appeal for the Crown under s.  676(1)(a) of the Criminal Code , R.S.C. 1985, \nc. C-46, which limits the Crown’s right of appeal to a “question of law alone” and not \nto “question[s] ab out how to weigh evidence and assess whether it meets the standard \nof proof” ( Hodgson , at paras.  32 and 34, citing R. v. Chung , 2020 SCC 8, [2020] 1 \nS.C.R.  405, at para.  10; see also R. v. J.M.H. , 2011 SCC 45, [2011] 3 S.C.R. 197, at \npara.  24). No appeal o n the basis of an “unreasonable acquittal” is open to the Crown \n(see J.M.H. , at paras.  32-33; Chung , at para.  31, per Karakatsanis  J., dissenting). We \nare guided by this Court’s recent admonition that the Crown’s right of appeal of an \nacquittal is an “extr aordinary remedy” that has been variously described as “‘drastic ’, \n‘exceptional’, ‘special’, ‘unusual’ and ‘limited’ in an ‘extrem[e]’ or ‘narrow’ manner” \n(Hodgson , at para.  24). \n We now consider whether this evidence, if properly",
    "token_count": 1000,
    "start_token": 22500,
    "end_token": 23500,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 26,
    "source_file": "2024scc38.txt",
    "text": "). We \nare guided by this Court’s recent admonition that the Crown’s right of appeal of an \nacquittal is an “extr aordinary remedy” that has been variously described as “‘drastic ’, \n‘exceptional’, ‘special’, ‘unusual’ and ‘limited’ in an ‘extrem[e]’ or ‘narrow’ manner” \n(Hodgson , at para.  24). \n We now consider whether this evidence, if properly assessed, could have \nhad a material bearing on the acquittal. In our view, if the appropriate deference is \nafforded to the trial judge’s findings, the Graveline standard is not made out.  \nII. The Legal Error Wo uld Not Have a Material Bearing on the Acquittal  \n The trial judge concluded that the complainant “found herself trapped in a \nviolent, unhappy, and loveless relationship” with the respondent (2021 NSSC 290, at \n2024 SCC 38 (CanLII)\n\n--- Page 58 ---\n \n para.  57). We agree that this finding was releva nt to making out the actus reus of the \noffence under s.  279.01(1) of the Criminal Code . \n However, to obtain a conviction under s.  279.01(1), the Crown must also \nshow that the respondent “exercise[d] control” over the complainant “ for the purpose \nof exploiti ng” the complainant or facilitating her exploitation. It is not sufficient for the \nCrown to only establish the actus reus ; whether the accused “exercise[d] control” over \nthe movements of the complainant is only one of the elements of the offence. \nFurthermo re, the language chosen by Parliament signals that it has chosen to ascribe \nthe “highest level of subjective mens rea ” to this offence (K.  Roach, Criminal Law  \n(8th ed. 2022), at p.  213).  \n The mens rea of the offence could have been established in one of thr ee \nways in the present case:  \n(a) The trial judge could have been persuaded by the testimony of the \ncomplainant.  \n(b) The trial judge could have inferred the respondent’s intent from the \ncircumstances of control and exploitation, if he found that the evidence \nestabl ished these as facts.  \n(c) The trial judge could have relied on some combination of (a) and (b).  \n2024 SCC 38 (CanLII)\n\n--- Page 59 ---\n \n \n The trial judge did not do any of the above, and a proper assessment of the \nevidence offered by the other witnesses would not have affected this outcome.  \nA. The Trial Judge Could Not Have Been Persuaded by the Testimony of the \nComplainant  \n The only evidence relevant to the mens rea , whether the respondent acted \nfor the “purpose of” exploiting the complainant, came from the complainant herself. \nShe testified that the resp ondent abused and exercised violent control over her for the \npurpose of forcing her into prostitution.  \n The trial judge was not persuaded beyond a reasonable doubt by the \ncomplainant’s testimony, considered in the context of the other evidence. Though he \naccepted “the threats, intimidation, and injury” by the respondent as facts, he rejected \nmuch of the complainant’s eviden ce because he found that she was “prone to \nexaggeration and hyperbole” and “fill[ed] in the blanks to comply with her narrative” \n(paras.  57-58). \n The trial judge identified several inconsistencies in the complainant’s \ntestimony that led him to this conclusi on. He noted that she admitted on \ncross -examination to having access to the money garnered through sex work, after \ninitially stating that the respondent “had complete control of the finances” (para.  62). \nHe also highlighted the fact that the complainant ag reed, on cross -examination, that she \ndrafted and posted Craigslist ads advertising sexual services (including one featuring a \n2024 SCC 38 (CanLII)\n\n--- Page 60 ---\n \n number that was for her personal use) even though she had “consistently testified that \n[the respondent] placed all the ads” (paras . 64-68). The trial judge noted other \ninconsistencies in the complainant’s evidence that called into question, inter alia , \nwhether the complainant conducted negotiations with prospective clients, her “street \nwalking”, when her sex work ended, and the amoun t of money she spent on drugs \n(paras.  58-68). All of the trial judge’s findings in this regard were relevant to the",
    "token_count": 1000,
    "start_token": 23400,
    "end_token": 24400,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 27,
    "source_file": "2024scc38.txt",
    "text": "the respondent] placed all the ads” (paras . 64-68). The trial judge noted other \ninconsistencies in the complainant’s evidence that called into question, inter alia , \nwhether the complainant conducted negotiations with prospective clients, her “street \nwalking”, when her sex work ended, and the amoun t of money she spent on drugs \n(paras.  58-68). All of the trial judge’s findings in this regard were relevant to the \ncomplainant’s credibility generally and to the alleged purpose for the respondent’s acts.  \n The fact that the trial judge found the complainan t not to be credible \nprecludes us from accepting her narrative as facts. Indeed, the trial judge explicitly \nstated that the complainant’s narrative “does not represent findings of fact” (para.  12). \n Our colleague suggests that the trial judge’s assessment o f the \ncomplainant’s credibility might have been different if the evidence of the other \nwitnesses was considered as part of the actus reus rather than past discreditable \nconduct. She writes that “ [the trial judge’s] assessment of the other witnesses’ eviden ce \nundermined his assessment of the complainant’s evidence as it failed to appreciate the \ninterconnectedness between both ” (para.  117).  \n We disagree. Though the trial judge mischaracterized the evidence of the \nother witnesses as past discreditable conduct, he ultimately admitted all of it (para.  43). \nThe reasons demonstrate that the trial judge tested the complainant’s credibility and \nevidence against the evidence of the other witnesses. As our colleague acknowledges \nin her reasons, the trial judge devoted f ive paragraphs to the framework through which \n2024 SCC 38 (CanLII)\n\n--- Page 61 ---\n \n he would assess the complainant’s credibility and reliability (para.  48). It is noteworthy \nthat the trial judge wrote explicitly “ [w]here the Crown’s case is wholly dependent on \nthe testimony of the complainant  it is essential the credibility and reliability of the \ncomplainant’s evidence be tested in the context of all the rest of the evidence ” (para.  53 \n(emphasis added), citing R. v. Stanton , 2021 NSCA 57, at para.  67). From these \nparagraphs, it is readily appa rent that the trial judge knew to test the complainant’s \nevidence against the evidence of the other witnesses, regardless of how it was \nclassified. Indeed, o ur colleague acknowledges that “[t]he reasons show that the trial \njudge considered the complainant’ s evidence in light of the exhibits and the evidence \nof other witnesses” (para.  48). \n Furthermore, at para.  57, the trial judge writes:  \n I am satisfied from all of the evidence  that [the complainant] found \nherself trapped in a violent, unhappy, and loveless  relationship with [the \nrespondent] . However, the charges before this Court do not directly \naddress the threats, intimidation, and injury that I accept as proven facts . \nThe question before me is whether the Crown has proven these charges \nbeyond a reasonabl e doubt. The past discreditable evidence certainly \ncreates a backdrop in which such exploitation could thrive . However, I \ncannot just assume from that context evidence that the human trafficking \nallegations are proven as against [the respondent]. It requir es the \nacceptance of [the complainant]’s evidence as credible and reliable to tie \n[the respondent] to the prostitution enterprise. [Emphasis added.]  \n The trial judge concluded that the relationship between the respondent and \nthe complainant was a violent on e based on “all of the evidence” before  him, not just \nthe evidence from the complainant. This demonstrates that the trial judge did, in fact, \nturn his mind to how the five witnesses’ evidence of “threats, intimidation, and injury” \n2024 SCC 38 (CanLII)\n\n--- Page 62 ---\n \n could corroborate the com plainant’s evidence. As such, we strongly disagree with our \ncolleague that the trial judge’s mischaracterization of the evidence offered by the other \nwitnesses led him to ignore the potential impact they had on the complainant’s \ncredibility or to entirely exclude them from this assessment. Our colleague says that \n“the consideration of evidence must not be confused with the assessment of evidence”, \nsuggesting that the other witnesses’ evidence may have been considered , but was not \nassessed  properly (para.  50). Yet, the trial judge’s reasons do not support this assertion; \njust because the evidence was considered past discreditable conduct did not mean it \n",
    "token_count": 1000,
    "start_token": 24300,
    "end_token": 25300,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 28,
    "source_file": "2024scc38.txt",
    "text": " potential impact they had on the complainant’s \ncredibility or to entirely exclude them from this assessment. Our colleague says that \n“the consideration of evidence must not be confused with the assessment of evidence”, \nsuggesting that the other witnesses’ evidence may have been considered , but was not \nassessed  properly (para.  50). Yet, the trial judge’s reasons do not support this assertion; \njust because the evidence was considered past discreditable conduct did not mean it \nwas entirely siloed from the trial judge’s credibility analysis.  \nB. The Trial Judge Could Not Have Inferred Intent From the Circumstances of \nControl or Exploitation  \n Our colleague also takes the position that due to the trial judge’s error of \nlaw, he failed to consider the possibility that the violence could be “a contributing cause \nin the complainant’s provision  of sexual services” when he assessed the evidence \n(paras.  109 and 113). Respectfully, our colleague’s position is detached from the reality \nof the trial judge’s findings. Moreover, even if a causal link could have been established \nin this case, the trial judge would not have been able to use this finding to infer that the \nrespondent intended to exploit  the complainant.  \n(1) The Five Witnesses Did Not Provide an Evidentiary Basis for Finding \nActual Exploitation  \n2024 SCC 38 (CanLII)\n\n--- Page 63 ---\n \n \n To begin, our colleague suggests that the evidence offered by the other \nwitnesses of the respondent’s regular violence and threats of violence against the \ncomplainant could have potentially been used to find that it was “a contributing cause \nin the complainant’s provision of sexual services” ( ibid.). \n In ou r view, even if the trial judge considered the evidence of violence as \npart of the actus reus  analysis rather than past discreditable conduct, it is unclear how \nthis would lead the trial judge to conclude that the respondent exploited the \ncomplainant.  \n “Exp loitation”, per s.  279.04 of the Criminal Code , requires the Crown to \nprove conduct by the accused that: (1) causes the victim to provide or offer to provide \nlabour or a service; and (2) could reasonably be expected to cause the victim to believe \nthat thei r safety (or the safety of person known to them) would be threatened if they \nfailed to provide such a service (majority reasons, at para.  103).  \n We agree with the Court of Appeal that the trial judge’s concern “was never \nthe violent conduct of [the responde nt], which he accepted, but rather whether [the \ncomplainant] was exploited ” (2023 NSCA 28, 425 C.C.C. (3d) 475, at para.  31 \n(emphasis added)). Critically, while the trial judge accepted that the complainant \nexperienced “threats, intimidation, and injury” i n her relationship with the respondent, \nhe was not satisfied that the respondent was tied to the sex work enterprise (para.  57). \nThe trial judge found the complainant’s testimony not to be credible as to this necessary \nlink (ibid.). \n2024 SCC 38 (CanLII)\n\n--- Page 64 ---\n \n \n Even if the evidence of  the five witnesses was assessed as part of the \nelements of the offence, the analysis would still be devoid of any additional evidence \nto show that the respondent actually exploited the complainant.  This is because, at its \nhighest, the evidence offered by the witnesses was solely about the respondent’s violent  \nbehaviour towards the complainant. Their testimony does not link this violent \nbehaviour to the complainant’s provision of sexual services. Instead, a s we explained \nabove, the only evidence given at tr ial that was capable of establishing this link  — the \ncomplainant’s testimony  — raised serious credibility issues in the trial judge’s mind.  \n(2) The Negative Credibility Findings of the Five Witnesses Bar an Inference \nof “Intent To Exploit”  \n Our colleague also s tates that a finding of actual exploitation “could, \ndepending on the evidence, be relevant and material to the key question of whether the \naccused acted for the purpose of exploiting the complainant” (para.  100), and concludes \nthat the mens rea of human tr afficking can sometimes be inferred from a finding of \nexploitation. However, after concluding that the evidence of the five witnesses could \nhave been relevant to establishing actual exploitation, our colleague stops short of \nexplaining how the respondent’s  intention to exploit could have been inferred in this \ncase. \n In our view, the trial judge’s assessment of",
    "token_count": 1000,
    "start_token": 25200,
    "end_token": 26200,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 29,
    "source_file": "2024scc38.txt",
    "text": "used acted for the purpose of exploiting the complainant” (para.  100), and concludes \nthat the mens rea of human tr afficking can sometimes be inferred from a finding of \nexploitation. However, after concluding that the evidence of the five witnesses could \nhave been relevant to establishing actual exploitation, our colleague stops short of \nexplaining how the respondent’s  intention to exploit could have been inferred in this \ncase. \n In our view, the trial judge’s assessment of the five witnesses’ evidence \nbars this inference from being made in the circumstances. He made detailed credibility \n2024 SCC 38 (CanLII)\n\n--- Page 65 ---\n \n findings that shaped his assessmen t of the evidence given by each of the other \nwitnesses, and his decision as to whether the Crown had met its burden.  \n Notably, the trial judge declined to accept testimony from N.R. and K.L. \nthat could have been probative of the respondent’s alleged exploit ation of the \ncomplainant. He noted that N.R. stated that “late -night outings” by the respondent and \ncomplainant became more frequent over time (para.  22). However, this evidence was \nintroduced for the first time on cross -examination, was not mentioned in N .R.’s \nstatement or meeting with the Crown, and was not disclosed to the defence ( ibid.). This \nmay well have contributed to the trial judge’s conclusion that N.R. “displayed a \nsomewhat cavalier attitude towards his duties as a sworn witness” (para.  23). \n The trial judge also did not accept N.R.’s assertion that the respondent “had \nlots of cash” could be probative of the respondent’s actual exploitation of the \ncomplainant (A.R., vol.  II, at p.  34). Nor did he accept N.R.’s testimony that the \nrespondent had the  cash because “he told [N.R.] he was a collector for a drug dealer” \n(ibid.). \n K.L. testified that the respondent and complainant “would go out in the \nevenings” and that she “drove them to hotels and nightclubs” and would “pick them up \nlate at night” (trial reasons, at para.  35). She also testified that she discovered \n“prostitution -related” materials saved on a computer she owned and that the \ncomplainant and respondent occasionally used (para.  37). She stated that the \nrespondent threatened her when she confro nted the complainant ( ibid.). The trial judge \n2024 SCC 38 (CanLII)\n\n--- Page 66 ---\n \n rejected much of this testimony as well. He noted that K.L.’s “direct testimony varied \nfrom her police statements and her cross -examination in several aspects” (para.  38). On \ncross -examination, she admitted “th at only once had she picked up” the complainant \nand respondent after a night out ( ibid.). She also backtracked on her statement that she \nhad discovered prostitution -related material saved on her computer (para.  39). These \ncredibility challenges led the tri al judge to “carefully scrutiniz[e]” K.L.’s testimony \n(para.  41). He found that K.L. had “accepted [the complainant]’s narrative and \nconsequently harboured animus towards” the respondent ( ibid.). \n In addition to identifying serious credibility issues with w itnesses whose \ntestimony was advanced by the Crown, the trial judge also took express note of \ncountervailing testimony offered by other witnesses that contributed to his conclusion \nthat the Crown had not proven the offences beyond a reasonable doubt.  \n The c omplainant’s daughter, “a very credible witness” in the trial judge’s \nestimation, offered testimony that night -time outings by the complainant and \nrespondent related to “work in the bars” (para.  31). She also testified about seeing the \ncomplainant “getting  into a grey vehicle that she did not recognize” shortly before the \ncomplainant and respondent separated (para.  69). When she confronted the \ncomplainant, she “was told to tell no one” ( ibid.). The complainant denied that this \nhappened ( ibid.). Another friend of the complainant, J.K., testified that the complainant \nand respondent would go out “a couple of times a week” but that it was for grocery \nshopping (para.  33). \n2024 SCC 38 (CanLII)\n\n--- Page 67 ---\n \n \n In summary, to find that there was an intent to exploit based on the five \nwitnesses’ ev",
    "token_count": 1000,
    "start_token": 26100,
    "end_token": 27100,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 30,
    "source_file": "2024scc38.txt",
    "text": " ibid.). The complainant denied that this \nhappened ( ibid.). Another friend of the complainant, J.K., testified that the complainant \nand respondent would go out “a couple of times a week” but that it was for grocery \nshopping (para.  33). \n2024 SCC 38 (CanLII)\n\n--- Page 67 ---\n \n \n In summary, to find that there was an intent to exploit based on the five \nwitnesses’ evi dence would require our Court to engage in a total reweighing of the \nevidence. This would fly in the face of what was said with determination and vigour so \nrecently in Hodgson . Simply because there is a path for the trial judge to infer intent to \nexploit f rom a pattern of violence by an accused in some cases, does not mean that this \nCourt can uproot the trial judge’s credibility findings so as to make out that inference \nin the present case.  \nIII. Conclusion  \n In the “ concrete reality of the case at hand ”, the trial  judge’s error in \ncharacterizing the testimony of the five witnesses did not have “a material bearing on \nthe acquittal” ( Graveline , at para.  14). In our view, what is critical is that the five \nwitnesses’ testimony was found to be admissible by the trial ju dge, despite his \nmischaracterization. And  — crucially  — the testimony that the trial judge accepted as \ncredible did not address whether the respondent exercised control over the complainant \nfor the purpose of  exploiting her.  \n The trial judge’s credibility f indings were the basis on which his reasonable \ndoubt rested, and on which the respondent was acquitted. There is no proper basis in \nlaw to set aside the trial judge’s conclusion in this regard. The  Criminal Code  does not \nprovide for a ground of appeal of u nreasonable acquittal; the majority’s reasoning \ncomes perilously close to just that.  \n2024 SCC 38 (CanLII)\n\n--- Page 68 ---\n \n \n There is another way of understanding our colleague’s analysis, which is \nthat evidence of violence will necessarily  give rise to an inference of intent to exploit. \nIndeed,  our colleague acknowledges that “even where the trial judge accepts that actual \nexploitation occurred, the Crown must still prove beyond a reasonable doubt that the \n[respondent] subjectively intended to exploit the complainant” (para.  108). However, \nhavin g made that acknowledgement, it is then not given effect. As we have outlined \nabove, there is no evidentiary basis that could allow for such an inference to be drawn \nin the present case. In suggesting otherwise, our colleague effectively reasons that \nbecau se there is a violent relationship between the respondent and the complainant, \nthere is therefore intent to exploit.  \n One can imagine a scenario where a person that provides sexual services is \nalso in a violent and abusive relationship. Both of these can ex ist separate and \nindependent of the other. While the abusive partner may in fact control, influence, and \ndirect the other partner in their relationship, they may have nothing to do with the fact \nthat this partner provides sexual services. Our colleague’s a nalysis suggests that the \nabusive partner may well be guilty of human trafficking in those circumstances, even \nthough the link to sexual services has not been made out. To be clear, the abusive \npartner in these kinds of cases might be found criminally liab le if they were charged \nwith, for example, assault, uttering threats, or criminal harassment. But those offences \nare not charged here, and they are not equivalent to human trafficking.  \n2024 SCC 38 (CanLII)\n\n--- Page 69 ---\n \n \n In addition, we are concerned that our colleague’s reasoning will, in \npractice, encourage courts to collapse the distinction between the actus reus  and mens \nrea of the offence, such that it will be unnecessary to determine if intention to exploit \nhas been proven beyond a reasonable doubt in cases involving acts of violence. T his is \nnot what Parliament intended as it effectively gives rise to another presumption apart \nfrom the one established in s.  279.01(3) of the Criminal Code . \n The appeal should be dismissed.  \n Appeal  allowed, CÔTÉ and ROWE JJ. dissenting.  \n Solicitor  for the appellant: Nova Scotia  Public Prosecution Service , \nHalifax.  \n Solicitor s for the respondent: Nova Scotia Legal Aid — Appeals Office , \nHalifax , N.S. ; Atherton Nicholson, Dartmouth , N.S.  \n2024 SCC 38 (CanLII)\n\n",
    "token_count": 986,
    "start_token": 27000,
    "end_token": 27986,
    "total_tokens_in_source": 27986
  },
  {
    "chunk_id": 31,
    "source_file": "2024scc38.txt",
    "text": " be dismissed.  \n Appeal  allowed, CÔTÉ and ROWE JJ. dissenting.  \n Solicitor  for the appellant: Nova Scotia  Public Prosecution Service , \nHalifax.  \n Solicitor s for the respondent: Nova Scotia Legal Aid — Appeals Office , \nHalifax , N.S. ; Atherton Nicholson, Dartmouth , N.S.  \n2024 SCC 38 (CanLII)\n\n",
    "token_count": 86,
    "start_token": 27900,
    "end_token": 27986,
    "total_tokens_in_source": 27986
  }
]