[
  {
    "chunk_id": 0,
    "source_file": "2024scc40.txt",
    "text": "--- Page 1 ---\n \n  \nSUPREME COURT OF CANADA  \n \nCITATION : Sanis Health Inc. v. \nBritish Columbia, 2024 SCC 40    \nAPPEAL HEARD : May 23 and 24, \n2024  \nJUDGMENT RENDERED : November \n29, 2024  \nDOCKET : 40864  \n \nBETWEEN : \n \nSanis Health Inc., Shoppers Drug Mart Inc.,  \nSandoz Canada Inc. and McKesson Canada Corporation  \nAppellants  \n \nand \n \nHis Majesty The King in Right of the Province of British Columbia  \nRespondent  \n \n- and - \n \nAttorney General of Canada, Attorney General of Ontario,  \nAttorney General of Quebec, Attorney General of Nova Scotia,  \nAttorney General of New Brunswick, Attorney General of Manitoba,  \nAttorney General of Prince Edward Island, Attorney General of Saskatch ewan,  \nAttorney General of Alberta, Attorney General of the Northwest Territories,  \nAttorney General of the Yukon Territory, Groupe Jean Coutu (PJC) inc.  \nand Pro Doc Ltd.  \nInterveners  \n \n \n \nCORAM : Wagner C.J. and Karakatsanis, Côté, Martin, Kasirer, O’Bonsawi n and \nMoreau JJ.  \n \n2024 SCC 40 (CanLII)\n\n--- Page 2 ---\n \n REASONS FOR \nJUDGMENT :  \n(paras. 1 to 110)  Karakatsanis J. (Wagner C.J. and Martin, Kasirer, O’Bonsawin \nand Moreau JJ. concurring)  \nDISSENTING \nREASONS :  \n(paras. 111 to 208)  Côté J.  \n \n \nNOTE: This document is subject to editorial revision before its reproduction in final \nform in the Canada Supreme Court Reports . \n   \n \n  \n2024 SCC 40 (CanLII)\n\n--- Page 3 ---\n \n Sanis Health Inc.,  Shoppers Drug Mart Inc.,  \nSandoz Canada Inc. and  McKesson Canada Corporation  Appellants  \nv. \nHis Majesty The King in Right of the Province of British Columbia  Respondent  \nand \nAttorney General of Canada,  \nAttorney General of Ontario,  \nAttorney General of Quebec,  \nAttorney General of Nova Scotia,  \nAttorney General of New Brunswick,  \nAttorney General of Manitoba,  \nAttorney  General of Prince Edward Island,  \nAttorney General of Saskatchewan,  \nAttorney General of Alberta,  \nAttorney General of the Northwest Territories,  \nAttorney General of the Yukon Territory,  \nGroupe Jean Coutu  (PJC) inc.  and Pro Doc Ltd.  Interveners  \nIndexed as: Sanis Health Inc. v. British Columbia  \n2024  SCC 40 \nFile No.: 40864.  \n2024:  May 23, 24; 2024:  November  29. \n2024 SCC 40 (CanLII)\n\n--- Page 4 ---\n \n Present: Wagner  C.J. and Karakatsanis, Côté, Martin,  Kasirer, O’Bonsawin and \nMoreau  JJ. \nON APPEAL  FROM  THE  COURT OF APPEAL FOR BRITISH COLUMBIA  \n Constitutional law — Division of powers — Extraterritoriality — \nLimitation on provincial legislation — British Columbia applying for certification of \nclass proceeding against manufacturers, marketers and distributors of opioid products \nfor recovery of heal th care expenditures incurred in treating individuals exposed to \nthose products — Provincial legislature adopting legislation that includes provision \npermitting British Columbia to act as representative plaintiff and to include other \ngovernments in Canada in proposed class unless they opt out of class proceeding \npursuant to terms of certification order  — Defendants challenging constitutional \nvalidity of provision — Whether provision ultra vires  legislative assembly of British \nColumbia — Constitution Act, 1867, s.  92(13), (14)  — Opioid Damages and Health \nCare Costs Recovery Act, S.B.C. 2018, c.  35, s.  11. \n British Columbia commenced an action in the provinc e’s Supreme Court \nalleging that  manufacturers, marketers, and d istributors of opioid products committe d \ncommon law torts and breaches of the Competition Act . The pleadings claim every \nprovince and territory in  Canada has experienced high numbers of opioid -related \naddictions, illnesses and deaths due to the opioid  epidemic and the defendants  \ncontributed to the epidemic by falsely marketing their products as being less addictive \nand less prone to abuse, tolerance, and withdraw al than other pain medications. British \n2024",
    "token_count": 1000,
    "start_token": 0,
    "end_token": 1000,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 1,
    "source_file": "2024scc40.txt",
    "text": "  manufacturers, marketers, and d istributors of opioid products committe d \ncommon law torts and breaches of the Competition Act . The pleadings claim every \nprovince and territory in  Canada has experienced high numbers of opioid -related \naddictions, illnesses and deaths due to the opioid  epidemic and the defendants  \ncontributed to the epidemic by falsely marketing their products as being less addictive \nand less prone to abuse, tolerance, and withdraw al than other pain medications. British \n2024 SCC 40 (CanLII)\n\n--- Page 5 ---\n \n Columbia sought certification of the action as a class proceeding with itself as the \nrepresenta tive plaintiff and a class consisting of all federal, provincial, and territorial \ngovernments and agencies that paid healthcare, pharmaceutical and treatment costs \nrelated to opioids. A few months after the proceeding was commenced, the legislature \nof Brit ish Columbia enacted the Opioid Damages and Health Care Costs Recovery Act  \n(“ORA ”) to create a direct, statutory cause of action in the litigation. Section 11 of the \nORA  authorizes British Columbia to bring an action on behalf of the class named in its \nproceeding bu t permits a class member to opt out of the proceeding under s.  16 of the \nprovince’s Class Proceedings Act , in the manner specified in the order certifying the \nclass proceeding. British Columbia changed its notice of civil claim to incorporate s.  11 \nof the ORA  into its pleadings.  \n Several of the defendants, pharmaceutical companies which manufacture, \nmarket, and distribute opioid products throughout Canada, applied for an order striking \ns. 11 of the ORA  as ultra vires  the legislature of British Col umbia and of no force and \neffect pursuant to s.  52 of the Constitution Act, 1982 . They argued it does not respect \nconstitutional territorial limits on provincial legislative competence and it violates \nCanada’s constitutional structure by undermining the so vereignty of other governments \nin Canada. The British Columbia Supreme Court dismissed the applications. It held \nthat s.  11 of the ORA  is a procedural mechanism to facilitate a process in which the \nsubstantive claims of extraterritorial governments may be litigated and therefore falls \nwithin s.  92(14) of the Constitution Act, 1867 , under the province’s authority to \nlegislate regarding the administration of justice in the province. The applications judge \n2024 SCC 40 (CanLII)\n\n--- Page 6 ---\n \n held that s.  11 respects the territorial limits of the  Constitution Act, 1867  since it only \naffects other governments once they consent to participate in the proceeding by either \nopting  in or by declining to opt  out. The Court of Appeal dismissed the defendants’ \nappeal.  \n Held (Côté  J. dissenting): The appeal should be dismissed.  \n Per Wagner  C.J. and Karakatsanis , Martin, Kasirer, O’Bonsawin and \nMoreau  JJ.: Section 11 of the ORA  is intra vires  the province of British Columbia. The \ncourts below were correct in finding that the pith and substance of s.  11 is the creation \nof a procedural mechanism for the application of the ORA  to the existing opioid -related \nproceeding. Section 11 does not deal with substantive rights, it is meaningfully \nconnected to the province of British Columbia, and it respects the legislative  \nsovereignty of other Canadian governments. It is properly classified under s.  92(14) of \nthe Constitution Act, 1867 , which grants the provinces the authority to legislate in \nrelation to the administration of justice in the province. Under this head of powe r, \nprovinces may enact laws and regulations pertaining to courts, rules of court and civil \nprocedure. Section 11 presumptively authorizes British Columbia to act as a \nrepresentative plaintiff on behalf of a class of other Canadian governments who choose \nto participate in this class proceeding.  \n The first stage of the framework set out in British Columbia v. Imperial \nTobacco Canada Ltd. , 2005 SCC 49, [2005] 2 S.C.R. 473,  to determine the \nconstitutional validity of legislation is to identify its pith and subs tance, that is, its main \n2024 SCC 40 (CanLII)\n\n--- Page 7 ---\n \n thrust or dominant or most important characteristic. Courts look at the law’s purpose \nand effects, examining both intrinsic and extrinsic evidence, and its legal and practical \neffects. The court will presume constitutionality, assu ming that the legislature did not \nintend to exceed its authority, especially if the attorneys",
    "token_count": 1000,
    "start_token": 900,
    "end_token": 1900,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 2,
    "source_file": "2024scc40.txt",
    "text": " \nconstitutional validity of legislation is to identify its pith and subs tance, that is, its main \n2024 SCC 40 (CanLII)\n\n--- Page 7 ---\n \n thrust or dominant or most important characteristic. Courts look at the law’s purpose \nand effects, examining both intrinsic and extrinsic evidence, and its legal and practical \neffects. The court will presume constitutionality, assu ming that the legislature did not \nintend to exceed its authority, especially if the attorneys general of the jurisdictions \naffected by the law support its validity. The second stage of the framework determines \nwhether the challenged legislation respects th e territorial limits of provincial power \nfound in both the opening words of s.  92 of the Constitution Act, 1867 and the language \nof the heads of power themselves, by determining whether the legislation has a \nmeaningful connection to the province and respec ts the sovereignty of other provinces. \nA meaningful connection is tested by assessing the law’s connection to the enacting \nterritory, to the subject matter of the law, and to those made subject to it.  \n The purpose of s.  11 of the ORA  is to provide a proced ural mechanism \nexplaining how the rest of the ORA  applies to British Columbia’s ongoing class \nproceeding. The term “the Crown” can refer to either a personification of the state or \nthe physical, natural person of His Majesty the King. As a plaintiff in lit igation to \nenforce a common law or statutory cause of action, a Crown typically acts in its \ncapacity as a natural person. Thus, the Crown in right of British Columbia is a person \ncapable of being a representative plaintiff under the Class Proceedings Act  and foreign \nCrowns may sue in any court having jurisdiction in the particular matter. Nothing in \nBritish Columbia’s legislation prevents foreign Crowns from participating in a class \naction in British Columbia as a member of a class of persons. Section  11 of  the ORA \nallows British Columbia to bring the class action at issue in the instant case under the \n2024 SCC 40 (CanLII)\n\n--- Page 8 ---\n \n Class Proceedings Act , which is a purely procedural statute. The text of s.  11 strongly \nindicates that its purpose is to provide a procedural mechanism tightl y oriented around \nthe continued efficacy of British Columbia’s class proceeding and the benefits which \nthe ORA  provide it. It also is clear from the entire context of the ORA , including its \nother provisions granting benefits to the proceeding, and from ext rinsic evidence that \nthe purpose of s.  11 of the ORA  was not to create substantive rights for the Crown.  \n When an individual chooses to participate as a member in a class action, \nthey necessarily give up some rights associated with litigation autonomy. This does not \nmean that s.  11 of the ORA  is a substantive provision. A Crown’s choice  to litigate in \na different jurisdiction and to subject itself to the procedural rules of that forum does \nnot violate any constitutional principle. As a participant in a class action, a Crown \nsacrifices  aspects of its litigation autonomy  but only if it chooses to do so through the \nopt-in or opt-out mechanism, a procedural right that has been recognized as a  primary \nprotection for class members in the class proceeding proce ss. The choice  to participate \nby opting in or not opting out represents an exercise of litigation autonomy, although \none which involves sacrificing other elements of autonomy.  Many aspects of litigation \nautonomy will  remain available through procedural pro tections offered to  \nnon-representative plaintiffs and under  the court’s general supervisory jurisdiction. It \ndoes not violate the Crown’s autonomy for it to accept the consequences of its litigation \nchoices and those consequences do not render s.  11 a prov ision dealing with substantive \ncivil rights. The legal effects of s.  11 are to regulate how British Columbia’s class \nproceeding will continue in a modified form after the ORA  came into force. The \n2024 SCC 40 (CanLII)\n\n--- Page 9 ---\n \n substantive rights of foreign Crowns remain unchanged. Secti on 11’s practical effects \nare to require foreign Crowns to choose whether they accept the procedural benefits \nand burdens of the class action after considering the consequences that this choice may \nhave on their rights.  \n Section 11 of the ORA maintains a m eaningful connection to British \nColumbia, both through the nature of the class action, and through the choice of the \nforeign Crowns to participate in the proceeding. It concerns a single action with \ncommonality of defendants, issues and claims. British Col umbia’s laws and courts do \nnot reach outside the province",
    "token_count": 1000,
    "start_token": 1800,
    "end_token": 2800,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 3,
    "source_file": "2024scc40.txt",
    "text": " procedural benefits \nand burdens of the class action after considering the consequences that this choice may \nhave on their rights.  \n Section 11 of the ORA maintains a m eaningful connection to British \nColumbia, both through the nature of the class action, and through the choice of the \nforeign Crowns to participate in the proceeding. It concerns a single action with \ncommonality of defendants, issues and claims. British Col umbia’s laws and courts do \nnot reach outside the province unless the court is satisfied there are common issues \nbetween British Columbia and the class members and British Columbia is the proper \nvenue for their resolution. Common issues establish a real and  substantial connection \nfor adjudicatory jurisdiction. Section 11 does not extend or change the court’s \njurisdiction; it merely provides procedural rules once jurisdiction is established. It is a \nlegitimate exercise of power for a province to set the proce dural rules for proceedings \nwithin its jurisdiction.  \n Section 11 of the ORA respects the legislative sovereignty of other \nCanadian governments. When a Crown participates as a non -representative plaintiff in \na class action in another province, it will find itself subject to that province’s procedural \nrules governing class actions. However, each Crown’s causes of action occurred in their \nown jurisdiction and thus are subject to their own substantive law. Intergovernmental \ncooperation in Canada recognizes that  legislative overlap is inevitable regarding \n2024 SCC 40 (CanLII)\n\n--- Page 10 ---\n \n national issues like the opioid epidemic and that governments may legislate for their \nown valid purposes in areas of overlap. In the instant case, nearly every provincial and \nterritorial government in Canada and  the federal government intends to participate in \nthe class action. A court should exercise considerable caution before it finds that this \ncooperation is unconstitutional. Courts in the Canadian federation demand the same \nlevel of faith in one another’s ju dgments where jurisdiction has been properly \nexercised. These goals are met where governments cooperate to have their claims \nlitigated efficiently in one action. Section  11 is an example of the important role that \nnational class actions play, providing a m echanism to help multiple governments work \ntoward the same goal. In an increasingly complex modern world, where governments \nassume greater regulatory roles in multifaceted areas overlapping jurisdictional \nboundaries, there is a greater need for cooperation  between governments and between \ncourts that cross those borders. National class actions, and in particular multi -Crown \nclass actions, ensure that justice is not blocked by provincial borders. The opioid \nepidemic is a stark example of a crisis that should attract cooperation and comity.  \n Per Côté  J. (dissenting): The appeal should be allowed. Sections  11(1)(b) \nand (2) of the ORA  are ultra vires  the legislature of British Columbia and should be \nsevered from the Act. The legislature of British Columbia cannot  authorize the province \nto initiate a class action to claim health care costs incurred by a foreign province on an \nopt-out basis, thereby compelling that province to take steps to avoid forced \nparticipation. Binding other governments to the class proceedin g unless they take \npositive steps to opt out in accordance with the certification order means that British \n2024 SCC 40 (CanLII)\n\n--- Page 11 ---\n \n Columbia’s provincial courts get to dictate how other provinces and the federal \ngovernment go about preserving their own rights. The legislature of a  province does \nnot have the authority to legislate in a manner that interferes with the rights and \nprerogatives of other provincial governme nts and the federal government.  The pith and \nsubstance of s.  11 is to legislate in respect of property and civil rig hts outside the \nprovince, contrary to the territorial limitations imposed by s.  92 of the Constitution Act, \n1867 . The legislature of British Columbia is attempting to aggregate civil rights in other \nprovinces into a single class action, but its powers are limited to property and civil \nrights “in the Province”. The effects of s.  11 are not merely incidental. Imposing \nmembership in the class on other governments as the default position interferes with \ntheir litigation autonomy. These unconstitutional legal ef fects cannot be made valid by \nthe fact that those foreign governments can choose to opt  out of the class action. The \npith and substance of s.  11 of the ORA  does not respect the territorial limitations on the \ncompetence of the legislature of British  Columbi a. Though horizontal cooperation \nbetween the provincial and federal governments on common issues is a laudable goal, \nwhatever method is used to achieve cooperation must be consistent with the structure \nof Canadian federal",
    "token_count": 1000,
    "start_token": 2700,
    "end_token": 3700,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 4,
    "source_file": "2024scc40.txt",
    "text": "s cannot be made valid by \nthe fact that those foreign governments can choose to opt  out of the class action. The \npith and substance of s.  11 of the ORA  does not respect the territorial limitations on the \ncompetence of the legislature of British  Columbi a. Though horizontal cooperation \nbetween the provincial and federal governments on common issues is a laudable goal, \nwhatever method is used to achieve cooperation must be consistent with the structure \nof Canadian federalism. Section s.  11 of the ORA is not. \n Where the validity of provincial legislation is challenged on the basis that \nit violates territorial limitations imposed on a provincial legislature, the assessment of \nits validity must be carried out in accordance with the framework established in \nImperial Tobacco . The first step is to determine the pith and substance of the impugned \nlegislation, which requires finding its essential character or dominant feature having \n2024 SCC 40 (CanLII)\n\n--- Page 12 ---\n \n regard to its purpose and effect. Section 11 of the ORA  engages and ultimately aff ects \nsubstantive rights  held by foreign governments far beyond the procedural advantages  \nof class proceedings legislation. It has serious impacts on the litigation autonomy of \nother governments. Its pith and substance is to legislate in respect of property  and civil \nrights outside of the province. It permits British Columbia to seek certification of a \nclass of governments asserting recovery rights for opioid -related health care costs, on \nan opt -out basis, such that by default, the provincial governments and  the federal \ngovernment are included in the class action. This creates a new substantive right \nbecause governments are not persons or members of a class of persons for the purposes \nof the Class Proceedings Act . Section  11 gives the province the ability to do something \nit could not before. Its effects are not simply limited to the application of the ORA  to \nthe extant class action.  \n Although s.  11 of the ORA  is procedural in some respects, the placement \nof s. 11(1)(b) within procedural paragraphs does not mea n that its effects are merely \nprocedural. The main thrust of s.  11 is found in s.  11(1)(b) and (2). The opt -out regime \nprovided for in s.  11(2) is central to the pith and substance of s.  11 as a whole. \nSection  11 cannot be construed as an opt -in regime; no thing indicates that other \ngovernments have a choice of opting in. British Columbia can commence a proceeding \nwithout any consultation with the other governments. By implementing an opt -out \nregime, the legislature of British Columbia is seeking to preserve  substantive rights it \nhas arrogated without the consent of the other governments. As well, the other \ngovernments do not have meaningful input on a host of important aspects of the \n2024 SCC 40 (CanLII)\n\n--- Page 13 ---\n \n proceeding, including the choice of counsel, litigation strategy, the evide nce to be \ntendered, or negotiation and settlement of the action. They lose their right to \nsimultaneously commence proceedings in their own jurisdictions. They are necessarily \nput to a choice pursuant to the laws of British Columbia  to opt out or lose their  litigation \nautonomy. Opting out requires taking proactive steps in accordance with the \ncertification order, meaning that British Columbia’s provincial courts dictate how they \nmay go about preserving their own rights. Further, s.  11 operates primarily  and not \nincidentally  with respect to litigants outside of British Columbia. The Crown however \nis not an ordinary litigant. Every province and Parliament has an attorney general with \nexecutive and judicial functions acting as its chief law officer. The effects of s. 11 on \nthe important functions of other governments’ attorneys general cannot be merely \nincidental.  \n The fact that governments can opt out does not change the legislation’s \nprima facie  encroachment upon property and civil rights in other provinces. Th us, it \ncannot be said that an opt -out regime is purely procedural given the real and substantial \nimpacts that the legislation has on the litigation autonomy of class members. Because \nthe pith and substance of s.  11(1)(b) and the opt -out context in which it  operates is to \nlegislate with respect to the substantive rights of other governments, it  falls within \n“Property and Civil Rights” under s.  92(13) of the Constitution Act, 1867 . \n Common issues that might ground jurisdiction in a provincial superior \ncourt o ver multi -Crown class proceedings are irrelevant",
    "token_count": 1000,
    "start_token": 3600,
    "end_token": 4600,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 5,
    "source_file": "2024scc40.txt",
    "text": " class members. Because \nthe pith and substance of s.  11(1)(b) and the opt -out context in which it  operates is to \nlegislate with respect to the substantive rights of other governments, it  falls within \n“Property and Civil Rights” under s.  92(13) of the Constitution Act, 1867 . \n Common issues that might ground jurisdiction in a provincial superior \ncourt o ver multi -Crown class proceedings are irrelevant to the constitutional validity \n2024 SCC 40 (CanLII)\n\n--- Page 14 ---\n \n of s.  11 of the ORA . A meaningful connection cannot be established between the \nenacting province, the legislative subject matter, and those made subject to it based on \nthe real  and substantial connection test applicable in determining whether a court has \njurisdiction over a matter. Nor do the nature of the class action and the choice of the \nforeign Crowns to participate provide a meaningful connection; consent plays no role \nin deciding whether there is a meaningful connection. The assessment of a meaningful \nconnection must be made with a view to the pith and substance of the impugned law. \nSection  11 of the ORA  allows British Columbia to bring a class action on behalf of \nother gov ernments across Canada. The fact that the subject matter of the law is, in pith \nand substance, related to the substantive rights of other governments necessarily means \nthat it has no meaningful connection with British Columbia. As well, s.  11 serves a \nbroader purpose than merely to establish a cause of action against defendants for \nwrongs in the province; its focus is on the other governments as plaintiffs and how their \nsubstantive rights operate in the context of the civil action. Even on a premise that s.  11 \nis procedural in nature and potentially falls under s.  92(14) of the Constitution Act, \n1867 , this logic would apply. For these reasons, it cannot be said that British Columbia \nhas a meaningful connection with both  the subject matter of s.  11 and those made \nsubject to it. As a result, s.  11 does not respect the territorial limitations prescribed by \ns. 92 of the Constitution Act, 1867 . \n Having found that there is no meaningful connection between the enacting \nprovince, the subject matter of the law, and th ose made subject to the law, the \ndisposition of this appeal does not require determining whether s.  11 of the ORA  pays \n2024 SCC 40 (CanLII)\n\n--- Page 15 ---\n \n respect to the legislative sovereignty of the other provincial governments and the \nfederal government. However, the fact that the other g overnments have endorsed the \nconstitutional validity of the provision is of no moment. The support of the other \ngovernments is based on a misconstrued interpretation of s.  11 as an opt -in provision. \nIn any event, the provinces cannot amend the Constitution  by mutual consent.  \n The ancillary powers doctrine should not be applied to uphold the \nconstitutional validity of s.  11. Section 11 is the only provision of the ORA related to \ncauses of action of other provincial or territorial governments under their own \nsubstantive laws. Without s.  11, the ORA  properly grounds and establishes a direct and \ndistinct cause of action against the defendants. Section 11 is not needed to enforce the \nsubstantive aspects of the remainder of the ORA . \n The appropriate remedy in the instant case is severance of ss.  11(1)(b) and \n(2) from the ORA . Severance should be employed when possible so that constitutional \naspects of the legislation are preserved. Only partial invalidation of the law is \nnecessary. The other provisions in s.  11 nee d not be disturbed and the balance of the \nstatutory scheme can stand on its own.  \nCases Cited  \nBy Karakatsanis J.  \n Applied: British Columbia v.  Imperial Tobacco Canada Ltd. , 2005 SCC \n2024 SCC 40 (CanLII)\n\n--- Page 16 ---\n \n 49, [2005] 2 S.C.R. 473; referred to:  Canada Post Corp. v. Lépine , 2009 SCC  16, \n[2009] 1 S.C.R. 549;  Western Canadian Shopping Centres Inc. v. Dutton , 2001 SCC \n46, [2001] 2 S.C.R. 534;  Hollick v. Toronto (City) , 2001 SCC 68, [2001] 3 S.C.R. 158;  \n",
    "token_count": 1000,
    "start_token": 4500,
    "end_token": 5500,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 6,
    "source_file": "2024scc40.txt",
    "text": " referred to:  Canada Post Corp. v. Lépine , 2009 SCC  16, \n[2009] 1 S.C.R. 549;  Western Canadian Shopping Centres Inc. v. Dutton , 2001 SCC \n46, [2001] 2 S.C.R. 534;  Hollick v. Toronto (City) , 2001 SCC 68, [2001] 3 S.C.R. 158;  \nRumley v. British Columbia , 2001 SCC 69, [2001] 3 S.C.R. 184 ; Reference re Secession \nof Quebec , [1998] 2 S.C.R. 217 ; References re Greenhouse Gas Pollution Pricing Act , \n2021 SCC 11, [2021] 1 S.C.R. 175; Canadian Western Bank v. Alberta , 2007 SCC 22, \n[2007] 2 S.C.R. 3; Reference re Securities Act , 2011 SCC 66, [2011] 3 S.C.R. 837;  \nHunt v. T &N plc , [1993] 4 S.C.R. 289;  Morguard Investments Ltd. v. De Savoye , [1990] \n3 S.C.R. 1077;  R. v. Parranto , 2021 SCC 46 , [2021] 3 S.C.R. 366 ; Quebec (Attorney \nGeneral) v. Canada (Attorney General) , 2015 SCC 14, [2015] 1 S.C.R. 693; \nFédération des producteur s de volailles du Québec v. Pelland , 2005 SCC 20, [2005] 1 \nS.C.R. 292; Reference re Pan -Canadian Securities Regulation , 2018 SCC 48, [2018] \n3 S.C.R. 189 ; Endean v. British Columbia , 2016 SCC 42, [2016] 2 S.C.R. 162;  Sharp \nv. Autorité des marchés financiers , 2023 SCC 29; R. v. Morgentaler , [1993] 3 S.C.R. \n463; Murray -Hall v. Quebec (Attorney General) , 2023 SCC 10; Reference re Genetic \nNon-Discrimination Act , 2020 SCC 17, [2020] 2 S.C.R. 283; Reference re Impact \nAssessment Act , 2023 SCC 23; Kitkatla Band v. B ritish Columbia (Minister of Small \nBusiness, Tourism and Culture) , 2002 SCC 31, [2002] 2 S.C.R. 146; Goodwin v. British \nColumbia (Superintendent of Motor Vehicles) , 2015 SCC 46, [2015] 3 S.C.R. 250; \nOPSEU v. Ontario (Attorney General) , [1987] 2 S.C.R. 2; Attorney General of Quebec \nv. Labrecque , [1980] 2 S.C.R. 1057; Verreault (J.E.) & Fils Ltée v. Attorney General \n(Quebec) , [1977] 1 S.C.R. 41;  Attorney General for Ontario v. Fatehi , [1984] 2 S.C.R. \n536; R. v.  Murray , [1967] S.C.R. 262;  R. v. McColman , 2023 SCC 8; R. v. British \n2024 SCC 40 (CanLII)\n\n--- Page 17 ---\n \n Columbia , [1992] 4 W.W.R. 490; Nelson (City) v. Marchi , 2021 SCC 41 , [2021] 3 \nS.C.R. 55 ; McNamara Construction (Western) Ltd. v. The Queen , [1977] 2 S.C.R. 654;  \nPro-Sys Consultants Ltd. v. Microsoft Corporation , 2013 SCC 57, [20 13] 3 S.C.R. 477; \nJohnson v. Ontario , 2022 ONCA 725, 475 D.L.R. (4th) 344; Coburn and Watson’s \nMetropolitan Home v. Home Depot of Canada Inc. , 2019 BCCA 308, 438 D.L.R. (4th) \n533; Johnson v. Ontario , 2021 ONCA 650, 158 O.R. (3d) 266; Wannan v. Hutchison , \n2020 BCSC 1233",
    "token_count": 1000,
    "start_token": 5400,
    "end_token": 6400,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 7,
    "source_file": "2024scc40.txt",
    "text": "2022 ONCA 725, 475 D.L.R. (4th) 344; Coburn and Watson’s \nMetropolitan Home v. Home Depot of Canada Inc. , 2019 BCCA 308, 438 D.L.R. (4th) \n533; Johnson v. Ontario , 2021 ONCA 650, 158 O.R. (3d) 266; Wannan v. Hutchison , \n2020 BCSC 1233, 74 C.P.C. (8th) 222; Milios v. Zagas  (1998), 38 O.R. (3d) 218; DLC \nHoldings Corp. v. Payne , 2021 BCCA 31, 456 D.L.R. (4th) 337; Dubuc v. 1663066 \nOntario Inc. , 2009 ONCA 914, 99 O.R. (3d) 476; Poffenroth Agri Ltd. v. Brown , 2020 \nSKCA 121, 65 C.P.C. (8th) 348; 1250264 Ontario Inc. v. Pet Valu Canada Inc. , 2013 \nONCA 279, 362 D.L.R. (4th) 88 ; 1176560 Ontario Ltd. v. Great Atlantic & Pacific Co. \nof Canada Ltd.  (2002), 62 O.R. (3d) 535 ; Currie v. McDonald’s Restaurants of Canada \nLtd. (2005), 250 D.L.R. (4th) 224; Herold v. Wassermann , 2022 SKCA 103, 473 \nD.L.R. (4th) 281; Fitzsimmons v. Cie matériaux de construction BP Canada , 2016 \nQCCS 1446; Tataskweyak Cree Nation v. Canada (A.G.) , 2021 MBQB 153;  Logan v. \nOntario (Minister of Health)  (2003), 36 C.P.C. (5th) 176 ; Dabbs v. Sun Life Assurance \nCo. of Canada  (1998), 40 O.R. (3d) 429 ; Leonard v. The Manufacturers Life Insurance \nCompany , 2022 BCCA 28, 75 B.C.L.R. (6th) 235; Berry v. Pulley , 2011 ONSC 1378, \n106 O.R. (3d) 123; Alberta Governme nt Telephones v. Canada (Canadian Radio -\ntelevision and Telecommunications Commission) , [1989] 2 S.C.R. 225; AIC Limited v. \nFischer , 2013 SCC 69, [2013] 3 S.C.R. 949; Bisaillon v. Concordia University , 2006 \nSCC 19, [2006] 1 S.C.R. 666;  Pioneer Corp. v. Godf rey, 2019 SCC 42, [2019] 3 S.C.R. \n295; Di Iorio v. Warden of the Montreal Jail , [1978] 1 S.C.R. 152; Ontario v. Criminal \n2024 SCC 40 (CanLII)\n\n--- Page 18 ---\n \n Lawyers’ Association of Ontario , 2013 SCC 43, [2013] 3 S.C.R. 3; Caron v. Alberta , \n2015 SCC 56, [2015] 3 S.C.R. 511; Castillo v. Castillo , 2005 SCC 83, [2005] 3 S.C.R. \n870; Reference re Upper Churchill Water Rights Reversion Act , [1984] 1 S.C.R. 297; \nClub Resorts Ltd. v. Van Breda , 2012 SCC 17, [2012] 1 S.C.R. 572; Global Securities \nCorp. v. British Columbia (Securities Commission) , 2000 SCC 21, [2000] 1 S.C.R. 494; \nVivendi Canada Inc. v. Dell’Aniello , 2014 SCC 1, [2014] 1 S.C.R. 3; Airia Brands Inc. \nv. Air Canada , 2017 ONCA 792, 417 D.L.R. (4th) 467; Harrington v. Dow Corning \nCorp. , 2000 BCCA 605, 193 D.L.R. (4th) 67; Meeking v. Cas h Store Inc. , 2013 MBCA \n81, 367 D.L",
    "token_count": 1000,
    "start_token": 6300,
    "end_token": 7300,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 8,
    "source_file": "2024scc40.txt",
    "text": " [2014] 1 S.C.R. 3; Airia Brands Inc. \nv. Air Canada , 2017 ONCA 792, 417 D.L.R. (4th) 467; Harrington v. Dow Corning \nCorp. , 2000 BCCA 605, 193 D.L.R. (4th) 67; Meeking v. Cas h Store Inc. , 2013 MBCA \n81, 367 D.L.R. (4th) 684;  Thorpe v. Honda Canada Inc. , 2011 SKQB 72, [2011] 8 \nW.W.R. 529;  Wilson v. Servier Canada Inc. (2000), 50 O.R. (3d) 219;  Beals v. \nSaldanha , 2003 SCC 72, [2003] 3 S.C.R. 416; Canada (Attorney General) v. British \nColumbia Investment Management Corp. , 2019 SCC 63, [2019] 4 S.C.R. 559; Wells v. \nNewfoundland , [1999] 3 S.C.R. 199; Reference re Canada Assistance Plan (B.C.) , \n[1991] 2 S.C.R. 525;  Bank of Montreal v. Attorney General (Quebec) , [1979] 1 S.C.R. \n565; Tolofson v. Jensen , [1994] 3 S.C.R. 1022; Unifund Assurance Co. v. Insurance \nCorp. of British Columbia , 2003 SCC 40, [2003] 2 S.C.R. 63; Canada (Attorney \nGeneral) v. PHS Community Services Society , 2011 SCC 44, [2011] 3 S.C.R. 134 . \nBy Côté J.  (dissenting)  \n R. v. Parranto , 2021 SCC 46 , [2021] 2 S.C.R. 366 ; R. v. Smith , 2019 SKCA \n100, 382 C.C.C. (3d) 455;  R. v. Fyfe , 2017 SKQB 5;  British Columbia v.  Imperial \nTobacco Canada Ltd. , 2005 SCC 49, [2005] 2 S.C.R. 473;  Reference re Upper \n2024 SCC 40 (CanLII)\n\n--- Page 19 ---\n \n Churchill Water Rights Reve rsion Act , [1984] 1 S.C.R. 297;  Global Securities Corp. v. \nBritish Columbia (Securities Commission) , 2000 SCC 21, [2000] 1 S.C.R. 494;  Pioneer \nCorp. v. Godfrey , 2019 SCC 42, [2019] 3 S.C.R. 295;  Western Canadian Shopping \nCentres Inc. v. Dutton , 2001 SCC 46 , [2001] 2 S.C.R. 534;  Gauthier v. The King  \n(1918), 56 S.C.R. 176;  Sharp v. Autorité des marchés financiers , 2023 SCC 29;  \nSparling v. Quebec (Caisse de dépôt et placement du Québec) , [1988] 2 S.C.R. 1015; \nAlberta Government Telephones v. Canada (Canadian Radio -television and \nTelecommunications Commission) , [1989] 2 S.C.R. 225; Currie v. McDonald’s \nRestaurants of Canada Ltd.  (2005), 74 O.R. (3d) 321;  Canada Post Corp. v. Lépine , \n2009 SCC 16, [2009] 1 S.C.R. 549;  Turner v. Bell Mobility Inc ., 2016 ABCA 21, 3 94 \nD.L.R. (4th) 325;  Gillis v. BCE Inc. , 2015 NSCA 32, 358 N.S.R. (2d) 39;  Frey v. BCE \nInc., 2013 SKCA 26, 409 Sask.  R. 266;  Johnson v. Ontario , 2021 ONCA 650, 158 O.R. \n(3d) 266;  Johnson v. Ontario , 2022 ONCA 725, 164 O.R. (3d) 573;  Hamm v. Canada \n(Attorne y General) , 2021 ABCA 329, 32 Alta. L.R",
    "token_count": 1000,
    "start_token": 7200,
    "end_token": 8200,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 9,
    "source_file": "2024scc40.txt",
    "text": "Inc., 2013 SKCA 26, 409 Sask.  R. 266;  Johnson v. Ontario , 2021 ONCA 650, 158 O.R. \n(3d) 266;  Johnson v. Ontario , 2022 ONCA 725, 164 O.R. (3d) 573;  Hamm v. Canada \n(Attorne y General) , 2021 ABCA 329, 32 Alta. L.R. (7th) 213;  Herold v. Wassermann , \n2022 SKCA 103, 473 D.L.R. (4th) 281; Coburn and Watson’s Metropolitan Home v. \nHome Depot of Canada Inc. , 2019 BCCA 308, 438 D.L.R. (4th) 533;  Dubuc v. 1663066 \nOntario Inc. , 2009 ONCA  914, 99 O.R. (3d) 476;  In re Criminal Code (1910), 43 \nS.C.R. 434;  Krieger v. Law Society of Alberta , 2002 SCC 65, [2002] 3 S.C.R. 372; \nOntario v. Criminal Lawyers’ Association of Ontari o, 2013 SCC 43, [2013] 3 S.C.R. \n3; Newfoundland and Labrador (Attorney  General) v. Uashaunnuat (Innu of Uashat \nand of Mani -Utenam) , 2020 SCC 4, [2020] 1 S.C.R. 15;  Unifund Assurance Co. v. \nInsurance Corp. of British Columbia , 2003 SCC 40, [2003] 2 S.C.R. 63;  Club Resorts \nLtd. v. Van Breda , 2012 SCC 17, [2012] 1 S.C.R. 572;  Hunt v. T&N plc , [1993] 4 \n2024 SCC 40 (CanLII)\n\n--- Page 20 ---\n \n S.C.R. 289; Castillo v. Castillo , 2005 SCC 83, [2005] 3 S.C.R. 870;  Harrington v. Dow \nCorning Corp. , 2000 BCCA 605, 193 D.L.R. (4th) 67;  HSBC v. Hocking , 2008 QCCA \n800, [2008] R.J.Q. 1189;  Airia Brands Inc. v. Air Canada , 2017 ONCA  792, 417 \nD.L.R. (4th) 467;  Reference re Secession of Quebec , [1998] 2 S.C.R. 217;  Reference \nre Pan -Canadian Securities Regulation , 2018 SCC 48, [2018] 3 S.C.R. 189;  Goodwin \nv. British Columbia (Superintendent of Motor Vehicles) , 2015 SCC 46, [2015] 3 S.C. R. \n250; R. v. Brown , 2022 SCC 18 , [2022] 1 S.C.R. 374 ; Ontario v. Canadian Pacific Ltd. , \n[1995] 2 S.C.R. 1031;  Attorney General of Nova Scotia v. Attorney General of Canada , \n[1951] S.C.R. 31;  Reference re Assisted Human Reproduction Act , 2010 SCC 61, \n[2010 ] 3 S.C.R. 457; Quebec (Attorney General) v. Lacombe , 2010 SCC 38, [2010] 2 \nS.C.R. 453; Schachter v. Canada , [1992] 2 S.C.R. 679;  Ontario (Attorney General) v. \nG, 2020 SCC 38, [2020] 3 S.C.R. 629.  \nStatutes and Regulations Cite d \nAct respecting the Ministère  de la Justice , CQLR , c. M-19, s.  4. \nAct Respecting the Role of the Attorney General , R.S.N.B. 2011, c.  116, s.  2. \nClass Proceedings Act , R.S.B.C. 1996, c.  50, ss. 1, 2(1), 4, 4.1, 8(3), 10 , 12, 15(1) , 16, \n26, 35, 36(2) , 44. \nCompetition Act",
    "token_count": 1000,
    "start_token": 8100,
    "end_token": 9100,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 10,
    "source_file": "2024scc40.txt",
    "text": " General , R.S.N.B. 2011, c.  116, s.  2. \nClass Proceedings Act , R.S.B.C. 1996, c.  50, ss. 1, 2(1), 4, 4.1, 8(3), 10 , 12, 15(1) , 16, \n26, 35, 36(2) , 44. \nCompetition Act , R.S.C. 1985, c. C-34, s. 52. \nConstitution Act, 1867 , Part V,  Part VI,  ss. 91, 92. \nConstitution Act, 1982 , s. 52. \nCrown Proceeding Act , R.S.B.C. 1996, c.  89, s.  1 “person”.  \nDepartment of Justice Act , R.S.C. 1985, c.  J-2, s. 5. \n2024 SCC 40 (CanLII)\n\n--- Page 21 ---\n \n Department of Justice Act , R.S.N.W.T. (Nu .) 1988, c.  97 (Supp .), s. 5. \nDepartment of Justice Act , R.S.Y. 2002, c.  55, s.  7. \nExecutive Council Act , S.N.L. 1995, c.  E-16.1, s.  4(4).  \nGovernment Organization Act , R.S.A. 2000, c.  G-10, Sch.  9, s. 2. \nInterpretation Act , R.S.B.C. 1996, c.  238, s.  29 “corp oration”, “person”.  \nJudicature Act , R.S.P.E.I. 1988, c.  J-2.1, s.  36. \nMinistry of the Attorney General Act , R.S.O. 1990, c.  M.17, s.  5. \nOpioid Damages and Health Care Costs Recovery Act , C.C.S.M., c.  O55.  \nOpioid Damages and Health Care Costs Recovery Act , S.P.E.I. 2020, c.  77. \nOpioid Damages and Health Care Costs Recovery Act , S.A. 2019,  c. O-8.5, s s. 12, 13. \nOpioid Damages and Health Care Costs Recovery Act , S.B.C. 2018, c.  35, s s. 2, 3, 4, \n5, 6, 7, 8 , 10, 11, 12. \nOpioid Damages and Health Care Costs Recovery Act , S.N.B. 2023, c.  28. \nOpioid Damages and Health Care Costs Recovery Act , S.N.L. 2019, c. O -6.2. \nOpioid Damages and Health -care Costs Recovery Act , S.N.S. 2020, c.  4. \nOpioid Damages and Health Care Costs Recovery Act , S. Nu. 2023, c.  19. \nOpioid Damages and Health Care Costs Recovery Act , S.N.W.T. 2023, c.  18. \nOpioid Damages and Health Care Costs Recovery Act, 2019 , S.O. 2019, c.  17, Sch.  2, \nss. 11, 12. \nOpioid Damages and Health Care Costs Recovery Act , S.S. 2020, c.  32. \nOpioid -related Damages and  Health Care Costs Recovery Act , CQLR, c. R -2.2.0.0.01.  \nPublic Service Act , R.S.N.S. 1989, c.  376, s.  29. \nThe Department of Justice Act , C.C.S.M. c.  J35, ss.  2, 2.1.  \nThe Justice and Attorney General Act , S.S. 1983, c.  J-4.3, s.  10. \nTobacco Damages and Health Care Costs Recovery Act , S.B.C. 2000, c.  30, ss. 5, \n2(5)(a), 3(2).  \n2024 SCC 40 (CanLII)\n\n--- Page 22 ---\n \n Authors Cited  \nBranch , Ward K ., and Math",
    "token_count": 1000,
    "start_token": 9000,
    "end_token": 10000,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 11,
    "source_file": "2024scc40.txt",
    "text": " and Attorney General Act , S.S. 1983, c.  J-4.3, s.  10. \nTobacco Damages and Health Care Costs Recovery Act , S.B.C. 2000, c.  30, ss. 5, \n2(5)(a), 3(2).  \n2024 SCC 40 (CanLII)\n\n--- Page 22 ---\n \n Authors Cited  \nBranch , Ward K ., and Mathew P.  Good.  Class Actions in Canada , 2nd ed . Toronto: \nThomson Reuters, 2024 (loose -leaf updated May 2024, release 2).  \nBrun, Henri, Guy Tremblay and Eugénie Brouillet. Droit constitutionnel , 6th ed. \nCowansville, Que.: Yvon Blais, 2014.  \nBC Government News . British Columbia files lawsuit against opioid industry , August \n29, 2018 (online: https://news.gov.bc.ca/17895 ; archived version: \nhttps://www.scc -csc.ca/cso -dce/2024SCC -CSC 40_1_eng.pdf ). \nBritish Columbia. Legislative Assembly. Official Report of Debates (Hansard) , \nNo. 150, 3rd Sess., 41st Parl. , October 1, 2018 , pp. 5331 -32. \nBritish Columbia. Legislative Assembly. Official Report of Debates (Hansard) , \nNo. 152, 3rd Sess., 41st Parl., October 2, 2018, p.  5390.  \nCanada. House of Commons. House of Commons Debates , vol.  151, No.  216, 1st Sess., \n44th P arl., June  19, 2023, p. 16247.  \nCanada. Special Advisory Committee on the Epidemic of Opioid Overdoses. Opioid - \nand Stimulant -related Harms in Canada , September 2024 (online: https://health -\ninfobase.canada.ca/substance -related -harms/opioids -stimulants/ ; archived \nversion: https://www.scc -csc.ca/cso -dce/2024SCC -CSC 40_2_eng.pdf ). \nCassels, Jamie, and Craig Jones. The Law of Large -Scale Claims: Product Liability, \nMass Torts, and Complex Lit igation in Canada . Toronto: Irwin Law, 2005.  \nCôté, Pierre‐André, and Mathieu Devinat. Interprétation des lois , 5th ed. Montréal: \nThémis, 2021.  \nEdinger, Elizabeth. “ British Columbia v. Imperial Tobacco Canada Ltd. : \nExtraterritoriality and Fundamental Princi ples” (2006), 43 Can. Bus. L.J.  301. \nFortin, Marie -France. “The King’s Two Bodies and the Canadian Office of the Queen” \n(2021), 25 Rev. Const. Stud.  117. \nGibson, Dale. “Interjurisdictional Immunity in Canadian Federalism” (1969), 47 Can. \nBar Rev.  40. \nHogg,  Peter W., and Wade K.  Wright. Constitutional Law of Canada , 5th ed. Supp . \nToronto: Thomson Reuters, 2024  (updated July 2024, release 1).  \nHogg, Peter W., Patrick J.  Monahan and Wade K.  Wright. Liability of the Crown , 4th \ned. Toronto: Carswell, 2011.  \n2024 SCC 40 (CanLII)\n\n--- Page 23 ---\n \n Horsma n, Karen, and Gareth Morley.  Government Liability: Law and Practice . \nToronto: Thomson Reuters, 2024  (loose‐leaf updated August  2024, release 2). \nJones, Craig. “The Case for the National Class” (2004), 1 C.C.A.R . 29. \nMathen, Carissima, and Patrick Macklem, eds. Canadian Constitutional Law , 6th ed. \nToronto: Emond, 2022.  \nMonestier, Tanya J. “Personal Jurisdiction over Non -Resident Class Members: Have \nWe Gone Down the Wrong Road?” (2010), 45 Tex. Int’l L.J.  537. \nPoirier, Johanne. “The 2018 Pan -Canadian Securities Regulation Reference: Dualist \nFederal",
    "token_count": 1000,
    "start_token": 9900,
    "end_token": 10900,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 12,
    "source_file": "2024scc40.txt",
    "text": "ima, and Patrick Macklem, eds. Canadian Constitutional Law , 6th ed. \nToronto: Emond, 2022.  \nMonestier, Tanya J. “Personal Jurisdiction over Non -Resident Class Members: Have \nWe Gone Down the Wrong Road?” (2010), 45 Tex. Int’l L.J.  537. \nPoirier, Johanne. “The 2018 Pan -Canadian Securities Regulation Reference: Dualist \nFederalism to the Rescue of Cooperative Federalism” (2020), 94 S.C.L.R. (2d) \n85. \nRedish, Martin H. Wholesale Justice: Constitutional Democracy and the Problem of \nthe Class Action Lawsuit . Stanford: Stanford  University Press, 2009.  \nSullivan, Ruth. The Construction of Statutes , 7th ed. Toronto: LexisNexis, 2022.  \nWalker, Janet. Canadian Conflict of Laws , 7th ed. Toronto: LexisNexis, 2024 (loose‐\nleaf updated February 2024, release 104).  \nWalker,  Janet,  H. Michael Rosenberg and Jasminka Kalajdzic, eds. Class Actions in \nCanada: Cases, Notes, and Materials , 3rd ed. Toronto: Emond Montgomery \nPublications, 2024.  \nWinkler, Warren K., et al. The Law of Class Actions in Canada . Toronto: Canada Law \nBook , 2014.  \n APPEAL from a judgment of the British Columbia Court of Appeal  \n(Newbury, Fisher and  Horsman JJ.A.) , 2023 BCCA 306 , 79 B.C.L.R. (6th) 1, 484 \nD.L.R. (4th) 512, [2024] 2 W.W.R. 436, [2023] B.C.J No. 1477 (Lexis), 2023 \nCarswellBC 2178 (WL), affirming a decision of Brundrett J., 2022 BCSC 2147 , 77 \nB.C.L.R. (6th) 313, [2022] B.C.J. No. 2382 (Lexis), 2022 CarswellBC  3468  (WL). \nAppeal dismissed , Côté J. dissenting.  \n2024 SCC 40 (CanLII)\n\n--- Page 24 ---\n \n  W. David Rankin  and Ankita Gupta , for the appellants Sanis Health Inc. \nand Shoppers Drug Mart Inc.  \n Peter J. Pliszka , Andrew Borrell  and Tom Posyniak , for the appellant \nSandoz Canada Inc.  \n Sandra A. Forbes  and Chanakya A. Sethi , for the appellant  the McKesson \nCanada Corporation . \n Reidar M. Mogerman , K.C., Katie I. Duke  and Emily Lapper , for the \nrespondent.  \n Christine Mohr  and Michelle Kellam , for the intervener the Attorney \nGeneral of Canada.  \n Ryan Cookson and S. Zachary Green , for the intervener the Attorney \nGeneral of Ontario.  \n Pierre -Luc Beauchesne , Marie -Catherine Bolduc  and Laurie Anctil , for \nthe intervener the Attorney General of Quebec.  \n Agnes MacNeil , K.C., and Edward A. Gores , K.C., for the intervener the \nAttorney General of Nova Scotia.  \n2024 SCC 40 (CanLII)\n\n--- Page 25 ---\n \n  Written submissions only by Véronique R. Guitard  and Rose Campbell , for \nthe intervener the Attorney General of New Brunswick.  \n Michael Bodner , for the intervener the Attorney General of Manitoba.  \n Written submissions only by Caroline Davison  and Michael Fleischmann , \nfor the intervener the Attorney General of Prince Edward Island.  \n Noah Wernikowski  and Justin Stevenson , for the intervener the Attorney \nGeneral of Saskatchewan.  \n Brooklyn LeClair , for the intervener the Attorne y General of Alberta.  \n Written submissions only by Mark Ishack  and Thomas Wallwork , for the \nintervener the Attorney General of the Northwest Territories.  \n Written submissions only by I. H. Fraser , for the intervener the Attorney \nGeneral of the Yukon Territory.  \n Roger J.  F. Lepage and Fadi Amine , for the intervener s Groupe Jean Coutu  \n(PJC) inc.  and Pro Doc Ltd.  \n The judgment of Wagner C.J. and Karakatsanis, Martin, Kasirer, \nO’Bonsawin and Moreau JJ. was delivered by  \n2024 SCC 40 (",
    "token_count": 1000,
    "start_token": 10800,
    "end_token": 11800,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 13,
    "source_file": "2024scc40.txt",
    "text": " I. H. Fraser , for the intervener the Attorney \nGeneral of the Yukon Territory.  \n Roger J.  F. Lepage and Fadi Amine , for the intervener s Groupe Jean Coutu  \n(PJC) inc.  and Pro Doc Ltd.  \n The judgment of Wagner C.J. and Karakatsanis, Martin, Kasirer, \nO’Bonsawin and Moreau JJ. was delivered by  \n2024 SCC 40 (CanLII)\n\n--- Page 26 ---\n \n  KARAKATSANIS J. —  \nI. Introduction  \n In an increasingly complex modern world, where governments assume \ngreater regulatory roles in multifaceted areas overlapping jurisdictional boundaries, \nthere is a greater need for cooperation between governments and between courts that \ncross those borders. Ou r Court has recognized this need in a more flexible approach to \ninterjurisdictional cooperation. It is reflected in the interpretative principle of \n“cooperative federalism”; the respect and recognition of each province’s adjudicative \njurisdiction in the sp irit of mutual comity; and the development of procedural \nframeworks to permit cross -border collective actions. It is reflected in the horizontal \ncooperation between governments for the public good.  \n National class actions in Canada, and in particular multi -Crown class \nactions, represent the convergence of these ideas. Fifteen years ago, this Court urged \nprovincial legislatures to “pay more attention to the framework for national class \nactions and the problems they present” ( Canada Post Corp. v. Lépine , 2009 SCC 16, \n[2009] 1 S.C.R. 549, at para. 57). When products, people, and problems cross \njurisdictional boundaries, cooperation and comity are vital to ensure that justice is not \nblocked by provincial borders.  \n The opioid epidemic spanning our country is a star k example of a crisis \nwhich attracts this cooperation and comity. National in scope, it highlights the role a \n2024 SCC 40 (CanLII)\n\n--- Page 27 ---\n \n national class action can play in achieving efficiency, consistency, and access to justice \nfor all those who have experienced harm, regardless of geographic boundaries.  \n The appellants, several pharmaceutical companies which manufacture, \nmarket, and distribute opioid products throughout Canada, challenge s. 11 of British \nColumbia’s Opioid Damages and Health Care Costs Recovery Act , S.B.C. 2018, c. 35  \n(ORA ). The provision authorizes the government of B.C. to bring an action on behalf \nof a class consisting of other provincial, territorial and federal governments in Canada \nto recover their respective health care costs caused by “opioid -related wrong[s]”.  The \nappellants say it does not respect the territorial limits on provincial legislative \ncompetence within the Constitution Act, 1867 . They argue that the framework chosen \nby B.C. to facilitate cooperation and comity, through a law which allows for a natio nal \nmulti -governmental class action, violates our constitutional structure by undermining \nthe sovereignty of other governments in Canada.  \n The ultimate question raised by their appeal is this: Can multiple Canadian \ngovernments join in a single class action,  in one province, before one province’s \nsuperior court, without unconstitutionally sacrificing their autonomy or sovereignty?  \n Specifically, the appellants ask if one province can determine the rules of \na class action that would bind other governments who c hoose to participate. \nConversely, can a government agree to be bound by another province’s rules, even if it \nmay limit the powers of its legislature and its successors?  \n2024 SCC 40 (CanLII)\n\n--- Page 28 ---\n \n \n The appellants say that the answer to these questions must be “no”. They \nsubmit that B. C.’s class action framework in s. 11 is not possible under our \nConstitution, as it would enable the Province to take control over the substantive civil \nrights of other governments. As a representative plaintiff in a multi -Crown class action, \nthe Province o f B.C. could direct litigation on behalf of other sovereign provinces and \nterritories, thereby binding those other governments to its decisions, infringing their \nlitigation autonomy and violating their legislative sovereignty to enact potentially \ncontradic tory laws. The appellants argue that this cannot be reconciled with our \nConstitution, which restrains the territorial reach of provincial legislation to matters \n“[i]n each Province” ( Constitution Act, 1867 , s. 92). \n The courts in these proceedings have disa greed. They concluded s. 11 of \nthe ORA  creates a procedural mechanism which presumptively authorizes B.C. to act \n",
    "token_count": 1000,
    "start_token": 11700,
    "end_token": 12700,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 14,
    "source_file": "2024scc40.txt",
    "text": " legislative sovereignty to enact potentially \ncontradic tory laws. The appellants argue that this cannot be reconciled with our \nConstitution, which restrains the territorial reach of provincial legislation to matters \n“[i]n each Province” ( Constitution Act, 1867 , s. 92). \n The courts in these proceedings have disa greed. They concluded s. 11 of \nthe ORA  creates a procedural mechanism which presumptively authorizes B.C. to act \nas a representative plaintiff in opioid -related proceedings on behalf of other Canadian \ngovernments who choose to participate. They held that t his mechanism falls under the \nProvince’s authority over “[t]he Administration of Justice in the Province” (s.  92(14) \nof the Constitution Act, 1867 ), and is meaningfully connected to B.C. without \nundermining any other government’s sovereignty.  \n I agree with  the courts below. As I shall explain, I do not accept the \nappellants’ position that the legislation deals with substantive, rather than procedural , \nrights.  The purpose and effect of the challenged provision is to create a procedural \nmechanism to promote litigation efficiency by joining the claims of consenting \n2024 SCC 40 (CanLII)\n\n--- Page 29 ---\n \n Canadian Crowns into a single proceeding, while ensuring that each Crown’s claims \nwill be decided i n accordance with their own substantive law. Section 11 falls within \nthe Province’s authority over the “Administration of Justice” under s. 92(14) of the \nConstitution Act, 1867 . \n Section 11 of the ORA  also properly respects the territorial limits under \ns. 92(14), which requires that the Province’s legislative powers be exercised “in the \nProvince”. It is meaningfully connected to B.C. by providing a procedural tool that \nonly applies to one proceeding before B.C.’s courts and affects foreign Crowns only if \nthey consent to have their common issues resolved together. Each of the other Crowns’ \nsubstantive claims remain under the control of their own legislatures; their legislative \nsovereignty is respected.  \n I would dismiss the appeal.  \nII. Background  \n The emergence of na tional class actions in Canada reflects the harmony \nstruck by the chords of intergovernmental cooperation and interjurisdictional comity \nwhich run throughout our federation’s constitutional structure. The three well -\nestablished goals underlying class actio ns — efficiency, access to justice and \ndeterrence — recognized by this Court in  Western Canadian Shopping Centres Inc. v. \nDutton , 2001 SCC 46, [2001] 2 S.C.R. 534, Hollick v. Toronto (City) , 2001 SCC 68, \n2024 SCC 40 (CanLII)\n\n--- Page 30 ---\n \n [2001] 3 S.C.R. 158, and Rumley v. British Columbia , 2001 SCC 69, [2001] 3 S.C.R. \n184, may, in some cases, require intergovernmental cooperation in a federalist system.  \n Federalism is one of the central organizing themes of our Constitution \n(Reference re Secession of Quebec , [1998] 2 S.C.R. 217, at para. 57) . It is “a \nfoundational principle” of our Constitution, meant “to reconcile diversity with unity” \nand to “foster cooperation between Parliament and the provincial legislatures for the \ncommon good” ( References re Greenhouse Gas Pollution Pricing Act , 2021 S CC 11, \n[2021] 1 S.C.R. 175 ( GGPPA Reference ), at para. 48).  \n Our Court has recognized that cooperation and comity are increasingly \nnecessary to the operation of a federal society in the 21st century (see, e.g., Canadian \nWestern Bank v. Alberta , 2007 SCC 22,  [2007] 2 S.C.R. 3, at para. 24). Different levels \nof government are encouraged to work together to establish interlocking and even \noverlapping regulatory regimes to solve interjurisdictional problems (see, e.g., \nReference re Securities Act , 2011 SCC 66, [ 2011] 3 S.C.R. 837, at paras. 57 -62). Courts \nare expected to give comity  — or full faith and credit  — to recognize one another’s \njudgments on subjects which cross provincial boundaries (see, e.g., Hunt v. T&N plc , \n[1993] 4 S.C.R. 289, at p. 324). Anything less would “fly in the face of the obvious \nintention",
    "token_count": 1000,
    "start_token": 12600,
    "end_token": 13600,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 15,
    "source_file": "2024scc40.txt",
    "text": " 2011] 3 S.C.R. 837, at paras. 57 -62). Courts \nare expected to give comity  — or full faith and credit  — to recognize one another’s \njudgments on subjects which cross provincial boundaries (see, e.g., Hunt v. T&N plc , \n[1993] 4 S.C.R. 289, at p. 324). Anything less would “fly in the face of the obvious \nintention of the Constitution to create a single country” ( Morguard Investments Ltd. v. \nDe Savoye , [1990] 3 S.C.R. 1077, at p. 1099).  \n The rise of national class actions is an example of this essential \ncooperation.  While class actions have been available at common law since the 17th \n2024 SCC 40 (CanLII)\n\n--- Page 31 ---\n \n century, class proceedings statutes were first enacted by provincial legislatures in the \nlate 20th century, simplifying the aggregation, prosecution, and determination of these \nclaims th rough a valuable set of procedural tools ( Dutton , at paras. 19 and 26; Hollick , \nat para. 13). The lack of cooperation by governments and parties within these new \nprocedural mechanisms, however, sometimes resulted in overlapping class actions in \nmultiple pr ovinces covering the same claims, the same defendants, and even the same \nplaintiffs.  \n In response to these cross -jurisdictional problems,  several provinces \nchanged their class proceedings statutes to clarify that their superior courts could certify \nan actio n with a class of plaintiffs that included residents outside the province (see \nW. K. Branch and M.  P. Good, Class Actions in Canada  (2nd ed. (loose -leaf)), at \n§§ 12:2-12:9). Nearly all provinces now have legislation enabling non -resident \nplaintiffs to have  their claims adjudicated efficiently in a single proceeding before one \nsuperior court, whose judgment will be respected and enforced by their “home” courts.  \n These national class actions, facilitated by cooperative provincial \nlegislative schemes and the ju dicial recognition of a superior court’s judgments under \nthe rules of private international law, help Canadians to deal with products, people, and \nproblems that cross jurisdictional boundaries. Moreover, multi -Crown class actions are \nan example of horizont al intergovernmental coordination between provinces and the \nfederal government in dealing with complex issues that cross jurisdictional borders.  \n2024 SCC 40 (CanLII)\n\n--- Page 32 ---\n \n \n The opioid epidemic facing Canada is a tragic example of the border -\ncrossing problems which engage such interju risdictional cooperation and comity. The \nscale and scope of the opioid crisis are well known (see, e.g., R. v. Parranto , 2021 SCC \n46, [2021] 3 S.C.R. 366, at paras. 93 -97, per Moldaver J.; Special Advisory Committee \non the Epidemic of Opioid Overdoses, Opioid- and Stimulant -related Harms in \nCanada , September 2024 (online)). Opioids are a powerful class of painkillers. While \nsome opioids have become associated with the illicit drug trade, most have legitimate \nmedical uses when properly administered. When use d improperly, however, opioids \ncan cause addiction.  \n The pleadings claim Canada has experienced high numbers of opioid -\nrelated addictions, illnesses and deaths and that the epidemic has affected every \nprovince and territory in Canada, devastating communiti es, families and lives \nnationwide.  \n Faced with the opioid epidemic, in 2018 B.C. brought a claim against 49 \nmanufacturers, marketers, and distributors of opioid products, which it alleged had \ncontributed to the opioid epidemic by falsely marketing their pr oducts as being less \naddictive and less prone to abuse, tolerance, and withdrawal than other pain \nmedications. B.C. alleged the commission of several common law torts, including \nnegligence, unjust enrichment, fraudulent misrepresentation, and breaches of s . 52 of \nthe Competition Act , R.S.C. 1985, c. C -34. \n2024 SCC 40 (CanLII)\n\n--- Page 33 ---\n \n \n B.C. started this proceeding as a proposed class action under B.C.’s Class \nProceedings Act , R.S.B.C. 1996, c. 50 ( CPA ), seeking certification with itself as the \nrepresentative plaintiff acting on behalf of  a class consisting of all federal, provincial, \nand territorial governments and agencies that had paid healthcare, pharmaceutical and \ntreatment costs",
    "token_count": 1000,
    "start_token": 13500,
    "end_token": 14500,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 16,
    "source_file": "2024scc40.txt",
    "text": " C -34. \n2024 SCC 40 (CanLII)\n\n--- Page 33 ---\n \n \n B.C. started this proceeding as a proposed class action under B.C.’s Class \nProceedings Act , R.S.B.C. 1996, c. 50 ( CPA ), seeking certification with itself as the \nrepresentative plaintiff acting on behalf of  a class consisting of all federal, provincial, \nand territorial governments and agencies that had paid healthcare, pharmaceutical and \ntreatment costs related to opioids.  \n Soon after, legislation was introduced to create a direct, statutory cause of \naction f or B.C. in the litigation it had begun. It introduced new evidentiary rules and \nother procedural mechanisms modeled on B.C.’s former Tobacco Damages and Health \nCare Costs Recovery Act , S.B.C. 2000, c. 30 ( TRA), upheld by this Court in British \nColumbia v.  Imperial Tobacco Canada Ltd. , 2005 SCC 49, [2005] 2 S.C.R. 473 (see \nLegislative Assembly of British Columbia, Official Report of Debates (Hansard) , \nNo. 150, 3rd Sess., 41st Parl., October 1, 2018, at pp. 5331 -32 (Hon. David Eby)). For \nexample, these rules allow statistical information as admissible evidence to prove \ncausation (s. 5), relieve the government from proving the cause of any particular \nindividual’s opioid -related injuries (s.  2(5)(a)), and require the court to presume that \nthose individuals would  not have used opioids without the defendants’ actions (s. 3(2)).  \n Unlike the former TRA, however, s. 11(1)(b) of the ORA  authorizes the \ngovernment of B.C., in its existing proceeding, to “bring an action on behalf of a class \nconsisting of” other provincial , territorial and federal governments in Canada and their \nhealthcare agencies (as B.C. had already done), unless those governments opt out of \nthe class under s. 16 of the CPA .  \n2024 SCC 40 (CanLII)\n\n--- Page 34 ---\n \n \n The ORA  came into force a few months after B.C. had started its \nproceeding base d on the common law and Competition Act  causes of action. B.C. then \nchanged its notice of civil claim to incorporate s.  11 expressly into its pleadings. Its \nlatest amended civil claim now also proposes two sub -classes of plaintiffs: one for all \ngovernments  relying on the common law and Competition Act  causes of action; and \nanother for “governments that have legislation specifically directed at recovery of \ndamages and healthcare costs arising from the Opioid Epidemic” (A.R., vol. IV, at p. \n167; A.R., vol. VI I, at p.  136).  \n This second sub -class reflects the fact that nearly all provinces and \nterritories in Canada have since enacted their own version of an opioid healthcare \nrecovery statute similar to B.C.’s ORA .1 Each statute has a provision that is \nsubstantia lly similar to s. 11 of B.C.’s ORA  (see, e.g., Opioid Damages and Health \nCare Costs Recovery Act , S.A. 2019, c.  O-8.5, s. 13; Opioid Damages and Health Care \nCosts Recovery Act, 2019 , S.O. 2019, c.  17, Sch.  2, s. 12). Many have an additional \nprovision stati ng that if a class action has been commenced by another province, the \ngovernment’s own claim is subject to that jurisdiction’s procedural rules while \nmaintaining the substantive rights within its own ORA -type legislation (see, e.g., \n                                                 \n1 Opioid  Damages and Health Care Costs Recovery Act , S.A. 2019, c. O -8.5; The Opioid Damages and \nHealth Care Costs Recovery Act , S.S. 2020, c. 32; The Opioid Damages and Health Care Costs \nRecovery Act , C.C.S.M. , c. O55; Opioid Damages and Health Care Costs Recover y Act , 2019 , S.O. \n2019, c. 17, Sch. 2; Opioid -related Damages and Health Care Costs Recovery Act , CQLR , c. R-\n2.2.0.0.01 ; Opioid Damages and Health Care Costs Recovery Act , S.N.B",
    "token_count": 1000,
    "start_token": 14400,
    "end_token": 15400,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 17,
    "source_file": "2024scc40.txt",
    "text": " Health Care Costs \nRecovery Act , C.C.S.M. , c. O55; Opioid Damages and Health Care Costs Recover y Act , 2019 , S.O. \n2019, c. 17, Sch. 2; Opioid -related Damages and Health Care Costs Recovery Act , CQLR , c. R-\n2.2.0.0.01 ; Opioid Damages and Health Care Costs Recovery Act , S.N.B. 2023, c. 28 ; Opioid \nDamages and Health -care Costs Recovery Act , S.N.S. 2020, c. 4; Opioid Damages and Health Care \nCosts Recovery Act , S.P.E.I. 2020 , c. 77; Opioid Damages and Health Care Costs Recovery Act , \nS.N.W.T. 2023, c. 18; Opioid Damages and Health Care Costs Recovery Act , S. Nu. 2023, c. 19; \nOpioid Damages and Health Care Co sts Recovery Act , S.N.L. 2019, c. O -6.2 (not yet in force).  \n2024 SCC 40 (CanLII)\n\n--- Page 35 ---\n \n Alberta’s Opioid Damage s and Health Care Costs Recovery Act , s. 12; Ontario’s \nOpioid Damages and Health Care Costs Recovery Act, 2019 , s. 11).  \nIII. Judicial History  \nA. Supreme Court of British Columbia, 2022 BCSC 2147, 77 B.C.L.R. (6th) 313 \n(Brundrett J.)  \n The appellant pharmaceutical companies brought an application for an \norder striking s. 11 of the ORA  as being invalid because it is ultra vires the Legislative \nAssembly of B.C. They claimed that s. 11 was a provision respecting “Property and \nCivil Rights”,  but because it dealt with the civil rights of other governments, it was not \n“in the Province” and thus was not within the Legislature’s competence under s.  92(13) \nof the Constitution Act, 1867  (para. 4).  \n Justice Brundrett instead characterized the provisi on as a “procedural \nmechanism to facilitate a process under the ORA , the CPA  and the Supreme Court Civil \nRules in which the substantive claims of extraterritorial governments may be litigated \nand pursued in a BC court” (para. 58). This procedural mechanism  presumptively \nauthorized B.C. to act on behalf of other governments in ORA -related proceedings, and \nfell within s. 92(14) of the Constitution Act, 1867  under the Province’s authority to \nlegislate regarding “[t]he Administration of Justice in the Province”  (para. 76).  \n2024 SCC 40 (CanLII)\n\n--- Page 36 ---\n \n \n As for whether s. 11 respected the territorial limits of the Province, \nBrundrett J. found that the provision regulated a single proceeding brought in the courts \nof B.C., while providing a right of other governments to have their claims adjudic ated \nin that proceeding if they chose to participate (para. 84). In that respect, even if s. 11 \nfell under s. 92(13),  it still respected the territorial limits of the Constitution Act, 1867 , \nsince it would only affect other governments once they consented to participate in the \nproceeding by either opting in or by declining to opt out (paras. 81 and 87). Although \nthe Province had applied for the class action to be certified on an “opt -in” basis, in \ncontrast to the “opt -out” mechanism in s. 11(2) of the ORA  and s. 16 of the CPA , it \nmade “little real -world difference”, because under either model the choice of other \ngovernments to participate negated any concerns that s. 11 trespassed on their \nlegislative sovereignty (paras. 67 and 81). Justice Brundrett conclud ed that s. 11 was \nintra vires  the B.C. Legislature.  \nB. British Columbia Court of Appeal, 2023 BCCA 306, 79 B.C.L.R. (6th) 1 \n(Newbury J.A., Fisher and Horsman JJ.A. Concurring)  \n The Court of Appeal for B.C. unanimously dismissed the appeal. Justice \nNewbury, wri ting for the court, agreed that s. 11 of the ORA  merely created a \nprocedural mechanism to allow",
    "token_count": 1000,
    "start_token": 15300,
    "end_token": 16300,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 18,
    "source_file": "2024scc40.txt",
    "text": " the B.C. Legislature.  \nB. British Columbia Court of Appeal, 2023 BCCA 306, 79 B.C.L.R. (6th) 1 \n(Newbury J.A., Fisher and Horsman JJ.A. Concurring)  \n The Court of Appeal for B.C. unanimously dismissed the appeal. Justice \nNewbury, wri ting for the court, agreed that s. 11 of the ORA  merely created a \nprocedural mechanism to allow the Province to act on behalf of other Canadian \ngovernments in the proposed class action. Since the substantive claims of other \ngovernments would be dealt with according to their own substantive laws, including \ntheir own ORA -type legislation where available, s. 11 did not affect any substantive \n2024 SCC 40 (CanLII)\n\n--- Page 37 ---\n \n civil rights of foreign Crowns. Like class proceedings statutes, s. 11 was simply a \nprocedural mechanism which fell unde r s. 92(14) and did not fall under s. 92(13).  \n Turning to the provision’s territoriality, Newbury J.A. agreed with \nBrundrett J. that “in the real world” each participating government would choose \nwhether to participate  — either by opting in or declining to opt out  — and that this \nconstituted a “meaningful connection” between those governments’ claims, the \nProvince of B.C., and the Supreme Court of British Columbia (para. 97). Further, s. 11 \ndid not affect the legislative sovereignty of other governments when  they chose to \nconsolidate their claims “to save the expense and inconvenience of many separate \nactions in Canada and thus ultimately to serve the public interest” (para. 100). Although \ns. 11 represented “a bold step, if not an experiment” in the realm of national class \nactions, Newbury J.A. held that it was intra vires  the Province (para. 3).  \nIV. Issues and Positions of the Parties  \n The fundamental issue in this appeal concerns whether s. 11 of the ORA  is \nultra vires  because it falls outside the Province of B.C.’s territorial legislative \ncompetence, as established by s. 92 of the Constitution Act, 1867 . If s. 11 is found to \nbe unconstitutional, this Court must also consider whether it may be saved by the \nancillary pow ers doctrine.  \n The appellants challenge the validity of s. 11 on the basis that it fails to \nrespect the territorial limits placed on the Province of B.C. by s. 92 of the Constitution \n2024 SCC 40 (CanLII)\n\n--- Page 38 ---\n \n Act, 1867 , and is thus of no force and effect under s.  52 of the Constitut ion Act, 1982 . \nThey allege that s. 11 permits the Crown in right of B.C. to take control of, and \nultimately determine, the substantive civil rights of other governments. Thus, it must \nbe classified under B.C.’s authority over “Property and Civil Rights” in  s. 92(13) of the \nConstitution Act, 1867 . Even if fell under s. 92(14), the appellants argue no province \ncould have a meaningful connection to the substantive claims of other governments, \nwhose sovereignty would be infringed if they cannot legislate respec ting the litigation \nof those claims. Section 11 causes other Crowns to lose their right to control the \nlitigation, which binds future governments and violates the principle of parliamentary \nsovereignty  — all substantive effects which have no meaningful con nection to B.C.  \n For its part, B.C. contends that the dominant characteristic of s. 11 is the \ncreation of a procedural mechanism through which it may prosecute an action in B.C \non behalf of other consenting governments seeking recovery for their opioid -related \nexpenses, and as such it should be classified under the Province’s authority over “[t]he \nAdministration of Justice” in s. 92(14). The territorial reach of s.  11 is meaningfully \nconnected to B.C. as it regulates a single claim before the courts of B.C.,  which will \naffect other Crowns only if they choose to participate, and it preserves their right to \nhave their individual claims determined in accordance with their own substantive laws. \nOther governments remain able to legislate regarding the substantive aspects of their \ncauses of action.  \nV. Analysis  \n2024 SCC 40 (CanLII)\n\n--- Page 39 ---\n \n \n Whether s. 11 properly relates to B.C.’s competence to legislate regarding \nmatters “in the Province” is resolved by",
    "token_count": 1000,
    "start_token": 16200,
    "end_token": 17200,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 19,
    "source_file": "2024scc40.txt",
    "text": "ffect other Crowns only if they choose to participate, and it preserves their right to \nhave their individual claims determined in accordance with their own substantive laws. \nOther governments remain able to legislate regarding the substantive aspects of their \ncauses of action.  \nV. Analysis  \n2024 SCC 40 (CanLII)\n\n--- Page 39 ---\n \n \n Whether s. 11 properly relates to B.C.’s competence to legislate regarding \nmatters “in the Province” is resolved by the two -part framework established by this \nCourt in Imperial Tobacco . I must first characterize and classify the challenged \nprovision, before determining whether it respects the other provinces’ territoriality. The \nvalidity of the law enacted by B.C. ultimately depends on whether it is properly “in the \nProvince”, as s. 92 of the Constitution Act, 186 7 requires.  \n The heart of the appellants’ challenge concerns whether the framework \nwhich s. 11 establishes for a national, multi -Crown class action improperly reaches \nbeyond B.C.’s borders, seizes the substantive civil rights of other Crowns, hales them \nbefore B.C.’s courts, and binds their governments to the outcome.  \n I reject this challenge. I conclude that s. 11 is a valid procedural framework \nto facilitate intergovernmental cooperation and to respect interjurisdictional comity, \nempowering our federation to meet its modern challenges.  \n This Court has long recognized that the “rigid, watertight compartments \napproach to the division of legislative power” risks hindering cooperative regulatory \nregimes undertaken in the public interest (see Quebec (Attorney Gen eral) v. Canada \n(Attorney General) , 2015 SCC 14, [2015] 1 S.C.R. 693 ( Quebec (Attorney General) ), \nat para. 17). Between the federal government and the provinces, this idea of cooperation \narises in the principle of “cooperative federalism”, an interpretativ e principle for \napproaching the division of powers (see GGPPA Reference , at para. 50). Horizontally, \nbetween provinces, valid cooperation can manifest as shared participation in \n2024 SCC 40 (CanLII)\n\n--- Page 40 ---\n \n interprovincial trade agreements to ensure seamless regulatory schemes (see, e .g., \nFédération des producteurs de volailles du Québec v. Pelland , 2005 SCC 20, [2005] 1 \nS.C.R. 292, at paras. 4 and 15), in cooperative capital market regulatory systems (see, \ne.g., Reference re Pan -Canadian Securities Regulation , 2018 SCC 48, [2018] 3 S. C.R. \n189, at paras. 1 -7, 19, 21 -22 and 130), and in interlocking class proceedings \nmechanisms like those created by the CPA  and its equivalents in other provinces.  \n In addition to legislative and executive cooperation, this Court has stressed \nthe need for a djudicative comity between the provinces’ superior courts. A level of \nnational cooperation between them is vital to serve the ends of justice for our federation \nin the 21st century (see, e.g., Morguard , at pp. 1099 -1100; Hunt , at pp. 324 -25; Endean \nv. Brit ish Columbia , 2016 SCC 42, [2016] 2 S.C.R. 162, at paras. 4, 17 and 58). Given \nthe comparable quality of justice offered by our courts, and the many aspects of modern \nlife that transcend provincial borders, this Court held that full faith and credit betwee n \ncourts is a constitutional imperative whenever there is a real and substantial connection \nbetween the matter and the court’s territory ( Hunt , at p. 324; see also Sharp v. Autorité \ndes marchés financiers , 2023 SCC 29, at paras. 110 -22). \n An appropriate lev el of cooperation is therefore necessary between the \nlegislative, executive, and judicial branches of government in our constitutional \nstructure. In the analysis which follows, I explain why the mechanism chosen by the \nProvince of B.C. to facilitate this c ooperation is constitutionally valid.  \nA. Relevant Statutory Provisions  \n2024 SCC 40 (CanLII)\n\n--- Page 41 ---\n \n \n Section 11 is the only provision of the ORA  that the appellants challenge. \nIt reads:  \n11 (1) If the government has commenced a proceeding in relation to an \nopioid -related wrong and the proc eeding is ongoing as of the date \nthis section comes into force,  \n \n(a)",
    "token_count": 1000,
    "start_token": 17100,
    "end_token": 18100,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 20,
    "source_file": "2024scc40.txt",
    "text": " this c ooperation is constitutionally valid.  \nA. Relevant Statutory Provisions  \n2024 SCC 40 (CanLII)\n\n--- Page 41 ---\n \n \n Section 11 is the only provision of the ORA  that the appellants challenge. \nIt reads:  \n11 (1) If the government has commenced a proceeding in relation to an \nopioid -related wrong and the proc eeding is ongoing as of the date \nthis section comes into force,  \n \n(a) the proceeding continues in accordance with this Act,  \n \n(b) for the purposes of section 4 of the Class Proceedings Act , the \ngovernment may bring an action on behalf of a class consisting \nof \n \n(i) one or more of the government of Canada and the \ngovernment of a jurisdiction within Canada, and  \n \n(ii) a federal or provincial government payment agency that \nmakes reimbursement for the cost of services that are in the \nnature of health care benefits within the meani ng of this \nAct, \n \n(c) a procedure completed, and an order made, before this section \ncomes into force continues to have effect unless  \n \n(i) it would be inconsistent with this Act, or  \n \n(ii) the court orders otherwise, and  \n \n(d) a procedure that began but was not completed befor e this \nsection comes into force must be completed in accordance with \nthis Act.  \n \n(2) Nothing in subsection (1) (b) of this section prevents a member of \nthe class described in that provision from opting out of the \nproceeding in accordance with section 16 of the Class Proceedings \nAct. \n Section 4 of the CPA , referenced in s. 11(1)(b) of the ORA , sets out the \nrequirements for a court to certify a class action in subss. (1) and (2). Subsections (3) \n2024 SCC 40 (CanLII)\n\n--- Page 42 ---\n \n and (4) deal specifically with the factors a court must consider to co operate with class \nactions covering the same subjects being litigated in other provinces, including whether \nit would be preferable for the plaintiffs’ common issues to be resolved in that other \nforum or in the courts of B.C.  \n Section 16 of the CPA , referenc ed in s. 11(2) of the ORA , reads:  \n16 (1) A member of a class involved in a class proceeding may opt out of \nthe proceeding in the manner and within the time specified in the \ncertification order.  \nB. What Is the Correct Characterization of Section  11, Considering Its Purpose and \nEffects?  \n Turning to the first stage of the Imperial Tobacco  framework, the “pith and \nsubstance” of s. 11 must be identified — that is, its “main thrust, or dominant or most \nimportant characteristic” ( GGPPA Reference , at para. 51 ). The court must characterize \nthe challenged law according to its “leading feature or true character” ( R. v. \nMorgentaler , [1993] 3 S.C.R. 463, at pp. 481 -83), doing so “as precisely as possible” \nwithout regard to its incidental or ancillary aspects ( GGPPA  Reference , at para. 52; see \nalso Imperial Tobacco , at para. 28).  \n In conducting this characterization, courts will look at the law’s purpose \nand effects. A law’s purpose can be determined by examining both intrinsic \nevidence  — that is, the text of the law itself  — and extrinsic evidence  — including \n2024 SCC 40 (CanLII)\n\n--- Page 43 ---\n \n legislative debates, minutes of parliamentary committees, and relevant government \npublications ( Murray -Hall v. Quebec (Attorney General) , 2023 SCC 10, at para. 25). \nA law’s effects can be found by considering bot h its legal effects  — those which flow \ndirectly from the provisions of the statute itself  — and its practical effects  — those \nwhich flow from the application of the law ( Reference re Genetic Non -Discrimination \nAct, 2020 SCC 17, [2020] 2 S.C.R. 283, at para . 51). This is essentially an \n“interpretative exercise [which] is meant to be neither technical nor formalistic” \n(Murray -Hall, at para. 24).  \n The court will approach the question of a law’s validity under the \ninterpretive presumption of constitutionality, assuming that the legislature did not \nintend to exceed its authority if the law can be read to limit it within its proper \njurisdictional bounds ( Reference re Impact Assessment Act , 2023 SCC 23, at para.  72).",
    "token_count": 1000,
    "start_token": 18000,
    "end_token": 19000,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 21,
    "source_file": "2024scc40.txt",
    "text": "ative exercise [which] is meant to be neither technical nor formalistic” \n(Murray -Hall, at para. 24).  \n The court will approach the question of a law’s validity under the \ninterpretive presumption of constitutionality, assuming that the legislature did not \nintend to exceed its authority if the law can be read to limit it within its proper \njurisdictional bounds ( Reference re Impact Assessment Act , 2023 SCC 23, at para.  72). \nThis presumption is especially strong when the attorneys general of the jurisdictions \naffected by the law support its validity ( Kitkatla Band v. British Columbia (Minister of \nSmall Business, Tourism and Culture) , 2002 SCC 31, [2002] 2 S.C.R. 146, at para.  73; \nGoodwin v. British Columbia (Superintendent  of Motor Vehicles) , 2015 SCC 46, \n[2015] 3 S.C.R. 250, at para. 33; OPSEU v. Ontario (Attorney General) , [1987] 2 \nS.C.R. 2, at pp. 19 -20). That said, the court’s role is to adjudicate constitutional \ncompliance and not simply defer to an Attorney General’s opinion of a law’s validity.  \n(1) What Is the Purpose of Section 11?  \n2024 SCC 40 (CanLII)\n\n--- Page 44 ---\n \n \n The appellants urge this Court to find that the purpose of s. 11 is to create \na cause of action for the Crown in right of B.C. to act as a representative plaintiff in a \nclass action on behalf of a class of “foreign” Crowns, since it could not do so under the \nCPA  alone. Because the Crown is not a “person” as that statute requires, it could not \notherwise act as a plaintiff in a class action. The appellants argue that, since s. 29 of the \nInterpret ation Act , R.S.B.C. 1996, c.  238, and s. 1 of the Crown Proceeding Act , \nR.S.B.C. 1996, c.  89, both exclude the Crown from the definition of a “person”, the \npurpose of s. 11 is to create substantive rights for the Crown in right of B.C. and the \nother provin ces which they formerly lacked. This argument requires consideration of \nwhether, without s. 11, a Crown is a “person” or “a class of persons” as ss. 2(1) and \n4(1)(b) of the CPA  require.  \n I would not give effect to the appellants’ submission on s. 11’s purp ose. In \nCanadian law, the term “the Crown” is used as both a personification of the state and \nin reference to the Sovereign, that is, the physical, natural person of His Majesty the \nKing ( Attorney General of Quebec v. Labrecque , [1980] 2 S.C.R. 1057, at p.  1082; \nVerreault (J.E.) & Fils Ltée v. Attorney General (Quebec) , [1977] 1 S.C.R. 41, at p. \n47; P.  W. Hogg, P.  J. Monahan and W.  K. Wright, Liability of the Crown  (4th ed. \n2011), at p. 12; see also M. -F. Fortin, “The King’s Two Bodies and the Canadian Offi ce \nof the Queen” (2021), 25 Rev. Const. Stud.  117). In this latter sense, as a natural person \n“the Crown” has many of the same common law powers as any other individual, unless \nthose powers have been expressly narrowed by statute ( Attorney General for Onta rio \nv. Fatehi , [1984] 2 S.C.R. 536, at p.  551; see also K.  Horsman and G. Morley, \n2024 SCC 40 (CanLII)\n\n--- Page 45 ---\n \n Government Liability: Law and Practice  (loose -leaf), at §§ 1:10 -1:11). For example, \nthe Crown as a natural person may hold property, enter into contracts, and spend money \nlike any other person (see Hogg, Monahan and Wright, at p. 12).  \n When the Crown participates as a plaintiff in litigation to enforce a \ncommon law or statutory cause of action, it is typically acting in this capacity as a \nnatural person ( Fatehi , at pp.",
    "token_count": 1000,
    "start_token": 18900,
    "end_token": 19900,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 22,
    "source_file": "2024scc40.txt",
    "text": " (loose -leaf), at §§ 1:10 -1:11). For example, \nthe Crown as a natural person may hold property, enter into contracts, and spend money \nlike any other person (see Hogg, Monahan and Wright, at p. 12).  \n When the Crown participates as a plaintiff in litigation to enforce a \ncommon law or statutory cause of action, it is typically acting in this capacity as a \nnatural person ( Fatehi , at pp. 551 -52; Hogg, Monahan and Wright, at p. 74). The Crown \nmay sue for damage to its civil rights in the same way as any other person, without a \nstatutory grant of authority to do so ( R. v. Murray , [1967] S.C.R. 262; Horsman and \nMorley, at §  1:11).  \n However, the Crown as a natural person is subject to its Parliament or its \nLegislature (see P.  W. Hogg and W.  K. Wright, Constitutional Law of Canada  (5th ed. \nSupp.), at § 10:13). So while the Crown has the right to sue to enforce its rights, this \nability may be limited by a  statute if, for example, the Crown is excluded from a \nparticular right or procedure.  \n The appellants argue that s. 29 of the Interpretation Act  is such a limitation \non the Crown’s capacity to sue under the CPA . Section 29 of the Interpretation \nAct — which provides general statutory definitions applicable to all legislation in \nB.C. — defines a “person” as including “ a corporation , partnership or party, and the \npersonal or other legal representatives of a person to whom the context can apply \naccording to law” . That same provision states that a “‘corporation’ .  . . includes a \ncorporation sole other than  [His] Majesty”. The appellants suggest that connecting \n2024 SCC 40 (CanLII)\n\n--- Page 46 ---\n \n these phrases leads inevitably to the conclusion that a “corporation” is a “person” unless \nthat corporati on is “[His] Majesty”.  \n I am not persuaded these definitions exclude the Crown from being a \n“person” for the purposes of the CPA  and s. 11 of the ORA . Section 29 of the \nInterpretation Act  states that a “‘person’ includes  a corporation” “other than [His] \nMajesty”. The word “includes” typically functions as a legislative signal that these \nterms are offered as examples, not as exhaustive meanings (see R. v. McColman , 2023 \nSCC 8, at para. 38; R. Sullivan, The Construction of Statutes  (7th ed. 2022), at § 4.04). \nThe non -exhaustive definition of a “person” in the Interpretation Act  does not displace \nthe ordinary meaning of this term, including the common law inclusion of the Crown \nas a natural person, capable of suing to enforce its rights (see R. v. British Columb ia, \n[1992] 4 W.W.R. 490 (B.C.S.C.), at para.  17; Sullivan, at § 4.04). Nor does the \nexclusion of the Crown from laws applying to private corporations, which s. 29 effects, \nlimit its ability to sue as a person.  \n As for s. 1 of the Crown Proceeding Act , it de fines a “person” as not \nincluding “the government”. However, that definition applies “[i]n this Act”, unlike the \ngeneral definitions in the Interpretation Act . The Crown Proceeding Act  deals with \nwhen the Crown may be sued as a defendant . It is a statutory  override of the common \nlaw position that the Crown is immune from liability, and as such does not speak to \nwhere the Crown is suing  as a plaintiff  (see Nelson (City) v. Marchi , 2021 SCC 41, \n[2021] 3 S.C.R. 55, at para. 38; Hogg and Wright, at § 10:12).  \n2024 SCC 40 (CanLII)\n\n--- Page 47 ---\n \n \n I conclude the Crown in right of B.C. was already a “person” capable of \nenforcing its civil rights as either a representative or non -representative plaintiff under \nthe CPA . \n The same conclusion applies to “foreign” Crowns. They may sue as a \n“person” under the  CPA . As similarly natural persons, foreign Crowns “may sue in any \nCourt having jurisdiction in the particular matter",
    "token_count": 1000,
    "start_token": 19800,
    "end_token": 20800,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 23,
    "source_file": "2024scc40.txt",
    "text": " SCC 40 (CanLII)\n\n--- Page 47 ---\n \n \n I conclude the Crown in right of B.C. was already a “person” capable of \nenforcing its civil rights as either a representative or non -representative plaintiff under \nthe CPA . \n The same conclusion applies to “foreign” Crowns. They may sue as a \n“person” under the  CPA . As similarly natural persons, foreign Crowns “may sue in any \nCourt having jurisdiction in the particular matter” ( McNamara Construction (Western) \nLtd. v. The Queen , [1977] 2 S.C.R. 654, at p. 660; see also Hogg, Monahan and Wright, \nat p. 493). “The C rown in right of a province (or the Dominion) has the power of a \nnatural person .  . . and is not subject to territorial restraints in exercising such common \nlaw powers” (Hogg and Wright, at §  13:8; see also Horsman and Morley, at §  1:11).  \n Leaving aside th e concerns raised about the effects of a multi -Crown class \naction on Crown autonomy or parliamentary sovereignty, there is nothing in the CPA , \nthe Interpretation Act , or the Crown Proceeding Act  that prevents  either the Crown in \nright of B.C. or any “foreign” Crowns from satisfying the most basic requirement to \nparticipate in a class action: to be “a member of a class of persons” ( CPA , s. 2(1)). \nWhen one or more Crowns sue as plaintiffs, their rights “are no d ifferent from those of \nthe subject, and never were” (Horsman and Morley, at § 1:11).  \n Further, s. 11 does not act on its own. Section 11(1)(b) allows B.C. to \n“bring an action” under the CPA  — a purely procedural statute which this Court has \nheld neither giv es nor takes away substantive rights (see Pro-Sys Consultants Ltd. v. \nMicrosoft Corporation , 2013 SCC 57, [2013] 3 S.C.R. 477, at para. 133). As a result, \n2024 SCC 40 (CanLII)\n\n--- Page 48 ---\n \n I reject the appellants’ suggestion that the purpose of s. 11 was to give substantive rights \nto the C rown in right of B.C., or to take substantive rights from foreign Crowns.  \n Rather, the intrinsic evidence from the text of s. 11 strongly indicates that \nits purpose is to provide a procedural mechanism explaining how the rest of the \nORA  — including the stat utory cause of action it provides to B.C. and its various other \nunique evidentiary and procedural rules  — applies to B.C.’s ongoing proceeding after \nthe ORA  came into force. The provision does not create a new proceeding. Instead, s. \n11(1)(a), along with t he preamble to the provision, identifies this proceeding as the \nsubject of the ORA , and states that if it remained ongoing after the ORA  came into force, \nit would continue in accordance with this Act. Section 11(1)(b) authorizes the \ngovernment to bring its  action on behalf of other Canadian governments and their \nhealth care agencies, confirming that the government’s claim, brought under the \nmechanisms already available to it in the CPA , remained effective, while also placing \nboundaries around who the govern ment may propose to include in the class. Section \n11(1)(c) states that if the procedure was completed or a court order was made, it would \ncontinue to have effect unless inconsistent with the ORA . And finally, s. 11(2) states \nthat the ability for proposed c lass members to opt out of the proceeding under s.  16 of \nthe CPA  remained unchanged. The text of s. 11 is tightly oriented around the continued \nefficacy of B.C.’s existing proceeding and the benefits which the ORA  would provide \nit, including the increased efficiency that a multi -Crown class action would offer to \neveryone involved.  \n2024 SCC 40 (CanLII)\n\n--- Page 49 ---\n \n \n This purpose of s. 11 is clear from the entire context of the ORA . While a \ncourt must characterize the challenged provisions rather than the entire law, the \ncharacter of the provi sion must be assessed in the context of the larger statutory scheme. \nIts relationship to that larger scheme “may be an important consideration in \ndetermining its pith and substance” ( Quebec (Attorney General) , at para. ",
    "token_count": 1000,
    "start_token": 20700,
    "end_token": 21700,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 24,
    "source_file": "2024scc40.txt",
    "text": "CanLII)\n\n--- Page 49 ---\n \n \n This purpose of s. 11 is clear from the entire context of the ORA . While a \ncourt must characterize the challenged provisions rather than the entire law, the \ncharacter of the provi sion must be assessed in the context of the larger statutory scheme. \nIts relationship to that larger scheme “may be an important consideration in \ndetermining its pith and substance” ( Quebec (Attorney General) , at para. 30). Several \nprovisions in the ORA  grant benefits to the proceeding identified by s. 11. Most \nsignificant is the “direct and distinct action” that the ORA grants to B.C. (ss.  2 and 3). \nIn addition, provisions permit a finding of joint liability between multiple defendants \n(ss. 4, 7 and 8) and  the evidence a court may consider to establish causation and \nquantification of damages (s. 5). Others are simply meant to clarify what will happen \nwhen the statute comes into force, similar to s. 11 itself. For example, s. 6 extends any \napplicable limitat ions period, s. 10 provides for the retroactive effect of the legislation, \nand s. 12 states that any settlement would continue to have effect. In that context, s. 11 \nis meant to provide the mechanism through which these various substantive and \nprocedural p rovisions apply to the proceeding already progressing before the court — \na conclusion reinforced by s. 11’s placement in the statute immediately following the \nretroactive effect created by s. 10.  \n The extrinsic evidence supports this interpretation. When th e government \nof B.C. announced it was beginning this litigation, its news release stated that it would \nsoon introduce legislation “[t]o assist the court process” (BC Government News, \nBritish Columbia files lawsuit against opioid industry , August 29, 2018 ( online)). \nWhen the ORA  was later brought before the Legislative Assembly, the Attorney \n2024 SCC 40 (CanLII)\n\n--- Page 50 ---\n \n General stated that the law was intended to “allow [the] government to proceed in its \nlitigation with opioid manufacturers and wholesalers on a similar basis to that in the \ntobacco case” ( Official Report of Debates (Hansard) , October  1, 2018, at p. 5331 (Hon. \nDavid Eby)). Acknowledging the ongoing proceeding, the Attorney General noted at \nthe bill’s second reading that “[t]he class action that has been commenced will be \ncontinued under this act, and this act will serve to extend the procedural rules included \nwithin it to the action in progress” ( Official Report of Debates (Hansard) , No.  152, 3rd \nSess., 41st Parl., October 2, 2018, at p. 5390 (Hon. David Eby)).  \n I agree with  B.C. and the courts below. I do not accept that the purpose of \ns. 11 of the ORA  was to create substantive rights for the Crown by enabling it to engage \nin litigation under the CPA  which it could not otherwise do. Based on both the intrinsic \nand extrinsic evidence, the purpose of s. 11 is to provide a procedural mechanism \nthrough which the broader provisions in the ORA  could apply to B.C.’s existing, \nproposed multi -Crown class action.  \n(2) What Are the Effects of Section 11?  \n The appellants submit that s. 11 impa cts the substantive rights of foreign \nCrowns by forcing them to arrogate to the government of B.C. their “litigation \nautonomy” (a collection of substantive civil rights related to the Crown’s sovereign \nability to independently litigate their own causes of action and to control the conduct \nof that litigation) (A.F., at paras. 63 -64). They say, it also forces foreign Crowns to \nmake the unconstitutional choice about opting in or opting out of this class action.  \n2024 SCC 40 (CanLII)\n\n--- Page 51 ---\n \n \n B.C. counters that Crowns must always sacrifice aspects of “litigation \nautonomy” when they litigate in courts outside their home jurisdiction. This does not \nviolate any constitutional principle, even when Crowns participate through the \nprocedural mechanisms provided by class proceedings statutes. The ef fect here is \nlimited to this single proceeding which preserves the substantive rights of other \nparticipating governments in accordance with their own laws.  \n An individual’s “litigation autonomy” has been described as an important \ncollection of rights, such as the right to appoint counsel",
    "token_count": 1000,
    "start_token": 21600,
    "end_token": 22600,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 25,
    "source_file": "2024scc40.txt",
    "text": "autonomy” when they litigate in courts outside their home jurisdiction. This does not \nviolate any constitutional principle, even when Crowns participate through the \nprocedural mechanisms provided by class proceedings statutes. The ef fect here is \nlimited to this single proceeding which preserves the substantive rights of other \nparticipating governments in accordance with their own laws.  \n An individual’s “litigation autonomy” has been described as an important \ncollection of rights, such as the right to appoint counsel of choice, the right to \nparticipate in developing litigation strategy, and the right to negotiate a settlement to \nthe action ( Johnson v. Ontario , 2022 ONCA 725, 475 D.L.R. (4th) 344, at para. 47; \nCoburn and Watson’s Metropol itan Home v. Home Depot of Canada Inc. , 2019 BCCA \n308, 438 D.L.R. (4th) 533, at para. 14). “Our society places a high premium on a \nperson’s ability to initiate and participate in litigation as an incident of personal \nautonomy” ( Johnson v. Ontario , 2021 ONC A 650, 158 O.R. (3d) 266, at para. 16). \nWhen an individual chooses to participate as a member in a class action, they \nnecessarily also choose to give up some of these rights as “the price paid to receive the \nbenefit from a class proceeding” ( Coburn and Wat son’s Metropolitan Home , at para. \n14; M.  H. Redish, Wholesale Justice: Constitutional Democracy and the Problem of \nthe Class Action Lawsuit  (2009), at pp. 135 -75). \n2024 SCC 40 (CanLII)\n\n--- Page 52 ---\n \n \n In multi -Crown class actions, this choice means that the government of the \nday may bind its successors to the choice of ceding some of its litigation rights. Does \nthis force an unconstitutional sacrifice of substantive rights on foreign Crowns?  \n My answer is “no”. While participation in a class action involves some \nsacrifice of litigation autonomy , this does not mean that s. 11 is a substantive provision, \nor that it effects an unconstitutional sacrifice of substantive rights.  \n Whenever a Crown chooses to engage in litigation to enforce its civil \nrights, including in its own territory, it loses aspec ts of litigation autonomy  — a choice \nwhich may have binding consequences for its successors, while not necessarily forcing \na sacrifice of substantive rights on them. As I have explained, a Crown has the same \npowers as an individual when acting as a litigan t to enforce its civil rights. Like any \nother litigant, a Crown may not withdraw from or control proceedings once an \nindependent court is seized with the claim and matters relating to its litigation \nautonomy are often at the court’s discretion. For example , a judge is entitled to decline \nto enforce a settlement agreed to by the parties (see, e.g., Wannan v. Hutchison , 2020 \nBCSC 1233, 74 C.P.C. (8th) 222; Milios v. Zagas  (1998), 38 O.R. (3d) 218 (C.A.)). A \njudge may also refuse to allow a plaintiff to withdr aw or discontinue an action in certain \ncircumstances (see, e.g., DLC Holdings Corp. v. Payne , 2021 BCCA 31, 456 D.L.R. \n(4th) 337; Dubuc v. 1663066 Ontario Inc. , 2009 ONCA 914, 99 O.R. (3d) 476; \nPoffenroth Agri Ltd. v. Brown , 2020 SKCA 121, 65 C.P.C. (8th) 348). Thus, the \n2024 SCC 40 (CanLII)\n\n--- Page 53 ---\n \n consequences of many litigation choices deprive the parties of their freedom to act as \nthey might wish.  \n When a Crown chooses to litigate in a different jurisdiction, this choice \nwill have even more significant, binding consequences. The Cro wn in right of Canada \nor a province can sue in whatever province has jurisdiction over the claim, but a Crown \nthat chooses to litigate in another province must subject itself to the procedural rules of \nthat forum (see McNamara Construction , at p. 660; Hogg , Monahan and Wright, at \np. 493; Horsman and Morley, at § 13:14). Those procedural rules are controlled by that \nother province’s legislature. As the appellants acknowledged during the hearing, a \nCrown’s submission",
    "token_count": 1000,
    "start_token": 22500,
    "end_token": 23500,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 26,
    "source_file": "2024scc40.txt",
    "text": " province has jurisdiction over the claim, but a Crown \nthat chooses to litigate in another province must subject itself to the procedural rules of \nthat forum (see McNamara Construction , at p. 660; Hogg , Monahan and Wright, at \np. 493; Horsman and Morley, at § 13:14). Those procedural rules are controlled by that \nother province’s legislature. As the appellants acknowledged during the hearing, a \nCrown’s submission to the procedural rules of another jurisdi ction in ordinary litigation \ndoes not violate any constitutional principle (transcript, day 1, at p. 6; see Hogg and \nWright, at §  10:20). They argue, however, that the degree of abandonment of litigation \nautonomy that a multi -Crown class action would requi re goes too far and violates the \nConstitution.  \n Granted, as a participant in a class action, a Crown would sacrifice more \naspects of its litigation autonomy  — but only if it chooses to do so through the opt -in \nor opt -out mechanism. That procedural right has  been recognized as “[t]he primary \nprotection for the absent class members in the class proceeding process” ( 1250264 \nOntario Inc. v. Pet Valu Canada Inc. , 2013 ONCA 279, 362 D.L.R. (4th) 88, at para. \n41, quoting 1176560 Ontario Ltd. v. Great Atlantic & Pac ific Co. of Canada Ltd.  \n(2002), 62 O.R. (3d) 535 (S.C.J.), at para. 75). In choosing to participate by opting in \n2024 SCC 40 (CanLII)\n\n--- Page 54 ---\n \n or not opting out, a class member, including a Crown, gains the benefits of class actions \n(such as cost savings and the avoidance of duplicativ e proceedings) in exchange for the \nburdens (such as being bound by the decisions of the representative plaintiff) (see \nCoburn and Watson’s Metropolitan Home , at paras. 14 -15). That is why the notice \nrequirements associated with the opt -in/opt -out mechanism  are such an important \nprocedural protection, to make sure that a class member knows of the rights they would \nsacrifice through their participation (see Lépine , at paras. 42 -43; Dutton , at para. 49; \nCurrie v. McDonald’s Restaurants of Canada Ltd.  (2005), 250 D.L.R. (4th) 224 (Ont. \nC.A.), at para. 28; Herold v. Wassermann , 2022 SKCA 103, 473 D.L.R. (4th) 281, at \npara. 36). Once properly notified, the choice of a class member to participate represents \nan exercise of litigation autonomy, although one  which involves sacrificing other \nelements of autonomy.  \n Even at that point, many aspects of litigation autonomy remain available \nthrough the procedural protections offered to non -representative plaintiffs within class \nproceedings, including a foreign Crown . For example, a court keeps the discretion to \nallow a class member to opt in or out late, if they can show they were not aware of the \nproceeding or the harm they had suffered (see CPA , ss. 8(3) and 10;  Fitzsimmons v. Cie \nmatériaux de construction BP Canad a, 2016 QCCS 1446; Branch and Good, at § 11:1). \nAt any time, the court may permit a class member to participate in the proceeding as \nan intervener to make sure their interests are fairly and adequately represented (see \nCPA , ss. 12 and 15(1); see also Tatas kweyak Cree Nation v. Canada (A.G.) , 2021 \nMBQB 153;  Branch and Good, at § 16:6). Class members may apply to replace the \n2024 SCC 40 (CanLII)\n\n--- Page 55 ---\n \n representative plaintiff if they believe they are not adequately representing the class \n(see CPA , ss. 8(3) and 10(1); Logan v. Ontario ( Minister of Health) (2003), 36 C.P.C. \n(5th) 176 (Ont. S.C.J.); Branch and Good, at § 16:4). Class members may also object \nto a proposed settlement (see CPA , s. 35; Dabbs v. Sun Life Assurance Co. of Canada  \n(1998), 40 O.R. (3d) 429 (",
    "token_count": 1000,
    "start_token": 23400,
    "end_token": 24400,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 27,
    "source_file": "2024scc40.txt",
    "text": ") and 10(1); Logan v. Ontario ( Minister of Health) (2003), 36 C.P.C. \n(5th) 176 (Ont. S.C.J.); Branch and Good, at § 16:4). Class members may also object \nto a proposed settlement (see CPA , s. 35; Dabbs v. Sun Life Assurance Co. of Canada  \n(1998), 40 O.R. (3d) 429 (C.J. (Gen. Div.)); Branc h and Good, at § 17:2). Class \nmembers can even apply for leave to act as a representative plaintiff to prosecute an \nappeal from an order made in a class proceeding where the representative plaintiff \ndeclines to act (see CPA , s. 36(2); Leonard v. The Manufa cturers Life Insurance \nCompany , 2022 BCCA 28, 75 B.C.L.R. (6th) 235, at para. 16; Branch and Good, at § \n21:1). This is in addition to the court’s general supervisory jurisdiction over the \nproceeding, which is triggered from the moment the proposed class ac tion begins and \nobliges the court to make sure the interests of the class members are protected (see \nCPA , s. 12; Coburn and Watson’s Metropolitan Home , at para. 14; W.  K. Winkler et \nal., The Law of Class Actions in Canada  (2014), at p. 20).  \n These procedura l protections, in class proceedings statutes and in the \ncourt’s inherent jurisdiction, protect those aspects of a class member’s litigation \nautonomy otherwise sacrificed when participating in a class action. Placing too high of \na protective fence around th e litigation autonomy of a class member, including a \nCrown, would likely extinguish many benefits that class proceedings statutes are \nintended to provide (see Berry v. Pulley , 2011 ONSC 1378, 106 O.R. (3d) 123, at \npara.  62; J. Cassels and C. Jones, The Law  of Large -Scale Claims: Product Liability, \nMass Torts, and Complex Litigation in Canada  (2005), at pp. 434 -38). \n2024 SCC 40 (CanLII)\n\n--- Page 56 ---\n \n \n Thus, participating in class proceedings involves both benefits and burdens \nfor a participant’s litigation autonomy. When a Crown takes the bene fits of a class \nproceedings statute, it also accepts its burdens ( Alberta Government Telephones v. \nCanada (Canadian Radio -television and Telecommunications Commission) , [1989] 2 \nS.C.R. 225, at p. 284). It does not violate the Crown’s autonomy for it to acc ept the \nconsequences of its litigation choices as a plaintiff.  Consequences are not substantive \nlaw. \n Nor do these consequences on the Crown’s litigation choices render s. 11 \nof the ORA  a provision dealing with substantive civil rights simply because those \nchoices may affect the Crown’s substantive rights. While participation as a class \nmember undoubtedly affects  substantive rights, the ability to participate in a class is \nonly a procedural right ( AIC Limited v. Fischer , 2013 SCC 69, [2013] 3 S.C.R. 949, at \npara. 34). This Court has repeatedly affirmed that class proceedings legislation is \nprocedural and does not change or create substantive rights (see, e.g., Bisaillon v. \nConcordia University , 2006 SCC 19, [2006] 1 S.C.R. 666, at para. 17; Pro-Sys \nConsultant s, at paras. 131 -33; Pioneer Corp. v. Godfrey , 2019 SCC 42, [2019] 3 S.C.R. \n295, at para. 116). The substantive rights of any foreign Crowns who choose to \nparticipate in this proceeding will still be determined in accordance with their own \nlaws, which rema in subject to change by their legislature and its successor \ngovernments.  \n2024 SCC 40 (CanLII)\n\n--- Page 57 ---\n \n \n I agree with the courts below, therefore, that the legal effects of s. 11 are \nto regulate how B.C.’s existing proceeding, and the procedural mechanisms from the \nCPA  which apply to tha t proceeding, would continue in a modified form after the ORA  \ncame into force. Section 11 authorizes the government of B.C. to bring this proposed \nclass action, on behalf of those potential class members in s. ",
    "token_count": 1000,
    "start_token": 24300,
    "end_token": 25300,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 28,
    "source_file": "2024scc40.txt",
    "text": "II)\n\n--- Page 57 ---\n \n \n I agree with the courts below, therefore, that the legal effects of s. 11 are \nto regulate how B.C.’s existing proceeding, and the procedural mechanisms from the \nCPA  which apply to tha t proceeding, would continue in a modified form after the ORA  \ncame into force. Section 11 authorizes the government of B.C. to bring this proposed \nclass action, on behalf of those potential class members in s. 11(1)(b). Section 11 also \nextends to this proc eeding the additional substantive rights and remedies that the ORA \nprovides exclusively to B.C., while the substantive rights of foreign Crowns who \nchoose to participate under these procedural rules remain unchanged.  \n Its practical effects are similarly con strained: it merely requires foreign \nCrowns to choose whether they wish to accept the procedural benefits and burdens of \nthe class action that s. 11 authorizes the Crown in right of B.C. to bring on their behalf, \nafter considering the consequences that thi s may have on their rights. Far from offering \nCrowns an “unconstitutional choice”, as the appellants describe it (A.F., at paras. 3 and \n77), s. 11 lets Crowns exercise their autonomy and choose whether it is in their best \ninterests to seek recovery for the ir opioid -related harms in a single, consolidated \nproceeding, or to opt out and go it alone. As the Attorneys General for the Northwest \nTerritories and Prince Edward Island point out, the existence of this choice may be the \nonly way that smaller jurisdicti ons could achieve recovery (I.F., Attorney General of \nthe Northwest Territories, at paras. 11 -22; I.F., Attorney General of Prince Edward \nIsland, at para. 18). The appellants’ arguments, if accepted, would prevent the Crowns \nfrom exercising their autonomy to efficiently pursue their claims collectively by telling \nthem that this is not a choice they can make. I conclude that a government can agree to \n2024 SCC 40 (CanLII)\n\n--- Page 58 ---\n \n be bound by another province’s rules in a class action proceeding, even if the \nconsequences may limit the pow ers of its legislature and its successors to avoid the \nconsequences of that choice.  \n(3) What Is Section 11’s Pith and Substance?  \n In sum, the purpose and effect of s. 11 deal with the promotion of litigation \nefficiency by joining the claims of consenting Crowns  into the single proceeding \nalready before the courts of B.C., so their individual claims can benefit from the \nefficiency and consistency that class actions and the ORA  provide.  \n The courts below were correct in finding that the pith and substance of s. \n11 is the creation of a procedural mechanism for the application of the ORA  to the \nexisting opioid -related proceeding, that the Province of B.C. is authorized to continue \nas a representative plaintiff on behalf of other Canadian governments who choose to \nparticipate.  \nC. Is Section 11 Classified Under Section 92(13), “Property and Civil Rights”, or \nUnder Section  92(14), “The Administration of Justice”?  \n After determining a law’s pith and substance, it must be “classified” by \nassigning it to one of the legislative heads of power within ss. 91 and 92 of the \nConstitution Act, 1867  (Quebec (Attorney General) , at para. 32).  \n2024 SCC 40 (CanLII)\n\n--- Page 59 ---\n \n \n First, I have concluded that s. 11 is procedural and does not deal with \nsubstantive rights. Accordingly, s. 11 does not fall under s. 92(13), as th e pith and \nsubstance of s. 11 does not deal with “Property and Civil Rights”.  \n Instead, I conclude that s. 11 is properly classified under s. 92(14) of the \nConstitution Act, 1867 , which grants the provinces the authority to legislate in relation \nto “[t]he A dministration of Justice in the Province, including the Constitution, \nMaintenance, and Organization of Provincial Courts, both of Civil and of Criminal \nJurisdiction, and including Procedure in Civil Matters in those Courts.” This language \nis intentionally broad, since “[b]efore Confederation, the Provinces exercised \nuntrammeled powers in respect of the Administration of Justice, both civil and \ncriminal” ( Di Iorio v. Warden of the Montreal Jail , [1978] 1 S.C.R. 152, at p. 204). \nHence, this provision provides  a non -exhaustive list of",
    "token_count": 1000,
    "start_token": 25200,
    "end_token": 26200,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 29,
    "source_file": "2024scc40.txt",
    "text": "Jurisdiction, and including Procedure in Civil Matters in those Courts.” This language \nis intentionally broad, since “[b]efore Confederation, the Provinces exercised \nuntrammeled powers in respect of the Administration of Justice, both civil and \ncriminal” ( Di Iorio v. Warden of the Montreal Jail , [1978] 1 S.C.R. 152, at p. 204). \nHence, this provision provides  a non -exhaustive list of examples that the provinces may \nlegislate in relation to, without limiting the provinces’ authority to those matters alone \n(pp. 204 -5). \n Under this head of power, the provinces may “enact laws and adopt \nregulations pertaining to co urts, rules of court and civil procedure” ( Ontario v. \nCriminal Lawyers’ Association of Ontario , 2013 SCC 43, [2013] 3 S.C.R. 3, at para. \n33; see also Caron v. Alberta , 2015 SCC 56, [2015] 3 S.C.R. 511, at para. 79). A law \nwill generally fall under s.  92(14 ) when it applies to the administrative functioning of \na province’s courts or to the procedural functioning of actions taking place before the \nprovince’s courts ( Castillo v. Castillo , 2005 SCC 83, [2005] 3 S.C.R. 870, at para. 37, \n2024 SCC 40 (CanLII)\n\n--- Page 60 ---\n \n per Bastarache J., concur ring; see also Criminal Lawyers’ Association of Ontario , at \npara. 33).  \n Section 11 of the ORA  is a procedural mechanism which operates with the \npurely procedural CPA  and presumptively authorizes the government of B.C. to act on \nbehalf of a class of consenting Canadian governments. Like all procedural rules, s. 11 \nwill play a role in the resolution of substantive rights and affects them to some extent, \nbut s. 11 neithe r creates nor changes substantive rights. Rather, s.  11 helps Crowns to \ncooperate in a collective pursuit of their individual claims, and assists B.C.’s courts in \npresiding over that pursuit.  \nD. Is Section 11 Improperly Extraterritorial?  \n Turning to the second  stage of the Imperial Tobacco  framework, the \nquestion is whether the challenged legislation respects the territorial limits of provincial \npower. These limits are found in both the opening words of s. 92, which state that \nprovincial legislatures may exclus ively make laws in relation to the listed subjects “In \neach Province”, and by the language of several heads of power themselves, which \nrequires that the laws be in relation to matters “in the Province” (e.g., s. 92(8), (12), \n(13), (14) and (16)).  \n The terri torial limitations on provincial powers “reflect the requirements \nof order and fairness underlying Canadian federal arrangements” ( Imperial Tobacco , \nat para. 27; see also Reference re Upper Churchill Water Rights Reversion Act , [1984] \n2024 SCC 40 (CanLII)\n\n--- Page 61 ---\n \n 1 S.C.R. 297 ( Churchi ll Falls ), at p. 328; Club Resorts Ltd. v. Van Breda , 2012 SCC \n17, [2012] 1 S.C.R. 572, at para. 31). They serve two purposes: they ensure provincial \nlegislation has a meaningful connection to the province, and that it pays respect to the \nsovereignty of ot her provinces within their respective legislative spheres ( Imperial \nTobacco , at para. 27). Where the pith and substance of the law relates to something \nintangible, as it does here, the court must ask if the law would respect the dual purposes \nof the territ orial limits in s. 92: does it have a meaningful connection to the enacting \nprovince; and does it respect the legislative sovereignty of other territories (para. 36)? \nIf so, the legislation is valid.  \n(1) Is There a Meaningful Connection Between Section 11 and the Territory \nof B.C., the Subject Matter of the Provision, and the Parties Who Are Made \nSubject to It?  \n The requirement, within the Imperial Tobacco framework, that a law must \nhave a “meaningful connection” to the enacting jurisdiction (para.  27), is based  on the \nconcern that state power be exercised legitimately (see Van Breda , at para. 31). A \n“family of tests” has arisen to assess whether a connection",
    "token_count": 1000,
    "start_token": 26100,
    "end_token": 27100,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 30,
    "source_file": "2024scc40.txt",
    "text": " the Territory \nof B.C., the Subject Matter of the Provision, and the Parties Who Are Made \nSubject to It?  \n The requirement, within the Imperial Tobacco framework, that a law must \nhave a “meaningful connection” to the enacting jurisdiction (para.  27), is based  on the \nconcern that state power be exercised legitimately (see Van Breda , at para. 31). A \n“family of tests” has arisen to assess whether a connection exists between the branch \nof the state trying to exercise power and the subject over whom the state seeks  to \nexercise power ( Sharp , at para. 118). The particular test that applies to the assessment \nwill vary depending on the context, though some factors will inevitably overlap since \nthe underlying purpose behind each test remains the same (para. 118; see also  paras. \n119-22). \n2024 SCC 40 (CanLII)\n\n--- Page 62 ---\n \n \n When assessing the constitutional validity  of legislation, a “meaningful \nconnection” is tested by assessing the law’s connection to the enacting territory, to the \nsubject matter of the law, and to those made subject to it ( Imperial Tobacco , at \npara.  36). While “strong relationships” among these factors will allow a court to \n“easily” find a meaningful connection to the province, the search remains one for a \n“meaningful connection”, and not a connection with no extraterritorial effects (para.  \n37). Incidental effects outside the province “will not disturb the constitutionality of an \notherwise intra vires  law” ( Global Securities Corp. v. British Columbia (Securities \nCommission) , 2000 SCC 21, [2000] 1 S.C.R. 494, at para. 23; see also Imperial \nTobacco , at para. 28). Some intrusions on the powers of other governments “are proper \nand to be expected” in a federation where intergovernmental cooperation on cross -\nborder issues is essential ( Canadian Western Bank , at para. 28).  \n Section 11 concerns a sing le class action in B.C.’s courts, involving the \ngovernment of B.C. and defendants who have conducted business in the province and \nallegedly caused opioid -related harms there.  \n However, the appellants’ objections to s. 11 require us to consider its \nmeaningfu l connection to B.C. when foreign Crowns would be affected. The appellants \nsay that s. 11 enables a class action where the substantive claims of foreign  Crowns, \nfor alleged wrongs occurring in foreign  provinces and territories, according to foreign  \nlaw, wi ll be prosecuted by the government of B.C. and decided by a B.C. court. They \n2024 SCC 40 (CanLII)\n\n--- Page 63 ---\n \n contend this eliminates any meaningful connection which s. 11 might otherwise have \nhad. \n I disagree. Section 11 maintains a meaningful connection to B.C. both \nthrough the nature of  the class action, and through the choice of the foreign Crowns to \nparticipate in the proceeding. The provision concerns a single action with commonality \nof defendants, issues and claims.  \n Section 11 is consistent with how courts establish jurisdiction over  out-of-\nprovince class members. Nothing in s. 11 changes that process. A court must still find \na real and substantial connection between B.C. and the class as a whole in order to \nestablish jurisdiction, and therefore B.C.’s legislature can only impose its procedural \nrules on foreign Crowns if the court is first satisfied that a real and substantial \nconnection between B.C. and the class is present. In the proceeding that s. 11 \nempowers, B.C.’s laws and courts do not reach outside the province unless the cour t is \nsatisfied there are common issues between the government of B.C. and the proposed \nclass members, and deems that B.C. is the proper venue for their resolution (see CPA , \nss. 4(1) and 4.1(1)(a); ORA , s. 11(1)(b)).  \n This Court and many others across Canad a have endorsed the idea that the \ncommon issues shared between the non -resident class plaintiffs and the resident \nrepresentative plaintiff suffice to establish a real and substantial connection for \nadjudicatory jurisdiction over the class (see, e.g., Dutto n, at paras. 52 -54; Vivendi \nCanada Inc. v. Dell’Aniello , 2014 SCC 1, [2014] 1 S.C.R. 3, at paras. 61 -63; Endean , \n2024 SCC 40 (CanLII",
    "token_count": 1000,
    "start_token": 27000,
    "end_token": 28000,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 31,
    "source_file": "2024scc40.txt",
    "text": " class plaintiffs and the resident \nrepresentative plaintiff suffice to establish a real and substantial connection for \nadjudicatory jurisdiction over the class (see, e.g., Dutto n, at paras. 52 -54; Vivendi \nCanada Inc. v. Dell’Aniello , 2014 SCC 1, [2014] 1 S.C.R. 3, at paras. 61 -63; Endean , \n2024 SCC 40 (CanLII)\n\n--- Page 64 ---\n \n at paras.  6, 17 and 58; Airia Brands Inc. v. Air Canada , 2017 ONCA 792, 417 D.L.R. \n(4th) 467, at para. 107; Harrington v. Dow Corning Corp. , 2000 BCCA 605, 193 \nD.L.R. (4th) 67, at para.  96; Meeking v. Cash Store Inc. , 2013 MBCA 81, 367 D.L.R. \n(4th) 684, at para. 97; Thorpe v. Honda Canada Inc. , 2011 SKQB 72, [2011] 8 W.W.R. \n529, at para. 135; Wilson v. Servier Canada Inc. (2000), 50 O.R. (3d) 219  (S.C.J.); see \nalso C. Jones, “The Case for the National Class” (2004), 1 C.C.A.R.  29, at pp. 46 -47; \nT. J. Monestier, “Personal Jurisdiction over Non -Resident Class Members: Have We \nGone Down the Wrong Road?” (2010), 45 Tex. Int’l L.J.  537, at pp. 546 -48; J. Walker, \nCanadian Conflict of Laws  (7th ed. (loose -leaf)), at § 4.03). Section 11 of the ORA  and \nthe relevant provisions of the CPA do not extend or change the court’s jurisdiction over \nthese extraterritorial plaintiffs or issues. This jurisdiction arise s from the court’s \nplenary authority, anchored by the real and substantial connection from the plaintiffs’ \ncommon issues ( Dutton , at paras. 19 -24, 33 -34 and 39; Meeking , at paras. 92 -97; \nThorpe , at paras. 119 and 135; Jones, at pp. 46 -47; Walker, at § 4.03 ). Section 11 of \nthe ORA  and the relevant provisions of the CPA merely provide the procedural rules \nfor the court once jurisdiction is established. It is a legitimate exercise of power for a \nprovince to set the procedural rules for proceedings within its j urisdiction.  \n Thus, s. 11 authorizes the government of B.C. to bring an action that \nmaintains a meaningful connection to B.C. through the common issues within the B.C. \nlitigation, the court’s jurisdiction over those issues, and the consent of all participat ing \nCrowns. The provision will affect foreign Crowns only if they do not opt out of the \nproceeding ( ORA , s. 11(2); CPA , s. 16). No governments are compelled to participate \n2024 SCC 40 (CanLII)\n\n--- Page 65 ---\n \n against their will, and the opt -out mechanism lets them make informed and voluntary \ndecisions about whether to subject themselves to B.C.’s courts and procedural rules \n(Lépine , at paras. 42 -43). If they choose to participate, they consent to the court’s \njurisdiction to preside over the resolution of the common issues which they accept are  \nessentially the same as those of the representative plaintiff, further linking their \nindependent claims and the province of B.C. (see Harrington , at para. 99; see also Beals \nv. Saldanha , 2003 SCC 72, [2003] 3 S.C.R. 416, at para. 37; Morguard , at pp. 1103 -4; \nVan Breda , at para. 79; Walker, at § 2.02). And if they do not consent to participate, \nthat is the end of the matter.  \n The appellants’ argument that the foreign nature of the Crowns’ claims \nnegates a meaningful connection is also flawed. Superior courts often adjudicate cases \nwith claims arising elsewhere or requiring the application of foreign law (see, e.g., Van \nBreda ). Applying foreign law to a foreign party does not necessarily destroy a “real",
    "token_count": 1000,
    "start_token": 27900,
    "end_token": 28900,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 32,
    "source_file": "2024scc40.txt",
    "text": " 79; Walker, at § 2.02). And if they do not consent to participate, \nthat is the end of the matter.  \n The appellants’ argument that the foreign nature of the Crowns’ claims \nnegates a meaningful connection is also flawed. Superior courts often adjudicate cases \nwith claims arising elsewhere or requiring the application of foreign law (see, e.g., Van \nBreda ). Applying foreign law to a foreign party does not necessarily destroy a “real \nand substantial connection” for the court’s jurisdiction over the claim; nor does it \nundermine the “meaningful connection” between the procedural law facilitating that \naction and the province which enacted it. Neither test demands the complete absence \nof all connections to other provinces (see Imperial Tobacco , at paras. 37 -38). \n Accepting the appellants’ arguments on this point would contradict \ndecades of established jurisprudence affirming that superior courts can preside over \nclass actions that are national in scope. When courts preside over these claims, they \nmust follow their home province’s procedural rules, while often applying the \n2024 SCC 40 (CanLII)\n\n--- Page 66 ---\n \n substantive laws from other provinces to each  class members’ individual claims. This \nCourt has endorsed national class actions in several decisions (see, e.g., Dutton ; Vivendi \nCanada Inc. ; Endean ). They are increasingly an important vehicle for many Canadians \nto access justice in the modern world.  \n The subject matter of s. 11 is, therefore, a proceeding brought by the \ngovernment of B.C. in the Supreme Court of British Columbia. Before certification, \nonly B.C. and the defendants are subject to it. Post -certification, only consenting \nforeign Crowns with common issues with the government of B.C. are subject to it. \nThus, a meaningful connection exists between B.C.’s Legislative Assembly, a \nprovision which deals with its courts’ procedures, and parties who choose to participate \nin such proceedings where thei r common issues will be resolved collectively.  \n(2) Does Section 11 Respect the Legislative Sovereignty of Other Canadian \nGovernments?  \n The appellants argue that s. 11 fails to respect the legislative sovereignty \nof other Canadian governments by forcing them to either opt out of the proceeding, or \nelse opt in and fetter their sovereignty by giving away their ability to legislate regarding \ntheir substantive opioid -related healthcare cost recovery rights or their litigation \nautonomy over those rights. They say that  the support of the other governments for this \nlegislation is irrelevant.  \n2024 SCC 40 (CanLII)\n\n--- Page 67 ---\n \n \n As I have explained, the appellants’ concerns about the binding effects on \nanother province’s litigation autonomy does not undermine its sovereignty. Litigation \ninvolves consequences  and those consequences may be inescapable, especially when \nthey occur in jurisdictions beyond the control of a government’s legislature. There is \nno constitutional principle against this. The appellants’ arguments blur the distinction \nbetween legislative and executive authority. The legislature of one level of government \ncannot transfer its primary authority to legislate to another level of government \n(Reference re Pan -Canadian Securities Regulation , at paras. 75 -76). However, no such \nrule applies to the e xecutive delegation of litigation conduct.  \n Of course, a government cannot displace existing laws through executive \naction and the “legislature is entitled to enact legislation inconsistent with the \ngovernment’s commitments under a prior agreement” ( Canada (Attorney General) v. \nBritish Columbia Investment Management Corp. , 2019 SCC 63, [2019] 4 S.C.R. 559, \nat para. 92). Thus, as a general constitutional principle, neither the executive, nor the \nlegislature itself, can bind a future legislature in its exercis e of authority ( Reference re \nPan-Canadian Securities Regulation , at paras. 54 -59; Wells v. Newfoundland , [1999] \n3 S.C.R. 199, at para. 37; Reference re Canada Assistance Plan (B.C.) , [1991] 2 S.C.R. \n525, at p. 560).  \n But this general principle hits its limi t when a Crown exercises its civil \nrights, in its capacity as a natural person, in areas where its legislature has no authority \nto enact laws. Aside from effects on a Crown’s desire to litigate  as they wish in foreign \n2024 SCC 40 (CanLII)\n\n--- Page 68 ---\n \n territory, when Crowns act in their ca pacity as a natural person in other jurisdictions \nthey may also have to accept legal consequences that fall outside their legislative \ncompetence, such as the creation of private rights",
    "token_count": 1000,
    "start_token": 28800,
    "end_token": 29800,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 33,
    "source_file": "2024scc40.txt",
    "text": "rights, in its capacity as a natural person, in areas where its legislature has no authority \nto enact laws. Aside from effects on a Crown’s desire to litigate  as they wish in foreign \n2024 SCC 40 (CanLII)\n\n--- Page 68 ---\n \n territory, when Crowns act in their ca pacity as a natural person in other jurisdictions \nthey may also have to accept legal consequences that fall outside their legislative \ncompetence, such as the creation of private rights and duties in other provinces. For \nexample, when a Crown enters into a contract in another province, that contract will \nfall under the legislative competence of that other  province’s authority over “Property \nand Civil Rights in the Province” (s.  92(13) of the Constitution Act, 1867 ). The \ncontracting Crown’s legislature could not enact a law to cancel those extra -provincial \ncontractual rights, and it will be bound by that contractual obligation in the same way \nas an individual (see Churchill Falls , at pp.  332-33; see also Bank of Montreal v. \nAttorney General (Quebec) , [1979] 1 S.C.R. 565, at p. 574).  \n So when a Crown exercises the same civil rights as an individual, it will be \nbound by the consequences of its actions undertaken in another province when those \nactions fall under that other province’s legislative sovereignty. Despi te being sovereign \nin its own territory over these subject matters, a Crown cannot legislate itself out of \nsituations it might have controlled at home. Nothing forces one province to engage in \nactivities elsewhere, but when they do, they must abide by the laws of that other \nprovince (see D. Gibson, “Interjurisdictional Immunity in Canadian Federalism” \n(1969), 47 Can. Bar Rev.  40, at p. 60; Hogg and Wright, at §  10:20).  \n This is the case when a Crown exercises its civil rights by participating as \na non -repres entative plaintiff in a class action in another province. It will find itself \nsubject to that province’s procedural rules governing class actions, including \n2024 SCC 40 (CanLII)\n\n--- Page 69 ---\n \n procedural rules relating to the binding nature of the court’s judgments or any \nsettlements negotia ted by the parties ( CPA , ss. 26 and 35).  \n However, the application of those procedural  rules to the foreign, \nparticipating Crowns does not determine which substantive  laws will apply to those \nCrowns (see Wilson , at para. 83; Thorpe , at para.  135; Walker, a t § 4.03). Here, the \nharms underlying each Crown’s causes of action occurred in their own jurisdictions \nand thus are subject to their own substantive law (see Tolofson v. Jensen , [1994] 3 \nS.C.R. 1022, at pp. 1050 and 1064 -65; Unifund Assurance Co. v. Insur ance Corp. of \nBritish Columbia , 2003 SCC 40, [2003] 2 S.C.R. 63, at paras. 25 and 80; Van Breda , \nat para. 37; Walker, at § 1.02[2][e]). That substantive law remains subject to each \nlegislature’s sovereignty, including their own ORA -type legislation to esta blish their \ncauses of action.  \n I also do not agree that s. 11 fails to respect the sovereignty of other \ngovernments because of the potential for overlap and conflict between their various \nORA -type statutes and the litigation they authorize. Multi -jurisdicti onal legislative \noverlap is normal in a federation; so long as it occurs within the proper legislative \nauthority of the enacting governments, it is not problematic (see Canada (Attorney \nGeneral) v. PHS Community Services Society , 2011 SCC 44, [2011] 3 S.C. R. 134, at \npara. 62; Canadian Western Bank , at paras. 36 -37). Multi -Crown participation in a \nnational class action, where each is authorized by its own law, represents cooperation \nbetween different governments and comity between the courts.  \n2024 SCC 40 (CanLII)\n\n--- Page 70 ---\n \n \n Intergovernment al cooperation in Canada recognizes that some amount of \noverlap is inevitable regarding national issues like the opioid epidemic, and that \n“governments should be permitted to legislate for their own valid purposes in these \nareas of overlap” ( PHS Community Services Society , at para. 62). While",
    "token_count": 1000,
    "start_token": 29700,
    "end_token": 30700,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 34,
    "source_file": "2024scc40.txt",
    "text": " is authorized by its own law, represents cooperation \nbetween different governments and comity between the courts.  \n2024 SCC 40 (CanLII)\n\n--- Page 70 ---\n \n \n Intergovernment al cooperation in Canada recognizes that some amount of \noverlap is inevitable regarding national issues like the opioid epidemic, and that \n“governments should be permitted to legislate for their own valid purposes in these \nareas of overlap” ( PHS Community Services Society , at para. 62). While the courts \nremain the ultimate arbiters of the constitutionality of governments’ efforts to regulate \nnationwide issues like these, the day -to-day task of maintaining the balance of powers \nregarding cooperative legislat ive schemes “falls primarily to governments” ( Canadian \nWestern Bank , at para. 24).  \n Here, nearly every provincial and territorial government in Canada has \nchosen to cooperate by enacting virtually identical statutes, by indicating their intent to \nparticipat e as class members, and by intervening in this appeal supporting B.C. The \nfederal government, which also intervened in support of the respondent, has indicated \nits intent to participate in the class action as well ( House of Commons Debates , \nvol. 151, No. 2 16, 1st Sess., 44th Parl., June 19, 2023, at p. 16247 (Hon. Carolyn \nBennett)). This multi -Crown participation is in harmony with our Court’s approach to \nintergovernmental cooperation on national issues, where collaboration between the \nexecutives and legisl atures of both provincial and federal governments is vital. \nEspecially given the presumption of constitutionality of legislation, a court should \nexercise considerable caution before it finds that this cooperation between multiple \nexecutive and legislative branches is unconstitutional (see Murray -Hall, at paras. 79 \nand 82; Reference re Impact Assessment Act , at para. 69; Kitkatla , at paras. 72 -73; \nOPSEU , at pp. 19 -20). \n2024 SCC 40 (CanLII)\n\n--- Page 71 ---\n \n \n As for the judicial branch of government, this Court has recognized that \n“[g]reater comity  is required in our modern era when international transactions involve \na constant flow of products, wealth and people across the globe” ( Hunt , at p. 292). The \ncourts in our federation provide a comparable quality of justice, and so demand the \nsame level of  faith in one another’s judgments where jurisdiction has been properly \nexercised ( Morguard , at p. 1099). If overlapping litigation arises, courts acting in \nrespect of one another have the tools to prevent any abuse of process (see, e.g., CPA , \nss. 4(3) to 4 .1). Comity between our federation’s courts helps with access to justice in \na world where people and problems cross borders without heed for which legislature \nor court has authority over them.  \n This is true in class actions, whose “purpose is to facilitate access to justice \nfor citizens who share common problems and would otherwise have little incentive to \napply to the courts on an individual basis to assert their rights” ( Bisaillon , at para. 16). \nThis Court has noted that class actions serve judicial econom y, promote access to \njustice, and modify the behaviour of wrongdoers who might otherwise escape \naccountability for their actions ( Dutton , at paras. 27 -29; Hollick , at para. 15). These \ngoals are met where governments cooperate with one another to have their  claims \nlitigated efficiently, in one action, before one province’s superior court, whose \nproceedings and judgment will be respected through the principle of comity in the other \ncourts of our federation.  \n2024 SCC 40 (CanLII)\n\n--- Page 72 ---\n \n \n Section 11 of the ORA  therefore respects the legislative sovereignty of \nforeign Crowns. It is an example of the important role that national class actions play \nin matters which span the country, by providing a mechanism to help multiple \ngovernments cooperate while working towa rd the same goal.  \n(3) Conclusion on Territoriality  \n Section 11 is meaningfully connected to the Province of B.C. and respects \nthe legislative sovereignty of other Canadian governments. Any extraterritorial effects \non foreign Crowns’ substantive rights are incid ental and do not affect its validity.  \nVI. Conclusion  \n Section 11 of the ORA  is a procedural mechanism through which the claims \nof consenting foreign Crowns can be determined in a single proceeding before the \ncourts of B.C., with the government of B.C. acting as  the representative plaintiff. This \nprocedural mechanism",
    "token_count": 1000,
    "start_token": 30600,
    "end_token": 31600,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 35,
    "source_file": "2024scc40.txt",
    "text": " and respects \nthe legislative sovereignty of other Canadian governments. Any extraterritorial effects \non foreign Crowns’ substantive rights are incid ental and do not affect its validity.  \nVI. Conclusion  \n Section 11 of the ORA  is a procedural mechanism through which the claims \nof consenting foreign Crowns can be determined in a single proceeding before the \ncourts of B.C., with the government of B.C. acting as  the representative plaintiff. This \nprocedural mechanism falls within the Province’s authority over the “Administration \nof Justice in the Province” under s. 92(14). It is meaningfully connected to the province \nand respects the legislative sovereignty of ot her governments. As a result, s. 11 is intra \nvires  the province, and it is unnecessary to consider the ancillary powers doctrine.  \n I would dismiss the appeal with costs.  \n The following are the reasons delivered by  \n2024 SCC 40 (CanLII)\n\n--- Page 73 ---\n \n  CÔTÉ J. —  \n TABLE OF CONTENTS  \n \nParagraph  \nI. Introduction  111 \nII. Analysis  121 \nA. Pith and Substance  126 \n Purpose: Seeking Certification of a Class of Governments Asserting Recovery \nRights for Opioid -Related Health Care Costs  129 \n Effects: Automatic Inclusion of Foreign Governments  136 \n \n 136 \n The Effects Are Not Merely Incidental 155 \n Balancing Legal and Practical Effects 159 \n Conclusion on Pith and Substance  163 \nB. Territorial Limitations  164 \n Meaningful Connection 165 \n \n 167 \n There Is No Meaningful Connection in This Case 178 \n Legislative Sovereignty 188 \n Conclusion on Territorial Limitations 197 \nC. Ancillary Powers  198 \nD. Remedy  205 \nIII. Conclusion  208 \nI. Introduction  \n The seriousness of the opioid crisis across Canada cannot be understated \nand the crisis continues to persist without slowing down (see R. v. Parranto , 2021 SCC \n46, [2021] 3 S.C.R. 366, at para.  96, per Moldaver  J.). While I recognize and do not in \n2024 SCC 40 (CanLII)\n\n--- Page 74 ---\n \n any way dismiss the seriousness of the situation involving opioids and its profound \nimpact on Canadians ( R. v. Smith , 2019 SKCA 100, 382 C.C.C. (3d) 455, at para.  90, \nciting  R. v. Fyfe , 2017 SKQB 5, at paras.  157-63), the severity of the circumstanc es \ndoes not allow our Court to amend the Constitution. Enhancing access to justice and \nfacilitating intergovernmental cooperation are laudable objectives, but they must be \naccomplished without conflicting with the fundamental structure of Canadian \nfederali sm. \n This appeal raises the question of whether s.  11 of the Opioid Damages \nand Health Care Costs Recovery Act , S.B.C. 2018, c.  35 (“ ORA ”), is ultra vires  the \nlegislature of British Columbia. In particular, can the legislature of British Columbia \nauthorize the Province to initiate a class action to claim health care costs incurred by a \nforeign province on an opt -out basis, thereby compelling that province to take steps to \navoid that forced participation in the given proceeding? In addition to the core issue,  \nthis appeal has important ramifications for the pith and substance analysis and the \nproper balance that must be struck between legal and practical effects in determining \nthe dominant purpose of an impugned law.  \n I do not question the fact that the legislat ive scheme of the ORA  is \nconstitutionally valid as far as it mirrors that of the Tobacco Damages and Health Care \nCosts Recovery Act , S.B.C. 2000, c.  30 (“ TRA”), the constitutional validity of which \nwas upheld by our Court in British Columbia v. Imperial To bacco Canada Ltd. , 2005 \nSCC 49, [2005] 2 S.C.R. 473. Unlike the TRA, however, the ORA  contains a provision \n2024 SCC 40 (CanLII)\n\n--- Page 75 ---\n \n that allows the Crown in right of British Columbia, as the representative plaintiff, to \nbring a multi -Crown class action lawsuit on behalf of other p rovincial governments and \nthe federal government and bind these governments to the class proceeding, unless they \ntake the positive steps to opt out. Moreover, the decision to opt out must be made in \naccordance with",
    "token_count": 1000,
    "start_token": 31500,
    "end_token": 32500,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 36,
    "source_file": "2024scc40.txt",
    "text": ", the ORA  contains a provision \n2024 SCC 40 (CanLII)\n\n--- Page 75 ---\n \n that allows the Crown in right of British Columbia, as the representative plaintiff, to \nbring a multi -Crown class action lawsuit on behalf of other p rovincial governments and \nthe federal government and bind these governments to the class proceeding, unless they \ntake the positive steps to opt out. Moreover, the decision to opt out must be made in \naccordance with the certification order, meaning that Bri tish Columbia’s provincial \ncourts get to dictate how other provinces and the federal government go about \npreserving their own rights. In my view, the relevant and related question is whether \nthe legislature of a province has the authority to legislate in a  manner that interferes \nwith the rights and prerogatives of other provincial governments and the federal \ngovernment. The answer must be no.  \n The appellants, which are named as defendants in the action at the heart of \nthis case, challenge the constitutional validity of s.  11 of the ORA . They suggest that \ns. 11, in pith and substance, engages substantive rights and falls outside the \njurisdictional (or territorial) boundaries and legislative competence of British \nColumbia. They submit that s.  11 is an unprecede nted affront to established \nconstitutional principles. The respondent, His Majesty the King in right of the Province \nof British Columbia, maintains that the pith and substance of the provision is to legislate \nin respect of the procedural powers of the Prov ince and respects the territorial \nlimitations imposed by the Constitution Act, 1867 . \n I am of the view that the pith and substance of s.  11 of the ORA  is to \nlegislate in respect of property and civil rights outside the province, contrary to the \n2024 SCC 40 (CanLII)\n\n--- Page 76 ---\n \n territorial limitations necessarily imposed on provincial legislatures by operation of \ns. 92 of the Constitution Act, 1867 . Through s.  11, the legislature of British Columbia \nis attempting to aggregate civil rights in other provinces into a single class action, but \nits powers are limited to property and civil rights “in the Province” pursuant to s.  92. \nThe effects of s.  11 on the substantive rights of the other provincial governments and \nthe federal government are not merely incidental. Rather, membership in the class is \nimposed on the other governments; that is, the provision’s default position would, in \npith and substance, interfere with their litigation autonomy. I do not claim that s.  11 of \nthe ORA  creates  substantive rights, but rather that it affects the substanti ve rights of \ngovernments outside British Columbia in a non -incidental way. As I explain in these \nreasons, these unconstitutional legal effects cannot be made valid by the fact that those \nforeign governments can choose to opt  out of the class action commenc ed by \nBritish  Columbia.  \n I acknowledge that a certification order is required for the provision to take \neffect. In this regard, I would highlight and agree with the points made by counsel for \nthe appellants, who, during oral argument, accepted that certific ation is required, but \ncontended that the dominant purpose of s.  11 of the ORA  ultimately relates to what \nhappens once the class action is certified. The very crux of the provision contemplates \ncertification, and a court cannot certify the given class acti on without the existence of \ns. 11. Of course, if the class action proposed by British Columbia were not certified, \nthe present debate would be rendered meaningless.  \n2024 SCC 40 (CanLII)\n\n--- Page 77 ---\n \n \n I conclude that the pith and substance of s.  11 of the ORA is to legislate \nwith respect to the substantive rights of other governments to litigate for the recovery \nof health care costs. I would therefore classify the provision as falling within the scope \nof s. 92(13) of the Constitution Act, 1867 . The provision does not respect the territorial \nlimitations on the competence of the legislature of British  Columbia and therefore its \npith and substance is not “in the Province” for the purposes of s.  92. More specifically, \nthere is no meaningful connection between the enacting territory, the subject ma tter of \nthe law, and those made subject to it. I would reach this same conclusion even if the \nprovision’s pith and substance were to be classified under s.  92(14). As I note later in \nthese reasons, I would also voice serious concerns about the impact that such",
    "token_count": 1000,
    "start_token": 32400,
    "end_token": 33400,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 37,
    "source_file": "2024scc40.txt",
    "text": " substance is not “in the Province” for the purposes of s.  92. More specifically, \nthere is no meaningful connection between the enacting territory, the subject ma tter of \nthe law, and those made subject to it. I would reach this same conclusion even if the \nprovision’s pith and substance were to be classified under s.  92(14). As I note later in \nthese reasons, I would also voice serious concerns about the impact that such a \nprovision would have on the legislative sovereignty of other provinces.  \n I do not disagree with my colleague that horizontal cooperation between \nthe provincial and federal governments on common issues is a laudable goal. However, \nwhatever method the provinces and federal government craft to achieve cooperation \nmust  be consisten t with the structure of Canadian federalism, no matter how \nadvantageous it may be to encroach on the jurisdiction of other governments in any \ngiven case. Governments could decide, for example, subject to jurisdictional issues, to \njoin their actions in a si ngle province. This would allow them to share some of the costs \nof the actions, thereby promoting efficiency and deterrence without infringing on the \nability of other provinces to make an active choice about whether to participate and \nhow to carry out liti gation. The opt -out structure of the ORA does not allow for this \nactive choice. Section 11 imposes participation by default, and this participation \n2024 SCC 40 (CanLII)\n\n--- Page 78 ---\n \n requires other provinces to submit to the litigation decisions of the Province of \nBritish  Columbia.  \n The appe llants also made submissions to the effect that s.  11 would be \nunconstitutional even if it created an opt -in, rather than an opt -out, regime for \nmulti -Crown class actions. Nevertheless, I find that it is unnecessary for me to express \na view on this in the present circumstances, as the issue before us is about the \nconstitutionality of s.  11 in its current form.  \n For the reasons that follow, I would allow the appeal.  \nII. Analysis  \n I agree with my colleague that where the validity of provincial legislation \nis challe nged on the basis that it violates territorial limitations imposed on a provincial \nlegislature, the assessment of its validity must be carried out in accordance with the \ntwo-part framework established by our Court in Imperial Tobacco . \n The first step is to determine the pith and substance of the impugned \nlegislation, which requires finding “its essential character or dominant feature” having \nregard to its purpose and effect ( Imperial Tobacco , at para.  29). Thereafter, courts are \ntasked with classifying the p rovincial legislation’s pith and substance under an \nappropriate head of power pursuant to s.  92 of the Constitution Act, 1867 . The second \nstep requires courts to determine whether the pith and substance of the impugned \n2024 SCC 40 (CanLII)\n\n--- Page 79 ---\n \n legislation “respects the territorial  limitations on that head of power  — i.e., whether it \nis in the province” (para.  36). In this regard, the legislation must have a meaningful \nconnection to the enacting province and must respect the legislative sovereignty of the \nother provinces.  \n At the out set, I wish to offer a few remarks to provide appropriate context \nfor these reasons. First, I recognize that the constitutional analysis regarding the pith \nand substance of an impugned law focuses on the dominant thrust of the law and \npermits extra -provinc ial effects that are incidental or ancillary. Ever since our Court’s \ndecision in Reference re Upper Churchill Water Rights Reversion Act , [1984] 1 S.C.R. \n297, at p.  332, it has been well established that extraterritorial effects that are merely \nincidental do not impact the constitutional validity of otherwise intra vires legislation. \nOur Court has affirmed this point on many occasions (see, e.g., Global Securities Corp. \nv. British Columbia (Securities Commission) , 2000 SCC 21, [2000] 1 S.C.R. 494, at \npara.  23; Imperial Tobacco , at para.  28). That being said, I would emphasize the words \nof McIntyre  J. in Upper Churchill , at p.  332, where he wrote that if “the pith and \nsubstance of the provincial enactment is the derogation from or elimination of \nextra -provinc ial rights then .  . . it will be ultra vires ” (see also Global Securities Corp ., \nat para.  24). \n Second, I acknowledge",
    "token_count": 1000,
    "start_token": 33300,
    "end_token": 34300,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 38,
    "source_file": "2024scc40.txt",
    "text": " at para.  28). That being said, I would emphasize the words \nof McIntyre  J. in Upper Churchill , at p.  332, where he wrote that if “the pith and \nsubstance of the provincial enactment is the derogation from or elimination of \nextra -provinc ial rights then .  . . it will be ultra vires ” (see also Global Securities Corp ., \nat para.  24). \n Second, I acknowledge our Court’s recent pronouncement that in the \ncontext of aggregate damages provisions, the “advantages conferred by class \nproceeding legisla tion are purely procedural, and .  . . they do not confer substantive \n2024 SCC 40 (CanLII)\n\n--- Page 80 ---\n \n rights” ( Pioneer Corp. v. Godfrey , 2019 SCC 42, [2019] 3 S.C.R. 295, at para.  116; see \nalso Western Canadian Shopping Centres Inc. v. Dutton , 2001 SCC 46, [2001] 2 S.C.R. \n534, at para.  46). While this is true, in my view, the impugned provision engages and \nultimately affects substantive rights  that go far beyond the procedural advantages  \nflowing from class proceedings legislation. Indeed, it has serious impacts on the \nlitigation autonomy o f other governments.  \n My analysis proceeds in two parts. In the first part, I discuss how the default \nposition of s.  11 of the ORA  is such that, in pith and substance, the provision’s purpose \nand effects are substantive in nature. I conclude that the pith a nd substance of the \nprovision is to legislate in respect of property and civil rights outside of the province \nand therefore falls within the purview of s.  92(13) of the Constitution Act, 1867 . In the \nsecond part, I conclude, however, that regardless of whe ther s.  11 falls within the scope \nof s. 92(13) or, if my analysis were incorrect, whether it instead falls within the scope \nof s. 92(14), the provision is still ultra vires  the legislature of British  Columbia, as it \ndoes not respect the territorial limitations imposed by the Constitution. There is no \nmeaningful connection between the enacting territory, the subject matter of the law, \nand those made subject to it. More specif ically, there is no meaningful connection \nbetween British Columbia and the other governments named in the class action, the \nclaims of these governments, and the subject matter of s.  11. Aside from British \nColumbia’s own claim, all other claims belong to an  emanation of the Crown outside \nof British Columbia.  \n2024 SCC 40 (CanLII)\n\n--- Page 81 ---\n \n A. Pith and Substance  \n I turn now to the pith and substance of the impugned provision. I reproduce \nthe entirety of s.  11 of the ORA here for convenience:  \n11 (1) If the government has commenced a proceeding i n relation to an \nopioid -related wrong and the proceeding is ongoing as of the date \nthis section comes into force,  \n \n(a) the proceeding continues in accordance with this Act,  \n \n(b) for the purposes of section 4 of the Class Proceedings Act , the \ngovernment may bring a n action on behalf of a class consisting \nof \n \n(i) one or more of the government of Canada and the \ngovernment of a jurisdiction within Canada, and  \n \n(ii) a federal or provincial government payment agency that \nmakes reimbursement for the cost of services that are in the \nnature of health care benefits within the meaning of this \nAct, \n \n(c) a procedure completed, and an order made, before this section \ncomes into force continues to have effect unless  \n \n(i) it would be inconsistent with this Act, or  \n \n(ii) the court orders otherwise, and  \n \n(d) a procedure that began but was not completed before this \nsection comes into force must be completed in accordance with \nthis Act.  \n \n(2) Nothing in subsection (1) (b) of this section prevents a member of \nthe class described in that provision from opting out of t he \nproceeding in accordance with section 16 of the Class \nProceedings Act . \n2024 SCC 40 (CanLII)\n\n--- Page 82 ---\n \n \n My colleague’s conclusion on the pith and substance of s.  11 of the ORA  \nmirrors the conclusions of the courts below:  \n. . . the pith and substance of s.  11 is the creation of a proced ural \nmechanism for the application of",
    "token_count": 1000,
    "start_token": 34200,
    "end_token": 35200,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 39,
    "source_file": "2024scc40.txt",
    "text": " out of t he \nproceeding in accordance with section 16 of the Class \nProceedings Act . \n2024 SCC 40 (CanLII)\n\n--- Page 82 ---\n \n \n My colleague’s conclusion on the pith and substance of s.  11 of the ORA  \nmirrors the conclusions of the courts below:  \n. . . the pith and substance of s.  11 is the creation of a proced ural \nmechanism for the application of the ORA  to the existing opioid -related \nproceeding, that the Province of B.C. is authorized to continue as a \nrepresentative plaintiff on behalf of other Canadian governments who \nchoose to participate. [para.  76] \n \n(See a lso 2022 BCSC 2147, 77 B.C.L.R. (6th) 313, at para.  73; 2023 \nBCCA 306, 79 B.C.L.R. (6th) 1, at paras.  54 and 85.)  \n At the outset, I agree with the appellants that the purpose of s.  11 is to \npermit the Province of British Columbia to seek certification of a class of governments \nasserting recovery rights for opioid -related health care costs. Tied to this purpose is the \nProvince’s ability to seek certification on an opt -out basis such that, by default, the \nprovincial governments and the federal government are i ncluded in the class action if \nBritish Columbia so chooses. While the respondent’s submission that s.  11 provides for \nthe procedural impacts of the ORA  coming into force on the opioid -related action is not \ninaccurate per se , I suggest that, in effect, it i mpacts substantive rights held by the \nforeign governments.  \n(1) Purpose: Seeking Certification of a Class of Governments Asserting \nRecovery Rights for Opioid -Related Health Care Costs  \n I begin by assessing the purpose of s.  11 of the ORA . My colleague suggests \nthat the Crown in right of British Columbia was already a “person” capable of \ncommencing an action on behalf of a class of persons, including those who do not \n2024 SCC 40 (CanLII)\n\n--- Page 83 ---\n \n reside in British Columbia. She suggests that, therefore, s.  11 does not create a power \nthat the Province did not have before. As a result, according to her, creating new rights \nfor the Crown in right of British Columbia and other provinces is not the purpose of \nthe provision. The first instance judge considered it a “collateral issue” (para.  62), and  \nthe Court of Appeal determined that because the challenge was directed at the validity \nof the provision, and not at the proceedings themselves, the question was not relevant \n(paras.  82-83). \n It may well be that the Province of British Columbia is a “person ” for the \npurposes of the Class Proceedings Act , R.S.B.C. 1996, c.  50 (“ CPA ”), and as a result \ncan commence a class action under this regime. Even so, I agree with the courts below \nthat it is not necessary to resolve this question in the present appeal. Th e important \nquestion is whether, as a matter of statutory interpretation, the Crown in right of the \nother  provinces and the federal Crown fall within the definition of “person” for the \npurposes of a multi -jurisdictional class proceeding under the CPA  (see, e.g., CPA , ss. 1, \n2(1), 4.1 and 44). If they do not fall within this definition, then s.  11 creates a new \nsubstantive right to bring a class action on behalf of other governments. The fact that \nthe Crown in right of a province can submit to the jurisdicti on of courts in other \nprovinces, or that its common law powers are not subject to territorial restraints, is in \nno way determinative in this interpretive exercise.  \n Leaving aside the question of whether this would be constitutionally \npermissible, it cannot be said that the legislature of British Columbia intended for other \n2024 SCC 40 (CanLII)\n\n--- Page 84 ---\n \n provincial governments and the federal government to be members of a class for the \npurposes of the CPA . It is a well -established principle that “the Crown is not bound by \nstatute except by  express words or necessary implication. What this means is that \ngeneral language in a statute, such as ‘person’ .  . ., will be interpreted as not including \nthe Crown” (P.  W. Hogg, P.  J. Monahan",
    "token_count": 1000,
    "start_token": 35100,
    "end_token": 36100,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 40,
    "source_file": "2024scc40.txt",
    "text": "84 ---\n \n provincial governments and the federal government to be members of a class for the \npurposes of the CPA . It is a well -established principle that “the Crown is not bound by \nstatute except by  express words or necessary implication. What this means is that \ngeneral language in a statute, such as ‘person’ .  . ., will be interpreted as not including \nthe Crown” (P.  W. Hogg, P.  J. Monahan and W.  K. Wright, Liability of the Crown  \n(4th ed. 2011), at p . 398; see also H.  Brun, G.  Tremblay and E.  Brouillet, Droit \nconstitutionnel  (6th ed. 2014), at para.  IX-86; K.  Horsman and G.  Morley, Government \nLiability: Law and Practice  (loose -leaf), at §  1.15). This principle is referred to as \nCrown immunity.  \n Even wh ere the language of a provincial statute is said to include the \nCrown, it will not by this very fact include other sovereign emanations of the Crown. \nAs Anglin  J. wrote in Gauthier v. The King  (1918), 56 S.C.R. 176, at p.  194, it is a \n“safe rule of constru ction that a reference to the Crown in a provincial statute shall be \ntaken to be to the Crown in right of the province only, unless the statute in express \nterms or by necessary intendment makes it clear that the reference is to the Crown in \nsome other sens e” (emphasis added). In that case, the Court determined that a provision \napplying the terms of a provincial statute to His Majesty ought not to be taken as \nsubjecting the federal Crown to the restrictions of that statute.  \n This reasoning should apply with e ven greater force with respect to the \nCrown in right of other provinces, given the territorial limitations on provincial power \nimposed by s.  92 of the Constitution Act, 1867 . Legislation should be interpreted in a \n2024 SCC 40 (CanLII)\n\n--- Page 85 ---\n \n manner consistent with those territorial l imitations (see Sharp v. Autorité des marchés \nfinanciers , 2023 SCC 29, at paras.  113-14; P. -A. Côté and M.  Devinat, Interprétation \ndes lois (5th éd. 2021), at paras.  779-82; R. Sullivan, The Construction of Statutes  \n(7th ed. 2022 ), at pp.  807 and 815).  \n It is true, as the respondent argues, that the Crown may take advantage of \na statutory regime by which it would otherwise not be bound and waive its immunity. \nFor instance, if the Crown brings an action to which certain limitations attach, it will \nbe bound by  such limitations (see Sparling v. Quebec (Caisse de dépôt et placement du \nQuébec) , [1988] 2 S.C.R. 1015, at p.  1027; Alberta Government Telephones v. Canada \n(Canadian Radio -television and Telecommunications Commission) , [1989] 2 S.C.R. \n225, at pp.  284-86). Such an exception to Crown immunity is a narrow one, and not \none that is adapted to the present context. This is because, by operation of Crown \nimmunity, the Crown in right of other provinces and the federal Crown are presumably \nexcluded from the word  “persons” in the CPA . A legislature cannot force the Crown of \nanother province or the state (e.g., through an opt -out regime) to take advantage of a \nstatutory regime it has enacted; it cannot force a Crown to waive its immunity. In the \npresent context, I cannot accept the respondent’s argument that foreign governments \nare “persons” or “members of a class of persons” for the purposes of the CPA . \n Since s.  11 of the ORA gives the Province of British Columbia the ability \nto do something it could not before, I therefore find that the purpose of the provision is \nto allow the Province of British Columbia to seek certification of a class of \n2024 SCC 40 (CanLII)\n\n--- Page 86 ---\n \n governments asserting recovery rights for opioid -related health care costs. Contrary to \nthe respondent’s argument, it is signi ficant to the constitutional analysis that the CPA  \nin British Columbia does not authorize multi -Crown class actions. As a result, the \n",
    "token_count": 1000,
    "start_token": 36000,
    "end_token": 37000,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 41,
    "source_file": "2024scc40.txt",
    "text": " could not before, I therefore find that the purpose of the provision is \nto allow the Province of British Columbia to seek certification of a class of \n2024 SCC 40 (CanLII)\n\n--- Page 86 ---\n \n governments asserting recovery rights for opioid -related health care costs. Contrary to \nthe respondent’s argument, it is signi ficant to the constitutional analysis that the CPA  \nin British Columbia does not authorize multi -Crown class actions. As a result, the \neffects of s.  11 are not simply limited to the application of the ORA ’s provisions to the \nextant class action, but are ins tead far more extensive.  \n(2) Effects: Automatic Inclusion of Foreign Governments  \n(a) The Opt -out Regime: Substantive Rights and Effects  \n I turn now to the effects of the impugned provision. I do not question the \nfact that s.  11 of the ORA  is procedural in some resp ects. For example, s.  11(1)(a) \nprovides that pre -existing proceedings regarding opioid -related wrongs continue in \naccordance with the ORA . Any such proceedings based on other causes of action \ncommenced before the coming into force of the ORA  therefore fall  within the direct \nand distinct cause of action under the ORA . Accordingly, the record reflects that British \nColumbia appropriately amended its civil claim in the present appeal to ground it within \nthe authority of the ORA . Likewise, s.  11(1)(c) provides t hat procedures completed or \norders made prior to the ORA ’s coming into force continue to have effect unless they \nare inconsistent with the ORA . Section 11(1)(d) provides that if not completed, a \nprocedure that began before the ORA ’s coming into force must be completed in \naccordance with the ORA . \n2024 SCC 40 (CanLII)\n\n--- Page 87 ---\n \n \n The placement of s.  11(1)(b) within these procedural paragraphs does not \nmean that its effects are merely procedural. Nor is it determinative of the pith and \nsubstance of s.  11 as a whole. In fact, I share the view of the courts below that the main \nthrust of s.  11 is to be found in s.  11(1)(b) and (2). Indeed, the Court of Appeal spoke \nof the importance of the manner in which s.  11(2) qualifies s. 11(1)(b); standing alone, \nthe latter provision would be “of doubtful v alidity” (para.  76). \n In addition to the placement of s.  11(1)(b) between procedural paragraphs, \nmy colleague also points to the placement of s.  11 as a whole, immediately following \nthe retroactive effect created by s.  10, as reinforcing its procedural natu re (para.  58). \nHowever, the fact that the section is placed there or that s.  11 has some procedural \naspects  does not make the section procedural as a whole. The impact of s.  11 is \nsubstantive.  \n The opt -out regime provided for in s.  11(2) of the ORA  is centr al to the \nassessment of the pith and substance of s.  11 as a whole. Section 11(2) necessarily \noperates alongside s.  11(1)(b), which codifies and provides a foundation for a direct \nand distinct cause of action authorizing the Province of British Columbia to  sue \nmanufacturers, wholesalers, or consultants on behalf of other governments. At first \nglance, these provisions may appear to have only a procedural impact, as they relate to \nclass proceedings and afford the advantages related to such proceedings. Read t ogether, \nhowever, s.  11(1)(b) and (2) interfere with the property and civil rights in other \nprovinces. In my view, in respect of the rights of other governments, these substantive \n2024 SCC 40 (CanLII)\n\n--- Page 88 ---\n \n effects cannot be said to be merely incidental; instead, they go to the pith  and substance \nof the provision.  \n Section 11(2) of the ORA  provides that, in accordance with s.  16 of the \nCPA , a member of the class can opt  out of the class action despite having been included \nin the proceeding by virtue of s.  11(1)(b) of the ORA . Relatedl y, s. 16 of the CPA  \nindicates that “[a",
    "token_count": 1000,
    "start_token": 36900,
    "end_token": 37900,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 42,
    "source_file": "2024scc40.txt",
    "text": ", they go to the pith  and substance \nof the provision.  \n Section 11(2) of the ORA  provides that, in accordance with s.  16 of the \nCPA , a member of the class can opt  out of the class action despite having been included \nin the proceeding by virtue of s.  11(1)(b) of the ORA . Relatedl y, s. 16 of the CPA  \nindicates that “[a] member of a class involved in a class proceeding may opt out of the \nproceeding in the manner and within the time specified in the certification order .” \nTherefore, it is not surprising that s.  11(2) of the ORA  express ly preserves a \ngovernment’s ability to opt  out as it exists in the CPA . \n I agree with my colleague that s.  11 of the ORA  cannot be construed as \nfeaturing an opt -in regime but must instead be interpreted as providing governments \nwith the ability to opt  out. Nothing in the wording of the ORA  or the CPA  indicates that \nother provincial governments or the federal government would have the choice of \nopting in the class action. Section 11(1)(b)(i) of the ORA  grants British Columbia the \npower to, at the very least, commence  an action of its own volition on behalf of a class \nconsisting of other governments. In other words, the Province can commence the \nproceeding without any consultation with the other governments and without their \nconsent. Consequently, the Court of Appeal was correct in determining that any \nconclusion that the provision can be viewed as authorizing an “opt -in” regime is \nunavailable simply by reason of the wording of s.  11 (para.  54). \n2024 SCC 40 (CanLII)\n\n--- Page 89 ---\n \n \n While my colleague and I both agree that s.  11 of the ORA  is an opt -out \nregime, we part ways on the impact of this finding. Throughout her reasons, my \ncolleague does not seem to make any sort of distinction between the effects of opting \nin or opting out  — both are, in her view, a choice about whether or not to participate  in \na class proceeding. With respect, I cannot agree that the effects are the same. An opt -out \nregime automatically binds other provinces and the federal government to the law of \nBritish Columbia if nothing is done to prevent its operation.  \n An opt -out regi me has long been used in cases involving class proceedings. \nProponents of such a regime emphasize its ability to afford procedural protection to \nunnamed plaintiffs (see Currie v. McDonald’s Restaurants of Canada Ltd.  (2005), 74 \nO.R. (3d) 321 (C.A.), at par a. 28; see also W.  K. Winkler et al., The Law of Class \nActions in Canada (2014), at p.  213). An opt -out provision preserves the ability of \ntypically out -of-province claimants (or non -residents) to pursue their claims in their \nown provinces and to avoid bei ng bound by the forum province’s adjudicative  \njurisdiction over the class proceeding. That being said, judgments are binding only \nwhere a class member is “notified of the suit and is given an opportunity to exclude \nhimself or herself from the proceeding” ( Western Canadian Shopping Centres , at \npara.  49). In other words, the procedure of giving adequate notice of the ability to opt \nout of the class proceeding is crucial to maintaining the function of the provision (see \nCanada Post Corp. v. Lépine , 2009 SCC 16 , [2009] 1 S.C.R. 549, at para.  42; see also \nWestern Canadian Shopping Centres , at para.  49). Indeed, an opt -out regime is \n2024 SCC 40 (CanLII)\n\n--- Page 90 ---\n \n beneficial for those who would not ordinarily engage in any such litigation, as they are \nautomatically deemed to be prospective class  members in the class litigation.  \n On the other hand, an opt -out regime can be restrictive and can present \nchallenges for those made subject to it. In essence, the existence of an opt -out provision \nfirst necessitates that claimants automatically be deemed p rospective class members \nunless they ultimately choose to exercise their right to opt out and exclude themselves \nfrom the class action (see Turner v. Bell Mobility Inc ., 2016 ABCA 21, 394 D.L.R. \n(4th) 325, at para",
    "token_count": 1000,
    "start_token": 37800,
    "end_token": 38800,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 43,
    "source_file": "2024scc40.txt",
    "text": " opt -out regime can be restrictive and can present \nchallenges for those made subject to it. In essence, the existence of an opt -out provision \nfirst necessitates that claimants automatically be deemed p rospective class members \nunless they ultimately choose to exercise their right to opt out and exclude themselves \nfrom the class action (see Turner v. Bell Mobility Inc ., 2016 ABCA 21, 394 D.L.R. \n(4th) 325, at para.  11). If a person falls within the definit ion of a class member for the \npurposes of the commenced class action, they become “part of the plaintiff class unless \nthey opt -out” ( Gillis v. BCE Inc. , 2015 NSCA 32, 358 N.S.R. (2d) 39, at para.  8; see \nalso Frey v. BCE Inc. , 2013 SKCA 26, 409 Sask.  R. 266). In this way, they “will \ngenerally be bound by the result of the certified class proceeding unless they take the \nstep of opting out” (J.  Walker, H.  M. Rosenberg and J.  Kalajdzic, Class Actions in \nCanada: Cases, Notes, and Materials  (3rd ed. 2024), at p.  35). The dynamics of an \nopt-out regime are unlike those of an opt -in regime; the latter grants non -class members \nthe authority to take proactive and positive steps to become  class members in the class \nproceeding (p.  229). Non -class members are therefore no t automatically deemed to be \nprospective class members in the class action.  \n In my view, the legislature of British Columbia’s decision to impose an \nopt-out as opposed to an opt -in regime has important legal impacts on class members’ \nsubstantive litigation rights. The legislature of British Columbia has chosen to permit \n2024 SCC 40 (CanLII)\n\n--- Page 91 ---\n \n the Province of British Columbia to commence a class action while automatically \nincluding other governments in the action. While there is some case law describing the \nopt-out regime itself as  a procedural protection (see Currie , at para.  28), I agree with \nthe appellants that the effects of imposing such a regime are properly characterized as \nsubstantive and non -incidental (transcript, day 1, at p.  28). By implementing such a \nregime, the legisl ature of British Columbia is seeking to preserve the substantive rights \nit has arrogated by automatically imposing a class action upon other governments. It is \ncommencing an action without the consent of the other governments (see C.A. reasons, \nat para.  76). \n In this sense, I would agree with the Court of Appeal for Ontario in \nJohnson v. Ontario , 2021 ONCA 650, 158 O.R. (3d) 266, at para.  15, where \nLauwers  J.A. referred to “the right to opt out as itself a substantive right”. In that case, \nthe court concluded that the litigant “lost substantive rights of significant importance \nwhen his motion for an extension of time within which to opt out of the class action \nwas denied” (para.  26). The loss of significant substantive rights flowed from being \nautomat ically deemed a prospective class member. As Lauwers  J.A. wrote, at para.  16: \nOur society places a high premium on a person’s ability to initiate and \nparticipate in litigation as an incident of personal autonomy. Along with it \ngoes the right to appoint cou nsel of one’s choice, the right to participate \nmeaningfully in the development of litigation strategy, to participate in \nsettlement negotiations, and to settle the action. The legislative right to opt \nout of a class proceeding recognizes these significant rights.  \n2024 SCC 40 (CanLII)\n\n--- Page 92 ---\n \n \n As I stated earlier, a consequence of an opt -out regime (as opposed to \nallowing claimants to “opt in” as class members) is that defined class members are \nautomatically deemed to be in the class action unless they take proactive steps to \nopt out. As ide from the representative plaintiff, no class member can provide any \nmeaningful input on a host of important aspects of the proceeding, including but not \nlimited to the choice of counsel, litigation strategy, the evidence to be tendered, \nparticipation in  negotiation discussions, and, ultimately, the settlement of the action \n(see A.F., at para.  49). As the Court of Appeal for Ontario has pointed out",
    "token_count": 1000,
    "start_token": 38700,
    "end_token": 39700,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 44,
    "source_file": "2024scc40.txt",
    "text": " class action unless they take proactive steps to \nopt out. As ide from the representative plaintiff, no class member can provide any \nmeaningful input on a host of important aspects of the proceeding, including but not \nlimited to the choice of counsel, litigation strategy, the evidence to be tendered, \nparticipation in  negotiation discussions, and, ultimately, the settlement of the action \n(see A.F., at para.  49). As the Court of Appeal for Ontario has pointed out, the choice \nof opting out “gives a class member the opportunity to privilege their own litigation \nautonomy  — to develop their own strategy, retain their own counsel, settle, or litigate \nas they decide  — over the benefits of the class proceeding that is conducted for their \nbenefit, but outside their control” ( Johnson v. Ontario , 2022 ONCA 725, 164 O.R. (3d) \n573, at para.  47, citing Johnson  (2021) , at para.  16). \n Equally important is the fact that under an opt -out regime, class members \nwho fall within the definition of the class lose their right to simultaneously commence \nproceedings in their own jurisdictions. For example, if another province, such as \nOntario, commenced a class action in its own province and arising from its own \nlegislation (see, e.g., Opioid Damages and Health Care Costs Recovery Act, 2019 , S.O. \n2019, c.  17, Sch.  2, s. 12(1)) and automatically incl uded the Province of British \nColumbia as a class member, the latter would not be able to implement or enforce its \nown legislature’s enactment in its own province. In other words, the Province of British \nColumbia would not be able to commence its claim in i ts own courts in British \n2024 SCC 40 (CanLII)\n\n--- Page 93 ---\n \n Columbia. This potential conflict could in effect preclude the operation of a statute \nenacted by Parliament or other provincial legislatures.  \n My colleague suggests that in the context of the current class action, each \nprovince’s cl aim would be determined in accordance with its own substantive laws. \nWith great respect, this fact has no bearing on the constitutional analysis. It is not an \neffect of s.  11 of the ORA  itself, nor is it a necessary consequence of its operation. \nRather, it  stems from the Province of British Columbia’s litigation strategy to ensure \nthat the British Columbia Supreme Court’s adjudicative jurisdiction can be established \nin respect of all other provincial claims and a potential outcome resulting from the \napplica tion of choice of law rules.  \n Moreover, once a class proceeding is commenced in British  Columbia, the \nother governments also become subject to the adjudicative jurisdiction of the forum \nprovince without having taken any steps to opt in ( Hamm v. Canada (Attorney \nGeneral) , 2021 ABCA 329, 32 Alta. L.R. (7th) 213, at para.  15). The other \ngovernments are necessarily put to a choice pursuant to the laws of British \nColumbia  — in this case the ORA . Thus, if a class member does not opt out of the class \nproceedin g, it loses its litigation autonomy ( Herold v. Wassermann , 2022 SKCA 103, \n473 D.L.R. (4th) 281, at para.  39). As the British Columbia Court of Appeal wrote in \nCoburn and Watson’s Metropolitan Home v. Home Depot of Canada Inc. , 2019 BCCA \n308, 438 D.L.R. (4t h) 533, at para.  14, this is “the price paid to receive the benefit from \na class proceeding”.  \n2024 SCC 40 (CanLII)\n\n--- Page 94 ---\n \n \n I hasten to add that this situation is unlike one where governments appear \nin other provincial jurisdictions as litigants or interveners. In those cases, the fore ign \ngovernments nevertheless maintain autonomy and authority over their decision -making \nand can “settle or abandon [their] participation” in the forum province’s court (A.R.F., \nat para.  8). They maintain their decision -making with respect to all substantiv e aspects \nof their cases, irrespective of the fact that they are subject to the forum province’s rules \nof civil procedure. My colleague cites certain cases to suggest that some \ndecision -making power in the context of litigation can be limited by foreign co urts in \nother cases. These are cases where a court refused a plaintiff’s application to withdraw \nor discontinue",
    "token_count": 1000,
    "start_token": 39600,
    "end_token": 40600,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 45,
    "source_file": "2024scc40.txt",
    "text": " (A.R.F., \nat para.  8). They maintain their decision -making with respect to all substantiv e aspects \nof their cases, irrespective of the fact that they are subject to the forum province’s rules \nof civil procedure. My colleague cites certain cases to suggest that some \ndecision -making power in the context of litigation can be limited by foreign co urts in \nother cases. These are cases where a court refused a plaintiff’s application to withdraw \nor discontinue an action. With great respect, these cases do not assist in the present \ncontext. They involve particular circumstances in which plaintiffs attem pted to \ncircumvent important rules of litigation, such as rules for assessing and paying costs \n(see, e.g., Dubuc v. 1663066 Ontario Inc. , 2009 ONCA 914, 99 O.R. (3d) 476). These \nare examples where courts took away some individual rights belonging to litiga nts \nbecause of exceptional circumstances. Meanwhile, the effect of s.  11 is to \npresumptively  remove virtually all decision -making power in litigation.  \n The effects of the provision challenged in this appeal reflect the complete \nopposite of litigation autono my. The fact that s.  11 of the ORA operates within the \ncontext of an opt -out regime necessarily means that, by default, the other provincial \ngovernments and the federal government are included in the class proceeding. Having \nbeen automatically included pur suant to s.  11(1)(b)(i), the governments are stripped of \ntheir litigation autonomy if they do not take proactive steps to opt out of the action. \n2024 SCC 40 (CanLII)\n\n--- Page 95 ---\n \n These steps must be taken in accordance with the certification order, meaning that \nBritish Columbia’s provincia l courts get to dictate how other provinces and the federal \ngovernment go about preserving their own rights. Indeed, their decision to opt  out is \nformal and must be filed with the court (see W. K. Branch and M.  P. Good, Class \nActions in Canada  (2nd ed. (lo ose-leaf)), at §  11:1).  \n It is noteworthy that in their letters of support (or acknowledgment letters), \neach of the governments characterized s.  11 as an “opt -in” regime granting them the \nability to join the class proceeding after taking positive steps. The ir understanding of \ns. 11 is different than what s.  11 specifically provides for. It is also noteworthy, as the \nCourt of Appeal below recognized, that the Province of British  Columbia’s litigation \nstrategy involved “seek[ing] a term in the certification or der that governments that did \nnot ‘positively opt in ’ to the action would be deemed to have opted out ” (para.  54 \n(emphasis in original)). Again, this is not what s.  11 provides for. In determining \nwhether s.  11 is constitutional, our Court must consider wh at s. 11 actually authorizes \nBritish Columbia to do, not the province’s attempt to narrow the unconstitutional \neffects of the provision by seeking an opt -in provision in the actual certification order.  \n Once again, I recognize that the crux of the provision  contemplates \ncertification; but the dominant purpose of s.  11 is ascertained only by reference to what \nultimately happens in the class action after certification. In the instant case, the \nprovinces would, as each of them has recognized, be bound by orders  in the class action. \nThey would yield all of their litigation autonomy (transcript, day 1, at p.  29). In this \n2024 SCC 40 (CanLII)\n\n--- Page 96 ---\n \n way, the impugned provision permits the legislature of British  Columbia to interfere \nwith and impose upon the rights and prerogatives of the othe r provincial governments \nand the federal government.  \n(b) The Effects Are Not Merely Incidental  \n With respect, I cannot accept my colleague’s conclusion that the effects of \ns. 11 on the litigation autonomy of foreign governments are incidental. While the \neffects  that flow from automatically or presumptively interfering with the substantive \nrights of litigants outside the province may be incidental in some circumstances \n(although I would refrain from ruling on this matter), that is not so in the context of \ns. 11 of the ORA . Let me explain.  \n First, s.  11 operates primarily  — and not incidentally  — with respect to \nlitigants outside the legislating province. Its core operation is directed not at class \nmembers who are inside the province, but rather those",
    "token_count": 1000,
    "start_token": 40500,
    "end_token": 41500,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 46,
    "source_file": "2024scc40.txt",
    "text": " substantive \nrights of litigants outside the province may be incidental in some circumstances \n(although I would refrain from ruling on this matter), that is not so in the context of \ns. 11 of the ORA . Let me explain.  \n First, s.  11 operates primarily  — and not incidentally  — with respect to \nlitigants outside the legislating province. Its core operation is directed not at class \nmembers who are inside the province, but rather those who are outsid e the province, \nnamely other provincial governments and the federal government.  \n Second, the Crown is not an ordinary litigant. This is because each \nprovincial legislature and Parliament has granted to their own attorney general the \nauthority and responsibi lity to conduct litigation for or against the Crown ( Department \nof Justice Act , R.S.C. 1985, c.  J-2, s. 5; Government Organization Act , R.S.A. 2000, \nc. G-10, Sch.  9, s. 2; The Department of Justice Act , C.C.S.M. c.  J35, ss.  2 and 2.1; An \nAct Respecting the  Role of the Attorney General , R.S.N.B. 2011, c.  116, s.  2; Public \n2024 SCC 40 (CanLII)\n\n--- Page 97 ---\n \n Service Act , R.S.N.S. 1989, c.  376, s.  29; Ministry of the Attorney General Act , R.S.O. \n1990, c.  M.17, s.  5; Act respecting the Ministère de la Justice , CQLR, c.  M-19, s.  4; \nThe Justice and  Attorney General Act , S.S. 1983, c.  J-4.3, s.  10; Executive Council Act , \nS.N.L. 1995, c.  E-16.1, s.  4(4); Department of Justice Act , R.S.N.W.T. (Nu.) 1988, \nc. 97 (Supp.), s.  5; Judicature Act , R.S.P.E.I. 1988, c.  J-2.1, s.  36; Department of \nJustice Act , R.S.Y. 2002, c.  55, s.  7). \n The appellants are correct to assert that the responsibilities and powers of \nattorneys general to direct litigation for their governments have constitutional \ndimensions that are grounded in “custom, tradition and constitutional us age” (see In re \nCriminal Code (1910), 43 S.C.R. 434, at p.  443, per Idington  J.). The office of attorney \ngeneral is expressly recognized in Part  V of the Constitution Act, 1867  as part of the \nconstitutions of the provinces. Moreover, attorneys general have both executive and \njudicial functions. Indeed, as chief law officers of the Crown, attorneys general act on \nbehalf of the executive pursuant to the provinces’ responsibility u nder s.  92(14) of the \nConstitution Act, 1867  (see Krieger v. Law Society of Alberta , 2002 SCC 65, [2002] 3 \nS.C.R. 372, at paras.  24-27; Ontario v. Criminal Lawyers’ Association of Ontari o, 2013 \nSCC 43, [2013] 3 S.C.R. 3, at paras.  34-35). The effects of s.  11 on these important \nfunctions cannot be merely incidental.  \n(c) Balancing Legal and Practical Effects  \n For the purposes of the pith and substance analysis, it is true that these legal \neffects will operate together with the practical effects that flow from the  impugned \n2024 SCC 40 (CanLII)\n\n--- Page 98 ---\n \n provision. I acknowledge that in this case, the central practical effect is that the other \nprovincial governments and the federal government have the choice of opting out of \nthe class action pursuant to s.  11(2) of the ORA . My colleague asserts t hat this means \nthat the governments can ultimately maintain their litigation autonomy by withdrawing \nfrom the class action to be able to pursue their own claims in their own provinces. It is \nallegedly not until they have officially chosen not to opt out th at their litigation \nautonomy is impacted.  \n With respect, this perspective construes the true effect of s.  11 of the ORA  \n",
    "token_count": 1000,
    "start_token": 41400,
    "end_token": 42400,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 47,
    "source_file": "2024scc40.txt",
    "text": " pursuant to s.  11(2) of the ORA . My colleague asserts t hat this means \nthat the governments can ultimately maintain their litigation autonomy by withdrawing \nfrom the class action to be able to pursue their own claims in their own provinces. It is \nallegedly not until they have officially chosen not to opt out th at their litigation \nautonomy is impacted.  \n With respect, this perspective construes the true effect of s.  11 of the ORA  \nfar too narrowly . In my opinion, a proper assessment of the pith and substance of s.  11 \nrequires the Court to give appropriate weight to the fundamental consideration at issue: \nthat is, s.  11 permits the legislature of British Columbia to legislate automatically (or \nby default) in respect of the property and civil rights of other provincial governments \nand the federal government. While it i s true that those governments can opt out of the \nclass action, that does not change the legislation’s prima facie  interference with other \ngovernments. The significant legal effect is that the Province of British Columbia is \ncapable of encroaching upon the property and civil rights of other governments.  \n The practical ability to opt out does not avoid the automatic or default result \nof s. 11. Rather, the effect is that an opt -out regime “force[s] a decision” on the other \nprovincial governments and the federal  government about whether to subject their \nclaims to the jurisdiction of British Columbia (see A.F., at para.  62). I would also \nsuggest that, by mitigating the very significant legal effects of a provision through the \n2024 SCC 40 (CanLII)\n\n--- Page 99 ---\n \n practical components of the provision,  a legislature can change or cloak the dominant \nthrust of its legislation. This is because the foreign governments’ membership in the \nclass action is automatically presumed, meaning that the provision’s default position \nwould, in pith and substance, interf ere with their litigation autonomy. These \nunconstitutional effects cannot be made valid by the fact that the other provincial \ngovernments and the federal government can choose to opt out of the proceedings.  \n Thus, it cannot be said that an opt -out regime is  purely procedural. With \nrespect, such a pretention is an attempt to sidestep the real and substantial impacts that \nthe legislation has on the litigation autonomy of class members. It would appear that \nthe respondent is aware of this complexity, as it argu es that if s.  11 of the ORA  is found \nto be ultra vires  the provincial legislature, the availability of an opt -in regime should \nbe read into s.  11(2) of the ORA  (see R.F., at paras.  33 and 118 -27). I agree with the \nCourt of Appeal below that this concession , which is intended to save the \nconstitutionality of s.  11, is misconceived (para.  54). Without commenting on whether \nan opt -in regime would, in fact, fix the unconstitutionality of s.  11, I conclude that the \ntext of s.  11(2) of the ORA  and s.  16 of the CPA cannot support the respondent’s \ninterpretation.  \n(3) Conclusion on Pith and Substance  \n Having regard to the default position of s.  11(1)(b) of the ORA  and the \nopt-out context in which s.  11 operates, I conclude that the pith and substance of the \nprovision is t o legislate with respect to the substantive rights of other governments to \n2024 SCC 40 (CanLII)\n\n--- Page 100 ---\n \n litigate for the recovery of health care costs. As a result, I would agree with the \nappellants and find that s.  11 of the ORA falls within “Property and Civil Rights” under \ns. 92(13 ) of the Constitution Act, 1867 . \nB. Territorial Limitations  \n Given that the pith and substance in this case relates to an intangible matter, \nI turn now to whether the impugned provision “respect[s] the dual purposes of the \nterritorial limitations in s.  92” of the Constitution Act, 1867  (Imperial Tobacco , at \npara.  36). Even if I were wrong about the classification of s.  11 of the ORA  under \ns. 92(13) and it instead falls under s.  92(14), I find that s.  11 exceeds the territorial \nlimitations on the legislative jur isdiction of British Columbia. In my view, the en",
    "token_count": 1000,
    "start_token": 42300,
    "end_token": 43300,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 48,
    "source_file": "2024scc40.txt",
    "text": " in s.  92” of the Constitution Act, 1867  (Imperial Tobacco , at \npara.  36). Even if I were wrong about the classification of s.  11 of the ORA  under \ns. 92(13) and it instead falls under s.  92(14), I find that s.  11 exceeds the territorial \nlimitations on the legislative jur isdiction of British Columbia. In my view, the enacting \nprovince does not have a meaningful connection with both the impugned legislation \nand those made subject to it. I would also voice serious concerns about the potential \nimpact of s.  11 on the legislati ve sovereignty of the other provinces.  \n(1) Meaningful Connection  \n In the result, I find that the respondent has failed to establish a meaningful \nconnection in this case. Having concluded that s.  11 of the ORA , in pith and substance, \nis substantive in nature, th ereby falling within the scope of s.  92(13) of the Constitution \nAct, 1867 , I conclude that the enacting legislature does not have a meaningful \nconnection with both the subject matter of the law and those made subject to it. \nHowever, even if I were to proce ed on the premise that the provision, in pith and \n2024 SCC 40 (CanLII)\n\n--- Page 101 ---\n \n substance, is procedural and therefore falls within the scope of s.  92(14), I would still \nfind no meaningful connection between the enacting legislature and those made subject \nto s. 11. \n First, the fact that  the subject matter of the law, in pith and substance, \naffects the substantive rights of other governments necessarily means that it has no \nmeaningful connection with the enacting province. Second, those “made subject to” \ns. 11 of the ORA  are the other pro vincial governments and the federal government, all \nof which have no meaningful connection with the enacting province. While it is the \ndefendants who are made subject to the ORA  as a whole  — much like it was the \ndefendants who were made subject to the TRA considered in Imperial Tobacco  — those \nmade subject to s.  11, in particular, are other governments. They are the ones on whose \nbehalf the class action is commenced. I will return to this point later in these reasons.  \n(a) Legislative and Adjudicative Jurisdiction  \n Before I proceed with my analysis on the issue of meaningful connection, \nI pause to comment on my colleague’s reliance on the real and substantial connection \ntest to support her conclusion that, given the common issues at play, s.  11 of the ORA \nhas a meaningful connection to British Columbia. I feel it necessary to highlight, in an \neffort to circumscribe the scope of this appeal, what I believe is confusion between the \nprescriptive legislative jurisdiction of the legislature of British Columbia  and the \nadjudicative jurisdiction of British Columbia courts.  \n2024 SCC 40 (CanLII)\n\n--- Page 102 ---\n \n \n The present appeal turns on the constitutional validity of s.  11 of the ORA , \nnot on whether the presence of common issues can ground jurisdiction in a provincial \nsuperior court over multi -Crown  class proceedings or multi -jurisdictional class \nproceedings in general. The constitutional validity of national class actions is irrelevant \nto the constitutional validity of s.  11 of the ORA  because it involves different \nconsiderations. The former is conc erned with the adjudicative jurisdiction of the British \nColumbia courts, while the latter is concerned with the territorial limitations imposed \non the legislative authority of the legislature of British Columbia. In this sense, I share \nthe view expressed b y our Court in Newfoundland and Labrador (Attorney General) v. \nUashaunnuat (Innu of Uashat and of Mani -Utenam) , 2020 SCC 4, [2020] 1 S.C.R. 15, \nat para.  16, that “it is important not to conflate the adjudicative competence of \nprovincial superior courts wit h the legislative competence of the province”.  \n My colleague states that s.  11 is “consistent with how courts establish \njurisdiction over out -of-province class members” (para.  89). With respect, this is a \nperfect example of how her analysis confuses the adj udicative competence of courts \nwith the legislative competence of the province.  \n The territorial limitations on the scope of the provincial legislative \nauthority granted by s.  92 of the Constitution Act, 186",
    "token_count": 1000,
    "start_token": 43200,
    "end_token": 44200,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 49,
    "source_file": "2024scc40.txt",
    "text": " competence of the province”.  \n My colleague states that s.  11 is “consistent with how courts establish \njurisdiction over out -of-province class members” (para.  89). With respect, this is a \nperfect example of how her analysis confuses the adj udicative competence of courts \nwith the legislative competence of the province.  \n The territorial limitations on the scope of the provincial legislative \nauthority granted by s.  92 of the Constitution Act, 1867  prevent both the enactment of \nlegislation whose pith and substance is outside the province and the application of a \nlaw of a province to matters not connected to that province. The validity of an \nenactment requires a “meaningful connection” to be established between the enacting \n2024 SCC 40 (CanLII)\n\n--- Page 103 ---\n \n province, the legislativ e subject matter, and those made subject to it ( Imperial Tobacco , \nat para.  36). In contrast, courts can apply a valid enactment to extraterritorial subjects \nwhere a “‘sufficient’ connection” is established ( Unifund Assurance Co. v. Insurance \nCorp. of Briti sh Columbia , 2003 SCC 40, [2003] 2 S.C.R. 63, at para.  56; Sharp , at \npara.  112).  \n These tests are not to be confused with the “real and substantial \nconnection” test applicable in determining whether the court of a province will assume \njurisdiction over a ma tter or whether the conflicts rules are inconsistent with the \nterritorial limitations imposed by s.  92 of the Constitution Act, 1867 (see Club Resorts \nLtd. v. Van Breda , 2012 SCC 17, [2012] 1 S.C.R. 572, at paras.  21-34). In Hunt v. T&N \nplc, [1993] 4 S.C.R . 289, at p.  325, La  Forest  J. stated that the real and substantial \nconnection test “was not meant to be a rigid test, but was simply intended to capture \nthe idea that there must be some limits on the claims to jurisdiction”. In this respect, I \nfully agree  with Bastarache  J. that “[t]he real and substantial connection necessary for \nthe courts of a province to take jurisdiction over a claim constitutes a lower threshold \nthan the meaningful connection required for a province to legislate with respect to the \nrights at issue” ( Castillo v. Castillo , 2005 SCC 83, [2005] 3 S.C.R. 870, at para.  44, per \nBastarache  J., concurring ; see also Unifund , at paras.  58 and 80; Sharp , at para.  116). \nWith respect, my colleague’s attempt to ground a meaningful connection in the real \nand substantial connection test blurs the distinction ably made by Bastarache  J., even \nthough the law is clear that the former is a higher standard.  \n2024 SCC 40 (CanLII)\n\n--- Page 104 ---\n \n \n I therefore respectfully disagree that the certification of the class action \nbased on a real and subst antial connection established through shared common issues \n(or commonality) will ensure a meaningful connection between the enacting province, \nthe legislative subject matter, and those made subject to it. Given the distinction \nbetween a real and substantia l connection and a meaningful connection, a finding of \nthe former does not necessarily entail a finding of the latter. Conversely, concluding \nthat no meaningful connection can be established has no impact on the question of \nwhether the common issues shared  between the non -resident class plaintiffs and the \nresident representative plaintiff suffice to establish a real and substantial connection for \nthe purposes of adjudicative jurisdiction over a multi -jurisdictional class proceeding. \nMy colleague’s analysis either fails to address or ignores the distinction between the \ntwo tests, despite the appellants’ arguments on this point (A.F., at para.  98). \n That being said, it would be imprudent to comment on how the real and \nsubstantial connection test is to be met in  the context of multi -jurisdictional class \nactions  — a question that has not been raised by the parties in the present appeal. Our \nCourt has never ruled on this question, and there are diverging opinions at the appellate \nlevel, as well as considerable acad emic debate, on whether the certification of common \nissues is sufficient to ground a superior court’s jurisdiction over foreign class members \n(see Harrington v. Dow Corning Corp. , 2000 BCCA 605, 193 D.L.R",
    "token_count": 1000,
    "start_token": 44100,
    "end_token": 45100,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 50,
    "source_file": "2024scc40.txt",
    "text": "isdictional class \nactions  — a question that has not been raised by the parties in the present appeal. Our \nCourt has never ruled on this question, and there are diverging opinions at the appellate \nlevel, as well as considerable acad emic debate, on whether the certification of common \nissues is sufficient to ground a superior court’s jurisdiction over foreign class members \n(see Harrington v. Dow Corning Corp. , 2000 BCCA 605, 193 D.L.R. (4th) 67; HSBC \nv. Hocking , 2008 QCCA 800, [2008] R .J.Q. 1189; Airia Brands Inc. v. Air Canada , \n2017 ONCA 792, 417 D.L.R. (4th) 467). In this context, I would be wary of \ncommenting on this issue without it being raised on a proper record.  \n2024 SCC 40 (CanLII)\n\n--- Page 105 ---\n \n \n My colleague also states that the “nature of the class action” and t he \n“choice of the foreign Crowns to participate in the proceeding” are what allow s.  11 to \nmaintain a meaningful connection to British Columbia (para.  88). It is unclear what the \n“nature of the class action” might refer to, aside from the potential to reso lve common \nissues. But my colleague’s reliance on the so -called “choice” of the foreign Crowns to \nparticipate, or their “consent” to the proceedings, is problematic (para.  91). \n I take issue with the statement that the foreign Crowns have chosen to \nparticip ate. They have not, since the nature of an opt -out regime is such that the foreign \ngovernments are not actually “choosing” to participate. There is no true choice, because \nthe provinces are already participating unless they take the steps to opt out within  the \ntimeline and on the conditions specified by the certification judge.  \n Furthermore, even if true consent were  obtained from the foreign \ngovernments, consent should still play no role in deciding whether there is a meaningful \nconnection. Consent from for eign governments cannot determine the constitutionality \nof an impugned provision. As I stated earlier, there may be cases where foreign \ngovernments believe that a law in one province is advantageous to them, even where \nthat law goes beyond that province’s law-making powers. Mutual agreement cannot \nsave a law that is ultra vires  the province.  \n Having made this clarification, I now turn to the question of whether a \nmeaningful connection can be established in this case.  \n2024 SCC 40 (CanLII)\n\n--- Page 106 ---\n \n (b) There Is No Meaningful Connection in This  Case  \n My colleague concludes that there is a meaningful connection between the \nenacting province, the subject matter of the law, and those made subject to the law, in \nline with the test employed in Imperial Tobacco . This conclusion is premised in part \non her view that following certification, the extraterritorial effects on foreign Crowns \narise not from s.  11, but from the court’s decision to certify the action (para.  90). \n I disagree with this premise. The extraterritorial effects flow from the \nprovision, n ot from the court’s certification. First, the purpose of s.  11 is to authorize \nthe Province to seek certification of the class action from the court. The action cannot \nbe certified without the existence of s.  11. Second, the assessment of a meaningful \nconn ection must be made with a view to the pith and substance of the impugned law. \nOnce again, I reiterate that the dominant feature of s.  11 can be ascertained only by \nreference to what happens in the class action post -certification.  \n In my opinion, the test t hat Major  J. adopted in Imperial Tobacco  must be \nviewed in the specific context of that case, where the analysis concerned the TRA in its \nentirety. In the instant appeal, the analysis is concerned with one specific provision: \ns. 11 of the ORA . \n Moreover, th ere is a marked divergence between the context and legislation \nin Imperial Tobacco  and those in the current case. In Imperial Tobacco , the defendant \ntobacco manufacturers challenged the constitutional validity of British  Columbia’s \n2024 SCC 40 (CanLII)\n\n--- Page 107 ---\n \n TRA. The TRA created a d irect and distinct cause of action authorizing the Province of \nBritish Columbia to sue the tobacco manufacturers for the tobacco -related health care \ncosts that",
    "token_count": 1000,
    "start_token": 45000,
    "end_token": 46000,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 51,
    "source_file": "2024scc40.txt",
    "text": " th ere is a marked divergence between the context and legislation \nin Imperial Tobacco  and those in the current case. In Imperial Tobacco , the defendant \ntobacco manufacturers challenged the constitutional validity of British  Columbia’s \n2024 SCC 40 (CanLII)\n\n--- Page 107 ---\n \n TRA. The TRA created a d irect and distinct cause of action authorizing the Province of \nBritish Columbia to sue the tobacco manufacturers for the tobacco -related health care \ncosts that it incurred. That was its pith and substance. It did not purport to engage the \nrights of any oth er province (see E.  Edinger, “ British  Columbia v. Imperial Tobacco \nCanada Ltd. : Extraterritoriality and Fundamental Principles” (2006), 43 Can. Bus. L.J.  \n301, at pp.  306-7). Nor did it operate within the context of a class action. The pith and \nsubstance of  the TRA was the creation of a new cause of action within the province, as \nwell as the simplification of the evidentiary burdens involved.  \n Writing for a unanimous Court, Major  J. recognized that an assessment of \nthe validity of legislation must have regard  to “the relationships among the enacting \nterritory, the subject matter of the law, and the person[s] sought to be subjected to its \nregulation” ( Imperial Tobacco , at para.  35, citing Unifund , at para.  63). He found that \nthe pith and substance of the legisl ation was in the province, irrespective of the fact that \nthe defendants were not all physically located within the province. Regarding the \nrequisite meaningful connection, he arrived at the following conclusion, at para.  37: \nHere, the cause of action that is the pith and substance of the Act serves \nexclusively to make the persons ultimately responsible for tobacco -related \ndisease suffered by British Columbians  — namely, the tobacco \nmanufacturers who, through their wrongful acts, caused those British \nColumbi ans to be exposed to tobacco  — liable for the costs incurred by the \ngovernment of British Columbia in treating that disease. There are thus \nstrong relationships among the enacting territory (British Columbia), the \nsubject matter of the law (compensation fo r the government of British \nColumbia’s tobacco -related health care costs) and the persons made \nsubject to it (the tobacco manufacturers ultimately responsible for those \ncosts) , such that the Act can easily be said to be meaningfully connected to \nthe provin ce. [Emphasis added.]  \n2024 SCC 40 (CanLII)\n\n--- Page 108 ---\n \n \n It is uncontested among the parties in this appeal that, with the exception \nof s. 11, the legislation at the heart of this case mirrors the TRA considered by our Court \nin Imperial Tobacco  (see A.F., at para.  13; R.F., at para.  15). I accept this proposition. \nIndeed, both the ORA and the TRA provide the enacting province with a direct and \ndistinct cause of action in relation to a particular wrong  — be it tobacco - or \nopioid -related. I do not dispute the fact that the enactment of the ORA , like that of the \nTRA, simplified the rules and grounded a cause of action for the Province.  But the ORA  \nis unique in a significant way. Section 11 allows the Province of British Columbia to \nbring a class action on behalf of other governments across Canad a. No such mechanism \nwas available to the Province under the TRA. \n In my opinion, what differentiates the result of the analysis in this case is \ntwofold. First, the fact that the subject matter of the law is, in pith and substance, related \nto the substantiv e rights of other governments necessarily means that it has no \nmeaningful connection with the enacting province. Unlike the circumstances in \nImperial Tobacco , it cannot be said that the Province of British Columbia has any \nmeaningful connection with the su bstantive rights of the other provincial governments \nand the federal government. Indeed, the manner in which the substantive rights of other \nprovinces  — to litigate for the recovery of health care costs  — operate in the context \nof a civil action in British  Columbia is beyond the purview of the enacting province. \nTo use the words of McIntyre  J. in Upper Churchill , I would conclude that the result \nof s. 11 is therefore “the derogation from or elimination of extra -provincial rights” \n(p. 332).  \n2024 SCC 40 (CanLII)\n\n--- Page 109 ---\n \n \n Second,",
    "token_count": 1000,
    "start_token": 45900,
    "end_token": 46900,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 52,
    "source_file": "2024scc40.txt",
    "text": " the recovery of health care costs  — operate in the context \nof a civil action in British  Columbia is beyond the purview of the enacting province. \nTo use the words of McIntyre  J. in Upper Churchill , I would conclude that the result \nof s. 11 is therefore “the derogation from or elimination of extra -provincial rights” \n(p. 332).  \n2024 SCC 40 (CanLII)\n\n--- Page 109 ---\n \n \n Second, there is a difference between those “made subject to” the law \nconsidered in Imperial Tobacco and those made subject to s.  11 of the ORA . As \nillustrated by the excerpt above, the defendant tobacco manufacturers in Imperial \nTobacco  were made subject to the TRA. The l egislation in that case provided the \nProvince of British Columbia with a direct and distinct cause of action against the said \ndefendants for tobacco -related harms suffered by British Columbians. As Major  J. \nrecognized, there was “at all times one critical connection to British Columbia \nexclusively: the recovery permitted by the action is in relation to expenditures by the \ngovernment of British Columbia for the health care of British Columbians” (para.  38). \nThe purpose of the legislated cause of action was t o simplify and codify a mechanism \nthrough which the Province could recoup health care costs for a breach of a duty owed \n“to persons in British Columbia” (paras.  40-41). The action itself was against the \ndefendants, and the duty was owed by the defendants. The central component of the \nTRA was therefore the direct and distinct cause of action against the defendants who \nwere made subject to the law for the harms they were said to have caused. The Province \nof British Columbia was authorized to bring an action o n behalf of its own province for \nthe harms suffered therein.  \n On the other hand, s.  11 of the ORA  serves a broader purpose than merely \nto establish or ground the Province of British Columbia’s cause of action against the \ndefendants  — a function of the ORA  in its entirety (see C.A. reasons, at paras.  1 and \n96). Unlike the remaining provisions of the ORA , s. 11 is not merely concerned with \nthe statutory cause of action for opioid -related wrongs in the province . Nor is it \n2024 SCC 40 (CanLII)\n\n--- Page 110 ---\n \n concerned with the defendants in this  case. Those are functions that are addressed and \naccomplished by the remainder of the ORA . Instead, the focus of s.  11 is on the other \ngovernments as plaintiffs and how their substantive rights operate in the context of the \ncivil action. Section 11 permit s the Province of British Columbia to presumptively act, \nas a representative plaintiff, on behalf of other provincial governments and the federal \ngovernment in a class proceeding. Contrary to the respondent’s assertion (see R.F., at \npara.  91), it is not th e Province or the defendants that are made subject to the strictures \nof s. 11. Instead, it is the other provincial governments and the federal government. I \nwould maintain this logic even if I were to proceed on the premise that s.  11 is \nprocedural in natu re and potentially falls under s.  92(14) of the Constitution Act, 1867 . \n For these reasons, I am of the view that the Province of British Columbia \ndoes not have a meaningful connection with both the subject matter of s.  11 and those \nmade subject to it. More  specifically, there is no connection between the Province of \nBritish  Columbia and the other governments named in the class action; no connection \nbetween the Province of British Columbia and the claims of the other governments; \nand no connection between th e Province of British Columbia and the subject matter of \ns. 11. As a result, s.  11 of the ORA  does not respect the territorial limitations prescribed \nby s.  92 of the Constitution Act, 1867 . \n(2) Legislative Sovereignty  \n Having found that there is no meaningful connection between the enacting \nprovince, the subject matter of the law, and those made subject to the law, I need not, \n2024 SCC 40 (CanLII)\n\n--- Page 111 ---\n \n for the disposition of this appeal, opine on whether s.  11 of the ORA  pays respect to the \nlegis lative sovereignty of the other provincial governments and the federal government. \nHowever, I wish to voice some concerns about the ability of a legislature to encroach \non the legislative sovereignty of",
    "token_count": 1000,
    "start_token": 46800,
    "end_token": 47800,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 53,
    "source_file": "2024scc40.txt",
    "text": " subject matter of the law, and those made subject to the law, I need not, \n2024 SCC 40 (CanLII)\n\n--- Page 111 ---\n \n for the disposition of this appeal, opine on whether s.  11 of the ORA  pays respect to the \nlegis lative sovereignty of the other provincial governments and the federal government. \nHowever, I wish to voice some concerns about the ability of a legislature to encroach \non the legislative sovereignty of other provinces and the federal government or to \neffectively bind provincial legislatures and Parliament by default.  \n The equal sovereignty of the provinces and the federal government is \nfundamental to our system of federalism ( Reference re Secession of Quebec , [1998] 2 \nS.C.R. 217, at paras.  56-59). By operat ion of the territorial limitation imposed by s.  92 \nof the Constitution Act, 1867 , each province is obliged to respect the sovereignty of the \nother provinces within their respective legislative spheres, and each can expect the \nsame respect in return ( Unifun d, at paras.  50-51; Imperial Tobacco , at para.  27). A \nprovince must therefore avoid encroaching on matters that properly fall within the \nexclusive jurisdiction of other provinces through its legislation.  \n In Imperial Tobacco , Major  J. did not specify what r equirement an \nimpugned provision must meet in order for its pith and substance to respect the \nlegislative authority of the other provinces. Importantly, however, he noted that \nalthough the cause of action created by the TRA might “capture, to some extent, \nactivities occurring outside of British Columbia”, there was no encroachment on the \nsovereignty of the other provinces because “no territory could possibly assert a stronger \nrelationship to that cause of action than British Columbia” (para.  38). In contras t, it \ncannot be said that the Province of British Columbia has the strongest relationship to \n2024 SCC 40 (CanLII)\n\n--- Page 112 ---\n \n the substantive rights of other governments to litigate for the recovery of health care \ncosts in the present case.  \n Allowing British Columbia to bind other provinci al governments and the \nfederal government to its multi -Crown class proceeding could encroach on the \nlegislative sovereignty of those governments. Such participation could in effect bind \nthe provincial legislatures and Parliament. Indeed, in the present cas e, if the executive \ndoes not opt out of the commenced class proceeding, the authority of the legislatures \nand Parliament would be fettered because they could not validly legislate their way out \nof the proceeding. Participation in the class proceeding would  come at the expense of \nthe authority of the legislatures and Parliament to supervise the conduct of Crown \nlitigation through their attorneys general.  \n This stands in stark contrast to the circumstances in Reference re \nPan-Canadian Securities Regulation , 2018 SCC 48, [2018] 3 S.C.R. 189, where our \nCourt concluded that an executive agreement to implement a proposed national \ncooperative system for the regulation of capital markets did not and could not fetter the \nsovereignty of the legislatures of the particip ating provinces. That was because the \nprovinces could always legislate to pull the executive out of the agreement (para.  67; \nsee also J.  Poirier, “The 2018 Pan -Canadian Securities Regulation Reference: Dualist \nFederalism to the Rescue of Cooperative Federa lism” (2020), 94 S.C.L.R. (2d) 85).  \n It may be that a provincial Crown can be bound by the consequences of its \nactions when it chooses to exercise its civil rights or to act outside the province, in its \n2024 SCC 40 (CanLII)\n\n--- Page 113 ---\n \n capacity as a natural person (see D.  Gibson, “Interjur isdictional Immunity in Canadian \nFederalism” (1969), 47 Can. Bar Rev.  40, at pp.  60-61). In such circumstances, the \nterritorial limitations on provincial powers would prevent the legislature of that \nprovince from relieving the Crown of those consequences. This is not a case of the \nCrown binding the legislature, but a simple application of the territorial limitations \nimposed by s.  92 of the Constitution Act, 1867 . Unlike the situation in Upper Churchill , \nwhere a foreign government is forced into a class acti on under s.  11 of the ORA , the \nconsequences are suffered in that government’s province. There is no expectation that \na province can legislate in respect of a contract",
    "token_count": 1000,
    "start_token": 47700,
    "end_token": 48700,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 54,
    "source_file": "2024scc40.txt",
    "text": ". This is not a case of the \nCrown binding the legislature, but a simple application of the territorial limitations \nimposed by s.  92 of the Constitution Act, 1867 . Unlike the situation in Upper Churchill , \nwhere a foreign government is forced into a class acti on under s.  11 of the ORA , the \nconsequences are suffered in that government’s province. There is no expectation that \na province can legislate in respect of a contract situated in another province. But it is \nexpected that a province can legislate for the re covery of health care costs incurred in \nits own province, irrespective of statutory regimes enacted in other provinces. It is a \nmatter that properly belongs to that province. The question of whether a provincial \nCrown can opt in and then bind its own legis lature in this way, however, should be left \nfor another day.  \n I add that, in my view, the fact that the other governments have endorsed \nthe constitutional validity of the provision is of no moment in this case and does not \nsave its validity. It is true that  the other governments, on the basis of their understanding \nof the regime, have expressed support for the constitutional validity of the provision \nthrough acknowledgment letters (see Appellants’ Condensed Book, tab  7). In their \nletters, the other provincia l governments and the federal government characterize s.  11 \nas an “opt -in” provision that grants them the freedom to take positive steps to join the \nclass proceeding as non -representative plaintiffs. Each of them refers to its \n2024 SCC 40 (CanLII)\n\n--- Page 114 ---\n \n understanding that if this ac tion is certified, it “will have the right to ‘opt -in’ to the \nproceeding” (see, e.g., tab  7). This is a misunderstanding of the provision, as it operates \nwithin the context of an opt -out regime.  \n The support of the other governments  — as reflected in their \nacknowledgment letters  — serves no meaningful purpose and should not be given any \nsignificant weight. With respect, while it is true that caution is appropriate where other \nattorneys general support the validity of another legislature’s enactment (see Good win \nv. British Columbia (Superintendent of Motor Vehicles) , 2015 SCC 46, [2015] 3 S.C.R. \n250, at para.  33), that is quite different from my colleague’s contention that the \npresumption of constitutionality is “especially strong” when the other attorneys gen eral \nsupport the law’s validity. In this case, each acknowledgment letter that is available in \nthe record clearly misconstrues s.  11 as an opt -in provision. This interpretation of the \nimpugned provision is not tenable and, accordingly, the presumption cann ot be relied \nupon (see R. v. Brown , 2022 SCC 18, [2022] 1 S.C.R. 374, at para.  88; Ontario v. \nCanadian Pacific Ltd. , [1995] 2 S.C.R. 1031, at para.  15). The opt -out provision \nautomatically includes the other governments in the class proceeding and grants t hem \nthe right to opt out. It does not offer the other governments the choice to opt in after \nexcluding them by default. The governments’ support is not based on a proper reading \nof the provision.  \n I would be remiss if I did not add the following remark. Jus t as the \nprovincial legislatures cannot delegate their legislative authority in respect of matters \n2024 SCC 40 (CanLII)\n\n--- Page 115 ---\n \n that fall within their exclusive jurisdiction under Part  VI of the Constitution Act, 1867 , \nso too are they unable to consent to other provinces arrogating su ch authority (see \nAttorney General of Nova Scotia v. Attorney General of Canada , [1951] S.C.R. 31;  \nReference re Pan -Canadian Securities Regulation , at para.  75). The provinces cannot \namend the Constitution by mutual consent.  \n(3) Conclusion on Territorial Limit ations  \n I find that s.  11 exceeds the territorial limitations on the legislative \njurisdiction of British Columbia. In my view, the enacting province does not have a \nmeaningful connection with both the impugned legislation and those made subject to \nit. While  our Court has often emphasized the importance of enhancing access to justice \nand facilitating intergovernmental cooperation, the constitutional boundaries that \nunderlie the fundamental structure of Canadian federalism must be respected.  \nC. Ancillary Powers  \n Given my conclusion that the provision is ultra vires  the legislature of \n",
    "token_count": 1000,
    "start_token": 48600,
    "end_token": 49600,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 55,
    "source_file": "2024scc40.txt",
    "text": " \njurisdiction of British Columbia. In my view, the enacting province does not have a \nmeaningful connection with both the impugned legislation and those made subject to \nit. While  our Court has often emphasized the importance of enhancing access to justice \nand facilitating intergovernmental cooperation, the constitutional boundaries that \nunderlie the fundamental structure of Canadian federalism must be respected.  \nC. Ancillary Powers  \n Given my conclusion that the provision is ultra vires  the legislature of \nBritish Columbia, it is necessary to briefly consider whether the prima facie  invalidity \nof the provision can be saved under the ancillary powers doctrine.  \n The ancillary powers doctrin e employs a rational and functional connection \ntest to determine whether the impugned provision considered in the pith and substance \nanalysis is connected to a valid legislative scheme. As our Court indicated in Reference \n2024 SCC 40 (CanLII)\n\n--- Page 116 ---\n \n re Assisted Human Reproduction Act , 2010 SCC 61, [2010] 3 S.C.R. 457, at para.  127, \nthe test of “necessity” applies “where the encroachment on the jurisdiction of the other \nlevel of government is substantial”. Our Court went on to distinguish the two \napproaches, at para.  138: \nThe rational and functional connection test assesses the relationship \nbetween the ancillary provisions and the otherwise valid legislative scheme \nin which they appear. The ancillary provisions must support the scheme in \na way that is rational in purpose and functional in effect. .  . . It need not be \nshown that the scheme would fail without the ancillary provisions; that \nwould be a test of necessity. Rather, the ancillary provisions must \nthemselves perform a function that complements the other provisions in \nthe scheme, a nd they cannot have been tacked on merely as a matter of \nconvenience.  \n The appellants submit that s.  11 is neither rationally nor functionally \nconnected to the ORA  and thus cannot be saved by the doctrine. The respondent argues \nthat the intrusion in this ca se, if any, is minimal. In particular, the respondent suggests \nthat there is a rational and functional connection between s.  11 of the ORA  and the \nlegislative scheme in its entirety.  \n While I acknowledge the flexible approach that has been endorsed by our \nCourt (see Reference re Assisted Human Reproduction Act , at para.  139), as well as my \ncolleague’s remarks about cooperation between Canadian regulatory regimes \n(para.  37), I am of the view that the ancillary powers doctrine cannot uphold the \nconstitutional validity of s.  11 of the ORA . \n2024 SCC 40 (CanLII)\n\n--- Page 117 ---\n \n \n As the appellants contend, s.  11 of the ORA is “the only provision of the \nORA  related to causes of action of other provincial or territorial governments under \ntheir own substantive laws” (A.F., at para.  112). As I indicated ea rlier and as my \ncolleague notes at para.  22 of her reasons, the ORA  otherwise largely mirrors and is \nmodeled after the TRA considered by our Court in Imperial Tobacco . Its focus is to \nestablish or ground a direct and distinct cause of action against the de fendants. Indeed, \nthe TRA fulfills its function without a provision that relates to a multi -Crown class \nproceeding.  \n So too, then, should the ORA . Without s.  11, the ORA properly grounds and \nestablishes a direct and distinct cause of action against manufact urers, wholesalers or \nconsultants in respect of opioid -related wrongs. As I have discussed in these reasons, \nthe intrusion of s.  11 on the competence of other governments is substantial; thus, there \nis a “higher .  . . threshold for upholding it on the basi s of the ancillary powers doctrine” \n(Reference re Assisted Human Reproduction Act , at para.  127). The provision is not \nneeded to enforce the substantive aspects of the remainder of the ORA . Rather, the \nProvince of British Columbia can proceed with its own claim in its own province in the \nabsence of s.  11. \n Thus, I conclude that the constitutional validity of s.  11 of the ORA cannot \nbe upheld through the ancillary powers doctrine. The ORA  can stand and can fulfill the \nobjectives of the legislature of British Columbia without the support of s.  11, as the \nprovision is not “necessarily incidental” to the otherwise valid scheme, nor does it \n2024 SCC ",
    "token_count": 1000,
    "start_token": 49500,
    "end_token": 50500,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 56,
    "source_file": "2024scc40.txt",
    "text": " its own province in the \nabsence of s.  11. \n Thus, I conclude that the constitutional validity of s.  11 of the ORA cannot \nbe upheld through the ancillary powers doctrine. The ORA  can stand and can fulfill the \nobjectives of the legislature of British Columbia without the support of s.  11, as the \nprovision is not “necessarily incidental” to the otherwise valid scheme, nor does it \n2024 SCC 40 (CanLII)\n\n--- Page 118 ---\n \n “actively further” it (see C.  Mathen and P.  Macklem, eds., Canadian Constitutional \nLaw (6th ed. 2022),  at pp.  215 and 225; Br un, Tremblay and Brouillet, at paras.  VI-2.49 \nto VI -2.54; see also Quebec (Attorney General) v. Lacombe , 2010 SCC 38, [2010] 2 \nS.C.R. 453).  \nD. Remedy  \n As I have found that the impugned provision’s pith and substance does not \nrespect the territorial limitations  imposed upon the provinces by the Constitution, I turn \nfinally to the issue of remedy.  \n In short, the appropriate remedy is severance. Where a court employs the \ndoctrine of severance, it does so in order “to interfere with the laws adopted by the \nlegislatu re as little as possible” ( Schachter v. Canada , [1992] 2 S.C.R. 679, at p. 696). \nAs our Court indicated in Schachter , at p.  696, “when only a part of a .  . . provision \nviolates the Constitution, it is common sense that only the offending portion should be \ndeclared to be of no force or effect, and the rest should be spared”. In a more recent \ndecision, our Court stated that rather than striking down an Act in its entirety, which is \nrarely done, remedies such as severance “should be employed when possible so t hat \nthe constitutional aspects of legislation are preserved” ( Ontario (Attorney General) v. \nG, 2020 SCC 38, [2020] 3 S.C.R. 629, at para.  116).  \n In my view, s.  11(1)(b) and (2) of the ORA  should be severed, and the \nremaining portions of s.  11 should be spar ed. The ORA  is not bound up with these \n2024 SCC 40 (CanLII)\n\n--- Page 119 ---\n \n provisions, and it otherwise closely mirrors the TRA, which our Court found to be \nconstitutionally valid in Imperial Tobacco . Thus, the balance of the statutory scheme \ncan stand on its own, and only “partial invalidat ion of the law” is necessary (see Mathen \nand Macklem, at p.  1306). The other provisions in s.  11 need not be disturbed.  \nIII. Conclusion  \n For these reasons, I would allow the appeal. I would declare that s.  11(1)(b) \nand (2) are ultra vires  the legislature of British Columbia and should be severed from \nthe ORA . \n Appeal  dismissed  with costs , CÔTÉ  J. dissenting.  \n Solicitors  for the appellant s Sanis Health Inc. and Shoppers Drug Mart \nInc.: Osler, Hoskin & Harcourt , Toronto.  \n Solicitors  for the appellant  Sandoz Canada Inc. : Fasken Martineau \nDuMoulin , Vancouver.  \n Solicitors  for the appellant  the McKesson Canada Corporation : Dav ies \nWard Phillips & Vineberg , Toronto.  \n Solicitors  for the respondent:  CFM Lawyers , Vancouver ; Attorney \nGeneral o f British Columbia, Vancouver . \n2024 SCC 40 (CanLII)\n\n--- Page 120 ---\n \n  Solicitor for the intervener the Attorney General of Canada: Department \nof Justice Canada, National Litigation Sector, Toronto.  \n Solicitor for the intervener the Attorney General of Ontario: Attorney \nGeneral of Ontario, Cons titutional Law Branch, Toronto.  \n Solicitor s for the intervener the Attorney General of Quebec: Bernard, Roy \n(Justice -Québec), Direction du contentieux de Montréal, Direction générale du \ncontentieux du Procureur général du Québec, Sous -ministériat des affai res juridiques, \nMontréal ; Ministère de la Justice du Québec, Direction du droit constitutionnel et \nautochtone, Québec.  \n Solicitor for the interv",
    "token_count": 1000,
    "start_token": 50400,
    "end_token": 51400,
    "total_tokens_in_source": 51676
  },
  {
    "chunk_id": 57,
    "source_file": "2024scc40.txt",
    "text": " titutional Law Branch, Toronto.  \n Solicitor s for the intervener the Attorney General of Quebec: Bernard, Roy \n(Justice -Québec), Direction du contentieux de Montréal, Direction générale du \ncontentieux du Procureur général du Québec, Sous -ministériat des affai res juridiques, \nMontréal ; Ministère de la Justice du Québec, Direction du droit constitutionnel et \nautochtone, Québec.  \n Solicitor for the intervener the Attorney General of Nova Scotia: Attorney \nGeneral of Nova Scotia, Legal Services, Halifax.  \n Solicitor for the intervener the Attorney General of New Brunswick: \nAttorney General of New Brunswick, Legal Services, Constitutional Group, \nFredericton.  \n Solicitor for the intervener the Attorney General of Manitoba: Manitoba \nJustice, Legal Services Branch, Winnipe g. \n Solicitor for the intervener the Attorney General of Prince Edward Island: \nDepartment of Ju stice and Public Safety , Charlottetown.  \n2024 SCC 40 (CanLII)\n\n--- Page 121 ---\n \n  Solicitor  for the intervener the Attorney General of Saskatchewan: \nGovernment of  Saskatchewan, Regina.  \n Solicitor  for th e intervener the Attorney General of Alberta: Alberta \nJustice , Constitutional and Aboriginal Law, Edmonton.  \n Solicitor for the intervener the Attorney General of the Northwest \nTerritories: Government of the Northwest Territories , Legal Division , Yellowknif e. \n Solicitor  for the intervener the Attorney General of the Yukon Territory: \nDepartment of Justice , Legal Services Branch , Whitehorse.  \n Solicitors  for the intervener Groupe Jean Coutu (PJC) inc.  and Pro Doc \nLtd.: Miller Thomson , Regina.  \n2024 SCC 40 (CanLII)\n\n",
    "token_count": 376,
    "start_token": 51300,
    "end_token": 51676,
    "total_tokens_in_source": 51676
  }
]