[
  {
    "chunk_id": 0,
    "source_file": "2025scc38.txt",
    "text": "--- Page 1 ---\n \n  \nSUPREME COURT OF CANADA  \n \nCITATION : Dorsey v. Canada \n(Attorney General), 2025 SCC  38   \nAPPEAL HEARD : May 13, 2025  \nJUDGMENT RENDERED : November \n21, 2025  \nDOCKET : 41132  \n \nBETWEEN : \n \nFrank Dorsey and  \nGhassan Salah  \nAppellants  \n \nand \n \nAttorney General of Canada  \nRespondent  \n \n- and - \n \nAttorney General of Quebec,  \nAttorney General of British Columbia,  \nJohn Howard Society of Canada,  \nCanadian Council for Refugees,  \nAlberta Prison Justice Society,  \nAboriginal Legal Services,  \nWest Coast Prison Justice Society,  \nBritish Columbia Civil Liberties Association,  \nCanadian Association of Elizabeth Fry Societies,  \nCanadian Association of Refugee Lawyers,  \nBlack Legal Action Centre,  \nPivot Legal Society,  \nMargaret L ee Cole,  \nCanadian Civil Liberties Association and  \nCanadian Prison Law Association  \n2025 SCC 38 (CanLII)\n\n--- Page 2 ---\n \n Interveners  \n \n \nCORAM : Wagner C.J. and Karakatsanis, Côté, Rowe, Martin, Kasirer, Jamal, \nO’Bonsawin and Moreau JJ.  \n \nREASONS FOR \nJUDGMENT :  \n(paras. 1 to 90)  Moreau J. (Wagner C.J. and Karakatsanis, Martin, Kasirer and \nO’Bonsawin JJ. concurring)  \n  \nJOINT DISSENTING \nREASONS : \n(paras. 91 to 208)  Côté and Rowe JJ. (Jamal J. concurring)  \n \n \nNOTE: This document is subject to editorial revision before its reproduction in final \nform in the Canada Supreme Court Reports . \n   \n \n  \n2025 SCC 38 (CanLII)\n\n--- Page 3 ---\n \n Frank Dorsey and  \nGhassan Salah  Appellant s \nv. \nAttorney General of Canada  Respondent  \nand \nAttorney General of Quebec,  \nAttorney General of British Columbia,  \nJohn Howard Society of Canada,  \nCanadian Council for Refugees,  \nAlberta Prison Justice Society,  \nAboriginal Legal Services,  \nWest Coast Prison Justice Society,  \nBritish Columbia Civil Liberties Association,  \nCanadian Association of E lizabeth Fry Societies,  \nCanadian Association of Refugee Lawyers,  \nBlack Legal Action Centre,  \nPivot Legal Society,  \nMargaret Lee Cole,  \nCanad ian Civil Liberties Association and  \nCanadian Prison Law Association  Interveners  \nIndexed as:  Dorsey v. Canada ( Attorney General)  \n2025  SCC  38 \nFile No.:  41132.  \n2025:  May 13; 2025:  November  21. \n2025 SCC 38 (CanLII)\n\n--- Page 4 ---\n \n Present:  Wagner  C.J. and Karakatsanis, Côté, Rowe, Martin, Kasire r, Jamal, \nO’Bonsawin and Moreau  JJ. \nON APPEAL  FROM  THE  COURT OF APPEAL FOR ONTARIO  \n Prerogative  writs — Habeas corpus  — Availability of remedy — \nDeprivation of liberty — Inmate — Reclassification and transfer to lower security \nfacility — Whether writ of habeas corpus is available to challenge refusal by carceral \nauthority to reclassify and transfer inmate to lower securi ty facility.  \n Two federal inmates applied to be transferred from medium - to \nminimum -security institutions . Despite having been recommended for reclassification \nand transfer to minimum -security facilities, in each case an administrative \ndecision -maker rejec ted their reclassification. Both inmates filed applications for \nhabeas corpus ad subjiciendum with certiorari  in aid, seeking orders that they either \nbe transferred to minimum -security institutions or that  their continued detention in \nmedium -security setti ngs be justified.  \n The inmates’ applications were joined for the limited purpose of \ndetermining a common threshold  legal issue: whether habeas corpus  is available to \nchallenge a refusal to reclassify an inmate to a lower security facility. The application  \njudge concluded that the inmates’ circumstances did not fall within the third category \n— a continuation of a deprivation of liberty that ha s become unlawful — set out in  \nDumas v. Leclerc Institute , [1986] 2 S.C.R. 459. Because ther e was no change in statu s \n2025 SCC 38 (CanLII)\n\n--- Page 5 ---\n \n quo, she was satisfied that the inmates’  residual liberty had not been reduced. Habeas",
    "token_count": 1000,
    "start_token": 0,
    "end_token": 1000,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 1,
    "source_file": "2025scc38.txt",
    "text": " that the inmates’ circumstances did not fall within the third category \n— a continuation of a deprivation of liberty that ha s become unlawful — set out in  \nDumas v. Leclerc Institute , [1986] 2 S.C.R. 459. Because ther e was no change in statu s \n2025 SCC 38 (CanLII)\n\n--- Page 5 ---\n \n quo, she was satisfied that the inmates’  residual liberty had not been reduced. Habeas \ncorpus  was therefore not available to them. The Court of Appeal  dismissed the inmates’ \nappe al. The majority held that  the third category of Dumas  is only available if an inmate \nbecomes entitled to greater liberty than that afforded by their continued detention, and \nthat the inmates could only have access to that category if that status was obtained and \nthey were not transferred. At the time the appeal before th e Court w as heard, both \ninmates had been reclassified and transferred to minimum -security facilities following \nreview at the statutorily -required date.  \n Held (Côté, Rowe and Jamal  JJ. dissenting):  The appeal should be allowed.  \n Per Wagner  C.J. and Karakatsanis, Mar tin, Kasirer, O’Bonsawin and \nMoreau  JJ.: The decision to deny an inmate a lower security reclassification is \nreviewable by way of habeas corpus , because it  has the qualitative effect of restricting \nliberty. Broad and effective access to habeas corpus  is paramount for those who suffer \nan unlawful and continued deprivation of their residual liberty and seek to challenge \nthe legality of their confinement. The decision to continue a particular, more restrictive \nform of confinement instead of placing an inmate i n a lower security facility results in \na deprivation of liberty.  Establishing a deprivation of liberty is not contingent on a \nchange in status quo or on proof of  an entitlement  to the less restrictive state.  \n The criteria for a successful habeas corpus  application are well established , \nrequiring two elements : (1) a deprivation of liberty and (2)  that the deprivation be \nunlawful. The application for habeas corpus  proceeds in three stages. As a threshold \n2025 SCC 38 (CanLII)\n\n--- Page 6 ---\n \n matter, leg al access to the writ requires that an a pplicant establish that they have been \ndeprived of liberty. This  first stage functions to filter out frivolous claims where there \nis no qualitative difference in liberty as between two states of confinement. In Dumas , \nthe Court outlined three possible depr ivations of liberty within the correctional context: \n(1) the initial deprivation of liberty, (2) a substantial change in conditions of \nconfinement amounting to a further deprivation of liberty, and (3)  a continuation of the \ndeprivation of liberty. The thir d category is assessed on temporal length, unlike the first \nand second categories which are grounded in a sudden change in the status quo. It is \nonly if the continuation of an initially valid deprivation of liberty becomes unlawful \nthat it can be challenge d by way of habeas corpus . These categories are not exhaustive \n— the actual analysis of whether a deprivation has occurred must always be undertaken \nfrom a qualitative perspective. Establishing the first element of a habeas corpus  \napplication requires that  an inmate prove that their current state of confinement is more \nrestrictive of their liberty that the state of confinement they allegedly ought to be in.  \n At the second stage of the application, once a deprivation of liberty is \nproven, the applicant must raise a legitimate ground upon which to question the legality \nof their current state of liberty deprivation. This means that the applicant’s allegations \nand grounds pleaded must disclose some basis in fact and law that would allow the \ncourt to conclude tha t the continued deprivation of liberty is unlawful. At the third \nstage, after the applicant has discharged the burden of establishing a deprivation of \nliberty and raising a legitimate ground to question the lawfulness of that deprivation, \nthe onus shifts t o the detaining authority to prove the deprivation was lawful.  \n2025 SCC 38 (CanLII)\n\n--- Page 7 ---\n \n  The analysis must inquire into whether there is a restriction on liberty as \nbetween two states of confinement . Not all carceral conditions will constitute \ndeprivations of liberty: carceral con ditions which do not result in a deprivation of \nliberty cannot form the basis for habeas corpus review. It is important not to conflate \nthe three Dumas  categories, which assist solely in determining the nature of the \ndeprivation. The analysis of deprivatio ns of liberty does not merely assess whether a \nchange has occurred ; if that were so, it would",
    "token_count": 1000,
    "start_token": 900,
    "end_token": 1900,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 2,
    "source_file": "2025scc38.txt",
    "text": " two states of confinement . Not all carceral conditions will constitute \ndeprivations of liberty: carceral con ditions which do not result in a deprivation of \nliberty cannot form the basis for habeas corpus review. It is important not to conflate \nthe three Dumas  categories, which assist solely in determining the nature of the \ndeprivation. The analysis of deprivatio ns of liberty does not merely assess whether a \nchange has occurred ; if that were so, it would effectively eliminate the third Dumas \ncategory . The analysis must focus on whether the inmate is currently in a state of \nconfinement that is relatively more restr ictive of his liberty than where he allegedly \nought to be.  \n For the third Dumas  category, an inmate will establish a deprivation of \nliberty if they demonstrate that their current continuing state of incarceration is more \nrestrictive of their liberty in com parison to the allegedly lawful state they seek to be \nreleased to. Entitlement to the less restrictive state does not  form part of the analysis \nfor a deprivation of liberty; rather, a legal entitlement to a certain form of incarceration \nis the outcome of a  successful habeas corpus  application, after being heard on its \nmerits. A requirement of entitlement at the first stage of an application would preclude \nan arbitrarily detained applicant from ever having their application heard.  \n It is clear that the effec t of security reclassification decisions within the \nfederal correctional  system may be to unlawfully detain an inmate in a higher, more \nrestrictive facility than they lawfully ought to be detained in. Federal inmates’ security \n2025 SCC 38 (CanLII)\n\n--- Page 8 ---\n \n classifications and placements have a profound impact on their qualitative experience \nof incarceratio n and, in many instances, also on its duration. An inmate unlawfully held \nfor an extended period at a higher security facility , having been wrongly denied a \nreclassification,  faces the same deprivation of liberty as an inmate who has been \nunlawfully transf erred to a higher security facility. Whether a security reclassification \nresults in a deprivation of liberty is context -dependent and will depend on whether the \ndecision results in actual physical constraints or deprivations of liberty that are more \nrestri ctive or severe than another, less restrictive security classification.  \n Within the context of a denied lower security reclassificatio n, it is  at the \nsecond stage that a court could decline to proceed to a hearing on the merits. An \napplication that fails to establish proper grounds, which provide a legal basis for the \nclaim of unlawfulness, will not proceed to stage three. Permitting access to habeas \ncorpus  in these circumstances will not open the floodgates. Courts can, and have, \nguarded against a flood of  cases by declining applications that lack a legal basis. \nHowever, once a sound legal basis is established, courts should not be reluctant to allow \nsuch applications to proceed. The second stage is not concerned with the capacity of \ncorrectional institutio ns to justify the seemingly unlawful detention; rather, it is focused \non ensuring meaningful access to justice to protect inmate’s liberty rights.  \n Per Côté , Rowe  and Jamal  JJ. (dissenting): The appeal should be \ndismissed. While habeas corpus  must remain a vailable and accessible when its use is \nwarranted, its scope is not unlimited. Habeas corpus  is not, and should not become, an \n2025 SCC 38 (CanLII)\n\n--- Page 9 ---\n \n unrestricted remedy used to challenge every feature in the correctional system \notherwise left to the administrative state. Dumas  established a requirement that the \napplicant must have a legal entitlement to reclassification and transfer to lower security \nin order to bring an application for habeas corpus  based on a continued deprivation of \nliberty . When the current law as set out in  Dumas  is properly applied, resort to habeas \ncorpus  is not available for the inmates in the instant case to challenge the administrative \ndecisions denying reclassification or transfer to lower security, as  they had no legal \nentitlement to reclassification or transfer to lower security.  \n Habeas corpus  does not  extend to administrative correctional decisions \nwhich deny an inmate’s transfer or reclassification request to a lower security \nclassification.  Dumas  remains the precedent to determine whether a deprivation of \nresidual liberty exists. Dumas  emphasized that the deprivation of liberty crystallizes at \nthe moment  one’s legal status changes, such as when parole is granted or a \nreclassification decision is t o take effect. Accordingly, habeas corpus  is only available \nto a federal inmate where they have been granted a reclassification or a transfer to a",
    "token_count": 1000,
    "start_token": 1800,
    "end_token": 2800,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 3,
    "source_file": "2025scc38.txt",
    "text": " inmate’s transfer or reclassification request to a lower security \nclassification.  Dumas  remains the precedent to determine whether a deprivation of \nresidual liberty exists. Dumas  emphasized that the deprivation of liberty crystallizes at \nthe moment  one’s legal status changes, such as when parole is granted or a \nreclassification decision is t o take effect. Accordingly, habeas corpus  is only available \nto a federal inmate where they have been granted a reclassification or a transfer to a \nlower security facility but they have not yet been transferred.  Entitlement to the less \nrestrictive form of l iberty is a prerequisite to establishing an unlawful deprivation of \nliberty under the third category of Dumas . \n Furthermore, habeas corpus  should not extend to administrative \ncorrectional decisions  which deny an inmate’s transfer or reclassification reques t to a \nlower security classification. Habeas corpus  is an extraordinary remedy available to \n2025 SCC 38 (CanLII)\n\n--- Page 10 ---\n \n those who are held in unlawful detention by agents of the state. In relation to inmates, \nthe remedy should continue to be limited to challenge further deprivations of liberty \nwithin a prison, notably an inmate’s unlawful transfer to a higher security facility or a \nmore restrictive condition of imprisonment. Its expansion to reviewing decisions which \ndo not alter an inmate’s residual liberty nor impose a greater depri vation of liberty is \nunwarranted; it interferes with Parliament’s scheme for the operation of institutions; \nand it sidesteps the administrative law framework. It is a procedure well suited to \nremedy unlawful deprivations of liberty, but ill  suited as a sub stitute for internal review \nand judicial review of the operation of correctional institutions. The use of habeas \ncorpus  overrides the deference given to administrative decision -makers under the \ngeneral law of judicial review.  \n While habeas corpus  has been interpreted expansively, it cannot be used \nto challenge a deprivation  of an anticipated right to residual liberty, one that has yet to \noccur.  Expanding the availability of habeas corpus  to denials of transfer to lower \nsecur ity levels risks distorting it into an alternative venue to challenge decisions  of \ncorrectional administrators , undermining both the integrity of the writ and the orderly \nadministration of the correctional system. It will also result in an unwarranted \ninterference by superior courts with Parliament’s legislative scheme.  \n The majority’s approach will improperly expand access to habeas corpus  \nand invite ad hoc  decision making. The first stage of the habeas corpus analysis \nrequires a true deprivation of liberty. However, the majority’s approach removes the \n2025 SCC 38 (CanLII)\n\n--- Page 11 ---\n \n requirement that an applicant alleging unlawful continued detention demonstrate an \nexisting legal entitlement to greater residual liberty. This risks undermining one of the \ndefining features of habeas corpus , namely, that it is an expeditious remedy. The first \nrisk is practical: courts have limited capacity, and applicants who are unlawfully \ndeprived of their liberty may face delays in obtaining relief while the co urts address \nhabeas corpus  applications that do not involve genuine deprivations of liberty and that \nraise matters better left to correctional administrators . The second risk is normative: \nlowering the threshold for what constitutes a deprivation of libert y diminishes the \nimportance of the interest at stake and, in turn, weakens the imperative of prompt \nresolution of habeas corpus applications. In addition,  habeas corpus  is not a tool by \nwhich to address systemic issues. It is focused on the individua l clai m of unlawful \ndetention, so expanding its scope to tackle the larger issue of over -classification is  a \nperilous endeavour.  \n The second stage in the habeas corpus  analysis must be strengthened and \nexplained if it is to filter out frivolous claims. There is disagreement with  the majority’s \nclaim that the expanded scope of habeas corpus  it proposes will not open the floodgates \nbecause courts are able to decline to hear a case on its merits if the applicant fails to \nraise a legitimate ground at the second stage  of the analysis. It is now almost inevitably \nthe case that the hearing o f the application for a writ of habeas corpus  becomes the \nsubstantive hearing. Further,  it is doubtful that courts will consider habeas corpus  \napplications concerning denials of trans fers to a lower security facilities  frivolous, \ngiven that inmates will easily demonstrate a deprivation of liberty. The second stage of \n2025 SCC 38 (CanLII)\n\n--- Page 12 ---\n \n the habeas corpus analysis will not  prevent the misuse of the writ that the majority",
    "token_count": 1000,
    "start_token": 2700,
    "end_token": 3700,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 4,
    "source_file": "2025scc38.txt",
    "text": " f the application for a writ of habeas corpus  becomes the \nsubstantive hearing. Further,  it is doubtful that courts will consider habeas corpus  \napplications concerning denials of trans fers to a lower security facilities  frivolous, \ngiven that inmates will easily demonstrate a deprivation of liberty. The second stage of \n2025 SCC 38 (CanLII)\n\n--- Page 12 ---\n \n the habeas corpus analysis will not  prevent the misuse of the writ that the majority \nreasons invite since an applicant n eed only identify an arguable issue and present a \nsound legal basis. The majority does not explain what this standard means or how to \napply it.  \n Reasonableness review of administrative correctional decisions should \nremain the exclusive purview of the Federal Court as provided for by Parliament. \nExisting r eview mechanisms are adequate, and the familiarity of the Federal Court with \nsuch review  in the operation of correctional facilities enables proper deference to be \ngiven to decisions by correctional ad ministrators. Provincial superior courts’ \njurisdiction to issue writs of habeas corpus  in the correctional context has never been \nwholly concurrent with the Federal Court’s jurisdiction in the same context. Moreover, \nin adopting the majority’s interpretati on, there would be no way to resolve \ninconsistencies in the application of habeas corpus  and its related jurisprudence , short \nof an appeal to the Court,  given that appeals from  the superior courts lie to the \nprovincial courts of appe al. \n There is disagreem ent with the majority’s statement that superior court \njudges retain discretion to issue remedies beyond the standard remedy of release to a \nless restrictive security facility. The remedy of habeas corpus  is non -discretionary; \nonce the court has determined the detention is unlawful, it must remedy the \nunlawfulness.  On a successful habeas corpus  application in the carceral context, the \n2025 SCC 38 (CanLII)\n\n--- Page 13 ---\n \n superior court would be obliged to release the inmate into a less restrictive security \nfacility.  \nCases Cited  \nBy Moreau  J. \n Applied:  Mission Institution v. Khela , 2014 SCC 24, [2014] 1 S.C.R. 502;  \nDumas v. Leclerc Institute , [1986] 2 S.C.R. 459; considered:  R. v. Miller , [1985] 2 S.C.R. \n613; Cardinal v. Director of Kent Institution , [1985] 2 S.C.R. 643 ; referred to:  Canada \n(Public Safety and Emergency Preparedness) v. Chhina , 2019 SCC 29, [2019] 2 S.C.R. \n467; May v. Ferndale Institution , 2005 SCC 82, [2005] 3 S.C.R. 809;  Jones v. \nCunningham , 371 U.S. 236 (1962); John Howard Society of Saskatchewan v. \nSaskatchewan (Att orney General) , 2025 SCC 6; Moldovan v. Canada (Attorney \nGeneral) , 2012 ONSC 2682, 291 C.C.C. (3d) 123;  Borowski v. Canada (Attorney \nGeneral) , [1989] 1 S.C.R. 342;  Morin v. National Special Handling Unit Review \nCommittee , [1985] 2 S.C.R. 662 ; R. v. Gamble , [1988] 2 S.C.R. 595;  Canada (Minister \nof Citizenship and Immigration) v. Vavilov , 2019 SCC 65, [2019] 4 S.C.R. 653;  Mapara \nv. Ferndale Institution (Warden) , 2012 BCCA 127, 318 B.C.A.C. 139;  Lord v. Coulter , \n2007 BCSC 1758, 72 Admin. L.R. (4th) 264, aff’d 2009 BCCA 62, 266 B.C.A.C. 122;  \nRain v. Canada (Parole Board) , 2015 ABQB 639;  Ewanchuk v. Canada (Attorney \nGeneral) , 2017 ABQB 237, 354 C.C.C. (3d) 119;  Mennes v. Canada (Attorney \nGeneral) , 2008 CanLII 6424;  Ewert v. Canada , 2018 SCC 30, [2018] 2 S.C.R. 16 5; \nRe",
    "token_count": 1000,
    "start_token": 3600,
    "end_token": 4600,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 5,
    "source_file": "2025scc38.txt",
    "text": ") , 2015 ABQB 639;  Ewanchuk v. Canada (Attorney \nGeneral) , 2017 ABQB 237, 354 C.C.C. (3d) 119;  Mennes v. Canada (Attorney \nGeneral) , 2008 CanLII 6424;  Ewert v. Canada , 2018 SCC 30, [2018] 2 S.C.R. 16 5; \nReza v. Canada , [1994] 2 S.C.R. 394;  Ogiamien v. Ontario (Community Safety and \n2025 SCC 38 (CanLII)\n\n--- Page 14 ---\n \n Correctional Services) , 2017 ONCA 839, 55 Imm. L.R. (4th) 220;  Leinen v. Mission \nInstitution (Warden) , 2025 BCCA 257.  \nBy Côté and Rowe  JJ. (dissenting)  \n Dumas v. Leclerc Inst itute, [1986] 2 S.C.R. 459; Canada (Minister of \nCitizenship and Immigration) v. Vavilov , 2019 SCC 65, [2019] 4 S.C.R. 653; R. (L.V.) \nv. Mountain Institution , 2016 BCCA 467, 346 C.C.C. (3d) 254; Mission Institution v. \nKhela , 2014 SCC 24, [2014] 1 S.C.R. 502 ; May v. Ferndale  Institution , 2005 SCC 82, \n[2005] 3 S.C.R. 809; Phillip v. D.P.P. , [1992] 1 A.C. 545;  Martineau v. Matsqui \nInstitution Disciplinary Board , [1980] 1 S.C.R. 602; R. v. Miller , [1985] 2 S.C.R. 613; \nCardinal v. Director of Kent Institution , [1985] 2 S.C.R. 643; Morin v. National Special \nHandling Unit Review Committee , [1985] 2 S.C.R. 662; Jones v. Cunningham , 371 \nU.S. 236 (1962); Peiroo v. Canada (Minister of Employment and Immigration)  (1989), \n69 O.R. (2d) 253; Canada (Public Safety and Em ergency Preparedness) v. Chhina , \n2019 SCC 29, [2019] 2 S.C.R. 467; R. v. Gamble , [1988] 2 S.C.R. 595; Mapara v. \nFerndale Institution (Warden) , 2012 BCCA 127, 318 B.C.A.C. 139 ; Lord v. Coulter , \n2007 BCSC 1758, 72 Admin. L.R. (4th) 264; Ewanchuk v. Canada (A ttorney General) , \n2017 ABQB 237, 354 C.C.C. (3d) 119; Rain v. Canada (Parole Board) , 2015 ABQB \n639; Latham v. Her Majesty the Queen , 2018 ABQB 69, 72 Alta. L.R. (6th) 357; R. v. \nOlson , [1989] 1 S.C.R. 296; Mackinnon v. Warden of Bowden Institution , 2016 FCA \n14; Forner v. Professional Institute of the Public Service of Canada , 2016 FCA 35, 481 \nN.R. 159; Nova Scotia (Attorney General) v. Diggs and Wilband , 2025 NSCA 20; R. \n2025 SCC 38 (CanLII)\n\n--- Page 15 ---\n \n v. Haug , 2011 ABCA 153, 502 A.R. 392; Moldovan v. Canada (Attorney General) , \n2012 ONSC 2682, 291 C.C.C. (3d) 123; Ogiamien v. Ontario (Community Safety and \nCorrectional Services) , 2017 ONCA 839, 55 Imm. L.R. (4th) 220; Scotland v. Canada \n(Attorney General) , 2017 ONSC 4850, 139 O.R. (3d) 191; Ali v. Canada (Minister of \nPublic Safety and Emergency Preparedness) , 2017 ONSC 2660, 137 O",
    "token_count": 1000,
    "start_token": 4500,
    "end_token": 5500,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 6,
    "source_file": "2025scc38.txt",
    "text": "iamien v. Ontario (Community Safety and \nCorrectional Services) , 2017 ONCA 839, 55 Imm. L.R. (4th) 220; Scotland v. Canada \n(Attorney General) , 2017 ONSC 4850, 139 O.R. (3d) 191; Ali v. Canada (Minister of \nPublic Safety and Emergency Preparedness) , 2017 ONSC 2660, 137 O.R. (3d) 498 . \nStatutes and Regulations Cite d \nCanadian Charter of Rights and Freedoms , ss. 7, 9, 10(c), 12, 24(1).  \nCode of Civil Procedure , CQLR, c.  C-25.01, s.  399. \nCorrections and Conditional Release Act , S.C.  1992, c.  20, ss.  4(c), 28, 30, 97, 98.  \nCorrections and Conditional Release Regulations , SOR/92 -620, ss.  17, 18(b), (c).  \nCriminal Code , R.S.C. 1985, c.  C-46. \nFederal Court Act , R.S.C. 1985, c.  F-7, s. 18.1(2).  \nFederal Court Rules , SOR/98 -106, rr.  301 to 314. \nHabeas Corpus Act , R.S.O. 1990, c.  H.1, s.  1(1), (2).  \nHabeas Corpus Act, 1679  (Eng.), 31 Cha.  2, c. 2. \nAuthors Cited  \nBlackstone, William. Commentaries on the Laws of England , Book III. Oxford: \nClarendon Press, 1768.  \nCanada. Correctional Service. Commi ssioner’s Directive 081: Offender Complaints \nand Grievances , June  28, 2019 (online: https://www.canada.ca/en/correctional -\nservice/corporate/acts -regulations -policy/commissioners -directives/081.html; \narchived version: https://www.scc -csc.ca/cso -dce/2025SCC -CSC 38_1_eng.pdf ). \n2025 SCC 38 (CanLII)\n\n--- Page 16 ---\n \n Canada. Correctional Service. Commissioner’s Directive 705 -7: Security \nClassification and Penitentiary Placement , January  15, 2018 (online: \nhttps://www.canada.ca/en/correctional -service/corporate/acts -regulations -\npolicy/commissioners -directives/705 -7.html; archived version: https://www.scc -\ncsc.ca /cso-dce/2025SCC -CSC 38_2_eng.pdf ). \nCanada. Correctional Service. Commissioner’s Directive 710 -6: Review of inmate \nsecurity c lassification , November  30, 2019 (online: \nhttps://www.canada.ca/en/correctional -service/corporate/acts -regulations -\npolicy/commission ers-directives/710 -6.html; archived version: https://www.scc -\ncsc.ca/cso -dce/2025SCC -CSC 38_3_eng.pdf ). \nDe Smith’s Judicial Review , 9th ed. by Ivan  Hare, Catherine  Donnelly and Joanna  Bell, \neds. London: Sweet & Maxwell, 2023.  \nDuker, William  F. A Constitutional History of Habeas Corpus . Westport, Ct.: \nGreenwood Press, 1980.  \nFarbey, Judith , and R obert  J. Sharpe, with Simon Atrill. The Law of Habeas Corpus , \n3rd ed. New York: Oxford University  Press, 2011.  \nParkes, Debra. “The ‘Great Writ’ Reinvigorated? Habeas Corpus  in Contemporary \nCanada” (2012), 36:1 Man. L.J.  351. \nSalhany , R. E. Canadian Criminal Procedure , 6th ed. Toront o: Thomson Reuters, 2025 \n(loose -leaf updated April 2025, release 1).  \n APPEAL from a judgment of the Ontario Court of Appeal  (Simmons, \nHarvison Young and George JJ.A.), 2023 ONCA 843 , 169 O.R. (3d) 417, [2023] O.J. \nNo. 569",
    "token_count": 1000,
    "start_token": 5400,
    "end_token": 6400,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 7,
    "source_file": "2025scc38.txt",
    "text": "any , R. E. Canadian Criminal Procedure , 6th ed. Toront o: Thomson Reuters, 2025 \n(loose -leaf updated April 2025, release 1).  \n APPEAL from a judgment of the Ontario Court of Appeal  (Simmons, \nHarvison Young and George JJ.A.), 2023 ONCA 843 , 169 O.R. (3d) 417, [2023] O.J. \nNo. 5696 (Lexis), 2023 CarswellOnt 19927 (WL), affirming a decision of Speyer  J., \n2022 ONSC 2107, 513 C.R.R. (2d) 90, [2022] O.J. No.  3030 (Lexis), 2022 \nCarswellOnt 9414 (WL). Appeal allowed, Côté, Rowe and Jamal  JJ. dissen ting. \n Adriel Weaver , Jessica Orkin, Simon Borys  and Kate Mitchell , for the \nappellant s. \n2025 SCC 38 (CanLII)\n\n--- Page 17 ---\n \n  John Provart  and Anusha Aruliah , for the respondent.  \n Abdou Thiaw  and Christophe Achdjian , for the intervener Attorney \nGeneral of Quebec.  \n Freya Zaltz and Davin Wong , for the intervener Attorney General of \nBritish Columbia.  \n Paul Quick , for the intervener John Howard Society of Canada.  \n Jennifer Dagsvik  and Jamie Liew , for the intervener Canadian Council for \nRefugees.  \n Amy Matychuk , for the intervener Alberta Prison Jus tice Society.  \n Emily Hill  and Matthew Malott , for the intervener Aboriginal Legal \nServices.  \n John Trueman  and Danielle Wierenga , for the intervener West Coast \nPrison Justice Society.  \n Frances Mahon  and Ga Grant , for the intervener British Columbia Civil \nLiberties Association.  \n2025 SCC 38 (CanLII)\n\n--- Page 18 ---\n \n  Jessica Rose  and Emma Arnold , for the intervener Canadian Association \nof Elizabeth Fry Societies.  \n Molly Joeck and Kes Posgate , for the intervener Canadian Association of \nRefugee Lawyers.  \n Saneliso Moyo , Geetha Philipupillai  and Demar  Kemar Hewitt , for the \nintervener Black Legal Action Centre.  \n Nana Yanful and Simone  A. Akyianu , for the intervener Pivot Legal \nSociety.  \n Jessica Zita  and Jeffrey Hartman , for the intervener Margaret Lee Cole.  \n Dan Goudge , for the intervener Canadian Civil  Liberties Association.  \n Alison Craig , for the intervener Canadian Prison Law Association.  \n The judgment of Wagner C.J. and Karakatsanis, Martin, Kasirer, \nO’Bonsawin and Moreau  JJ. was delivered by  \n MOREAU J. —  \nI. Introduction  \n2025 SCC 38 (CanLII)\n\n--- Page 19 ---\n \n [1] Over the past four decades, thi s Court has been resolute in its application \nof habeas corpus to the modern carceral context. Long revered as the great writ of \nliberty, habeas corpus  review remains an essential safeguard against unlawful \ndetention and a cornerstone for the protection of prisoner’s rights. This Court has \nrepeatedly stated that “ [h]abeas corpus has never been ‘a static, narrow, formalistic \nremedy’; rather, over the centuries, it ‘has grown to achieve its grand purpose — the \nprotection of individuals against erosion of their  right to be free from wrongful \nrestraints upon their liberty’” ( Canada (Public Safety and Emergency Preparedness) v. \nChhina , 2019 SCC 29, [2019] 2 S.C.R. 467, at para. 19, citing  May v.  Ferndale \nInstitution , 2005 SCC 82, [2005] 3 S.C.R. 809, at para. 21, and Jones v. Cunningham , \n371 U.S. 236 (1962), at p. 243; Mission Institution v. Khela , 2014 SCC 24, [2014] 1 \nS.C.R. 502, at para. 54).  \n[2]  This Court  has recognized that the writ, as both a right and remedy, must \nremain flexible and purposive in order to respond to unlawful deprivations of liberty. \nMoreover, the writ must remain available and accessible to those individuals whose \nliberty has been most r estricted living within penitentiary walls. These",
    "token_count": 1000,
    "start_token": 6300,
    "end_token": 7300,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 8,
    "source_file": "2025scc38.txt",
    "text": " , 2014 SCC 24, [2014] 1 \nS.C.R. 502, at para. 54).  \n[2]  This Court  has recognized that the writ, as both a right and remedy, must \nremain flexible and purposive in order to respond to unlawful deprivations of liberty. \nMoreover, the writ must remain available and accessible to those individuals whose \nliberty has been most r estricted living within penitentiary walls. These individuals, \nalready facing significant deprivations of their liberty, should have access to the \nexpedient and effective relief long offered by habeas corpus  where the deprivation of \nliberty becomes unlawfu l. A qualitative approach must be taken when assessing the \nmeaning of “deprivation of liberty” which focuses on the actual effect of a particular \nform of confinement.  \n2025 SCC 38 (CanLII)\n\n--- Page 20 ---\n \n [3] This appeal requires the Court to decide a narrow question: whether \ninmates who are deni ed a lower security classification may access  the writ of habeas \ncorpus . Many such denials will, of course, be lawful, just as many decisions increasing \nan inmate’s security classification are lawfully made. Yet the writ exists precisely for \nthose occasion s when carceral authorities exceed their lawful bounds. Broad and \neffective access to habeas corpus  is paramount for those who suffer an unlawful and \ncontinued deprivation of their residual liberty and seek to challenge the legality of their \nconfinement.  \n[4]  Recently, in John Howard Society of Saskatchewan v. Saskatchewan \n(Attorney General) , 2025 SCC 6, this Court has reiterated the importance of taking a \nfunctional, rather than formalistic, approach when dealing with rights of inmates. To \nacknowledge that rea lity does not require altering the established framework of habeas \ncorpus . The test remains as reiterated in Khela : to access the writ of habeas corpus , \nthere must be a deprivation of liberty, and legitimate grounds to question the legality \nof the deprivat ion (para. 30). Applying that same test to a denial of a lower security \nclassification that results in an unlawful continuation of more restrictive confinement \nis consistent with both precedent and principle.  \n[5] The appellants, two federal inmates, both appl ied to be transferred from \nmedium - to minimum -security institutions. Despite both appellants having been \nrecommended for reclassification and transfer to minimum -security facilities, in each \ncase an administrative decision -maker rejected their reclassifica tion. As a result, both \n2025 SCC 38 (CanLII)\n\n--- Page 21 ---\n \n appellants continued to be confined in medium -security facilities until the next \nstatutory date for their reclassification review. At the time this appeal was heard, both \nappellants were reclassified and transferred to minimum -secur ity facilities following \nreview at the statutorily -required date.  \n[6] In my view, the decision to continue a particular, more restrictive form of \nconfinement instead of placing an inmate in a lower security facility results in a \ndeprivation of liberty. The eff ect of being continually held in a higher security facility \nis substantially the same as an inmate being involuntarily transferred to a higher \nsecurity facility. Both inmates face greater restrictions on their daily lives and both are \ndeprived of their lib erty relative to the facility in which they potentially ought to be \nplaced. As I outline, any distinction between the two is erroneously based on a \nformalistic understanding of a deprivation of liberty.  \n[7] Furthermore, the existence of alternative procedures does not impact the \nthreshold availability of habeas corpus  when a lower security classification is denied \nto an inmate. Should an inmate prove a deprivation of liberty and raise a legitimate \nground to question the legality of the deprivation, a hearing on  the merits must follow. \nThe writ is non -discretionary and release, in this case to a lower security facility, \nremains the remedy, however, courts have a degree of flexibility to impose  appropriate \nconditions on release in the case before them.  \n[8] I would al low the appeal.  \n2025 SCC 38 (CanLII)\n\n--- Page 22 ---\n \n II. Background  \nA. Statutory Scheme  \n[9] This appeal concerns the federal correctional statutory scheme. The \nsecurity classification of inmates in the federal correctional system is governed by the \nCorrections and Conditional Release Act , S.C. 1992, c.  20 (“ CCRA ”), and the \nCorrections and Conditional Release Regulations , SOR/92 -620 (“ CCRR ”). \nAdditionally, detailed rules for applying the CCRA  are set out",
    "token_count": 1000,
    "start_token": 7200,
    "end_token": 8200,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 9,
    "source_file": "2025scc38.txt",
    "text": " \n II. Background  \nA. Statutory Scheme  \n[9] This appeal concerns the federal correctional statutory scheme. The \nsecurity classification of inmates in the federal correctional system is governed by the \nCorrections and Conditional Release Act , S.C. 1992, c.  20 (“ CCRA ”), and the \nCorrections and Conditional Release Regulations , SOR/92 -620 (“ CCRR ”). \nAdditionally, detailed rules for applying the CCRA  are set out in Commissioner’s \nDirectives — binding internal policies issued by the Commissioner of Corrections \npursuant to ss. 97 and 98 of the CCRA . In this appeal, three such directives are \nparticularly relevant: Commissioner’s Directive 705 -7: Security Classification and \nPenitentiary Placement  (January 15, 2018 (online)) (“CD 705 -7”), Commissioner’s \nDirective 710 -6: Review of inmate security classification  (November 30, 2019 (online)) \n(“CD 710 -6”), and Commissioner’s Directive 081: Offender Complaints and \nGrievances  (June 28, 2019 (online)) (“CD 081”).  \n[10] Under s. 30 of the CCRA , Correctional Service Canada (“CSC”) mu st \nassign each inmate one of three security levels (maximum, medium, or minimum) and \nplace them in an appropriate penitentiary. Placement must be consistent with s. 28 of \nthe CCRA , which requires CSC to take reasonable steps to ensure that an inmate is hel d \nin the least restrictive environment appropriate to their case. These decisions are guided \nby s. 17 of the CCRR , which sets out the factors to be considered, including the \nseriousness of the offence, institutional behaviour, and potential for violent beh aviour.  \n2025 SCC 38 (CanLII)\n\n--- Page 23 ---\n \n [11] The CCRR  defines the thresholds for each security level. Referring to the \nsecurity levels relevant to the appeal, a minimum -security classification is reserved for \ninmates who present “a low probability of escape and a low risk to the safety of the  \npublic” and require “a low degree of supervision and control” (s. 18(c)); a medium -\nsecurity classification is reserved for inmates who present “a low to moderate \nprobability of escape and a moderate risk to the safety of the public” and require a \n“moderat e degree of supervision and control” (s. 18(b)). These definitions inform both \ninitial placement and any future reclassification.  \n[12] Further, detailed rules in the Commissioner’s Directives govern CSC’s \nassessment of classification. Pursuant to CD 705 -7, CSC is required to use a \ncombination of actuarial tools and individualized analysis in all classification \ndecisions. At intake, staff must complete a Custody Rating Scale to guide initial \nplacement. At review or reclassification, a Security Reclassification Sc ale is used (CD \n710-6). In all cases, staff must prepare a written Assessment for Decision that includes \nratings on three mandatory factors: institutional adjustment, escape risk, and risk to \npublic safety (CD 705 -7, s. 6). These ratings must be explained and any divergence \nfrom the scale must be justified in writing.  \n[13] In most cases, the final decision -maker is the institutional head — the \nperson normally in charge of the penitentiary and typically the warden (CD 705 -7, s. \n5; CD 710 -6, s. 3(2)). However, wh en the inmate is a dangerous offender, there are \nadditional layers of review. In such cases, the institutional head’s decision must be \n2025 SCC 38 (CanLII)\n\n--- Page 24 ---\n \n supported by the Regional Deputy Commissioner (“RDC”) and approved by the \nAssistant Commissioner, Correctional Operations  and Programs (“ACCOP”), who \nserves as the final authority (CD 705 -7, s. 5; CD 710 -6, s. 3(2)).  \n[14] Inmates in medium - or maximum -security are entitled to a review of their \nsecurity classification at least every two years, with earlier reviews triggered by the  \ncompletion of a correctional program for Indigenous inmates (CD 710 -6, ss. 7 and 8). \nOnce a decision is made, the inmate must be informed in writing within five working \ndays, along with the reasons and the information relied upon (CD 710 -6, s. 5). Inmates  \nmust also be informed of their right to grieve the decision ( ibid.).  \n[15] The grievance process",
    "token_count": 1000,
    "start_token": 8100,
    "end_token": 9100,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 10,
    "source_file": "2025scc38.txt",
    "text": ", with earlier reviews triggered by the  \ncompletion of a correctional program for Indigenous inmates (CD 710 -6, ss. 7 and 8). \nOnce a decision is made, the inmate must be informed in writing within five working \ndays, along with the reasons and the information relied upon (CD 710 -6, s. 5). Inmates  \nmust also be informed of their right to grieve the decision ( ibid.).  \n[15] The grievance process is set out in CD 081. Reclassification decisions, as \ndecisions of the institutional head or higher, are appealed directly to the final, national \nlevel of the inmat e grievance system (CD 081, s. 7; CD 710 -6, s. 3). These national \nlevel grievances are decided by the Assistant Commissioner, Policy, or an equivalent \nor higher -ranking designate (CD 081, s. 8). Grievance decisions can be judicially \nreviewed in the Federal  Court. In addition, inmates may bring concerns to the Office \nof the Correctional Investigator, an independent oversight body with the power to \ninvestigate and report on CSC practices (CD 081, s. 15).  \nB. Frank Dorsey and Ghassan Salah  \n2025 SCC 38 (CanLII)\n\n--- Page 25 ---\n \n [16] Frank Dorsey is a 64 -year-old Black Canadian who has been incarcerated \nsince 1999, first pending trial and then as a federal prisoner following conviction. He \nwas designated as a dangerous offender and received an indeterminate sentence.  \n[17] In 2019, Mr. Dorsey requested a security  reclassification in order to be \ntransferred from a medium -security institution to a minimum -security institution. His \nrequest was supported by his case management team (“CMT”), the Manager of \nAssessment and Intervention (“MAI”), and the Warden, all of who m concluded that \nhe met the criteria for a minimum -security placement. However, reclassification \ndecisions for dangerous offenders must also be approved by the RDC and the ACCOP. \nOn September 9, 2019, the RDC concluded that Mr. Dorsey posed a “moderate” pu blic \nsafety risk and denied his reclassification request.  \n[18] In Mr. Dorsey’s subsequent security classification review two years later \nin 2021, his CMT and the Warden again recommended that he be reclassified as \nminimum security. This time, the RDC concurred in that recommendation and, on \nOctober 25, 2021, the ACCOP gave the final approval, reclassifying and transferring \nMr. Dorsey to minimum security.  \n[19] Ghassan Salah is a Jordanian citizen who has been incarcerated since 2004 \nand began serving concurrent life s entences in 2006 with no eligibility for day parole \nuntil 2026. Given his citizenship status, he is subject to a deportation order.  \n2025 SCC 38 (CanLII)\n\n--- Page 26 ---\n \n [20] In 2019, Mr. Salah requested a security reclassification in order to be \ntransferred from a medium -security institution to a  minimum -security institution. His \nrequest was initially supported by his parole officer and the MAI. However, a new \nMAI was later assigned to his file and, on November 11, 2019, reassessed him as a \nmoderate escape risk based on the existence of a deportat ion order. The Warden \naccepted this assessment and denied the request. Mr. Salah was advised that he could \nnot reapply until two years before his parole eligibility date. This time, in May 2024, \nMr. Salah was reclassified as minimum security and transferre d accordingly.  \nC. Judgments Below  \n[21] Prior to being reclassified as minimum security, both appellants filed \napplications in 2019 for habeas corpus ad subjiciendum  with certiorari  in aid, seeking \norders that CSC either transfer them to minimum -security institutions or justify their \ncontinued detention in medium -security settings. Although their applications were not \nformally brought under the Canadian Charter of Rights and Freedoms , the appellants \nalleged that their continued classification engaged their ss. 7, 9, 10(c) and 12 Charter \nrights.  \n(1) Ontario Superior Court of Justice, 2022 ONSC 2107, 513 C.R.R. (2d) 90 \n(Speyer J.)  \n2025 SCC 38 (CanLII)\n\n--- Page 27 ---\n \n [22] On consent, the applications were joined on January 25, 2021",
    "token_count": 1000,
    "start_token": 9000,
    "end_token": 10000,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 11,
    "source_file": "2025scc38.txt",
    "text": "leged that their continued classification engaged their ss. 7, 9, 10(c) and 12 Charter \nrights.  \n(1) Ontario Superior Court of Justice, 2022 ONSC 2107, 513 C.R.R. (2d) 90 \n(Speyer J.)  \n2025 SCC 38 (CanLII)\n\n--- Page 27 ---\n \n [22] On consent, the applications were joined on January 25, 2021  for the \nlimited purpose of determining a common threshold legal issue: Is habeas corpus  \navailable to challenge CSC’s refusal to reclassify an inmate to a lower security level?  \n[23] The application judge concluded that the appellants’ circumstances did not \nfall within the third Dumas  v. Leclerc Institute , [1986] 2 S.C.R. 459,  category (a \ncontinuation of a deprivation of liberty that has become unlawful). Citing  a series of \ncases from the Ontario Superior Court of Justice, starting with Moldovan v. Canada \n(Attorney General) , 2012 ONSC 2682, 291 C.C.C. (3d) 123, the application judge \nconcluded that she was bound by horizontal stare decisis to conclude that there is no \ndeprivation of liberty when an inmate is denied a reclassification. In her view, these \ncases had overtaken an earlier line of Superior Court decisions preceding Moldovan \nthat concluded habeas corpus was available.  \n[24] After distinguishing a series of appellate cases, the application judge \nconcluded that the third Dumas category only “appears to hav e been applied in cases \nof extended detentions or detentions of uncertain duration” or “in criminal cases where \nthe sentence imposed has become unlawful” (para. 73). Because there was no change \nin status quo, the application judge was satisfied that the ap pellants’ residual liberty \nhad not been reduced. Habeas corpus was therefore not available to them and their \napplications were dismissed.  \n(2) Ontario Court of Appeal, 2023 ONCA 843, 169 O.R. (3d) 417 (Harvison \nYoung and George JJ.A., Simmons J.A. Dissenting)  \n2025 SCC 38 (CanLII)\n\n--- Page 28 ---\n \n [25] George J.A., writing for the majority, dismissed the appeal. The appellants \nrenewed their argument that CSC’s refusal to reclassify them as minimum security \namounted to a continuation of an unlawful deprivation of liberty, falling within the \nthird category established in Dumas . George  J.A. held that the third category of \nDumas is only available if an inmate becomes entitled to greater liberty than that \nafforded by their continued detention. Access to the third Dumas category required \nthe appellants to have a cquired the “status” of a minimum -security classification. Only \nif that status was obtained and they were not transferred could it be said that they were \nsubject to an unlawful continuation of a deprivation of liberty.  \n[26] George J.A. relied on this Court’s de cisions in May and Khela , noting that \nboth decisions reaffirmed that “a deprivation of residual liberty under the third Dumas \ncategory will only arise when the conditions of an inmate’s continued detention have \nsomehow changed” (para. 48). A change in the nature of a continued detention is a \nprerequisite to questioning its legality.  \n[27] Simmons J.A. dissented, concluding that the appellants could avail \nthemselves of habeas corpus . In her view, Dumas did not establish a “general rule \nconcerning the point at whi ch an initially valid deprivation of liberty becomes \nunlawful”, and noted that Dumas  linked unlawfulness to a “particular status” in the \ncontext of a decision concerning parole (para. 106). In other words, Dumas did not \nprevent continuations of a deprivati on of liberty from being challenged in \n2025 SCC 38 (CanLII)\n\n--- Page 29 ---\n \n circumstances other than those where the inmate obtains a greater liberty interest or \nwhere there is a change in the status quo.  \n[28] She determined that there was no reason to deny access to habeas corpus \nwhere there are  grounds for concluding that the refusal of a lower security \nclassification was unreasonable. On the majority’s reading, prison officials could \nunlawfully exceed their authority in depriving inmates of a lower security \nclassification, but inmates would not  be able to challenge such unlawfulness by way \nof habeas corpus . In her view, when inmates are unlawfully denied reclassification, a \ncontinuation of their deprivation of liberty is made out",
    "token_count": 1000,
    "start_token": 9900,
    "end_token": 10900,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 12,
    "source_file": "2025scc38.txt",
    "text": " reason to deny access to habeas corpus \nwhere there are  grounds for concluding that the refusal of a lower security \nclassification was unreasonable. On the majority’s reading, prison officials could \nunlawfully exceed their authority in depriving inmates of a lower security \nclassification, but inmates would not  be able to challenge such unlawfulness by way \nof habeas corpus . In her view, when inmates are unlawfully denied reclassification, a \ncontinuation of their deprivation of liberty is made out and they should have resort to \nhabeas corpus if they can show that  legitimate grounds exist for questioning the \nlawfulness of the denial of a lower security classification  such that the reclassification \nwould otherwise have been made . She observed that “[p]ermitting resort to habeas \ncorpus  in such circumstances does not presume an entitlement to a lower security \nclassification”, which would be determined on the ultimate assessment of the \nlawfulness of the denial (para.  114).  \nIII. Issue on Appeal  \n[29] The appeal raises a single issue: Is habeas corpus  available to challenge \nCSC’s re fusal to reclassify an inmate to a lower security level?  \n[30] This appeal is now moot as both appellants have been reclassified and \ntransferred to minimum -security facilities. Nonetheless, all parties ask the Court to \n2025 SCC 38 (CanLII)\n\n--- Page 30 ---\n \n exercise its discretion to hear the appeal.  I agree that it is in the interests of justice for \nthis Court to resolve this outstanding legal issue of public importance, given the \ndisagreement and full argument of the parties on the issue, and the temporal nature of \nhabeas corpus  applications renders  them evasive of review ( Borowski v. Canada \n(Attorney General) , [1989] 1 S.C.R. 342; see, e.g., Khela,  at para. 14).  \nIV. Analysis  \nA. General Principles of Habeas Corpus  \n[31] Historically, habeas corpus was a means to ensure that a defendant in an \naction was brought physically before the Court (J. Farbey and R. J. Sharpe, with \nS. Atrill,  The Law of Habeas Corpus  (3rd ed. 2011), at p. 16). Over time, the writ \ntransformed into a vehicle for reviewing the ju stification for a person’s imprisonment. \nBlackstone described habeas corpus as the “great and efficacious writ in all manner of \nillegal confinement” (W. Blackstone, Commentaries on the Laws of England  (1768), \nBook III, at p. 132.). The remedy of habeas cor pus was codified for the first time in \n1641 in England, and then for a second time in the Habeas Corpus Act of 1679 (Eng.), \n31 Cha. 2, c. 2 ( Khela , at para.  28). The purpose for doing so was to address delays in \nobtaining the writ, ensure prisoners were pr ovided with copies of their warrants to \nunderstand the grounds for their detention, and ensure that prisoners “would not be \ntaken to places beyond the reach of the writ” (Farbey and Sharpe, at p. 16).  \n2025 SCC 38 (CanLII)\n\n--- Page 31 ---\n \n [32] Subsequently, Canadian law has sought to preserve the o bjects of the \nHabeas Corpus Act , which “embodied the evolving purposes and principles of the writ” \n(Khela , at para. 29). This Court has recognized that the writ is “the strongest tool a \nprisoner has to ensure that the deprivation of his or her liberty is n ot unlawful” and that \nit “should develop over time to ensure that the law remains consistent with the remedy’s \nunderlying goals” (paras. 29 and 54).   \n[33] Habeas corpus is now enshrined in s. 10(c) of the Charter , but it also \nintersects and protects two of our  most fundamental rights: the right to liberty of the \nperson and the right not to be deprived thereof except in accordance with the principles \nof fundamental justice (s. 7); and the right not to be arbitrarily detained or imprisoned \n(s. 9) ( Khela , at para.  29; May, at para 22). Courts must never lose sight of the \nunderlying liberty interest of the applicant and are not bound to limited categories or \ndefinitions of review ( Khela , at para. 55). Access to the remedy should rarely be subject \nto restrictions ( Khela, at para. 54).",
    "token_count": 1000,
    "start_token": 10800,
    "end_token": 11800,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 13,
    "source_file": "2025scc38.txt",
    "text": " fundamental justice (s. 7); and the right not to be arbitrarily detained or imprisoned \n(s. 9) ( Khela , at para.  29; May, at para 22). Courts must never lose sight of the \nunderlying liberty interest of the applicant and are not bound to limited categories or \ndefinitions of review ( Khela , at para. 55). Access to the remedy should rarely be subject \nto restrictions ( Khela, at para. 54).  \n[34] Given that habeas corpus  safeguards against wrongful restraints on liberty, \nthe jurisprudence has remained resolute in upholding the broad and accessible character \nof the writ. This Court has consistently held  that “ jurisprudential devel opments limiting  \nhabeas corpus jurisdiction should be carefully evaluated and should not be allowed to \nexpand unchecked. The exceptions to habeas corpus  jurisdiction .  . . should be well \ndefined and limited” ( May, at para. 50). Broad and unobstructed acces s to the writ has \n2025 SCC 38 (CanLII)\n\n--- Page 32 ---\n \n animated the past 40 years of jurisprudence on habeas corpus  as this Court has \nexpanded the grounds for reviewing the legality of deprivations of liberty.  \n[35] Despite its antiquity, habeas corpus  remains the strongest tool for prisoners \nin en suring that a deprivation of their residual liberty is not unlawful ( Khela , at \npara.  29). Four decades ago, this Court clarified the scope of habeas corpus  in the \ntrilogy of R. v. Miller , [1985] 2 S.C.R. 613 , Cardinal  v. Director of Kent Institution , \n[1985] 2 S.C.R. 643 , and Morin  v. National Special Handling Unit  Review Committee , \n[1985] 2 S.C.R. 662  (collectively, the “ Miller  trilogy”) confirming that the writ was \navailable to inmates challenging their administrative segregation, noting these \nrestric tive forms of custody are a “prison within a prison” ( Miller , at p. 668). The  Miller  \ntrilogy recognized that a deprivation of liberty within the carceral context constricts \nwhat little residual liberty inmates have left and that habeas corpus  is available to \nchallenge unlawful deprivations of their residual liberty, despite inmates not being \nreleased back into the public.  \nB. Legal Framework for Habeas Corpus Applications  \n[36] The criteria for a successful habeas corpus  application are well established, \nrequiring ( 1) a deprivation of liberty and (2) that the deprivation be unlawful ( Khela , \nat para. 30).  \n[37] The application for habeas corpus  proceeds in three stages.  \n2025 SCC 38 (CanLII)\n\n--- Page 33 ---\n \n [38] As a threshold matter, legal access to the writ requires that an applicant \nestablish that they have been deprived of liberty. Once a deprivation of liberty is \nproven, the applicant must raise a legitimate ground upon which to question its legality. \nIf the applicant has raised such a ground, the onus shifts to the respondent authorities \nto show that the d eprivation of liberty was lawful ( Khela , at para. 30; Farbey and \nSharpe, at p. 85;  May, at para. 74). If the applicant meets this onus, the onus for \nestablishing the lawfulness of the deprivation of liberty shifts to the detaining authority \n(May, at para. 74; Khela , at para. 30). As stated by this Court in  Khela , this shifting \nonus plays a crucial and historically significant role in habeas corpus  applications:  \nThis particular shift in onus is unique to the writ of  habeas corpus . Shifting \nthe legal burden o nto the detaining authorities is compatible with the very \nfoundation of the law of  habeas corpus , namely that a deprivation of \nliberty is permissible only if the party effecting the deprivation can \ndemonstrate that it is justified. [para. 40]  \n[39] Lastly, inmat es may apply for certiorari in aid of habeas corpus, which \npermits the institutional decision -making record to be brought before the judge ( Khela , \nat para. 35).  \n(1) Stage One: Deprivation of Liberty  \n[40] In Dumas , this Court outlined three possible deprivations of liberty within \nthe correctional context: “.  . . the initial deprivation of liberty, a substantial change in \nconditions [of confinement ] amounting to a further deprivation of liberty, and a \ncontinuation of",
    "token_count": 1000,
    "start_token": 11700,
    "end_token": 12700,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 14,
    "source_file": "2025scc38.txt",
    "text": ", which \npermits the institutional decision -making record to be brought before the judge ( Khela , \nat para. 35).  \n(1) Stage One: Deprivation of Liberty  \n[40] In Dumas , this Court outlined three possible deprivations of liberty within \nthe correctional context: “.  . . the initial deprivation of liberty, a substantial change in \nconditions [of confinement ] amounting to a further deprivation of liberty, and a \ncontinuation of the deprivation of liberty” (p. 464). This appea l focuses on the third \n2025 SCC 38 (CanLII)\n\n--- Page 34 ---\n \n category, a “continuation” of liberty deprivation. Examples of continued deprivations \n— both in and outside the carceral context — can be found in Chhina  and Cardinal , \nwhere the initial detention was valid, but due to the extended le ngth or uncertainty of \nthe duration of the detention, it became unlawful. As the Court confirmed in Dumas , it \nis only if the continuation of an initially valid deprivation of liberty becomes unlawful \nthat it can be challenged by way of habeas corpus  (ibid.). The third Dumas  category is \nassessed on temporal length, unlike the first and second categories which are grounded \nin a sudden change in the status quo.  \n[41] I note that these categories are not exhaustive, but rather they assist “in \npinpointing the nature o f a challenge to a deprivation of liberty for reasons beyond \nthose underlying an initial order” ( Chhina , at para. 23). This Court has applied these \ncategories broadly to frame a particular type of deprivation, but the actual analysis of \nwhether a deprivati on has occurred must always be undertaken from a qualitative \nperspective ( R. v. Gamble , [1988] 2 S.C.R. 595, at p.  644). As stated in Gamble , any \ndistinctions regarding the availability of habeas corpus review that are “uncertain, \ntechnical, artificial and , most importantly, non -purposive should be rejected” (p. 640).  \n[42] Within the carceral context, a deprivation of liberty is always relative, often \ndealing with various restrictions on an inmate’s residual liberty. As emphasized in \nMiller , “a prisoner has the right not to be deprived unlawfully of the relative or residual  \nliberty permitted to the general inmate population of an institution” (p. 637 (emphasis \nadded)).  \n2025 SCC 38 (CanLII)\n\n--- Page 35 ---\n \n [43] Establishing the first element of a habeas corpus  application therefore \nrequires that an inmat e prove that their current state of confinement is more restrictive \nof their liberty than the state of confinement they allegedly ought to be in. For example, \nan inmate in segregation is deprived of his liberty relative  to those inmates not placed \nin segre gation. The case law has now recognized certain obvious relative restrictions \nas between states of confinement, such as segregation in contrast to general population \nand the tiered restrictions on liberty as between minimum -, medium -, and maximum -\nsecurity federal facilities (see, e.g., Cardinal , May, and Khela ).  \n[44] The writ of habeas corpus  exists to release a person from an unlawful \ndeprivation of their liberty. Care must be taken not to lose sight of this objective. The \nfirst stage functions to filter out f rivolous claims where there is no qualitative difference \nin liberty as between two states of confinement. All applications for habeas corpus,  \nirrespective of a particular Dumas category, face further filtering at the second stage: \nraising a legitimate grou nd to question the lawfulness of the deprivation of their liberty.  \n(2) Stage Two: Legitimate Ground for Questioning the Lawfulness of the \nDeprivation of Liberty  \n[45] Once an applicant has proven a deprivation of their liberty, they must next \nraise a legitimate grou nd for questioning the legality of their current state of liberty \ndeprivation. In order for a detention to be lawful, the decision maker must have \njurisdictional authority to order the detention, the decision -making process must be \nprocedurally fair, and t he decision to detain must be both reasonable and Charter -\n2025 SCC 38 (CanLII)\n\n--- Page 36 ---\n \n compliant ( Chhina , at para. 17;  May, at para. 77). A detention will be unreasonable if \nit is arbitrary or lacking an evidentiary foundation ( Khela , at para. 67).  \n[46] With respect to the second stage, t he applicant must establish a basis for \nthe alleged grounds of unlawfulness. This means that, as preliminary matter",
    "token_count": 1000,
    "start_token": 12600,
    "end_token": 13600,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 15,
    "source_file": "2025scc38.txt",
    "text": " Charter -\n2025 SCC 38 (CanLII)\n\n--- Page 36 ---\n \n compliant ( Chhina , at para. 17;  May, at para. 77). A detention will be unreasonable if \nit is arbitrary or lacking an evidentiary foundation ( Khela , at para. 67).  \n[46] With respect to the second stage, t he applicant must establish a basis for \nthe alleged grounds of unlawfulness. This means that, as preliminary matter, the \napplicant’s allegations and grounds pleaded must disclose some basis in fact and law \nthat would allow the court to conclude that the co ntinued deprivation of liberty is \nunlawful (see Khela , at para. 41; May, at para. 33).  \n[47]  It bears repeating that the writ of habeas corpus  is non -discretionary, \nmeaning that “the matter must  proceed to a hearing if the inmate shows some basis for \nconcludin g that the detention is unlawful” ( Khela , at para. 41 (emphasis in original)). \nTherefore, if an inmate “raise[s] an arguable issue there is no room for discretion: the \nmatter should proceed to hearing so that a full and proper determination can be made” \n(Farbey and Sharpe, at p. 53).  \n[48] Both appellants initially sought relief pursuant to Ontario’s Habeas Corpus \nAct, R.S.O. 1990, c. H.1. I should point out that s. 1(1) of the Act requires “reasonable \nand probable ground for the complaint” as opposed to requiring a “legitimate ground” \nfor questioning the legality of the deprivation of liberty. Whether these requiremen ts \nare conceptually different, or impose a different burden on the applicant, is not a \nquestion before this Court. As such, a technical analysis of the implications of this \nlinguistic difference is not necessary to resolve this appeal. As neither of the pa rties \npresented arguments on this subject, I will refrain from further comment.   \n2025 SCC 38 (CanLII)\n\n--- Page 37 ---\n \n (3) Stage Three: Burden Shifts to Detaining Authority To  Justify the Detention  \n[49] After the applicant has discharged the burden of (1) establishing a \ndeprivation of liberty and (2)  raising a legitimate ground to question the lawfulness of \nthat deprivation, the onus shifts to the detaining authority to prove the deprivation was \nlawful.  \n[50] Although this appeal is concerned solely with access to habeas corpus \nwhere a reclassification req uest is refused, I note with respect to the ultimate merits \nthat it is for the hearing judge to determine whether a particular breach of the CCRA  is \nunfair or whether a decision was truly unreasonable, having reviewed the full \nevidentiary record. As this C ourt stated in Khela , “not all breaches of the CCRA  or the \nCCRR  will be unfair.  . . . [T]he reviewing judge must determine whether that error or \nthat technicality rendered the decision procedurally unfair” (para. 90). Likewise, \ndecisions are not unreasonab le merely because certain indicia point in the opposite \ndirection, and it is for a hearing judge, with access to the full record, to make a holistic \ndetermination ( Canada (Minister of Citizenship and Immigration) v. Vavilov , 2019 \nSCC 65, [2019] 4 S.C.R. 65 3, at paras. 102 and 105).  \nC. Availability of Habeas Corpus for Security Reclassification  \n[51] With this legal framework in mind, I next consider whether the decision to \ndeny a lower security reclassification is reviewable by way of habeas corpus . As I will \nexplain, such a decision has the qualitative effect of restricting liberty.  \n2025 SCC 38 (CanLII)\n\n--- Page 38 ---\n \n (1) Denial of Lower Security Reclassification Is a Deprivation of Liberty  \n[52] The first question is whether a denial of lower security reclassification is a \ndeprivation of liberty.  \n(a) Relative Restrictions in Liberty  \n[53] A security reclassification decision has three possible outcomes: a transfer \nto a higher security facility, a transfer to a lower security facility, or no transfer. Of \ncourse, inmates who are reclassified to a lower security facili ty will not require access \nto the writ. Both May and Khela  dealt with reclassification decisions where the outcome \nwas a transfer to a higher security facility. Here, the outcome of the reclassification \ndecision is a continuation of a current security clas s",
    "token_count": 1000,
    "start_token": 13500,
    "end_token": 14500,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 16,
    "source_file": "2025scc38.txt",
    "text": "] A security reclassification decision has three possible outcomes: a transfer \nto a higher security facility, a transfer to a lower security facility, or no transfer. Of \ncourse, inmates who are reclassified to a lower security facili ty will not require access \nto the writ. Both May and Khela  dealt with reclassification decisions where the outcome \nwas a transfer to a higher security facility. Here, the outcome of the reclassification \ndecision is a continuation of a current security clas sification.  \n[54] As noted above, the analysis must inquire into whether there is a restriction \non liberty as between two states of confinement. For example, the relational focus in \nMiller  was on administrative segregation versus the general population within one \nfederal facility; however, in my view, the same relative comparison applies as between \ntwo separate facilities (i.e., an inmate being held in a maximum -security facility is more \ndeprived of his liberty than if he was placed in a medium -security facility). In Miller , \nestablishing a deprivation of liberty required proof of “a distinct form of confinement \nor detention in which the actual physical constraint or deprivation of liberty, a s distinct \nfrom the mere loss of certain privileges, is more restrictive or severe than the normal \none in an institution” (p.  641). Transposing this logic onto security reclassifications, \n2025 SCC 38 (CanLII)\n\n--- Page 39 ---\n \n the salient comparison is between a current restrictive classificati on in contrast to \nanother, less restrictive, classification.  \n[55] Undoubtedly, not all carceral conditions will constitute deprivations of \nliberty. My colleagues note that “ habeas corpus  is not an unrestricted remedy to \nchallenge an ever -widening range of cond itions of incarceration ” (para. 160). I do not \ncontend otherwise. Again, in Miller , this Court explained that habeas corpus  is not \nmeant “to challenge any and all conditions of confinement in a penitentiary or prison, \nincluding the loss of any privilege en joyed by the general inmate population” (p.  641).   \n[56] Since the Miller  trilogy, courts have held that denial of or inability to access \nrehabilitative programming does not constitute a deprivation of liberty ( Mapara v. \nFerndale Institution (Warden) , 2012 BCCA 127, 318 B.C.A.C. 139, at paras. 12 -15; \nLord v. Coulter , 2007 BCSC 1758, 72 Admin. L.R. (4th) 264, at paras. 60 -63, aff’d \n2009 BCCA 62, 266 B.C.A.C. 122; Rain v. Canada (Parole Board) , 2015 ABQB 639, \nat para. 15). Furthermore, in Ewanchuk v. Canada (Attorn ey General) , 2017 ABQB \n237, 354 C.C.C. (3d) 119, the court held that habeas corpus  does not apply in situations \ninvolving temporary lock downs and other intermittent forms of detention; rude, \nabusive, or inattentive staff; exposure to dangerous inmates; co mplaints about food, \nmedical accommodations, and hygiene; complaints that the inmate grievance \nprocedures are ineffective; inadequate mail services and searches of mail; inadequate \naccess or excessively expensive telephone communications; and restrictions that \nimpede legal research, document preparation, and litigation activities (para. 65). \n2025 SCC 38 (CanLII)\n\n--- Page 40 ---\n \n Likewise, in Mennes v. Canada (Attorney General) , 2008 CanLII 6424, the Ontario \nSuperior Court of Justice held that housing an inmate in a double occupancy room \ninstead of a single occupancy room does not engage a deprivation of liberty (paras. 27 -\n28).  \n[57] Contrary to my colleagues’ suggestion, access to habeas corpus has not \nundergone and, following this appeal, does not risk undergoing unrestrained expansion.  \nThe examples listed above demonstrate that habeas corpus  is circumscribed to carceral \nconditions which amount to a deprivation of liberty. Carceral conditions which do not \nresult in a deprivation of liberty cannot form the basis for habeas corpus review. This \nCourt has previously recognized that “[t]he conditions of imprisonment have \ntraditionally been understood as falling within the purview of corre ctional institutions, \nnot courts” ( John Howard Society of Saskatchewan , at para. 40). These reasons should \nnot be read as departing from that established understanding. The mere loss of certain \nprivileges is distinct from an unlawful",
    "token_count": 1000,
    "start_token": 14400,
    "end_token": 15400,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 17,
    "source_file": "2025scc38.txt",
    "text": " Carceral conditions which do not \nresult in a deprivation of liberty cannot form the basis for habeas corpus review. This \nCourt has previously recognized that “[t]he conditions of imprisonment have \ntraditionally been understood as falling within the purview of corre ctional institutions, \nnot courts” ( John Howard Society of Saskatchewan , at para. 40). These reasons should \nnot be read as departing from that established understanding. The mere loss of certain \nprivileges is distinct from an unlawful decision to maintain a  more restrictive form of \nincarceration ( Miller , at p. 641).  \n[58] It is important not to conflate the three Dumas  categories, which assist \nsolely in determining the nature  of the deprivation, with an analysis of whether there \nis a deprivation of liberty between  two distinct forms of confinement. The analysis of \ndeprivations of liberty does not merely assess whether a change has occurred; if that \nwere so, it would effectively eliminate the third  Dumas  category. The analysis must \n2025 SCC 38 (CanLII)\n\n--- Page 41 ---\n \n focus on whether the inmate is cur rently in a state of confinement that is relatively  more \nrestrictive of his liberty than where he allegedly ought to be.  \n[59] It is less difficult to identify when a deprivation has arisen with respect to \nthe first and second categories, namely, when a change results in depriving the inmate \nof liberty relative to his prior state. These two categories require an overt change in \nliberty, so courts can readily establish a deprivation so long as the change is between \nrelative states of liberty deprivation and not m ere privileges. The analysis of a \n“deprivation of liberty” for these first two categories has tended to be straightforward. \nFor instance, in May, this Court concluded in one pithy paragraph that a deprivation of \nliberty was established when inmates were tr ansferred to a higher security facility (para. \n76). \n[60] Turning to the third category, a continual confinement that results in a \ndeprivation of liberty, the analysis remains one of comparing two relative states. The \nanalysis here is the same as above. An inmat e will establish a deprivation of liberty if \nthey demonstrate that their current continuing state of incarceration is more restrictive \nof their liberty than the allegedly lawful state they seek to be released to. For example, \nin Cardinal , where the applica nts were lawfully placed in administrative segregation \nbut it was their continued  confinement in segregation, as opposed to the general \npopulation, that was found to be unlawful.  \n[61] Establishing a deprivation of liberty is not contingent on a change in statu s \nquo. A “change in status quo” speaks to the first and second Dumas categories and is \n2025 SCC 38 (CanLII)\n\n--- Page 42 ---\n \n useful only as a proxy for comparing two distinct states of liberty restriction. Unlike \nthe first and second categories of Dumas , which are defined by a change in condit ions, \nthe third category is marked by the distinct absence of any change. If it were necessary \nto show that an inmate had previously experienced a greater degree of liberty, and then \nwas deprived of such liberty, there would conceptually be no space left f or the third \ncategory.  \n[62] I can see no principled reason for permitting access to the writ based solely \non an inmate having already experienced greater freedom (such as before being placed \nin segregation) but, conversely, prohibiting access to the writ becau se one seeks  — but \nhas not yet experienced — greater freedom. I reject the lower courts’ and the \nrespondent’s assertion that, because an inmate has never enjoyed a less restrictive form \nof imprisonment, they have not been deprived of liberty. This formalis tic, and unduly \nnarrow, interpretation of liberty deprivation is discordant with both the general tenor \nof our Court’s jurisprudence on habeas corpus and a purposive interpretation of \nCharter  rights. As Justice Wilson stated in Gamble , “the effects of a de privation of \nliberty or a continuation of a particular form of deprivation of liberty should be \nreviewed from a qualitative perspective” (p.  644). The concept of status quo serves no \npurpose when analyzing whether a continual state of confinement is a depr ivation of \nliberty.  \n(b) No Entitlement Necessary  \n2025 SCC 38 (CanLII)\n\n--- Page 43 ---\n \n [63] In my view, the courts below erred in holding that an applicant must first \nprove an “entitlement” to the less restrictive state in order to establish a deprivation of \nliberty. The respondent echoed this line of  reasoning, arguing that, for a continuation \n",
    "token_count": 1000,
    "start_token": 15300,
    "end_token": 16300,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 18,
    "source_file": "2025scc38.txt",
    "text": " when analyzing whether a continual state of confinement is a depr ivation of \nliberty.  \n(b) No Entitlement Necessary  \n2025 SCC 38 (CanLII)\n\n--- Page 43 ---\n \n [63] In my view, the courts below erred in holding that an applicant must first \nprove an “entitlement” to the less restrictive state in order to establish a deprivation of \nliberty. The respondent echoed this line of  reasoning, arguing that, for a continuation \nto be tantamount to a deprivation of liberty, it must involve circumstances where an \ninitially lawful detention becomes “unlawful because of a change in the legal \nentitlement of the detainee” (R.F., at para. 60) . Entitlement has never formed part of \nthe analysis for a deprivation of liberty; rather, a legal entitlement to a certain form of \nincarceration is the outcome of a successful habeas corpus  application, after being \nheard on its merits. A requirement of ent itlement at the first stage of an application \nwould preclude an arbitrarily detained applicant from ever having their application \nheard.  \n[64] Reliance on entitlement appears to come from a misinterpretation of \nDumas , which dealt with an inmate challenging a con tinuation of his deprivation of \nliberty. In that case, Mr. Dumas was initially granted day parole by the National Parole \nBoard (“NPB”), conditional on his acceptance into a community residential centre. In \nthe interim, Mr. Dumas committed various disciplin ary offences and, following a \nreview, the NPB revoked their prior approval of day parole before it ever took effect. \nMr. Dumas commenced a habeas corpus application challenging his denial of day \nparole. This Court concluded that he had no right to habeas c orpus , holding that the \n“continuation of an initially valid deprivation of liberty can be challenged by way of \nhabeas corpus only if it becomes unlawful” (p. 464). The Court noted that: “In the \ncontext of parole, the continued detention of an inmate will o nly become unlawful if \n2025 SCC 38 (CanLII)\n\n--- Page 44 ---\n \n he has acquired the status of a parolee” ( ibid.). When a decision to grant parole is \nconditional, an “inmate only becomes a parolee if and when the condition is fulfilled” \n(ibid.). In the case of Mr. Dumas, because the condition was never fulfilled: he was \nnever granted parolee status and therefore had no right to habeas corpus  (p. 465).  \n[65] Based on these facts, access to habeas corpus  was denied because \nMr. Dumas failed to raise le gitimate grounds for challenging the legality of his \ndeprivation of liberty — the second prerequisite for accessing a merits hearing. This \nCourt was clear that Mr. Dumas had not alleged that the NPB acted without jurisdiction, \ndeprived him of procedural fa irness, or infringed the Charter (Dumas , at p. 465). In \nother words, Mr. Dumas failed to provide a legitimate ground for questioning the \ndeprivation. I note that Dumas was decided well before this Court held in Khela that \nhabeas corpus was available to cha llenge the substantive reasonableness of an \nadministrative decision -maker.  \n[66] Moreover, there was no entitlement to the less restrictive state of liberty in \nCardinal , a case dealing with a continuation of liberty deprivation . In Cardinal , the \napplicants were  moved from a medium - to maximum -security facility following a \nhostage -taking situation. The applicants were immediately placed in segregation. The \nSegregation Review Board subsequently recommended that the applicants be moved \nto the general population, bu t the Director maintained the right to refuse this \nrecommendation. This Court held that the Director’s decision to continue to hold  the \napplicants in segregation was unlawful because it was procedurally unfair (p. 661). \n2025 SCC 38 (CanLII)\n\n--- Page 45 ---\n \n However, had the Director notified t he applicants that he intended to reject the \nSegregation Review Board’s recommendation and provided them with an opportunity \nto be heard, procedural fairness would have been met and the decision to continue the \nsegregation could have been found to have bee n lawful (pp. 659 -60). Therefore, \nimportantly, at no point did the applicants have a crystallized entitlement to be \ntransferred to the general population. Rather, a recommendation was made and a \ndecision -maker declined that recommendation. Notably, the rem edy for the procedural \nunfairness was to release the applicants into the general population of a new institution, \ndespite having had no prior interaction with that",
    "token_count": 1000,
    "start_token": 16200,
    "end_token": 17200,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 19,
    "source_file": "2025scc38.txt",
    "text": "segregation could have been found to have bee n lawful (pp. 659 -60). Therefore, \nimportantly, at no point did the applicants have a crystallized entitlement to be \ntransferred to the general population. Rather, a recommendation was made and a \ndecision -maker declined that recommendation. Notably, the rem edy for the procedural \nunfairness was to release the applicants into the general population of a new institution, \ndespite having had no prior interaction with that population.  \n[67] As these cases demonstrate, the first stage requires an applicant to establish \nthat their present state of liberty is restricted relative to that which they allegedly ought \nto lawfully be in, and does not require that they establish a formal entitlement. The \nfocus is on the effect of a particular type or level of detention and must be  reviewed \nfrom a qualitative perspective. This stage should not function to prevent access to the \nwrit based on formalistic distinctions.  \n(c) Impact of Security Reclassification  \n[68] Turning to the impact of security reclassification decisions within the \nfederal c orrectional system, in my view, it is clear that their effect may be to unlawfully \ndetain an inmate in a higher, more restrictive facility than they lawfully ought to be \ndetained in. Federal inmates’ security classifications and placements have a profound \n2025 SCC 38 (CanLII)\n\n--- Page 46 ---\n \n impact on their qualitative experience of incarceration and, in many instances, also on \nits duration.  \n[69] Security classification and placement will impact the degree of access an \ninmate has to correctional programs, rehabilitative opportunities, private fami ly visits, \nwork opportunities, and temporary absences, as well as the eventual timing of their \nrelease , all of which may well impact their successful reintegration into the community. \nFor inmates serving life or indeterminate sentences, such as the appella nts, transfer to \na minimum -security facility is often the prerequisite to a conditional release.  \n[70] This Court has recognized the non -trivial and substantial liberty restrictions \nas between minimum -, medium -, and maximum -security federal facilities and \nestab lished that a transfer to a higher security facility constitutes a deprivation of liberty \n(see, e.g., May; Khela ). In my view, an inmate unlawfully held for an extended period \nat a higher security facility, having been wrongly denied a reclassification, fa ces the \nsame deprivation of liberty as an inmate who has been unlawfully transferred to a \nhigher security facility.  \n[71] Whether a security reclassification results in a deprivation of liberty is \nultimately context -dependent. It will depend on whether the deci sion results in actual \nphysical constraints or deprivations of liberty that are more restrictive or severe than \nanother, less restrictive security classification. Security reclassification decisions that, \nin practice, result in an insignificant or trivial limitation on an inmate’s rights would \nnot constitute a deprivation of liberty for the purposes of habeas corpus .  \n2025 SCC 38 (CanLII)\n\n--- Page 47 ---\n \n [72] Moreover, as several interveners point out, marginalized Black and \nIndigenous inmates are more likely to be over -classified, meaning they are  more likely \nto be assessed at a higher security level than their non -marginalized peers (see, e.g., \nI.F., Aboriginal Legal Services, at paras. 9 -15; I.F., Black Legal Action Centre, at \nparas.  10-12; I.F., Canadian Association of Elizabeth Fry Societies, a t para. 10). Over -\nclassification disproportionately places Black and Indigenous inmates in higher, more \nrestrictive security facilities with a lesser degree of access to rehabilitative \nopportunities that promote successful reintegration into the community upon release. \nNotably, the inability to reach a lower security classification can preclude inmates from \nqualifying for culturally responsive environments and programming, such as the \nHealing Lodge ( Ewert v. Canada , 2018 SCC 30, [2018] 2 S.C.R. 165, at para . 65; A.F., \nat para.  40). In turn, impeding access to the writ will disproportionately impact these \nmarginalized groups ’ ability to cascade to lower security levels and, ultimately, to \nrehabilitate and reintegrate .  \n[73] To summarize, the decision to increase a  security classification is a \ndeprivation of liberty, as is the decision to deny a lower security classification. \nHowever, in both situations, access to habeas corpus  will still require an applicant to \nraise a legitimate ground for the unlawfulness of that  particular decision. What amounts \nto legitimate grounds must be assessed on a case -",
    "token_count": 1000,
    "start_token": 17100,
    "end_token": 18100,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 20,
    "source_file": "2025scc38.txt",
    "text": " cascade to lower security levels and, ultimately, to \nrehabilitate and reintegrate .  \n[73] To summarize, the decision to increase a  security classification is a \ndeprivation of liberty, as is the decision to deny a lower security classification. \nHowever, in both situations, access to habeas corpus  will still require an applicant to \nraise a legitimate ground for the unlawfulness of that  particular decision. What amounts \nto legitimate grounds must be assessed on a case -by-case basis. As discussed above, at \nthe second stage, an applicant must raise a legitimate ground to question the lawfulness \nof the denial of a lower security classificat ion because it was either procedurally unfair, \nunreasonable, outside the decision maker’s jurisdiction, failed to comply with the \n2025 SCC 38 (CanLII)\n\n--- Page 48 ---\n \n Charter , or a combination of these reasons. Failure to raise a legitimate ground at the \nsecond stage will result in the dismis sal of the habeas corpus  application. This \nrequirement ensures that only claims with a sound legal foundation proceed to the \nmerits, thereby preventing misuse of the writ.   \n[74] Within the context of a denial of a lower security reclassification, it would \nbe at this second threshold stage that a court could decline to proceed to a hearing on \nthe merits. An application that fails to establish proper grounds, which provide a legal \nbasis for the claim of unlawfulness, will not proceed to stage three of the habeas corpus \nprocess. I do not agree that permitting access to habeas corpus  in these circumstances \nwill open the floodgates as the respondent suggests (R.F., at para. 107, citing \napplication judge’s reasons, at para.  49). At this second stage, the applicant is required \nto raise a legitimate ground to question the lawfulness of the deprivation of their liberty. \nTo do so, they must identify an arguable issue and present a sound legal basis for their \nclaim (see Farbey and Sharpe, at p.  53). Importantly, this second  stage engages the \ncourts’ gatekeeping function and courts should take care to decline to hear a case on its \nmerits where the applicant does not meet this threshold (see  Khela , at para. 41).  \n[75] The governing test, as articulated in Dumas  and affirmed in May, Khela , \nand subsequent cases, remains unchanged. This Court has consistently applied the test \nin line with the expansive and purposive approach to habeas corpus  recognized in \nDumas.  In the present context — where unlawful restraints on liberty arise from th e \nwrongful denial of security reclassifications — the remedy clearly falls within the \n2025 SCC 38 (CanLII)\n\n--- Page 49 ---\n \n established scope. The traditional onuses associated with the writ should remain \nunchanged; once the inmate demonstrates a deprivation of liberty, all that is required is  \nthat they cast a doubt on the lawfulness of the deprivation ( Khela , at para. 77). To \nunduly narrow this scope would constitute a departure from the Court’s settled \njurisprudence. Should Parliament consider this application of the remedy too broad, it \nretains the authority to respond by enacting a complete, comprehensive and expert \nprocedure for review of federal reclassification refusals ( May, at paras. 40 and 44).  \n[76] Preventing applications with a proper legal basis from proceeding to the \nthird stage out of  fear of opening the floodgates would run contrary to the very \nfoundation of the law of habeas corpus . Courts can, and have, guarded against a flood \nof cases by declining applications that lack a legal basis. However, once a sound legal \nbasis is establishe d, courts should not be reluctant to allow such applications to proceed. \nThe second stage of the application is not concerned with the capacity of correctional \ninstitutions to justify the seemingly unlawful detention; rather, it is focused on ensuring \nmean ingful access to justice to protect inmates’ liberty rights.  \n[77] The purposive and qualitative approach to habeas corpus  leads me to \nconclude that a deprivation of liberty is established when an inmate has been denied a \nlower security reclassification. Premat urely filtering out reclassification decisions that \ncontinue, rather than definitively alter, a particular form of confinement fails to assess \nthe reality of inmates’ lives within the walls of a prison. Whether or not that decision \nis lawful is a distinct and separate question in the analysis, with respect to which the \n2025 SCC 38 (CanLII)\n\n--- Page 50 ---\n \n applicant must raise a legitimate ground. An unreasonable or arbitrary decision to \nrefuse a lower",
    "token_count": 1000,
    "start_token": 18000,
    "end_token": 19000,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 21,
    "source_file": "2025scc38.txt",
    "text": ". Premat urely filtering out reclassification decisions that \ncontinue, rather than definitively alter, a particular form of confinement fails to assess \nthe reality of inmates’ lives within the walls of a prison. Whether or not that decision \nis lawful is a distinct and separate question in the analysis, with respect to which the \n2025 SCC 38 (CanLII)\n\n--- Page 50 ---\n \n applicant must raise a legitimate ground. An unreasonable or arbitrary decision to \nrefuse a lower security classification is an unlawful deprivation of liberty and the \nappropriate remedy is r elease to a lower security facility.  \n[78] Habeas corpus  remains one of the few tools available for inmates to \neffectively challenge and remedy a wrongful restraint on their residual liberty. It would \nbe antithetical to the purpose of the “great and efficacious writ” if courts were precluded \nfrom assessing the lawfulness of a particular, more restrictive form of continued \nconfinement. In recognition of the courts’ traditional role as a safeguard of the liberty \nof inmates,  Gamble  held that “[r]elief in the form of habeas corpus  should not be \nwithheld for reasons of mere convenience”, reinforcing that access to the writ must not \nbe subject to procedural roadblocks (p. 635).  \n[79] The above analysis answers the issue on appeal: a decision denying \nreclassification to a lower security ins titution is a deprivation of residual liberty \nreviewable by way of habeas corpus . It follows that the courts below erred in \nconcluding that the appellants could not seek to challenge the reclassification refusals \nof the detaining authorities in their cases . Both appellants have now been reclassified \nand moved to minimum -security facilities, and therefore the application of habeas \ncorpus  to the legality of their particular detentions is now moot. However, the parties \nraised some additional concerns which I w ill briefly address.  \n(2) No Barrier to Habeas Corpus  Posed by Other Avenues of Review or \nRemedial Jurisdiction  \n2025 SCC 38 (CanLII)\n\n--- Page 51 ---\n \n [80] There are only two instances where a provincial superior court may decline \nto hear a habeas corpus application on its merits. The first is when a de tainee attacks \nthe legality of their conviction or sentence, which should be challenged through the \nappeal mechanisms set out in the Criminal Code , R.S.C. 1985, c.  C-46 (Gamble , at p. \n636). The second is when a “complete, comprehensive and expert scheme pr ovides for \nreview that is at least as broad and advantageous as habeas corpus with respect to the \nchallenges raised by the habeas corpus application” ( Chhina , at para. 40). In May, this \nCourt made it clear that the internal grievance procedure made availab le under the \nCCRA for reclassification decisions is not a “complete, comprehensive and expert \nstatutory scheme” (para. 63; see also paras.  62 and 64; Reza v. Canada , [1994] 2 S.C.R. \n394, at p. 405). Nor can provincial superior courts decline jurisdiction i n favour of \nFederal Court jurisdiction ( May, at paras. 65 -72). \n[81] Neither of the parties argued that decisions denying security \nreclassification fall within one of the two jurisdictional exceptions. This case is not \nabout concurrent jurisdiction, nor is it ab out the scope of review for assessing the \nlegality of the deprivation. Instead it hinges on the narrow issue of whether a particular \nsecurity reclassification outcome is capable of triggering threshold access to the writ \n(R.F., at para. 88).  Nevertheless, the respondent argues that inmates denied lower \nsecurity reclassification still have several avenues available for remedying their \ncontinued detention, such as CSC’s internal grievances procedure and judicial review \nin Federal Court.  \n2025 SCC 38 (CanLII)\n\n--- Page 52 ---\n \n [82] This argument has no b earing on whether habeas corpus  is available to \nreview decisions rejecting lower security reclassifications. As stated in May:  \nThe proper scope of the availability of habeas corpus  must be considered \nfirst on its own merits, apart from possible problems a rising from \nconcurrent or overlapping jurisdiction. The general importance of this \nremedy as the traditional means of challenging deprivations of liberty is \nsuch that its proper development and adaptation to the modern realities of \nconfinement in a prison setting should not be compromised by concerns \nabout conflicting jurisdiction. [Emphasis deleted.]  \n \n(para. 31, quoting Miller , at p.  641.)  \nThe denial of a lower",
    "token_count": 1000,
    "start_token": 18900,
    "end_token": 19900,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 22,
    "source_file": "2025scc38.txt",
    "text": "first on its own merits, apart from possible problems a rising from \nconcurrent or overlapping jurisdiction. The general importance of this \nremedy as the traditional means of challenging deprivations of liberty is \nsuch that its proper development and adaptation to the modern realities of \nconfinement in a prison setting should not be compromised by concerns \nabout conflicting jurisdiction. [Emphasis deleted.]  \n \n(para. 31, quoting Miller , at p.  641.)  \nThe denial of a lower security classification constitutes a deprivation of liberty and \ntherefore falls within the prop er scope of a habeas corpus  review on the merits. I note \nthat the decision of whether a statutory scheme constitutes a “complete, comprehensive \nand expert statutory scheme for review that is at least as broad and advantageous as \nhabeas corpus ” is also cont ext-dependent ( Chhina , at para.  40). The availability of \nother forms of relief is not an impediment to the availability of habeas corpus  (see May, \nat paras. 65 -72; Khela , at paras. 43 -49; Chhina , at paras. 64 -67). \n[83] Moreover, the alternative forms of relief may be inadequate for inmates \nwho have been denied lower security reclassifications because they lack a timely, \nindependent review and the effective remedy of release to a lower security facility.  This \nCourt has co nsistently held that the writ of habeas corpus  in provincial superior courts \nis more advantageous to detainees in comparison to judicial review in Federal Court \n(see May, at paras. 65 -72; Khela , at paras. 43 -49; Chhina , at paras. 64 -67). The \nfollowing diff erences are often highlighted: (1) a habeas corpus  application can be \n2025 SCC 38 (CanLII)\n\n--- Page 53 ---\n \n reviewed more rapidly (often within a week) whereas judicial review can only be \ncommenced in Federal Court 160 days following the impugned decision ( Federal \nCourt Act , R.S.C. 1985, c.  F-7, s. 18.1(2);  Federal Court Rules , SOR/98 -106, rr.  301 \nto 314); (2) the remedy following a successful judicial review in Federal Court will \ngenerally be an order for redetermination, not release — there is no history of \nmandamus being used by the Federal Court to release a detainee (see Chhina , at para. \n65); (3) the scope of review in habeas corpus is broader as it reviews the legality of the \ndetention as a whole, rather than one particular administrative decision (see para. 64);  \n(4) judicial review is dis cretionary and the onus remains on the applicant to prove \nunlawfulness, unlike the shifting onus at the third stage of the habeas corpus  analysis; \nand (5) there is greater local access to provincial superior courts ( Khela , at para. 47).  \n[84] The respondent also  argues that provincial superior courts lack the remedial \njurisdiction to order that inmates be placed in a lower security institution where they \nhave never previously been housed. This is because provincial superior courts lack \njurisdiction over certiorar i, mandamus , or declaratory relief in relation to federal \nadministrative bodies (R.F., at paras. 80 -83).  \n[85] This argument adopts a very narrow understanding of habeas corpus relief \nthat is contrary to this Court’s jurisprudence.  \n[86] First, while a provincial su perior court does not have an inherent discretion \nto refuse to conduct a review of a habeas corpus  application, there is discretion at the \nthird stage of the proceeding, after a judge has reviewed the record ( Khela , at para.  78). \n2025 SCC 38 (CanLII)\n\n--- Page 54 ---\n \n Habeas corpus  is the revie w of the legality of the detention, and while the lawfulness \nof a particular decision may be the focal point of the review, the state can tender \nevidence as to why an applicant should nevertheless not be discharged. I agree with the \nintervener, the John Ho ward Society of Canada, that CSC may lead evidence with \nrespect to the substantive overall legality of the detention and the judge can consider \nthis evidence when determining whether to grant the remedy of release (transcript, at \npp. 99 -100).   \n[87] Second, whi le release remains the standard remedy for habeas corpus , \ncourts are empowered under their inherent jurisdiction to attach strict conditions to such \nrelease. As Justice Sharpe explained in Ogiam",
    "token_count": 1000,
    "start_token": 19800,
    "end_token": 20800,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 23,
    "source_file": "2025scc38.txt",
    "text": ", the John Ho ward Society of Canada, that CSC may lead evidence with \nrespect to the substantive overall legality of the detention and the judge can consider \nthis evidence when determining whether to grant the remedy of release (transcript, at \npp. 99 -100).   \n[87] Second, whi le release remains the standard remedy for habeas corpus , \ncourts are empowered under their inherent jurisdiction to attach strict conditions to such \nrelease. As Justice Sharpe explained in Ogiamien v. Ontario (Community Safety and \nCorrectional Services) , 2017 ONCA 839 , 55 Imm. L.R. (4th) 220 : \n I do not accept the general proposition .  . . that a judge has never had \nauthority to impose conditions when granting habeas corpus . I agree with \nthe submission .  . . that such a rigid view would unduly impair the inherent \npowers of the Superior Court to ensure that its orders are effective. It would \nalso be inconsistent with the need to ensure that the fundamental common \nlaw and constitutional right to habeas corp us remains a flexible and \neffective remedy. [para.  47] \n[88] In keeping with the flexible nature of habeas corpus , courts have crafted \ntailored conditions on release to reflect the specific circumstances before them. Upon \ndetermining that a decision denying an i nmate’s lower security classification is \nunlawful, a court retains discretion to order release to a less restrictive facility (with or \nwithout conditions) or, depending on the circumstances, maintain the inmate’s present \nclassification. For example, in Ogiamien , conditions were placed on the applicant’s \n2025 SCC 38 (CanLII)\n\n--- Page 55 ---\n \n release because “outright or unconditional release would be inappropriate” (para.  48; \nsee also para. 49). Likewise, while the court in Leinen v. Mission Institution (Warden) , \n2025 BCCA 257, rejected the impo sition of conditions designed solely to avoid \nadministrative inconvenience, it agreed that judges could impose conditions on release \nto address public safety concerns and promote respect for the law (para. 64).  \n[89] In sum, the availability of the writ is not c ircumscribed by alternative \navenues of redress, and this Court has previously found that alternative paths are neither \ntimely nor provide as effective relief as habeas corpus . The remedy following a \nsuccessful application is release to a less restrictive s ecurity facility, but CSC may \ntender evidence during the third stage of habeas corpus application as to why a specific \nsecurity classification is nonetheless justified and judges retain discretion to not \ndischarge an applicant. Finally, as both a right and  remedy, habeas corpus  has always \nbeen flexible and adaptable to contemporary deprivations of liberty. Lower courts \nretain the ability to craft appropriate conditions when granting relief.  \nV. Conclusion  \n[90] For the foregoing reasons, I would allow the appeal. G iven that the appeal \nis moot, I would make no further order. As the appellants do not seek costs, I would \nmake no order as to costs.  \n The reasons of Côté, Rowe and Jamal JJ. were delivered by  \n2025 SCC 38 (CanLII)\n\n--- Page 56 ---\n \n  CÔTÉ AND ROWE JJ. —  \nI. Overview  \n[91] This case is not a constitutional challenge. Rather, it concerns habeas \ncorpus , an extraordinary common law remedy. While habeas corpus  must remain  \navailable and accessible when its use is warranted, its scope is not unlimited. Habeas \ncorpus  is not, and sh ould not become, an unrestricted remedy used to challenge every \nfeature in the correctional system otherwise left to the administrative state.  \n[92] The essence of any habeas corpus application is to assess whether a \nwrongful restraint  — or unlawful deprivation of liberty  — has been imposed. In the \ninstant case, the appellants are asking our Court to expand the writ of habeas corpus to \nallow its use by federal inmates to challenge the decisions of correctional \nadministrators to deny reclassification and transfer requests from an inmate’s existing \nlevel of security classification to a lower one.  \n[93] We must determine if such an expansion is warranted. The majority is of \nthe view that it is (para.  6). We are not and, respectfully, our view is supported by the \nwrit’s his torical background and evolution.  \n[94] While habeas corpus  should be used readily to safeguard the liberty of \nindividuals against unlawful detention, only in limited circumstances should it be used \nas a substitute for judicial review  in the correctional system. In its",
    "token_count": 1000,
    "start_token": 20700,
    "end_token": 21700,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 24,
    "source_file": "2025scc38.txt",
    "text": " We must determine if such an expansion is warranted. The majority is of \nthe view that it is (para.  6). We are not and, respectfully, our view is supported by the \nwrit’s his torical background and evolution.  \n[94] While habeas corpus  should be used readily to safeguard the liberty of \nindividuals against unlawful detention, only in limited circumstances should it be used \nas a substitute for judicial review  in the correctional system. In its contemporary form, \n2025 SCC 38 (CanLII)\n\n--- Page 57 ---\n \n habeas corpus  is a summary procedure, one that contemplates a judge substituting their \ndecision for that of a public official. Although this iteration of habeas corpus  is \nmarkedly different from the hi storical version of the writ, which protected individual \nliberty against state abuse, the evolution of habeas corpus  has been incremental and \nalways in keeping with its underlying rationale, i.e., to guard against unlawful \nrestraints.  \n[95] In 1986, our Court in  Dumas v. Leclerc Institute , [1986] 2 S.C.R. 459, at \np. 464, set out the contours of the application of habeas corpus to correctional settings \nby recognizing three categories of deprivations of liberty: (1) the initial deprivation; (2) \na substantial change  in conditions amounting to a further deprivation of liberty; and, \n(3) a continuation of the deprivation of liberty. The third category is engaged in this \nappeal. However, as a matter of law, its criteria have not been met.  \n[96] To meet the criteria of the thir d category, a federal inmate must have an \nexisting legal entitlement to increased residual liberty. This is clear from Dumas , which \nremains good law and binding authority. There, an inmate seeking habeas corpus \nbecause of his “continued” detention despite having been granted parole was denied \nhabeas corpus by our Court because a condition for his parole had not been fulfilled. \nIn other words, he had not achieved the status of a parolee and as such, his residual \nliberty remained unchanged. Those facts stand in sharp contrast with the instant case. \nNeither appellant reached a stage comparable to that attained by Mr.  Dumas  — neither \never secured approval to be reclassified and transferred to a lower security facility, \n2025 SCC 38 (CanLII)\n\n--- Page 58 ---\n \n whereas Mr.  Dumas had been granted conditio nal parole. As the Court of Appeal \nrightly concluded, because Mr.  Dorsey and Mr.  Salah had no legal entitlement to \nreclassification, their residual liberty remained unchanged and, as such, resort to \nhabeas corpus  was unavailable to them.  \n[97] Habeas corpus  is, of course, available to challenge an unlawful deprivation \nof liberty. This is well -settled law. However, while the majority claims that it does not \nalter the habeas corpus  framework, its interpretation does so by dispensing with the \nrequirement of a legal entitlement to increased residual liberty to meet the third \ncategory of Dumas  (para.  4). It results in an expansion of habeas corpus beyond \nwrongful restraints on one’s liberty. It strains the law of judicial review by allowing \nsuperior courts to bypass th e usual remedies available on judicial review, such as \nremitting the matter for reconsideration by the decision maker, by granting release \nthrough habeas corpus . When the scope of habeas corpus  applications becomes \namorphous or too wide, the coherence of t he law relating to review of administrative \naction is undermined.  \n[98] Our colleague begins her reasons by stating that “[l]ong revered as the great \nwrit of liberty, habeas corpus  review remains an essential safeguard against unlawful \ndetention” (para.  1). We a gree. But the unlawful deprivation of an inmate’s residual \nliberty is not at issue in this appeal. Rather, the issue is whether the “Great Writ of \nLiberty” is to be used, first, as an end -run around procedures for the administration of \nprisons established by Parliament and, second, as a means to circumvent administrative \n2025 SCC 38 (CanLII)\n\n--- Page 59 ---\n \n law procedures based on the prerogative writs of mandamus , certiorari  and prohibition. \nWhat this Court provided for in Dumas  was the use of habeas corpus  to give effect \nexpeditiously to an applicant’s existing legal entitlement to greater liberty. Instead, the \nmajority will transform habeas corpus  from an extraordinary common law remedy",
    "token_count": 1000,
    "start_token": 21600,
    "end_token": 22600,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 25,
    "source_file": "2025scc38.txt",
    "text": ", as a means to circumvent administrative \n2025 SCC 38 (CanLII)\n\n--- Page 59 ---\n \n law procedures based on the prerogative writs of mandamus , certiorari  and prohibition. \nWhat this Court provided for in Dumas  was the use of habeas corpus  to give effect \nexpeditiously to an applicant’s existing legal entitlement to greater liberty. Instead, the \nmajority will transform habeas corpus  from an extraordinary common law remedy into \na means for judges to summarily substitute their own views for those of correctional \nadministrators. Judges will create and bestow on an inmate an entitlement to be released \ninto a lower security prison, where no such entitlement previously existed.  \n[99] It is important to be clear about the practical impact of this appeal on the \ncorrectional system. If the ap pellants succeed, superior courts will play a central role \nin the administration of the correctional system. This stands directly against the \nintention of Parliament, which, through the Corrections and Conditional Release Act , \nS.C. 1992, c.  20 (“ CCRA ”), an d related regulations, has established an alternative \nscheme of review for administrative decisions made by correctional administrators.  \n[100]  Therefore, the majority’s characterization of the question on appeal as \n“narrow” obscures that the consequences of its reasons will be wide -ranging. The \nmajority’s reasons unduly broaden the scope of habeas corpus in two ways : first, by \nremoving the requirement of a legal entitlement to greater liberty in order to establish \na deprivation of liberty; second, by requiring th e applicant only to put forward an \n“arguable issue” to establish a legitimate ground challenging the lawfulness of the \ndetention (para.  74). \n2025 SCC 38 (CanLII)\n\n--- Page 60 ---\n \n [101]  In this context, not only will inmates be able to invoke the writ to challenge \ndenials of reclassification and tran sfer requests, but the decision opens the door to the \nwrit’s use in challenging a wider range of decisions concerning the conditions of their \ndetention. This risks an ensuing surge of habeas corpus applications before the court, \nlimiting their capacity to provide relief to genuine deprivations of liberty. The \nimportance of the liberty interest at stake will also diminish and weaken the imperative \nof prompt resolution of habeas corpus . \n[102]  The expansion o f habeas corpus  so that it becomes a regular tool for \njudicial oversight in the correctional system should be avoided.  \n[103]  We would dismiss the appeal, upholding the Court of Appeal’s judgment \nthat habeas corpus  should not be available in the case of a federal  inmate being denied \nreclassification and transfer to lower security facility. Rather, such decisions should be \nsubject to review under procedures established by Parliament, as well as judicial review \nunder the Vavilov  framework ( Canada (Minister of Citize nship and Immigration) v. \nVavilov , 2019 SCC 65, [2019] 4 S.C.R. 653).  \nII. Facts  \n[104]  In 2019, Mr.  Dorsey and Mr.  Salah both applied for transfers to \nminimum -security. Both requests were denied.  \nA. Background Concerning Mr.  Dorsey  \n2025 SCC 38 (CanLII)\n\n--- Page 61 ---\n \n [105]  Mr. Dorsey procured a 17 -year-old vict im into prostitution. Prior to his \ndesignation as a dangerous offender, he had 26  criminal convictions. A psychiatrist \ndiagnosed him with severe anti -social personality disorder in the psychopathic range \nand stated that he represents a substantial risk of reoffending. A 2018 psychological \nassessment further concluded that Mr.  Dorsey was a high risk for violent recidivism.  \n[106]  In 2019, while incarcerated at a medium -security facility, Mr.  Dorsey \nrequested a transfer to a minimum -security facility. Mr.  Dorsey’s c ase management \nteam, his Manager of Assessment and Intervention (“MAI”), and his Warden, all agreed \nthat he met the criteria for reclassification to minimum -security but, because of his \ndangerous offender status, his transfer request had to be approved by the Regional \nDeputy Commissioner (“RDC”) and the Assistant Commissioner, Correctional \nOperations and Programs (“ACCOP”).  \n[107]  The RDC rejected the Warden’s recommendation in favour of \nreclassification and maintained Mr.  Dorsey’s medium -security status, stating that he \nwas assessed as a high risk for violent",
    "token_count": 1000,
    "start_token": 22500,
    "end_token": 23500,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 26,
    "source_file": "2025scc38.txt",
    "text": " he met the criteria for reclassification to minimum -security but, because of his \ndangerous offender status, his transfer request had to be approved by the Regional \nDeputy Commissioner (“RDC”) and the Assistant Commissioner, Correctional \nOperations and Programs (“ACCOP”).  \n[107]  The RDC rejected the Warden’s recommendation in favour of \nreclassification and maintained Mr.  Dorsey’s medium -security status, stating that he \nwas assessed as a high risk for violent recidivism and a moderate risk of general \nrecidivism.  \n[108]  At the subsequent security classification review, his case management \nteam and the Warden again recommended reclassification as minimum -security. This \ntime, the RDC concurred in that recommendation, with the result that it was forwarded \nto the ACCOP. On October  25, 2021  — while Mr.  Dorsey’s habeas corpus  application \n2025 SCC 38 (CanLII)\n\n--- Page 62 ---\n \n was pending  — the ACCOP approved his classification as minimum -security and he \nwas transferr ed. \nB. Background Concerning Mr.  Salah  \n[109]  Mr. Salah firebombed a family home in the middle of the night while two \nchildren, aged 7 and 10, were asleep inside. He did so in an attempt to kill their mother \nin order to silence her. The mother escaped but the childr en were killed. Mr.  Salah was \nconvicted of two counts of first degree murder and was sentenced to concurrent life \nsentences.  \n[110]  In August 2019, while incarcerated at a medium -security facility, \nMr. Salah requested a transfer to a minimum -security facility. Mr. Salah’s case \nmanagement team, his parole officer, and his initial MAI recommended reclassification \nand transfer to a minimum -security facility. He was rated as a low escape risk despite \na deportation order. His case management team noted that he intend ed to return to \nJordan, his home country, on full parole and has a detailed resettlement plan.  \n[111]  In October  2019, a new MAI was assigned to Mr.  Salah’s file and assessed \nhim as a moderate escape risk on the basis of the deportation order. The Warden \naccepted  the new MAI’s assessment and issued a decision denying the transfer request. \nThe Warden told him that he would have to wait to re -apply closer to his day parole \neligibility date.  \n2025 SCC 38 (CanLII)\n\n--- Page 63 ---\n \n [112]  Mr. Salah was reclassified and transferred to minimum -security in \nMay 2024.  \nC. Applications for a Writ of Habeas Corpus  \n[113]  Mr. Dorsey and Mr.  Salah each applied under the Habeas Corpus Act , \nR.S.O. 1990, c.  H.1, for a writ of habeas corpus ad subjiciendum  with certiorari  in aid, \non the basis that the decisions were substantively unreason able and unlawful. They also \nalleged that the denial of their transfer requests engaged ss.  7, 9, 10(c) and 12 of the \nCanadian Charter  of Rights and Freedoms . \n[114]  On consent, the applications were joined for the purpose of determining a \ncommon threshold legal issue: whether Mr.  Dorsey and Mr.  Salah could resort to \nhabeas corpus  to challenge the denials of their applications for transfer to lower \nsecurity prisons.  \nIII. Judicial History  \nA. Ontario Superior Court of Justice, 2022 ONSC 2107, 513 C.R.R. (2d) 90 \n(Speyer  J.) \n[115]  The application judge concluded that habeas corpus  is not available to the \napplicants to challenge the denials of their applications for reclassification to \nminimum -security and their requests for transfers to minimum -security prisons. While \na decision may  be disadvantageous to an inmate, that does not amount to a deprivation \n2025 SCC 38 (CanLII)\n\n--- Page 64 ---\n \n of residual liberty unless it is characterized by a reduction in the prisoner’s liberty. \nHere, there was no such reduction in liberty.  \n[116]  The application judge noted that the question rai sed by the appellants is not \nnovel, as it has been considered by the Ontario Superior Court of Justice numerous \ntimes in the last decade. She found that the preponderance of the jurisprudence during \nthe preceding decade concluded that “a refusal to reclass ify an offender from higher to \nlower security does not amount",
    "token_count": 1000,
    "start_token": 23400,
    "end_token": 24400,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 27,
    "source_file": "2025scc38.txt",
    "text": " in the prisoner’s liberty. \nHere, there was no such reduction in liberty.  \n[116]  The application judge noted that the question rai sed by the appellants is not \nnovel, as it has been considered by the Ontario Superior Court of Justice numerous \ntimes in the last decade. She found that the preponderance of the jurisprudence during \nthe preceding decade concluded that “a refusal to reclass ify an offender from higher to \nlower security does not amount to a deprivation of liberty”  — it is not a deprivation of \nan offender’s residual liberty (para.  35). \nB. Court of Appeal for Ontario, 2023 ONCA 843, 169 O.R. (3d) 417  \n[117]  The Court of Appeal’s decision was split. George  J.A., with \nHarvison  Young  J.A. concurring, dismissed the appeal. Simmons  J.A. dissented; she \nwould have allowed the appeal.  \n(1) Majority Reasons (George  J.A., Harvison  Young  J.A. Concurring)  \n[118]  George  J.A. noted that, while habeas corpus  is avai lable when an inmate \nis deprived of their residual liberty, the appellants’ arguments presumed that they were \nentitled to reclassification to a minimum -security institution. But there is no \n“standalone entitlement to a minimum -security classification” simp ly because the \nCCRA  directs Correctional Service Canada (“CSC”) to take all reasonable steps to \n2025 SCC 38 (CanLII)\n\n--- Page 65 ---\n \n ensure that inmates are placed in the least restrictive environment (para.  40, citing \nR. (L.V.) v. Mountain Institution , 2016 BCCA 467, 346 C.C.C. (3d) 254, at para.  39). \n[119]  George  J.A. concluded that the appellants’ situation did not fall within the \nthird Dumas  category because they had not acquired the status of a minimum -security \nclassification. Had CSC refused to transfer Mr.  Dorsey after reclassifying him, habe as \ncorpus  would have been available (para.  46). He noted that using habeas corpus  for \nthese decisions “would effectively make [it] available to every federal inmate in respect \nof every security classification decision” (para.  43). He saw “nothing to compel  or \nwarrant opening this floodgate” ( ibid.). \n[120]  George  J.A. noted that the Supreme Court’s decision in Mission Institution \nv. Khela , 2014 SCC 24, [2014] 1 S.C.R. 502, “could not be any clearer: the writ of \nhabeas corpus  is available to an inmate only when the ir residual liberty has been \nreduced or, put differently, deprived” (para.  57 (emphasis in original)).  \n(2) Dissenting Reasons (Simmons  J.A.)  \n[121]  Simmons  J.A. concluded that whether an inmate is entitled to resort to \nhabeas corpus  under the third Dumas  category mus t depend on whether they can show \na legitimate ground for concluding that the only basis for withholding a \nminimum -security classification was unlawful such that a minimum -security \nclassification would otherwise have been granted. She explained that, “[i]n  these \ncircumstances, if the reclassification decision is ultimately found to be unlawful, a \n2025 SCC 38 (CanLII)\n\n--- Page 66 ---\n \n continuing deprivation of liberty under the third Dumas  category will have crystallized \nas of the date of the reclassification decision and the finding of unlawful ness will also \ntrigger entitlement to the lower -security classification” (para.  115).  \n[122]  Simmons  J.A. does not read Dumas  as linking unlawfulness to acquiring a \nparticular status. Instead, it is the refusal of lesser restrictive conditions without a lawful \nbasis that crystallizes the deprivation of liberty.  \nIV. Analysis  \n[123]  The appellants submit that the denial of reclassification or transfer to lower \nsecurity is a deprivation of liberty such that it can ground an application for habeas \ncorpus . They submit that this f alls within the third category of Dumas : continuation of \na deprivation of liberty. We disagree. As we explain below, Dumas  established a \nrequirement that the applicant must have a legal entitlement to reclassification and \ntransfer to lower security in orde r to bring an application for habeas corpus  based on \nthe third Dumas category. The law as it stands does not allow for",
    "token_count": 1000,
    "start_token": 24300,
    "end_token": 25300,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 28,
    "source_file": "2025scc38.txt",
    "text": " that it can ground an application for habeas \ncorpus . They submit that this f alls within the third category of Dumas : continuation of \na deprivation of liberty. We disagree. As we explain below, Dumas  established a \nrequirement that the applicant must have a legal entitlement to reclassification and \ntransfer to lower security in orde r to bring an application for habeas corpus  based on \nthe third Dumas category. The law as it stands does not allow for the interpretation \noffered by the majority, particularly regarding the third Dumas  category.  \n[124]  We cannot endorse the majority’s expansion o f the remedy of habeas \ncorpus  in the correctional context. As we explain below, the reach of habeas corpus  \ninto the correctional system strains modern administrative law. Habeas corpus  is an \nextraordinary remedy that should not be used to challenge decisio ns denying transfer \nfrom medium - to minimum -security, unless the applicant has an existing legal \n2025 SCC 38 (CanLII)\n\n--- Page 67 ---\n \n entitlement to that transfer and not simply an “arguable issue”. Such an expansion will \nfurther entangle superior courts into the administration of correctiona l facilities. This \nis not their purview. Habeas corpus is not an unrestricted remedy and its availability \nmust conform to its intended purpose and historical evolution, as we explain below.  \nA. Evolution of Habeas Corpus From the 14th  Century to the 1980s  \n(1) Historical Origins  \n[125]  Habeas corpus , also known as the “Great Writ of Liberty”, was first used \nin the 14th  century “as a device for compelling appearance [of defendants] before the \nKing’s judicial instrumentalities” (W.  F. Duker, A Constitutional History of Habea s \nCorpus  (1980), at pp.  3 and 62). In this first incarnation of the writ, it was used by \ncourts to ensure appearance of the defendant in court. The writ commanded the sheriff \nto locate, arrest, and “to have the body” of the defendant appear in court (p.  24). \n[126]  From the 14th  century onwards, in part due to jurisdictional battles \nbetween various courts in England and growing tension between Parliament and the \nservants of the monarch (i.e., the executive), habeas corpus  “was transformed into an \ninstrument that safeguards individual freedom” (Duker, at p.  62; see also May v. \nFerndale  Institution , 2005 SCC 82, [2005] 3 S.C.R. 809, at para.  19). This new form \nof the writ demonstrated two “critical differences” in procedure from its earlier \niteration: the proceeding was commenced “on the petition of the prisoner” and “it was \nimplicit in the court’s action that it intended to examine the cause of the imprisonment” \n2025 SCC 38 (CanLII)\n\n--- Page 68 ---\n \n (Duker, at p.  24). As a result, the court “assumed a right to i nquire into the nature of an \nincarceration” ( ibid.). As Duker notes:  \nBy the middle of the fourteenth century, the use of habeas corpus  in \nresponse to petitions on behalf of prisoners that they might be presented \nbefore the court was sufficiently common to have become a distinct form \nof habeas corpus : habeas corpus cum causa . . . . The writ ordered the \nsheriff to have the body of the prisoner brought before the court along with \nthe cause of his arrest and detention.  [pp. 24-25] \n[127]  By the 17th  century, the case  law had “confirmed that the writ of habeas \ncorpus  had assumed a new role. .  . . The questioning of the validity of commitments, \npreviously an incidental effect of the writ, now became the major object” (Duker, at \np. 46). \n[128]  The form of habeas corpus  that emerged in the 17th  century is still used \ntoday:  \nThe writ is directed to the .  . . person having custody or control of the \napplicant. It requires that person to return to the court, on the day specified, \nthe body of the applicant and the cause of his  detention.  The process \nfocuses upon the cause returned. If the return discloses a lawful cause, the \nprisoner is remanded; if the cause returned is insufficient or unlawful, the \nprisoner is released. The matter directly at issue is simply",
    "token_count": 1000,
    "start_token": 25200,
    "end_token": 26200,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 29,
    "source_file": "2025scc38.txt",
    "text": "The writ is directed to the .  . . person having custody or control of the \napplicant. It requires that person to return to the court, on the day specified, \nthe body of the applicant and the cause of his  detention.  The process \nfocuses upon the cause returned. If the return discloses a lawful cause, the \nprisoner is remanded; if the cause returned is insufficient or unlawful, the \nprisoner is released. The matter directly at issue is simply the reason given \nby the party who is exercising restraint over the applicant. [Emphasis \nadded.]  \n \n(J. Farbey and R.  J. Sharpe, with S.  Atrill, The Law of Habeas Corpus  \n(3rd ed. 2011), at p.  21, citing Phillip v. D.P.P. , [1992] 1 A.C. 545 (P.C.), \nat p. 558.)  \n2025 SCC 38 (CanLII)\n\n--- Page 69 ---\n \n [129]  In other words, the writ of habeas corpus  developed to focus on assessing \nthe legality of the state’s initial commitment of individuals. Until 1985, courts did not \nuse habeas corpus  to review the legality of decisions of correctional administrators.  \n(2) Emergence of Habeas Co rpus as a Remedy for Inmates and the Current \nTest for Deprivations of Liberty in the Correctional Context  \n[130]  In 1980, our Court decided in Martineau v. Matsqui Institution \nDisciplinary Board , [1980] 1 S.C.R. 602, “that prisoners were entitled to procedural \nfairness and could seek judicial review of decisions by prison officials that deprived \nthem of their ‘ residual liberty ’ (i.e., through placement in segregation)” (D.  Parkes, \n“The ‘Great Writ’ Reinvigorated? Habeas Corpus  in Contemporary Canada” (2012), \n36:1 Man. L.J.  351, at p.  353). In that case, our Court recognized that “[t]he rule of law \nmust run within penitentiary walls” and that decisions of correctional administrators \ncould have “the effect of depriving an individual of his liberty by committing him t o a \n‘prison within a prison’” ( Martineau , at p.  622; see also Parkes, at p.  353).  \n[131]  The introduction of the concept of “residual liberty” created the conditions \nto recognize habeas corpus  in the correctional system, serving as the rationale \nanimating a trilo gy of cases in 1985 in which our Court expanded the scope of habeas \ncorpus  in the correctional context by making it available to challenge not only the \ncommitment to custody but also decisions by those running correctional institutions, \ni.e. administrative  decision makers, where these decisions significantly deprive an \ninmate of the liberty available to the general inmate population: R. v. Miller , [1985] 2 \n2025 SCC 38 (CanLII)\n\n--- Page 70 ---\n \n S.C.R. 613; Cardinal v. Director of Kent Institution , [1985] 2 S.C.R. 643; and Morin \nv. National Speci al Handling Unit Review Committee , [1985] 2 S.C.R. 662.  \n[132]  In Miller , following a disturbance in a correctional facility, an inmate was \ntransferred to another institution and placed in a special handling unit (i.e., \nadministrative segregation). The reason for  his segregation was explained to him as \nstemming from his participation in the disturbance, yet he was never afforded the \nopportunity to confront the evidence of his involvement. This was a case of an inmate \nlawfully incarcerated being placed in a more re strictive form of incarceration.  \n[133]  In Cardinal , inmates were accused of being involved in a hostage -taking \nincident within their correctional facility, prompting criminal charges and transfer to \nanother correctional facility where they were placed in segrega tion. The Director of the \ncorrectional facility declined to conduct an independent inquiry, relying instead on the \nopinion of a fellow warden. The inmates secured an order from the Segregation Review \nBoard recommending that they be released from segregatio n into the general prison \npopulation, but the Director refused to comply. He did not inform the inmates of his \nreasons for refusal, nor did he give them an opportunity to be heard. They challenged \ntheir continued placement in segregation by applications fo r habeas corpus . In all three \ncases, the “actions involved deprivations",
    "token_count": 1000,
    "start_token": 26100,
    "end_token": 27100,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 30,
    "source_file": "2025scc38.txt",
    "text": " on the \nopinion of a fellow warden. The inmates secured an order from the Segregation Review \nBoard recommending that they be released from segregatio n into the general prison \npopulation, but the Director refused to comply. He did not inform the inmates of his \nreasons for refusal, nor did he give them an opportunity to be heard. They challenged \ntheir continued placement in segregation by applications fo r habeas corpus . In all three \ncases, the “actions involved deprivations of the prisoners’ residual liberty interests” as \nthe severity of the initial, lawful, incarceration was increased or continued (Parkes, at \np. 354).  \n2025 SCC 38 (CanLII)\n\n--- Page 71 ---\n \n [134]  In Morin , the inmate was placed in a  special handling unit at a different \ninstitution than the one where he was normally housed after he was charged with the \ndeath of a fellow inmate. He went on to be acquitted of murder but remained in \nsegregation and his request to be transferred back to a  medium -security institution was \nrefused. He challenged his continued placement in segregation by way of habeas \ncorpus . \n[135]  A year later, Lamer  J. (as he then was) brought together these strands of \nemerging case law to develop a framework to govern the applica tion of habeas corpus \nin a correctional setting in Dumas . He described three deprivations of liberty that arise \nin the correctional setting at p.  464: \n. . . the lower courts erred in holding that habeas corpus  was available \nto attack only the initial warra nt of committal. Habeas corpus  is available \nto challenge an unlawful deprivation of liberty. In the context of \ncorrectional law, there are three different deprivations of liberty: the initial \ndeprivation of liberty, a substantial change in conditions amoun ting to a \nfurther deprivation of liberty, and a continuation of the deprivation of \nliberty.  [Emphasis added.]  \n[136]  It is from this perspective that we must address this appeal.  \n(3) Post-Dumas  Jurisprudential Developments  \n[137]  Subsequent treatments of habeas corpus  in the correctional context came \n20 years later, in May and Khela . \n2025 SCC 38 (CanLII)\n\n--- Page 72 ---\n \n [138]  In May, our Court affirmed concurrent jurisdiction of provincial superior \ncourts and the Federal Court over the decisions of federal correctional administrators. \nWriting for the majority, LeBel and Fish  JJ. concluded that provincial superior courts \ncould hear habeas corpus applications in the correctional context, concurrent with the \navailability of judicial review in the Federal Court, as the internal review procedures \nwhich constitute par t of the legislative scheme were not as broad as habeas corpus and \nless advantageous (paras.  63-65 and 72).  \n[139]  In Khela , our Court reviewed an inmate’s transfer to maximum -security \nfrom medium -security and found that it was unlawful on the basis of lack of pr ocedural \nfairness. In reaching this conclusion, LeBel  J., writing for the Court, stated that such a \ndecision must be procedurally fair to be lawful; the failure by the correctional \nauthorities to meet statutory disclosure requirements therefore rendered th e inmate’s \ntransfer unlawful and he had been properly granted habeas corpus . \nB. Habeas Corpus Does Not  Extend to Administrative Correctional Decisions \nWhich Deny an Inmate’s Transfer or Reclassification Request to a Lower \nSecurity Classification  \n(1) Dumas  Remains  the Precedent To Determine Whether a Deprivation of \nResidual Liberty Exists  \n[140]  As noted, this appeal concerns the application of the common law habeas \ncorpus  test in a correctional setting, specifically whether a federal inmate’s denial of \n2025 SCC 38 (CanLII)\n\n--- Page 73 ---\n \n reclassification o r transfer to a lower security classification constitutes a deprivation of \nresidual liberty. Do these constitute a deprivation of residual liberty?  \n[141]  Dumas remains the leading authority as to this question. As noted, Lamer  J. \nrecognized three categories for a deprivation of liberty: (1) the initial decision requiring \ndetention, (2) a change in the conditions of detention, and (3) the continuation of \ndetention  once it has become unlawful. The third category is at issue in the instant case, \nas it was in Dumas . \n[142]  Under the Dumas  test, an inmate who is already lawfully detained must \nfirst demonstrate that there has been a deprivation of",
    "token_count": 1000,
    "start_token": 27000,
    "end_token": 28000,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 31,
    "source_file": "2025scc38.txt",
    "text": ". \nrecognized three categories for a deprivation of liberty: (1) the initial decision requiring \ndetention, (2) a change in the conditions of detention, and (3) the continuation of \ndetention  once it has become unlawful. The third category is at issue in the instant case, \nas it was in Dumas . \n[142]  Under the Dumas  test, an inmate who is already lawfully detained must \nfirst demonstrate that there has been a deprivation of their residual liberty  — some thing \nbeyond the original, lawful incarceration  — and must draw on one of the three Dumas \ncategories as a recognized basis to challenge the legality of this deprivation. If this \ninitial burden is met, the onus then shifts to the detaining authority to just ify the legality \nof the deprivation on the inmate’s liberty. Should the detaining authority fail to meet \nits burden, the court must  release the inmate from the conditions that constitute the \ndeprivation of liberty; the court cannot do anything different th an to give effect to the \ntransfer; in this respect, habeas corpus  is a non -discretionary remedy. To say otherwise \nwould be an over -extension and distortion of habeas corpus . \n[143]  In brief, the analysis on a habeas corpus  application proceeds in three \nstages. At  stage one, the applicant must establish a deprivation of liberty. At stage two, \nthe application must establish a legitimate ground to question the lawfulness of the \n2025 SCC 38 (CanLII)\n\n--- Page 74 ---\n \n deprivation of liberty. If the applicant meets their burden at stages one and two, then at  \nstage three, the detaining authority must establish the deprivation was lawful.  \n[144]  Not only does Dumas  remain the leading authority for determining whether \nthere is a deprivation of residual liberty in a correctional context, but both its reasoning \nand factu al matrix are directly applicable in the present case.  \n[145]  In Dumas , Lamer  J. clarified that although the facts there involved parole, \nhis reasoning was not confined to that. He emphasized that the deprivation of liberty \ncrystallizes at the moment one’s legal status changes  — such as when parole is granted \nor a reclassification decision is to take effect. Lamer  J. wrote, at pp.  464-65: \nThe continuation of an initially valid deprivation of liberty can be \nchallenged by way of habeas corpus  only if it becomes unlawful. In the \ncontext of parole, the continued detention of an inmate will only become \nunlawful if he has acquired the status of a parolee.  An inmate acquires that \nstatus as of the moment the decision to grant him parole takes effect . Thus, \nif parole is granted effective immediately, he becomes a parolee when the \ndecision is rendered. If, for some reason, the restriction to his liberty \ncontinues, he may then have access to habeas corpus . If parole is granted \neffective at some later da te, then the inmate acquires the status of parolee \nat that date and not at the date of the decision. Similarly, where a decision \nis made to grant parole but it is subject to the fulfilment of a condition, the \ninmate only becomes a parolee if and when the c ondition is fulfilled. If he \nis not released on parole when the term arrives or the condition is fulfilled, \nthen he may resort to habeas corpus . Finally, if parole is refused, it is \nobvious that the inmate has not become a parolee and he cannot have \nrecour se to habeas corpus  to challenge the decision.  [Emphasis added.]  \n[146]  The majority writes that the conclusion in Dumas  denying access to habeas \ncorpus  was based on Mr.  Dumas’ failure to raise a legitimate ground for challenging \n2025 SCC 38 (CanLII)\n\n--- Page 75 ---\n \n the legality of his deprivation o f liberty, and not on his entitlement to parole (see \npara.  65). This interpretation of Dumas  is to the opposite of this Court’s clear wording. \nIndeed, the majority’s interpretation rests on the Court’s discussion in Dumas , at p.  465, \nthat “a detainee is [n ot] left without recourse in an appropriate case”. The majority \ninterprets this discussion as pertaining to whether Mr.  Dumas raised a legitimate \nground for challenging the legality of a deprivation of liberty on a habeas corpus  \napplication. This is not th e case. In writing what it did, the Court was referring to \nalternative pathways for recourse, which are unrelated to Mr.  Dumas’ application for \nhabeas corpus",
    "token_count": 1000,
    "start_token": 27900,
    "end_token": 28900,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 32,
    "source_file": "2025scc38.txt",
    "text": "465, \nthat “a detainee is [n ot] left without recourse in an appropriate case”. The majority \ninterprets this discussion as pertaining to whether Mr.  Dumas raised a legitimate \nground for challenging the legality of a deprivation of liberty on a habeas corpus  \napplication. This is not th e case. In writing what it did, the Court was referring to \nalternative pathways for recourse, which are unrelated to Mr.  Dumas’ application for \nhabeas corpus . The Court stated that, apart from his application for habeas corpus , \nMr. Dumas may have had recou rse to challenge the National Parole Board’s \njurisdiction to “review its earlier decision” or the way it conducted this review on the \nbasis that it “may have infringed the rules of natural justice” or his Charter  rights \n(p. 465). As the Court explained in Dumas , “[t]hese issues are not before the Court on \nan application for habeas corpus , but could be raised on an application under s.  18 of \nthe Federal Court Act , R.S.C. 1970 (2nd Supp.), c.  10, or s.  24(1) of the Charter ” \n(p. 465).  \n[147]  The Court’s sole basis fo r denying Mr.  Dumas’ access to habeas corpus  \nwas because he was not legally entitled to the status of parolee. The Court did not deny \nhim access to habeas corpus  because he failed to raise a legitimate ground to challenge \nhis deprivation of liberty. The Co urt repeated several times that the status of a \nparolee  — in other words, entitlement to the less restrictive form of liberty  — is a \n2025 SCC 38 (CanLII)\n\n--- Page 76 ---\n \n prerequisite to establishing an unlawful deprivation of liberty under the third category \nof Dumas  (see pp.  464-65). \n[148]  The maj ority’s reliance on Cardinal  for the proposition that an applicant \nneed not demonstrate a legal entitlement to an increased residual liberty is also \nmisplaced. In Cardinal , the Director exercised his authority under s.  40 of the \nPenitentiary Service Regula tions , C.R.C. 1978, c.  1251, to continue certain inmates’ \nsegregation, contrary to the recommendation of the review board. In doing so, he failed \nto give notice to the inmates or provide them an opportunity to be heard. On the appeal \nof the inmates’ applic ations for habeas corpus , this Court held the Director’s decision \nto be unlawful as procedurally unfair.  \n[149]  The majority reasons that the inmates did not have a “crystallized” legal \nentitlement to transfer into the general population because, had the Director  observed \nthe duty of fairness, his decision “could have been found to have been lawful” \n(para.  66). \n[150]  However, as Le  Dain  J. explained in Cardinal , “the denial of a right to a \nfair hearing must always render a decision invalid” (p.  661). Because the Directo r \ndenied the inmates a fair hearing, his decision under the Penitentiary Service \nRegulations  to keep them segregated was invalid. As a result, at the time of their \napplications for habeas corpus , the applicants’ continued segregation rested on an \ninvalid d ecision. In other words, as there was no lawful basis for their segregation, the \napplicants had a “crystallized” legal entitlement to less restrictive confinement.  \n2025 SCC 38 (CanLII)\n\n--- Page 77 ---\n \n [151]  The Attorney General of Quebec submits that habeas corpus  is not a means \nto guarantee a libe rty that an incarcerated person has yet to acquire; rather it serves as \na remedy against an unlawful restraint on a residual, existing liberty (I.F., at para.  22). \nWe agree.  \n[152]  At the moment an inmate’s legal entitlement to an altered, less severe \nresidual li berty vests, so too does their right to resort to habeas corpus , where \ncorrectional administrators do not give effect to that legal entitlement. This principle is \napplicable to the present cases; applying the reasoning of Dumas leads to the conclusion \nthat habeas corpus  is only available to a federal inmate where they have been granted \na reclassification or a transfer to a lower security facility but they have not yet been \ntransferred (see C.A. reasons, at para.  44). \n(2) Facts and Holding of Dumas Are Analogous  to the Instant Case  \n",
    "token_count": 1000,
    "start_token": 28800,
    "end_token": 29800,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 33,
    "source_file": "2025scc38.txt",
    "text": " give effect to that legal entitlement. This principle is \napplicable to the present cases; applying the reasoning of Dumas leads to the conclusion \nthat habeas corpus  is only available to a federal inmate where they have been granted \na reclassification or a transfer to a lower security facility but they have not yet been \ntransferred (see C.A. reasons, at para.  44). \n(2) Facts and Holding of Dumas Are Analogous  to the Instant Case  \n[153]  In Dumas , the decision to grant parole was conditional on the inmate’s \nacceptance by a community centre program; because that condition had yet to be \nfulfilled, although with no fault on his part, the applicant never acquired the statu s of a \nparolee. As such, he did not have a legal entitlement to parole and his residual liberty \nremain unchanged. As a result, habeas corpus  was not available to him:  \nThe [National Parole Board] made a decision to grant him day parole, but \nthe terms used a re not precise and there is some uncertainty as to whether \nhis day parole was simply delayed until appropriate arrangements could be \nmade or whether it was conditional on his acceptance by the Centre. \nHowever, the [National Parole Board] subsequently delay ed and later \n2025 SCC 38 (CanLII)\n\n--- Page 78 ---\n \n reversed this decision before the term arrived or the prerequisite condition \nwas fulfilled. It is clear that the appellant never became a parolee, and he \nthus has no right to a habeas corpus . [Emphasis added; p.  465.]  \n[154]  Applying the analysis from Dumas  to the instant case, we must first ask \nwhether the appellants had a legal entitlement to reclassification and/or transfer to \nlower security. The answer is no, they did not.  \n[155]  This is contrary to submissions from the appellant s, who argue that the \nlanguage in the CCRA  which directs CSC to use the “least restrictive measures \nconsistent with the protection of society, staff members and offenders” gives federal \ninmates a legal entitlement to access the “least restrictive measures”  (CCRA , s. 4(c); \nsee also A.F., at para.  31). We agree with the Attorney General of Canada that this \nlanguage must be read in its entirety and in the legislative scheme’s broader context \n(R.F., at para.  77). \n[156]  Section 28 of the CCRA  provides that, in placing  inmates in the least \nrestrictive environment, consideration is to be given to, inter alia , the kind of custody \nand control necessary for the safety of the inmate and of other people within the prison \n(R.F., at para.  76, citing CCRA , s. 28). The CCRA  does not create a statutory \nentitlement to the least restrictive confinement divorced from these considerations. \nInstead, it mandates the CSC to place each inmate in the least restrictive placement \nhaving regard to the various factors set out in the statute. Lo wer security classifications \nare available to federal inmates as a result  of CSC’s assessment; they have no \nentitlement to them absent this.  \n2025 SCC 38 (CanLII)\n\n--- Page 79 ---\n \n C. Habeas Corpus Should Not Extend to Administrative Correctional Decisions \nWhich Deny an Inmate’s Transfer or Reclass ification Request to a Lower \nSecurity Classification  \n[157]  Habeas corpus  is an extraordinary remedy available to those who are held \nin unlawful detention by agents of the state. The writ’s expansive evolution from its \ninception to the modern day has led courts, including our own, to conclude that habeas \ncorpus  has never been “a static, narrow, formalistic remedy” ( Khela , at para.  54, \nquoting May, at para.  21). We agree with the majority (at para.  1) that, since its \ninception, habeas corpus  “has grown to achieve i ts grand purpose  — the protection of \nindividuals against erosion of their right to be free from wrongful restraints upon their \nliberty” ( May, at para.  21, quoting Jones v. Cunningham , 371 U.S. 236 (1962), at \np. 243).  \n[158]  In relation to inmates, the remedy shou ld continue to be limited to \nchallenge further deprivations of liberty within a prison, notably an inmate’s unlawful \ntransfer to a higher security facility or a more restrictive condition of imprisonment, \ne.g. administrative segregation. The appellants see k to transform habeas corpus  into a \ngeneralized alternative to the existing scheme",
    "token_count": 1000,
    "start_token": 29700,
    "end_token": 30700,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 34,
    "source_file": "2025scc38.txt",
    "text": " Cunningham , 371 U.S. 236 (1962), at \np. 243).  \n[158]  In relation to inmates, the remedy shou ld continue to be limited to \nchallenge further deprivations of liberty within a prison, notably an inmate’s unlawful \ntransfer to a higher security facility or a more restrictive condition of imprisonment, \ne.g. administrative segregation. The appellants see k to transform habeas corpus  into a \ngeneralized alternative to the existing scheme of internal review and judicial review of \ndecisions by administrative decision makers in correctional facilities. That would go \nwell beyond the proper use of habeas corpus . \n[159]  As we will explain, its expansion to reviewing decisions which do not alter \nan inmate’s residual liberty nor impose a greater deprivation of liberty is unwarranted; \n2025 SCC 38 (CanLII)\n\n--- Page 80 ---\n \n it interferes with Parliament’s scheme for the operation of correctional institutions; and \nit sidesteps the administrative law framework adopted in Vavilov . \n[160]  In our view, habeas corpus is not an unrestricted remedy to challenge an \never-widening range of conditions of incarceration; post -Dumas case law does not \nchange that. While habeas corpus  continues to be a flexible remedy, its use within \nprisons needs to be carefully constrained. As an extraordinary remedy, its remit needs \nto be tailored to its purpose (see Peiroo v. Canada (Minister of Employment and \nImmigration)  (1989), 69 O.R. (2d) 253 (C.A .), at pp.  257 and 261 -62). It is a procedure \nwell suited to remedy unlawful deprivations of liberty, but ill suited as a substitute for \ninternal review and judicial review of the operation of correctional institutions. The use \nof habeas corpus  overrides t he deference given to administrative decision makers under \nthe general law of judicial review. Our Court should be mindful of the concerns raised \nby the Attorney General of Canada and by the provinces about expanding habeas \ncorpus , as we will now explain.  \n(1) Habeas Corpus  Is Not an Unrestricted Remedy To Challenge \nEver -Widening Conditions of Incarceration; A Superior Court’s Use of the \nRemedy Is Restricted by its Purpose  \n[161]  If an application for habeas corpus is successful, the reviewing court will \ngrant habeas c orpus  (Canada (Public Safety and Emergency Preparedness) v. Chhina , \n2019 SCC 29, [2019] 2 S.C.R. 467,  at para.  18; May, at para.  33). As a remedy, it has \nbeen referred to by our Court as “broad” and has been interpreted expansively as it is \nnot “a static, narrow, formalistic remedy” ( Chhina , at para.  21; May, at para.  21, \n2025 SCC 38 (CanLII)\n\n--- Page 81 ---\n \n quoting Jones v. Cunningham , 371 U.S. 236 (1962), at p.  243; see also  Chhina , at \npara.  19). \n[162]  This we accept. But the fact that habeas corpus has been interpreted \n“broadly” is not licence to “broaden” its application beyond its purpose. Habeas corpus \ncannot be used to challenge a deprivation of an anticipated  right to residual liberty, one \nthat has yet to occur. In May, LeBel and Fish  JJ. cautio ned that “jurisprudential \ndevelopments limiting habeas corpus jurisdiction should be carefully evaluated and \nshould not be allowed to expand unchecked” (para.  50). That would be so if superior \ncourts get into the business of deciding challenges to administ rative decisions, those \nbeing matters that are properly in the purview of the Federal Court.  \n[163]  Were we to find the opposite  — as the majority does  — that would give \nrise to a reprioritization of access to the courts. Because of the seriousness of an \nunlawful  deprivation of liberty, habeas corpus  applications are heard swiftly; they \nplace the onus on the state to prove that the deprivation of liberty is lawful. As such, \nexpanding the availability of habeas corpus  to denials of transfer to lower security \nlevels  will convert habeas corpus into a summary form of reverse onus judicial review \nfor the security reclassification process. Such an approach risks distorting habeas \ncorpus  into an alternative venue to challenge decisions of correctional administrators, \n",
    "token_count": 1000,
    "start_token": 30600,
    "end_token": 31600,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 35,
    "source_file": "2025scc38.txt",
    "text": " habeas corpus  applications are heard swiftly; they \nplace the onus on the state to prove that the deprivation of liberty is lawful. As such, \nexpanding the availability of habeas corpus  to denials of transfer to lower security \nlevels  will convert habeas corpus into a summary form of reverse onus judicial review \nfor the security reclassification process. Such an approach risks distorting habeas \ncorpus  into an alternative venue to challenge decisions of correctional administrators, \nunde rmining both the integrity of the writ and the orderly administration of the \ncorrectional system.  \n2025 SCC 38 (CanLII)\n\n--- Page 82 ---\n \n [164]  The practical consequence of this expansion and, a fortiori , its subsequent \nextension to a widening range of decisions said to relate to “residual liberty”, w ill be \nunwarranted interference by superior courts with Parliament’s legislative scheme, \nwhich balances both the interests of the inmates and others. These interests include the \nsafety of correctional officials (e.g., measures to ensure the safety of corre ctional \nofficials are more extensive in maximum -security facilities than in medium -security \nfacilities) as well as the public (e.g., it is relatively easy for an inmate to escape from a \nminimum -security facility). The CCRA  provides various avenues for redr ess that \nconstitute, in Parliament’s view, a suitable remedial structure. Accepting the majority’s \ninterpretation risks upsetting the balance the CCRA  strikes in the mechanisms it \nprovides by granting an alternative, fast -track judicial review in the form of habeas \ncorpus proceedings.  \n(a) The First Stage of the Habeas Corpus Analysis Requires a True \nDeprivation of Liberty  \n[165]  The majority’s approach will improperly expand access to habeas corpus  \nand invite ad hoc  decision making. It does so, first, because it remov es the requirement \nthat an applicant alleging unlawful continued detention demonstrate an existing legal \nentitlement to greater residual liberty. Under this approach, an inmate whose conditions \nof incarceration have not changed, who has no legal entitlemen t to a change in those \nconditions, and whose detention continues on the same legal authority as their initial \ndeprivation, would be considered to have suffered a deprivation of liberty. They would \ndo so merely by demonstrating that some other state of conf inement would be \n2025 SCC 38 (CanLII)\n\n--- Page 83 ---\n \n qualitatively less restrictive than their current state (majority reasons, at paras.  41 and \n43-44). \n[166]  Second, the majority’s approach will expand access to habeas corpus  and \ninvite ad hoc  decision making because its approach to the second st age of the habeas \ncorpus  analysis will not realistically filter out frivolous claims. The majority’s \napproach provides no guidance on how this second stage should be applied, other than \naffirming that the threshold is low. We return to this point later in our reasons.  \n[167]  The distortion of habeas corpus is exacerbated by the majority’s limited \nguidance as to what alternative state of confinement will amount to a deprivation of \nliberty sufficient to engage the writ. In setting out a legal framework for the third  \nDumas  category, the majority explains only that a deprivation of liberty requires a \n“qualitative difference in liberty” (para.  44; see also paras.  41, 51 and 62). Qualitative \nsimply means that the court will look at whether the difference has an effect on  the \ninmate’s liberty interests (see R. v. Gamble , [1988] 2 S.C.R. 595, at p.  644). This \napproach does not establish a threshold for the relevant degree of that effect. In other \nwords, this framework lacks a standard by which to determine that an effect on  an \ninmate falls short of establishing a deprivation of liberty (majority reasons, at \nparas.  40-44). \n[168]  Then, in applying its framework, the majority indicates that, if there is such \na standard, it is a low and indeterminate one. Its reasons suggest that a de privation of \nliberty is made out by conditions that are simply “more restrictive” or that result in \n2025 SCC 38 (CanLII)\n\n--- Page 84 ---\n \n limitations that are more than “insignificant or trivial”, but that will in any case be \n“ultimately context -dependent” (para.  71). Further still, to the ext ent it is suggested that \ncase law applying the second Dumas  category of deprivations of liberty can be",
    "token_count": 1000,
    "start_token": 31500,
    "end_token": 32500,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 36,
    "source_file": "2025scc38.txt",
    "text": " of \nliberty is made out by conditions that are simply “more restrictive” or that result in \n2025 SCC 38 (CanLII)\n\n--- Page 84 ---\n \n limitations that are more than “insignificant or trivial”, but that will in any case be \n“ultimately context -dependent” (para.  71). Further still, to the ext ent it is suggested that \ncase law applying the second Dumas  category of deprivations of liberty can be readily \napplied to the third Dumas  category, which is at issue here, this does not address that \nthose cases interpret the inherent limitation of the seco nd category. Namely, the second \ncategory deals with decisions resulting in “a substantial  change” in the inmate’s \nconditions ( Dumas , at p.  464 (emphasis added)). The third category contains no such \nqualifying language, and the majority has not recognized o r introduced this necessary \nlimitation. Instead, the majority has dismissed  the requirement the applicant \ndemonstrate existing legal entitlement to greater liberty.  \n[169]  This unclear standard opens the door to results -based and unmethodical \ndecision making. A c learer standard is required to ensure that denying an inmate’s \nrequest for any more -than-trivial easing in their conditions of detention is not treated \nas a deprivation of their liberty.  \n[170]  The majority points to post -Miller  decisions that found certain carce ral \nconditions do not amount to deprivations of liberty as proof that there is no risk of an \nunrestrained expansion of habeas corpus  (para.  54). With respect, this misses the point: \nour concern is not with the state of the law hitherto, based as it has bee n on the \nreasoning in Dumas , but with the implications of the majority’s new and unmoored \napproach. Indeed, the cases cited by the majority highlight our very concern. In Mapara \nv. Ferndale Institution (Warden) , 2012 BCCA 127 , 318 B.C.A.C. 139, the appella nts \n2025 SCC 38 (CanLII)\n\n--- Page 85 ---\n \n had unsuccessfully brought a writ of habeas corpus  alleging the denial of their requests \nfor escorted temporary absences amounted to deprivations of liberty. The Court of \nAppeal rejected this argument on the basis that “a decision that denies an inmate access \nto less restrictive conditions does not consti tute such a deprivation” (para.  16). Yet, the \nmajority has now decided precisely the opposite. Similarly, in Lord v. Coulter , 2007 \nBCSC 1758, 72 Admin. L.R. (4th) 264, the court stated that the denial of a request for \nparole was not a deprivation of libert y, because the inmate “is not seeking to have that \nwhich was taken away from him restored, but is, rather, seeking the conferral of a new \nright or privilege” (para.  42). And in Ewanchuk v. Canada (Attorney General) , 2017 \nABQB 237, 354 C.C.C. (3d) 119, the court stated that “ [h]abeas corpus has no \napplication where a person complains they were denied release or a reduced form of \ndetention ” (para.  24). Again, the majority’s approach takes the contrary view.  \n[171]  Further, the majority, asserting that its approach w ill not improperly \nexpand the scope of carceral conditions that constitute deprivations of liberty, cites \nMapara , Lord , and Rain v. Canada (Parole Board) , 2015 ABQB 639, as examples \nwhere courts have held that lack of access to rehabilitative programming d oes not \nconstitute a deprivation of liberty. However, the majority also  suggests that a “lesser \ndegree of access to rehabilitative opportunities” is now part of the context for \ndetermining that a denial of security reclassification is a deprivation of libe rty \n(para.  72). These cases might well have been decided differently if they had been \nconsidered in light of the majority’s reasons.  \n2025 SCC 38 (CanLII)\n\n--- Page 86 ---\n \n [172]  Since inmates with no legal entitlement to increased residual liberty will \nnow be able to avail themselves of the remedy, t his will result in an increase in the \nnumber of habeas corpus  applications. Indeed, the majority has transformed this first \nstage in a way that makes it drastically easier to demonstrate a deprivation of liberty, \ndespite recognizing its role in “filter[ing ]",
    "token_count": 1000,
    "start_token": 32400,
    "end_token": 33400,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 37,
    "source_file": "2025scc38.txt",
    "text": " reasons.  \n2025 SCC 38 (CanLII)\n\n--- Page 86 ---\n \n [172]  Since inmates with no legal entitlement to increased residual liberty will \nnow be able to avail themselves of the remedy, t his will result in an increase in the \nnumber of habeas corpus  applications. Indeed, the majority has transformed this first \nstage in a way that makes it drastically easier to demonstrate a deprivation of liberty, \ndespite recognizing its role in “filter[ing ] out frivolous claims” (para.  44). \n[173]  An example supporting our assertion is the effect of our decision in Khela  \non Alberta courts. The Khela  decision led to “an unusual, if not unprecedented, increase \nin habeas corpus  applications” from inmates ( Latham v. H er Majesty the Queen , 2018 \nABQB 69, 72 Alta. L.R. (6th) 357 , at para.  1). Many of these applications had no merit \nor were brought for illegitimate, alternative purposes rather than to obtain release. To \naddress this surge of applications, the Alberta Court  of Queen’s Bench resorted to adopt \nan Accelerated Habeas Corpus  Review Procedure (paras.  2-13). As such, and bearing \nin mind the more limited scope of the Khela  decision compared to the majority’s \npresent ruling, this latter will lead to a similar surge i n habeas corpus applications filed \nin courts across Canada.  \n[174]  The majority’s approach thereby risks undermining one of the defining \nfeatures of habeas corpus , namely, that it is an expeditious  remedy because “[t]he \nimportance of the interests at stake milita tes in favour of a quick resolution of the \nissues” ( May, at para.  69; see also Khela , at para.  61). The first risk is practical: courts \nhave limited capacity, and applicants who are unlawfully deprived of their liberty may \nface delays in obtaining relief w hile the courts address habeas corpus  applications that \n2025 SCC 38 (CanLII)\n\n--- Page 87 ---\n \n do not involve genuine deprivations of liberty and that raise matters better left to \ncorrectional administrators. The second risk is normative: lowering the threshold for \nwhat constitutes a deprivatio n of liberty diminishes the importance of the interest at \nstake and, in turn, weakens the imperative of prompt resolution of habeas corpus \napplications.  \n[175]  The majority reasons warrant an additional comment. Habeas corpus is not \na tool by which to address sys temic issues. The majority partly anchors its justification \nfor broadening habeas  corpus in the need to address the issue of “over -classification” \nof inmates from certain marginalized groups in the current administrative carceral \nsystem. However, the purpo se of habeas  corpus  is to protect “individuals against \nerosion of their right to be free from wrongful restraints upon their liberty” ( May, at \npara.  21, quoting Jones , at p.  243). The writ of habeas corpus  is therefore focused on \nthe individual claim of unlawful detention. The majority undertakes a perilous \nendeavour in expanding its scope to tackle the larger issue of over -classification, \nespecially without delving into the complex roots of that issue.  \n(b) The Second Stage in the Habeas Corpus Analysis Must Be Strengthened \nand Explained if It Is To Filter Out Frivolous Claims  \n[176]  The majority claims  that the expanded scope of habeas corpus  it proposes \nwill not open the floodgates  because courts are able to decline to hear a case on its \nmerits if the applicant fails to raise a legitimate ground at the second stage of the \nanalysis. With respect, we disagree.  \n2025 SCC 38 (CanLII)\n\n--- Page 88 ---\n \n [177]  The majority fails to capture the procedural environment in which habeas \ncorpus applications are presented. As we set out above, because a person’s liberty is \npotentially at stake, courts deal with habeas corpus  applications expeditiously (see, \ne.g., Habeas Corpus Act , s. 1(2); Code of Civil Procedure , CQLR, c.  C-25.01, s.  399). \nIn the past, the application for a w rit of habeas corpus entailed a two -stage process \nwhereby the judge to whom the application was presented would determine whether a \nlegitimate ground for the complaint exists and, then, if so, the writ would issue and the \nmerits would be determined on the return of the writ (",
    "token_count": 1000,
    "start_token": 33300,
    "end_token": 34300,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 38,
    "source_file": "2025scc38.txt",
    "text": " 1(2); Code of Civil Procedure , CQLR, c.  C-25.01, s.  399). \nIn the past, the application for a w rit of habeas corpus entailed a two -stage process \nwhereby the judge to whom the application was presented would determine whether a \nlegitimate ground for the complaint exists and, then, if so, the writ would issue and the \nmerits would be determined on the return of the writ ( R. v. Olson , [1989] 1 S.C.R. 296). \nHowever, it “is now almost inevitably the case that the hearing of the application for \nthe writ becomes the substantive hearing” (Farbey and Sharpe, at p.  235; R.  E. Salhany, \nCanadian Criminal Procedur e (6th ed. (loose -leaf)), at § 10:5) . \n[178]  Under these circumstances, it is doubtful that courts will consider a habeas \ncorpus  application like the present one frivolous, given that, in light of the majority’s \nruling, inmates will easily demonstrate a deprivati on of liberty.  \n[179]  Nor will the second stage of the habeas corpus analysis prevent the misuse \nof the writ that the majority reasons invite, since, according to the majority, an applicant \nneed only “identify an arguable issue and present a sound legal basis” (p ara. 74). The \nmajority does not explain what this standard means or how to apply it. Indeed, the \njurisprudence  — which largely addresses the second Dumas  category or the third \nDumas  category as we interpret it (i.e., requiring an existing legal entitlement  to greater \nliberty)  — suggests that this is a low threshold. It demands no more than “cause to \n2025 SCC 38 (CanLII)\n\n--- Page 89 ---\n \n doubt” the legality of the detention ( May, at para.  71) or “ some basis  for concluding \nthat the detention is unlawful” ( Khela , at para.  41 (emphasis added)).  \n[180]  A deprivation may be unlawful due to procedural unfairness, as was the \ncase in Cardinal  and Khela , or where the decision maker lacks the jurisdictional \nauthority to order the detention, as was the case in Dumas . The majority even suggests \nan applicant can est ablish the decision was unlawful if it lacks an evidentiary \nfoundation or is arbitrary or unreasonable (majority reasons, at para.  45, citing Khela , \nat para.  67). If all an inmate must do at stage two is to rely on one of these “sound legal \nbas[es] ” and “i dentify an arguable  issue” or “some basis” that the detention is unlawful, \na court is unlikely to readily dismiss an application rather than hearing it on its merits \n(majority reasons, at paras.  46-47, 74 and 76 -77 (emphasis added) ). As a practical \nmatter,  the corrections authorities will be required to justify to the court any refusal of \na lower security reclassification.  \n[181]  Moreover, because the majority does not undertake the analysis of the \nsecond stage in the instant case, its reasons provide no guidance or demonstration on \nhow to weed out frivolous claims at this stage. Instead, given the majority’s directions, \nincluding as to the danger of “over -classification”, courts may well be more likely to \ndecide the case on its merits.  \n[182]  As such, the second stage of the analysis will not effectively prevent a flood \nof applications being heard by the courts.  \n2025 SCC 38 (CanLII)\n\n--- Page 90 ---\n \n (2) Reasonableness Review Should Remain the Exclusive Purview of the \nFederal Court  \n[183]  Reasonableness review of administrative correctional decisions should \nremain the exclusive purview of the Federal Court as provided for by Parliament. This \nis so for several reasons.  \n[184]  First, the familiarity of the Federal Court with such review in the operation \nof correctional facilities enables proper deference to be given to decisions  by \ncorrectional administrators. It must be borne in mind that habeas corpus as a remedy \nis narrow. It does not extend to reweighing the numerous quantitative and qualitative \nfactors involved in security classifications. Habeas corpus  is a very blunt instrument \nand its focus is singular: whether the deprivation of liberty is lawful. Deference is owed \nto the decisions of correctional administrators because, inter alia , they better \nunderstand the penitentiary culture and inmate",
    "token_count": 1000,
    "start_token": 34200,
    "end_token": 35200,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 39,
    "source_file": "2025scc38.txt",
    "text": " \ncorrectional administrators. It must be borne in mind that habeas corpus as a remedy \nis narrow. It does not extend to reweighing the numerous quantitative and qualitative \nfactors involved in security classifications. Habeas corpus  is a very blunt instrument \nand its focus is singular: whether the deprivation of liberty is lawful. Deference is owed \nto the decisions of correctional administrators because, inter alia , they better \nunderstand the penitentiary culture and inmate behaviour  that underlies classification \ndecisions. This understanding derived from experience was acknowledged by LeBel  J. \nin Khela , at para.  76: \nLike the decision at issue in Lake , a transfer decision requires a \n“fact -driven inquiry involving the weighing of vario us factors and \npossessing a ‘negligible legal dimension’” ( Lake v. Canada (Minister of \nJustice) , 2008 SCC 23, [2008] 1 S.C.R. 761, at paras.  38 and 41). The \nstatute outlines a number of factors to which a warden must adhere when \ntransferring an inmate: the  inmate must be placed in the least restrictive \nenvironment that will still assure the safety of the public, penitentiary staff \nand other inmates, should have access to his or her home community, and \nshould be transferred to a compatible cultural and lingu istic environment \n(s. 28 CCRA ). Determining whether an inmate poses a threat to the security \nof the penitentiary or of the individuals who live and work in it requires \nintimate knowledge of that penitentiary’s culture and of the behaviour of \n2025 SCC 38 (CanLII)\n\n--- Page 91 ---\n \n the individual s inside its walls. Wardens and the Commissioner possess \nthis knowledge, and related practical experience, to a greater degree than a \nprovincial superior court judge.  [Emphasis added.]  \n[185]  While we endorse LeBel  J.’s comments that correctional administrators a re \nvested with particularized knowledge to a “greater degree” than a superior court judge, \nthe same is true for Federal Court judges, given their extensive experience of judicial \nreview in federal prisons. For practical reasons, reasonableness review for i nmates \nchallenging administrative decisions of correctional administrators is better left to the \nFederal Court as opposed to superior courts.  \n[186]  Second, a further practical concern relating to consistency in jurisprudence \nemerges in the majority’s interpretat ion, because there will be no way to resolve \ninconsistencies in the application of habeas corpus  and its related jurisprudence given \nthat appeals from the superior courts lie to the provincial courts of appeal while appeals \nfrom the Federal Court lie to th e Federal Court of Appeal. Short of an appeal to our \nCourt, there will be no way to resolve possible inconsistencies as among provincial \ncourts of appeal. This may not only lead to administrative incoherence in the \ncorrectional system but also undermine th e uniform development of the law governing \nliberty and detention across the country, at least as regards federal prisons.  \n[187]  Third, the argument that resort to habeas corpus is required to challenge \ncorrectional security classification decisions because exist ing review mechanisms are \ninsufficient is not compelling; to the contrary, the existing review mechanisms are \nadequate (in addition to being the mechanisms chosen by Parliament). This includes \n2025 SCC 38 (CanLII)\n\n--- Page 92 ---\n \n the normal order of affairs  — where an inmate’s classification to maximum - or \nmedium -security can be revisited every six months, where inmates can request file \ncorrections for reliance on incorrect information, and where an inmate can file a \ncomplaint with the Correctional Investigator  — as well as the internal grieva nce \nprocess and, finally, judicial review.  \n[188]  The appellants in this case argue that reliance on judicial review before the \nFederal Court is insufficient because it can only be accessed after the grievance \nprocedure provided for by Parliament is exhausted (A. F., at para.  45, citing Mackinnon \nv. Warden of Bowden Institution , 2016 FCA 14, at para.  6). During oral submissions, \ncounsel for the appellants stated the Federal Court has relied on the doctrine of \nexhaustion to require inmates seeking judicial review of  an administrative decision to \ncomplete the internal grievance procedure (transcript, at p.  7). We do not accept this as \na reason to reject the Federal Court as the appropriate forum for reviewing security \nreclassification decisions made by correctional ad ministrative",
    "token_count": 1000,
    "start_token": 35100,
    "end_token": 36100,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 40,
    "source_file": "2025scc38.txt",
    "text": " FCA 14, at para.  6). During oral submissions, \ncounsel for the appellants stated the Federal Court has relied on the doctrine of \nexhaustion to require inmates seeking judicial review of  an administrative decision to \ncomplete the internal grievance procedure (transcript, at p.  7). We do not accept this as \na reason to reject the Federal Court as the appropriate forum for reviewing security \nreclassification decisions made by correctional ad ministrative decision makers. The \nFederal Court has the discretion to hear a judicial review even where internal grievance \nprocedures are not exhausted; we have confidence that they will do so where \ncircumstances warrant (see, e.g., Forner v. Professional Institute of the Public Service \nof Canada , 2016 FCA 35, 481 N.R. 159, at paras.  14-15). \n[189]  Fourth, concerning reasonableness review, we do not accept the majority’s \npronouncements on this issue as it relates to Khela . That case does not stand for the \nproposit ion that superior courts can engage in reasonableness review on habeas corpus \n2025 SCC 38 (CanLII)\n\n--- Page 93 ---\n \n applications in a way parallel to the Federal Court on judicial review. The comments \nmade by LeBel  J. concerning reasonableness in Khela  — a case decided on procedural \nfairness  — were obiter ; they are not part of his analysis leading to the disposition of \nthis case (paras.  5, 80 and 98) . These comments are not a proper basis for disturbing \nthe balance our Court has set out for administrative review in Vavilov . \n[190]  Fifth, provincial su perior courts’ jurisdiction to issue writs of habeas \ncorpus  in the correctional context has never been wholly concurrent with the Federal \nCourt’s jurisdiction in the same context. For example, habeas corpus  in the superior \ncourts is not available to addres s changes to an inmate’s conditions of detention unless \nthe inmate has experienced a “substantial change in conditions amounting to a further \ndeprivation of liberty” ( Dumas , at p. 464). However, judicial review to the Federal \nCourt remains available in reg ard to administrative decisions which otherwise affect an \ninmate’s conditions and experiences (see, e.g., Nova Scotia (Attorney General) v. Diggs \nand Wilband , 2025 NSCA 20, at paras.  51-53; R. v. Haug , 2011 ABCA 153, 502 A.R. \n392, at paras.  3 and 6; Ewanch uk, at paras.  10 and 71; Moldovan v. Canada (Attorney \nGeneral) , 2012 ONSC 2682, 291 C.C.C. (3d) 123, at para.  15(ii)).  \n(3) Unconditional Release to a Lower Security Facility Is the Only Remedy \nAvailable on a Habeas Corpus  Application  \n[191]  The majority reasons that superior court judges “retain discretion” to issue \nremedies beyond the standard remedy of release to a less restrictive security facility \n(para.  89). The majority reasons that this remedial discretion arises from the superior \n2025 SCC 38 (CanLII)\n\n--- Page 94 ---\n \n courts’ inherent jurisdiction. We disagree. On a successful habeas corpus  application, \nsuperior courts have at their disposal only one remedy: release to a less restrictive \nfacility ( Chhina , at paras.  1 and 65;  Miller , at p.  635-36; Farbey  and Sharpe , at p.  21). \n[192]  On applications for habeas corpus , the broad remedial powers under \ns. 24(1) of the Charter  are not available. It is important to note that this appeal concerns \nthe common law  writ of habeas corpus . It does not concern a Charter  challenge. The \nappellants  alleged that the denial of their transfer requests engaged ss.  7, 9, 10(c) and \n12 of the Charter , but did not bring Charter  applications (see C.A. decision, at paras.  4 \nand 45). In other words, the appellants are not alleging breaches of Charter  rights. \nHabeas corpus  as a Charter  remedy is available in response to a Charter  breach (see \nGamble , at pp.  639-40; see also Khela , at para.  29). As a result, habeas corpus  in",
    "token_count": 1000,
    "start_token": 36000,
    "end_token": 37000,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 41,
    "source_file": "2025scc38.txt",
    "text": " the Charter , but did not bring Charter  applications (see C.A. decision, at paras.  4 \nand 45). In other words, the appellants are not alleging breaches of Charter  rights. \nHabeas corpus  as a Charter  remedy is available in response to a Charter  breach (see \nGamble , at pp.  639-40; see also Khela , at para.  29). As a result, habeas corpus  in this \ncase is not available as a Charter  remedy under s.  24(1), but as a common law remedy.  \nOn applications for habeas corpus  in the common law, it is not proper for courts to rely \non s.  24(1) of the Charter  to issue remedies beyond release and transfer.  \n[193]  We agree that on habeas corpus  applications, superior courts have inherent \njurisdiction when  issuing the remedy of release to impose additional conditions \n(Ogiamien v. Ontario (Community Safety and Correctional Services) , 2017 ONCA \n839, 55 Imm. L.R. (4th) 220, at para.  48). This approach guarantees access to the \nremedy of habeas corpus  for applic ants, while protecting “public safety and respect for \nthe law” through the imposition of appropriate conditions (para.  48). The context in \nwhich Ogiamien  was decided is important for understanding Sharpe  J.A.’s comments \n2025 SCC 38 (CanLII)\n\n--- Page 95 ---\n \n about imposing additional conditions . Sharpe  J.A. was writing in the context of release \nfrom immigration detention. Release in that context entails full release and additional \nconditions may include to “keep the peace and be of good behaviour”, to “attend all \nimmigration proceedings as and w hen required”, or to “abstain absolutely from the \npossession and/or consumption of any drugs or other substances prohibited by law”, \namong others (see, e.g., Scotland v. Canada (Attorney General) , 2017 ONSC 4850, \n139 O.R. (3d) 191, at paras.  78-79; see als o Ali v. Canada (Minister of Public Safety \nand Emergency Preparedness) , 2017 ONSC 2660, 137 O.R. (3d) 498, at para.  41). \n[194]  That is not the context of this appeal and similar conditions and terms of \nrelease do not have the same logical impact on an inmate’s r elease to a less restrictive \nsecurity facility. The decision challenged by way of habeas corpus  is the denial of \nreclassification and transfer to a less restrictive facility. Even if additional conditions \nare imposed by the court, the remedy of habeas corp us is non -discretionary; once the \ncourt has determined the detention is unlawful, it must remedy the unlawfulness. On a \nsuccessful habeas corpus  application in the carceral context, the superior court would \nbe obliged to release the inmate into a less rest rictive security facility. The majority \ndoes not articulate what types of conditions could be imposed upon release and, in our \nview, there are none. The impact that an inmate’s transfer into a less restrictive security \nfacility has on the staff and fellow inmates will not be markedly different if the court \nimposes conditions about, for example, activities that the inmate can undertake, or \nprivileges that they can access in such facility.  \n2025 SCC 38 (CanLII)\n\n--- Page 96 ---\n \n [195]  In addition to imposing conditions of release, the majority states tha t “CSC \nmay tender evidence .  . . as to why a specific security classification is .  . . justified” and \nthat courts can make such a determination on a habeas corpus  application (para.  89). \nGiven that there are generally only three levels of security (maximum, medium, and \nminimum), it is not clear how this line of reasoning could lead to anything but full \nrelease into the immediately lesser level of security. This hig hlights that the expansion \nof habeas corpus  into this type of decision making will lead to the micromanagement \nof federal correctional facilities by superior courts.  \n[196]  The prerogative writs, including habeas corpus , share a common goal: to \nensure that author ity is utilized in conformity with the purposes and constraints that \ngovern it ( De Smith’s Judicial Review  (9th ed. 2023), by I.  Hare, C.  Donnelly and \nJ. Bell, eds., at p.  787). The reviewing court",
    "token_count": 1000,
    "start_token": 36900,
    "end_token": 37900,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 42,
    "source_file": "2025scc38.txt",
    "text": "agement \nof federal correctional facilities by superior courts.  \n[196]  The prerogative writs, including habeas corpus , share a common goal: to \nensure that author ity is utilized in conformity with the purposes and constraints that \ngovern it ( De Smith’s Judicial Review  (9th ed. 2023), by I.  Hare, C.  Donnelly and \nJ. Bell, eds., at p.  787). The reviewing court determines whether the authority has been \nproperly exercis ed but it does not substitute its own preference, and then give effect to \nthat preference by exercising an authority not conferred on the court. Therefore, on a \nsuccessful habeas corpus  application, the court gives effect to the claimant’s legal \nrights whi ch underlie that application; it cannot “ignore illegality simply because it \nseems that the applicant really ought to be detained” (Farbey  and Sharpe , at p.  52). \nAsserting that a court’s lack of statutory authority can be overcome by its inherent \nauthority  is to claim that courts possess authority to govern, in addition to their \nadjudicative role. They do not. Yet this is what the majority invites by asserting that \n“judges retain discretion to not discharge an applicant” even where the applicant’s \n2025 SCC 38 (CanLII)\n\n--- Page 97 ---\n \n detainmen t is unlawful, and that judges may issue any condition they see fit as a remedy \non a successful habeas corpus  application (paras.  85-86). \n[197]  The majority appears driven to make these sweeping claims of judicial \npower on a habeas corpus  application in order to  blunt the readily foreseeable \nconsequences of its expansion of what constitutes a deprivation of liberty: a flood of \nclaims by inmates with no legal entitlement to the new carceral conditions they seek. \nInstead, those very consequences should lead the maj ority to recognize that its \nreasoning will transform the writ of habeas corpus  into an ill -suited substitute for \ninternal review and judicial review of the operation of correctional institutions.  \n(4) Caution Is Warranted To Address Provincial Concerns  \n[198]  The Atto rney General of Canada, as the respondent, shares the caution of \nthe application judge that accepting the position of the appellants would render every \nsecurity reclassification decision reviewable by way of habeas corpus (R.F., at \npara.  107).  \n[199]  The Attorney  General of British Columbia, as an intervener, asks our Court \nto limit any holding stemming from this case to only federal institutions, given that \nprovincial correctional facilities are governed by different statutes (I.F., at para.  10). It \nalso makes a “floodgates” argument similar to that of the Attorney General of Canada \n(I.F., at para.  11). The Attorney General of Quebec advances a similar position (I.F., at \nparas.  42-43). \n2025 SCC 38 (CanLII)\n\n--- Page 98 ---\n \n [200]  It is important to be mindful of the impacts of this decision on provincial \ncorrectional systems. We agree with the Attorney General of British Columbia that a \ndecision as to federal correctional facilities does not readily transpose onto a provincial \nscheme, which is tailored to deal with the different circumstances of provincial \ncorrectional facilities.  \n[201]  The practical implications of this decision on judicial resources and access \nto justice are significant. Given the procedural advantages (including the high priority) \nthat habeas corpus offers an applicant, there is every reason to e xpect that it will \nquickly supplant other available review mechanisms, leading to a surge of habeas \ncorpus  applications before superior courts, resulting in delays in other proceedings \nbefore those courts.  \n[202]  Caution is warranted. Although habeas corpus  is a broad and flexible \nremedy, it should remain targeted on the liberty of the subject. Expanding it beyond its \nproper confines risks imposing significant burdens on already strained provincial \nsuperior courts and disrupting correctional frameworks of Parliame nt’s design. It \nwould tend to draw superior courts more deeply into the day -to-day administration of \ncorrectional systems. These concerns underscore the need to preserve habeas corpus  \nfor its enduring purpose: safeguarding against unlawful deprivations of liberty, rather \nthan serving as a generalized vehicle for reviewing administrative decisions within \ncorrectional institutions.  \nV. Application and Disposition  \n2025 SCC 38 (CanLII)\n\n--- Page 99 ---\n \n [203]  This Court has undertaken an expansion of habeas corpus  that stands at \n",
    "token_count": 1000,
    "start_token": 37800,
    "end_token": 38800,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 43,
    "source_file": "2025scc38.txt",
    "text": " day -to-day administration of \ncorrectional systems. These concerns underscore the need to preserve habeas corpus  \nfor its enduring purpose: safeguarding against unlawful deprivations of liberty, rather \nthan serving as a generalized vehicle for reviewing administrative decisions within \ncorrectional institutions.  \nV. Application and Disposition  \n2025 SCC 38 (CanLII)\n\n--- Page 99 ---\n \n [203]  This Court has undertaken an expansion of habeas corpus  that stands at \nodds with modern administrative law remedies and procedures. Administrative \ndecisions, which include those made within federal prisons, are subject to internal \nreview as per the scheme set out in the governing statute, the CCRA  backed up by  \njudicial review before the Federal Court. A wide range of decisions made within a \ncorrectional facility regarding an inmate can be characterized as impacting their liberty. \nIn the end, we conclude that habeas corpus  is not available to challenge decisions  \ndenying transfer to lower security facilities.  \n[204]  Neither Mr.  Dorsey nor Mr.  Salah ought to have had access to habeas \ncorpus to challenge the administrative decisions denying reclassification or transfer to \nlower security.  \n[205]  In Mr.  Dorsey’s case, his case mana gement team, the MAI, and his Warden \nall recommended a transfer to minimum -security. However, the transfer was \nconditional on approval by the RDC and the ACCOP. Since that approval was not \ngranted, the condition was not met, and Mr.  Dorsey never acquired t he legal status of \na minimum -security inmate.  \n[206]  Likewise, Mr.  Salah’s reclassification and transfer to lower security were \nrecommended by his case management team and a parole officer, but a newly assigned \nMAI assessed him as being a moderate escape risk, le ading the Warden to recommend \ndenial of transfer. As in Dumas , Mr.  Salah came close to acquiring a new status but did \nnot achieve it. As a result, habeas corpus  is not available. The factual parallels between \n2025 SCC 38 (CanLII)\n\n--- Page 100 ---\n \n Dumas  and these cases reinforce the conclusion that no unlawful deprivation of liberty \n(for which habeas corpus  is a remedy) has occurred.  \n[207]  As such, it is our view that when the current law as set out in Dumas  is \nproperly applied, resort to habeas corpus is not available for either Mr.  Dorsey or \nMr. Salah to challenge the administrative decisions denying reclassification or transfer \nto lower security.  \n[208]  Accordingly, we would dismiss the appeal.  \n Appeal allowed, CÔTÉ, ROWE and JAMAL  JJ. dissenting . \n Solicitors  for the appellant s: Goldblatt Partners, Toronto ; Borys Law, \nKingston ; Kate Mitchell , Toronto . \n Solicitor  for the respondent : Department of Justice Canada  — National \nLitigation Sector , Toronto . \n Solicitor for the interve ner Attorney General of Quebec : Ministère de la \nJustice du Québec  — Direction du droit constitutionnel et autochtone , Québec.  \n Solicitor for the intervener Attorn ey General of British Columbia : Ministry \nof the Attorney General of British Columbia  — Legal Services Branch , Vancouver.  \n2025 SCC 38 (CanLII)\n\n--- Page 101 ---\n \n  Solicitor  for the intervener  John How ard Society of Canada : Queen’s \nPrison Law Clinic , Kingston.  \n Solicitors  for the intervener  Canadian Council for Refugees : Newcomer \nLegal Clinic, Thunder Bay; Jamie Liew, Ottawa . \n Solicitor  for the intervener Alberta Pr ison Justice Society : Prison & Police \nLaw, Calgary.  \n Solicitor  for the intervener Aboriginal Legal Services : Aboriginal Legal \nServices, Toronto.  \n Solicitors  for the intervener Wes t Coast Prison Justice \nSociety : Allen/McMillan Litigation Counsel, Vancouver.  \n Solicitors  for the intervener Britis h Columb ia Civil Liberties \nAssociation : Pender Litigation, Vancouver ; British Columbia Civil Liberties \nAssociation, Vancouver . \n Solicitors  for the intervener Canadian Associat ion of Elizabeth Fry \nSocieties : PATH Legal, Dartmouth , N.S. \n Solicitors  for the intervener Canadian Association of Refugee \nLawyers : Edelmann & Co., Vancouver ; Kes Posgate Law, Toronto . \n2025 SCC 38 (CanLII)\n\n--- Page 102 ---\n \n  Solicitors  for the interv ener Black Legal Action Centre : Goldblatt \nPartners, Toronto; Black Legal Action Centre, Toronto . \n Solicitors  for the  interv",
    "token_count": 1000,
    "start_token": 38700,
    "end_token": 39700,
    "total_tokens_in_source": 39797
  },
  {
    "chunk_id": 44,
    "source_file": "2025scc38.txt",
    "text": " Fry \nSocieties : PATH Legal, Dartmouth , N.S. \n Solicitors  for the intervener Canadian Association of Refugee \nLawyers : Edelmann & Co., Vancouver ; Kes Posgate Law, Toronto . \n2025 SCC 38 (CanLII)\n\n--- Page 102 ---\n \n  Solicitors  for the interv ener Black Legal Action Centre : Goldblatt \nPartners, Toronto; Black Legal Action Centre, Toronto . \n Solicitors  for the  intervener Pivot Legal Society : Yanful Law, Toronto; \nPivot Legal Society, Vancouver.  \n Solicitors  for th e intervener Margaret Lee Cole : Lockyer Zaduk Zeeh, \nToronto.  \n Solicitors  for the intervener Canadian Civil Liberties \nAssociation : Stockwoods, Toronto.  \n Solicitors  for the intervener C anadian Prison Law Association : Posner \nCraig Stein, Toronto.  \n2025 SCC 38 (CanLII)\n\n",
    "token_count": 197,
    "start_token": 39600,
    "end_token": 39797,
    "total_tokens_in_source": 39797
  }
]